{"chapter_number":49,"bismillah_pre":true,"revelation_order":106,"revelation_place":"madinah","name_arabic":"الحجرات","name_complex":"Al-Ĥujurāt","name_simple":"Al-Hujurat","verses_count":18,"pages":[515,517],"meaning":{"text":"The Rooms","en":"The Rooms","id":"Kamar-kamar"},"verses":[[[1,4613,"49:1","يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُقَدِّمُوا بَيْنَ يَدَيِ اللَّهِ وَرَسُولِهِ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ",["O you who believe! be not forward in the presence of Allah and His Messenger, and be careful of (your duty to) Allah; surely Allah is Hearing, Knowing.","Wahai orang-orang yang beriman! Janganlah kamu mendahului Allah dan Rasul-Nya dan bertakwalah kepada Allah. Sungguh, Allah Maha Mendengar, Maha Mengetahui."],515,26,52,206,null,null],[2,4614,"49:2","يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَلَا تَجْهَرُوا لَهُ بِالْقَوْلِ كَجَهْرِ بَعْضِكُمْ لِبَعْضٍ أَن تَحْبَطَ أَعْمَالُكُمْ وَأَنتُمْ لَا تَشْعُرُونَ",["O you who believe! do not raise your voices above the voice of the Prophet, and do not speak loud to him as you speak loud to one another, lest your deeds became null while you do not perceive.","Wahai orang-orang yang beriman! Janganlah kamu meninggikan suaramu melebihi suara Nabi, dan janganlah kamu berkata kepadanya dengan suara keras sebagaimana kerasnya (suara) sebagian kamu terhadap yang lain, nanti (pahala) segala amalmu bisa terhapus sedangkan kamu tidak menyadari."],515,26,52,206,null,null],[3,4615,"49:3","إِنَّ الَّذِينَ يَغُضُّونَ أَصْوَاتَهُمْ عِندَ رَسُولِ اللَّهِ أُولَٰئِكَ الَّذِينَ امْتَحَنَ اللَّهُ قُلُوبَهُمْ لِلتَّقْوَىٰ ۚ لَهُم مَّغْفِرَةٌ وَأَجْرٌ عَظِيمٌ",["Surely those who lower their voices before Allah's Messenger are they whose hearts Allah has proved for guarding (against evil); they shall have forgiveness and a great reward.","Sesungguhnya orang-orang yang merendahkan suaranya di sisi Rasulullah, mereka itulah orang-orang yang telah diuji hatinya oleh Allah untuk bertakwa. Mereka akan memperoleh ampunan dan pahala yang besar."],515,26,52,206,null,null],[4,4616,"49:4","إِنَّ الَّذِينَ يُنَادُونَكَ مِن وَرَاءِ الْحُجُرَاتِ أَكْثَرُهُمْ لَا يَعْقِلُونَ",["(As for) those who call out to you from behind the private chambers, surely most of them do not understand.","Sesungguhnya orang-orang yang memanggil engkau (Muhammad) dari luar kamar(mu) kebanyakan mereka tidak mengerti."],515,26,52,206,null,null],[5,4617,"49:5","وَلَوْ أَنَّهُمْ صَبَرُوا حَتَّىٰ تَخْرُجَ إِلَيْهِمْ لَكَانَ خَيْرًا لَّهُمْ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ",["And if they wait patiently until you come out to them, it would certainly be better for them, and Allah is Forgiving, Merciful.","Dan sekiranya mereka bersabar sampai engkau keluar menemui mereka, tentu akan lebih baik bagi mereka. Dan Allah Maha Pengampun, Maha Penyayang."],516,26,52,206,null,null],[6,4618,"49:6","يَا أَيُّهَا الَّذِينَ آمَنُوا إِن جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا أَن تُصِيبُوا قَوْمًا بِجَهَالَةٍ فَتُصْبِحُوا عَلَىٰ مَا فَعَلْتُمْ نَادِمِينَ",["O you who believe! if an evil-doer comes to you with a report, look carefully into it, lest you harm a people in ignorance, then be sorry for what you have done.","Wahai orang-orang yang beriman! Jika seseorang yang fasik datang kepadamu membawa suatu berita, maka telitilah kebenarannya, agar kamu tidak mencelakakan suatu kaum karena kebodohan (kecerobohan), yang akhirnya kamu menyesali perbuatanmu itu."],516,26,52,206,null,null],[7,4619,"49:7","وَاعْلَمُوا أَنَّ فِيكُمْ رَسُولَ اللَّهِ ۚ لَوْ يُطِيعُكُمْ فِي كَثِيرٍ مِّنَ الْأَمْرِ لَعَنِتُّمْ وَلَٰكِنَّ اللَّهَ حَبَّبَ إِلَيْكُمُ الْإِيمَانَ وَزَيَّنَهُ فِي قُلُوبِكُمْ وَكَرَّهَ إِلَيْكُمُ الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ ۚ أُولَٰئِكَ هُمُ الرَّاشِدُونَ",["And know that among you is Allah's Messenger; should he obey you in many a matter, you would surely fall into distress, but Allah has endeared the faith to you and has made it seemly in your hearts, and He has made hateful to you unbelief and transgression and disobedience; these it is that are the followers of a right way.","Dan ketahuilah olehmu bahwa di tengah-tengah kamu ada Rasulullah. Kalau dia menuruti (kemauan) kamu dalam banyak hal pasti kamu akan mendapatkan kesusahan. Tetapi Allah menjadikan kamu cinta kepada keimanan dan menjadikan (iman) itu indah dalam hatimu serta menjadikan kamu benci kepada kekafiran, kefasikan, dan kedurhakaan. Mereka itulah orang-orang yang mengikuti jalan yang lurus,"],516,26,52,206,null,null],[8,4620,"49:8","فَضْلًا مِّنَ اللَّهِ وَنِعْمَةً ۚ وَاللَّهُ عَلِيمٌ حَكِيمٌ",["By grace from Allah and as a favor; and Allah is Knowing, Wise.","sebagai karunia dan nikmat dari Allah. Dan Allah Maha Mengetahui, Mahabijaksana."],516,26,52,206,null,null],[9,4621,"49:9","وَإِن طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا ۖ فَإِن بَغَتْ إِحْدَاهُمَا عَلَى الْأُخْرَىٰ فَقَاتِلُوا الَّتِي تَبْغِي حَتَّىٰ تَفِيءَ إِلَىٰ أَمْرِ اللَّهِ ۚ فَإِن فَاءَتْ فَأَصْلِحُوا بَيْنَهُمَا بِالْعَدْلِ وَأَقْسِطُوا ۖ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ",["And if two parties of the believers quarrel, make peace between them; but if one of them acts wrongfully towards the other, fight that which acts wrongfully until it returns to Allah's command; then if it returns, make peace between them with justice and act equitably; surely Allah loves those who act equitably.","Dan apabila ada dua golongan orang-orang mukmin berperang, maka damaikanlah antara keduanya. Jika salah satu dari keduanya berbuat zhalim terhadap (golongan) yang lain, maka perangilah (golongan) yang berbuat zhalim itu, sehingga golongan itu kembali kepada perintah Allah. Jika golongan itu telah kembali (kepada perintah Allah), maka damaikanlah antara keduanya dengan adil, dan berlakulah adil. Sungguh, Allah mencintai orang-orang yang berlaku adil."],516,26,52,206,null,null],[10,4622,"49:10","إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ ۚ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ",["The believers are but brethren, therefore make peace between your brethren and be careful of (your duty to) Allah that mercy may be had on you.","Sesungguhnya orang-orang mukmin itu bersaudara, karena itu damaikanlah antara kedua saudaramu (yang berselisih) dan bertakwalah kepada Allah agar kamu mendapat rahmat."],516,26,52,206,null,null],[11,4623,"49:11","يَا أَيُّهَا الَّذِينَ آمَنُوا لَا يَسْخَرْ قَوْمٌ مِّن قَوْمٍ عَسَىٰ أَن يَكُونُوا خَيْرًا مِّنْهُمْ وَلَا نِسَاءٌ مِّن نِّسَاءٍ عَسَىٰ أَن يَكُنَّ خَيْرًا مِّنْهُنَّ ۖ وَلَا تَلْمِزُوا أَنفُسَكُمْ وَلَا تَنَابَزُوا بِالْأَلْقَابِ ۖ بِئْسَ الِاسْمُ الْفُسُوقُ بَعْدَ الْإِيمَانِ ۚ وَمَن لَّمْ يَتُبْ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ",["O you who believe! let not (one) people laugh at (another) people perchance they may be better than they, nor let women (laugh) at (other) women, perchance they may be better than they; and do not find fault with your own people nor call one another by nicknames; evil is a bad name after faith, and whoever does not turn, these it is that are the unjust.","Wahai orang-orang yang beriman! Janganlah suatu kaum mengolok-olok kaum yang lain (karena) boleh jadi mereka (yang diperolok-olokkan) lebih baik dari mereka (yang mengolok-olok) dan jangan pula perempuan-perempuan (mengolok-olokkan) perempuan lain (karena) boleh jadi perempuan (yang diperolok-olokkan) lebih baik dari perempuan (yang mengolok-olok). Janganlah kamu saling mencela satu sama lain dan janganlah saling memanggil dengan gelar-gelar yang buruk. Seburuk-buruk panggilan adalah (panggilan) yang buruk (fasik) setelah beriman. Dan barangsiapa tidak bertobat, maka mereka itulah orang-orang yang zhalim."],516,26,52,206,null,null],[12,4624,"49:12","يَا أَيُّهَا الَّذِينَ آمَنُوا اجْتَنِبُوا كَثِيرًا مِّنَ الظَّنِّ إِنَّ بَعْضَ الظَّنِّ إِثْمٌ ۖ وَلَا تَجَسَّسُوا وَلَا يَغْتَب بَّعْضُكُم بَعْضًا ۚ أَيُحِبُّ أَحَدُكُمْ أَن يَأْكُلَ لَحْمَ أَخِيهِ مَيْتًا فَكَرِهْتُمُوهُ ۚ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ تَوَّابٌ رَّحِيمٌ",["O you who believe! avoid most of suspicion, for surely suspicion in some cases is a sin, and do not spy nor let some of you backbite others. Does one of you like to eat the flesh of his dead brother? But you abhor it; and be careful of (your duty to) Allah, surely Allah is Oft-returning (to mercy), Merciful.","Wahai orang-orang yang beriman! Jauhilah banyak dari prasangka, sesungguhnya sebagian prasangka itu dosa dan janganlah kamu mencari-cari kesalahan orang lain dan janganlah ada di antara kamu yang menggunjing sebagian yang lain. Apakah ada di antara kamu yang suka memakan daging saudaranya yang sudah mati? Tentu kamu merasa jijik. Dan bertakwalah kepada Allah, sesungguhnya Allah Maha Penerima tobat, Maha Penyayang."],517,26,52,206,null,null],[13,4625,"49:13","يَا أَيُّهَا النَّاسُ إِنَّا خَلَقْنَاكُم مِّن ذَكَرٍ وَأُنثَىٰ وَجَعَلْنَاكُمْ شُعُوبًا وَقَبَائِلَ لِتَعَارَفُوا ۚ إِنَّ أَكْرَمَكُمْ عِندَ اللَّهِ أَتْقَاكُمْ ۚ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ",["O you men! surely We have created you of a male and a female, and made you tribes and families that you may know each other; surely the most honorable of you with Allah is the one among you most careful (of his duty); surely Allah is Knowing, Aware.","Wahai manusia! Sungguh, Kami telah menciptakan kamu dari seorang laki-laki dan seorang perempuan, kemudian Kami jadikan kamu berbangsa-bangsa dan bersuku-suku agar kamu saling mengenal. Sesungguhnya yang paling mulia di antara kamu di sisi Allah ialah orang yang paling bertakwa. Sungguh, Allah Maha Mengetahui, Mahateliti."],517,26,52,206,null,null],[14,4626,"49:14","قَالَتِ الْأَعْرَابُ آمَنَّا ۖ قُل لَّمْ تُؤْمِنُوا وَلَٰكِن قُولُوا أَسْلَمْنَا وَلَمَّا يَدْخُلِ الْإِيمَانُ فِي قُلُوبِكُمْ ۖ وَإِن تُطِيعُوا اللَّهَ وَرَسُولَهُ لَا يَلِتْكُم مِّنْ أَعْمَالِكُمْ شَيْئًا ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ",["The dwellers of the desert say: We believe. Say: You do not believe but say, We submit; and faith has not yet entered into your hearts; and if you obey Allah and His Messenger, He will not diminish aught of your deeds; surely Allah is Forgiving, Merciful.","Orang-orang Arab Badui berkata, “Kami telah beriman.” Katakanlah (kepada mereka), “Kamu belum beriman, tetapi katakanlah ‘Kami telah tunduk (Islam),’ karena iman belum masuk ke dalam hatimu. Dan jika kamu taat kepada Allah dan Rasul-Nya, Dia tidak akan mengurangi sedikit pun (pahala) amal perbuatanmu. Sungguh, Allah Maha Pengampun, Maha Penyayang.”"],517,26,52,207,null,null],[15,4627,"49:15","إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ آمَنُوا بِاللَّهِ وَرَسُولِهِ ثُمَّ لَمْ يَرْتَابُوا وَجَاهَدُوا بِأَمْوَالِهِمْ وَأَنفُسِهِمْ فِي سَبِيلِ اللَّهِ ۚ أُولَٰئِكَ هُمُ الصَّادِقُونَ",["The believers are only those who believe in Allah and His Messenger then they doubt not and struggle hard with their wealth and their lives in the way of Allah; they are the truthful ones.","Sesungguhnya orang-orang mukmin yang sebenarnya adalah mereka yang beriman kepada Allah dan Rasul-Nya kemudian mereka tidak ragu-ragu dan mereka berjihad dengan harta dan jiwanya di jalan Allah. Mereka itulah orang-orang yang benar."],517,26,52,207,null,null],[16,4628,"49:16","قُلْ أَتُعَلِّمُونَ اللَّهَ بِدِينِكُمْ وَاللَّهُ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ",["Say: Do you apprise Allah of your religion, and Allah knows what is in the heavens and what is in the earth; and Allah is Cognizant of all things.","Katakanlah (kepada mereka), “Apakah kamu akan memberitahukan kepada Allah tentang agamamu (keyakinanmu), padahal Allah mengetahui apa yang ada di langit dan apa yang ada di bumi dan Allah Maha Mengetahui segala sesuatu.”"],517,26,52,207,null,null],[17,4629,"49:17","يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا ۖ قُل لَّا تَمُنُّوا عَلَيَّ إِسْلَامَكُم ۖ بَلِ اللَّهُ يَمُنُّ عَلَيْكُمْ أَنْ هَدَاكُمْ لِلْإِيمَانِ إِن كُنتُمْ صَادِقِينَ",["They think that they lay you under an obligation by becoming Muslims. Say: Lay me not under obligation by your Islam: rather Allah lays you under an obligation by guiding you to the faith if you are truthful.","Mereka merasa berjasa kepadamu dengan keislaman mereka. Katakanlah, “Janganlah kamu merasa berjasa kepadaku dengan keislamanmu, sebenarnya Allah yang melimpahkan nikmat kepadamu dengan menunjukkan kamu kepada keimanan, jika kamu orang yang benar.”"],517,26,52,207,null,null],[18,4630,"49:18","إِنَّ اللَّهَ يَعْلَمُ غَيْبَ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَاللَّهُ بَصِيرٌ بِمَا تَعْمَلُونَ",["Surely Allah knows the unseen things of the heavens and the earth; and Allah sees what you do.","Sungguh, Allah mengetahui apa yang gaib di langit dan di bumi. Dan Allah Maha Melihat apa yang kamu kerjakan."],517,26,52,207,null,null]],[[[1,9,515,"&#xfb8e;","word","يَا أَيُّهَا",["O you who believe","kamu mendahului"]],[2,9,515,"&#xfb8f;","word","الَّذِينَ",["O you who believe","antara"]],[3,9,515,"&#xfb90;","word","آمَنُوا",["O you who believe","hadapan"]],[4,9,515,"&#xfb91;","word","لَا",["(Do) not","Allah"]],[5,9,515,"&#xfb92;","word","تُقَدِّمُوا",["put (yourselves) forward ","dan rasul-Nya"]],[6,9,515,"&#xfb93;","word","بَيْنَ",["before Allah","dan bertakwalah"]],[7,9,515,"&#xfb94;","word","يَدَيِ",["before Allah","Allah"]],[8,9,515,"&#xfb95;","word","اللَّهِ",["before Allah","sesungguhnya"]],[9,9,515,"&#xfb96;","word","وَرَسُولِهِ",["and His Messenger","Allah"]],[10,9,515,"&#xfb97;","pause","ۖ",[null,null]],[11,9,515,"&#xfb98;","word","وَاتَّقُوا",["and fear Allah","Maha Mendengar"]],[12,9,515,"&#xfb99;","word","اللَّهَ",["and fear Allah","Maha Mengetahui"]],[13,9,515,"&#xfb9a;","pause","ۚ",[null,null]],[14,10,515,"&#xfb9b;","word","إِنَّ",["Indeed",""]],[15,10,515,"&#xfb9c;","word","اللَّهَ",["Allah",""]],[16,10,515,"&#xfb9d;","word","سَمِيعٌ",["(is) All-Hearer",""]],[17,10,515,"&#xfb9e;","word","عَلِيمٌ",["All-Knower",""]],[18,10,515,"&#xfb9f;","end","ﮟ",[null,null]]],[[1,10,515,"&#xfba0;","word","يَا أَيُّهَا",["O you who believe","wahai"]],[2,10,515,"&#xfba1;","word","الَّذِينَ",["O you who believe","orang-orang yang"]],[3,10,515,"&#xfba2;","word","آمَنُوا",["O you who believe","beriman"]],[4,10,515,"&#xfba3;","word","لَا",["(Do) not","jangan"]],[5,10,515,"&#xfba4;","word","تَرْفَعُوا",["raise","kamu meninggikan"]],[6,10,515,"&#xfba5;","word","أَصْوَاتَكُمْ",["your voices","suaramu"]],[7,11,515,"&#xfba6;","word","فَوْقَ",["above","di atas"]],[8,11,515,"&#xfba7;","word","صَوْتِ",["(the) voice","suara"]],[9,11,515,"&#xfba8;","word","النَّبِيِّ",["(of) the Prophet","nabi"]],[10,11,515,"&#xfba9;","word","وَلَا",["and (do) not","dan jangan"]],[11,11,515,"&#xfbaa;","word","تَجْهَرُوا",["be loud","kamu keraskan"]],[12,11,515,"&#xfbab;","word","لَهُ",["to him","kepadanya"]],[13,11,515,"&#xfbac;","word","بِالْقَوْلِ",["in speech","dengan perkataan"]],[14,11,515,"&#xfbad;","word","كَجَهْرِ",["like (the) loudness","seperti keras"]],[15,11,515,"&#xfbae;","word","بَعْضِكُمْ",["(of) some of you","sebagian kamu"]],[16,12,515,"&#xfbaf;","word","لِبَعْضٍ",["to others","terhadap sebagian"]],[17,12,515,"&#xfbb0;","word","أَنْ",["lest","bahwa"]],[18,12,515,"&#xfbb1;","word","تَحْبَطَ",["become worthless","akan hapus"]],[19,12,515,"&#xfbd3;","word","أَعْمَالُكُمْ",["your deeds","amal-amal kamu"]],[20,12,515,"&#xfbd4;","word","وَأَنْتُمْ",["while you","dan kamu"]],[21,12,515,"&#xfbd5;","word","لَا",["(do) not","tidak"]],[22,12,515,"&#xfbd6;","word","تَشْعُرُونَ",["perceive","menyadari"]],[23,12,515,"&#xfbd7;","end","ﯗ",[null,null]]],[[1,12,515,"&#xfbd8;","word","إِنَّ",["Indeed","sesungguhnya"]],[2,12,515,"&#xfbd9;","word","الَّذِينَ",["those who","orang-orang yang"]],[3,13,515,"&#xfbda;","word","يَغُضُّونَ",["lower","merendahkan"]],[4,13,515,"&#xfbdb;","word","أَصْوَاتَهُمْ",["their voices","suara  mereka"]],[5,13,515,"&#xfbdc;","word","عِنْدَ",["(in) presence","di sisi"]],[6,13,515,"&#xfbdd;","word","رَسُولِ",["(of the) Messenger of Allah ","rasul"]],[7,13,515,"&#xfbde;","word","اللَّهِ",["(of the) Messenger of Allah ","Allah"]],[8,13,515,"&#xfbdf;","word","أُولَٰئِكَ",["those","mereka itu"]],[9,13,515,"&#xfbe0;","word","الَّذِينَ",["(are) the ones","orang-orang yang"]],[10,13,515,"&#xfbe1;","word","امْتَحَنَ",["Allah has tested","menguji"]],[11,13,515,"&#xfbe2;","word","اللَّهُ",["Allah has tested","Allah"]],[12,14,515,"&#xfbe3;","word","قُلُوبَهُمْ",["their hearts","hati mereka"]],[13,14,515,"&#xfbe4;","word","لِلتَّقْوَىٰ",["for righteousness","untuk bertakwa"]],[14,14,515,"&#xfbe5;","pause","ۚ",[null,null]],[15,14,515,"&#xfbe6;","word","لَهُمْ",["For them","bagi mereka"]],[16,14,515,"&#xfbe7;","word","مَغْفِرَةٌ",["(is) forgiveness","ampunan"]],[17,14,515,"&#xfbe8;","word","وَأَجْرٌ",["and a reward","dan pahala"]],[18,14,515,"&#xfbe9;","word","عَظِيمٌ",["great","besar"]],[19,14,515,"&#xfbea;","end","ﯪ",[null,null]]],[[1,14,515,"&#xfbeb;","word","إِنَّ",["Indeed","sesungguhnya"]],[2,14,515,"&#xfbec;","word","الَّذِينَ",["those who","orang-orang yang"]],[3,15,515,"&#xfbed;","word","يُنَادُونَكَ",["call you","mereka memanggil kamu"]],[4,15,515,"&#xfbee;","word","مِنْ",["from","dari"]],[5,15,515,"&#xfbef;","word","وَرَاءِ",["behind","belakang"]],[6,15,515,"&#xfbf0;","word","الْحُجُرَاتِ",["the private chambers","kamar-kamar"]],[7,15,515,"&#xfbf1;","word","أَكْثَرُهُمْ",["most of them","kebanyakan mereka"]],[8,15,515,"&#xfbf2;","word","لَا",["(do) not","tidak"]],[9,15,515,"&#xfbf3;","word","يَعْقِلُونَ",["understand","mengerti"]],[10,15,515,"&#xfbf4;","end","ﯴ",[null,null]]],[[1,1,516,"&#xfb51;","word","وَلَوْ",["And if","dan kalau"]],[2,1,516,"&#xfb52;","word","أَنَّهُمْ",["they","sekiranya mereka"]],[3,1,516,"&#xfb53;","word","صَبَرُوا",["had been patient","mereka sabar"]],[4,1,516,"&#xfb54;","word","حَتَّىٰ",["until","sehingga"]],[5,1,516,"&#xfb55;","word","تَخْرُجَ",["you came out","kamu keluar"]],[6,1,516,"&#xfb56;","word","إِلَيْهِمْ",["to them","kepada mereka"]],[7,1,516,"&#xfb57;","word","لَكَانَ",["certainly it would be","sungguh adalah"]],[8,1,516,"&#xfb58;","word","خَيْرًا",["better","lebih baik"]],[9,1,516,"&#xfb59;","word","لَهُمْ",["for them","bagi mereka"]],[10,1,516,"&#xfb5a;","pause","ۚ",[null,null]],[11,1,516,"&#xfb5b;","word","وَاللَّهُ",["And Allah","dan Allah"]],[12,1,516,"&#xfb5c;","word","غَفُورٌ",["(is) Oft-Forgiving","Maha Pengampun"]],[13,2,516,"&#xfb5d;","word","رَحِيمٌ",["Most Merciful","Maha Penyayang"]],[14,2,516,"&#xfb5e;","end","ﭞ",[null,null]]],[[1,2,516,"&#xfb5f;","word","يَا أَيُّهَا",["O you who believe","wahai"]],[2,2,516,"&#xfb60;","word","الَّذِينَ",["O you who believe","orang-orang yang"]],[3,2,516,"&#xfb61;","word","آمَنُوا",["O you who believe","beriman"]],[4,2,516,"&#xfb62;","word","إِنْ",["If","jika"]],[5,2,516,"&#xfb63;","word","جَاءَكُمْ",["comes to you","datang kepadamu"]],[6,2,516,"&#xfb64;","word","فَاسِقٌ",["a wicked person","orang fasik"]],[7,2,516,"&#xfb65;","word","بِنَبَإٍ",["with information","dengan berita"]],[8,2,516,"&#xfb66;","word","فَتَبَيَّنُوا",["investigate","maka jelaskan"]],[9,3,516,"&#xfb67;","word","أَنْ",["lest","agar"]],[10,3,516,"&#xfb68;","word","تُصِيبُوا",["you harm","kamu (tidak) menimpakan"]],[11,3,516,"&#xfb69;","word","قَوْمًا",["a people","kaum"]],[12,3,516,"&#xfb6a;","word","بِجَهَالَةٍ",["in ignorance","karena kebodohan/tidak tahu"]],[13,3,516,"&#xfb6b;","word","فَتُصْبِحُوا",["then you become","maka jadilah kamu"]],[14,3,516,"&#xfb6c;","word","عَلَىٰ",["over","atas"]],[15,3,516,"&#xfb6d;","word","مَا",["what","apa"]],[16,3,516,"&#xfb6e;","word","فَعَلْتُمْ",["you have done","perbuatanmu"]],[17,3,516,"&#xfb6f;","word","نَادِمِينَ",["regretful","orang-orang yang menyesal"]],[18,3,516,"&#xfb70;","end","ﭰ",[null,null]]],[[1,4,516,"&#xfb71;","word","وَاعْلَمُوا",["And know","dan ketahuilah"]],[2,4,516,"&#xfb72;","word","أَنَّ",["that","bahwa"]],[3,4,516,"&#xfb73;","word","فِيكُمْ",["among you","diantara kamu"]],[4,4,516,"&#xfb74;","word","رَسُولَ",["(is the) Messenger of Allah","rasul"]],[5,4,516,"&#xfb75;","word","اللَّهِ",["(is the) Messenger of Allah","Allah"]],[6,4,516,"&#xfb76;","pause","ۚ",[null,null]],[7,4,516,"&#xfb77;","word","لَوْ",["If","jika"]],[8,4,516,"&#xfb78;","word","يُطِيعُكُمْ",["he were to obey you","dia mentaati kamu"]],[9,4,516,"&#xfb79;","word","فِي",["in","dalam"]],[10,4,516,"&#xfb7a;","word","كَثِيرٍ",["much","banyak"]],[11,4,516,"&#xfb7b;","word","مِنَ",["of","dari"]],[12,4,516,"&#xfb7c;","word","الْأَمْرِ",["the matter","urusan"]],[13,4,516,"&#xfb7d;","word","لَعَنِتُّمْ",["surely you would be in difficulty","tentu menyusahkan kamu"]],[14,5,516,"&#xfb7e;","word","وَلَٰكِنَّ",["but","tetapi"]],[15,5,516,"&#xfb7f;","word","اللَّهَ",["Allah","Allah"]],[16,5,516,"&#xfb80;","word","حَبَّبَ",["has endeared","menjadikan cinta"]],[17,5,516,"&#xfb81;","word","إِلَيْكُمُ",["to you","kepadamu"]],[18,5,516,"&#xfb82;","word","الْإِيمَانَ",["the Faith","keimanan"]],[19,5,516,"&#xfb83;","word","وَزَيَّنَهُ",["and has made it pleasing","dan Dia menjadikannya indah"]],[20,5,516,"&#xfb84;","word","فِي",["in","dalam"]],[21,5,516,"&#xfb85;","word","قُلُوبِكُمْ",["your hearts","hatimu"]],[22,5,516,"&#xfb86;","word","وَكَرَّهَ",["and has made hateful","dan Dia menjadikan benci"]],[23,5,516,"&#xfb87;","word","إِلَيْكُمُ",["to you","kepadamu"]],[24,6,516,"&#xfb88;","word","الْكُفْرَ",["disbelief","kekafiran"]],[25,6,516,"&#xfb89;","word","وَالْفُسُوقَ",["and defiance","dan kefasikan"]],[26,6,516,"&#xfb8a;","word","وَالْعِصْيَانَ",["and disobedience","dan kedurhakaan"]],[27,6,516,"&#xfb8b;","pause","ۚ",[null,null]],[28,6,516,"&#xfb8c;","word","أُولَٰئِكَ",["Those","mereka itu"]],[29,6,516,"&#xfb8d;","word","هُمُ",["(are) they ","mereka"]],[30,6,516,"&#xfb8e;","word","الرَّاشِدُونَ",["the guided ones","orang-orang yang mengikuti jalan yang lurus"]],[31,6,516,"&#xfb8f;","end","ﮏ",[null,null]]],[[1,7,516,"&#xfb90;","word","فَضْلًا",["A Bounty","karunia"]],[2,7,516,"&#xfb91;","word","مِنَ",["from Allah","dari"]],[3,7,516,"&#xfb92;","word","اللَّهِ",["from Allah","Allah"]],[4,7,516,"&#xfb93;","word","وَنِعْمَةً",["and favor","dan nikmat"]],[5,7,516,"&#xfb94;","pause","ۚ",[null,null]],[6,7,516,"&#xfb95;","word","وَاللَّهُ",["And Allah","dan Allah"]],[7,7,516,"&#xfb96;","word","عَلِيمٌ",["(is) All-Knower","Maha Mengetahui"]],[8,7,516,"&#xfb97;","word","حَكِيمٌ",["All-Wise","Maha Bijaksana"]],[9,7,516,"&#xfb98;","end","ﮘ",[null,null]]],[[1,7,516,"&#xfb99;","word","وَإِنْ",["And if","dan jika"]],[2,7,516,"&#xfb9a;","word","طَائِفَتَانِ",["two parties","dua golongan"]],[3,8,516,"&#xfb9b;","word","مِنَ",["among","dari"]],[4,8,516,"&#xfb9c;","word","الْمُؤْمِنِينَ",["the believers","orang-orang yang beriman"]],[5,8,516,"&#xfb9d;","word","اقْتَتَلُوا",["fight","mereka berperang"]],[6,8,516,"&#xfb9e;","word","فَأَصْلِحُوا",["then make peace","maka damaikanlah"]],[7,8,516,"&#xfb9f;","word","بَيْنَهُمَا",["between both of them","diantara keduanya"]],[8,8,516,"&#xfba0;","pause","ۖ",[null,null]],[9,8,516,"&#xfba1;","word","فَإِنْ",["But if","maka jika"]],[10,8,516,"&#xfba2;","word","بَغَتْ",["oppresses","berbuat aniaya"]],[11,8,516,"&#xfba3;","word","إِحْدَاهُمَا",["one of them","salah seorang dari keduanya"]],[12,9,516,"&#xfba4;","word","عَلَى",["on","atas"]],[13,9,516,"&#xfba5;","word","الْأُخْرَىٰ",["the other","yang lain"]],[14,9,516,"&#xfba6;","word","فَقَاتِلُوا",["then fight","maka perangilah"]],[15,9,516,"&#xfba7;","word","الَّتِي",["one which","yang"]],[16,9,516,"&#xfba8;","word","تَبْغِي",["oppresses","berbuat aniaya"]],[17,9,516,"&#xfba9;","word","حَتَّىٰ",["until","sehingga"]],[18,9,516,"&#xfbaa;","word","تَفِيءَ",["it returns","(golongan) kembali"]],[19,9,516,"&#xfbab;","word","إِلَىٰ",["to","kepada"]],[20,9,516,"&#xfbac;","word","أَمْرِ",["(the) command","perintah"]],[21,9,516,"&#xfbad;","word","اللَّهِ",["(of) Allah","Allah"]],[22,9,516,"&#xfbae;","pause","ۚ",[null,null]],[23,9,516,"&#xfbaf;","word","فَإِنْ",["Then if","maka jika"]],[24,9,516,"&#xfbb0;","word","فَاءَتْ",["it returns","kembali"]],[25,10,516,"&#xfbb1;","word","فَأَصْلِحُوا",["then make peace","maka damaikanlah"]],[26,10,516,"&#xfbd3;","word","بَيْنَهُمَا",["between them","diantara keduanya"]],[27,10,516,"&#xfbd4;","word","بِالْعَدْلِ",["with justice","dengan adil"]],[28,10,516,"&#xfbd5;","word","وَأَقْسِطُوا",["and act justly","dan berlaku adil-lah kamu"]],[29,10,516,"&#xfbd6;","pause","ۖ",[null,null]],[30,10,516,"&#xfbd7;","word","إِنَّ",["Indeed","sesungguhnya"]],[31,10,516,"&#xfbd8;","word","اللَّهَ",["Allah","Allah"]],[32,10,516,"&#xfbd9;","word","يُحِبُّ",["loves","menyukai"]],[33,10,516,"&#xfbda;","word","الْمُقْسِطِينَ",["those who act justly","orang-orang yang berbuat adil"]],[34,11,516,"&#xfbdb;","end","ﯛ",[null,null]]],[[1,11,516,"&#xfbdc;","word","إِنَّمَا",["Only","sesungguhnya hanyalah"]],[2,11,516,"&#xfbdd;","word","الْمُؤْمِنُونَ",["the believers","orang-orang yang beriman"]],[3,11,516,"&#xfbde;","word","إِخْوَةٌ",["(are) brothers","bersaudara"]],[4,11,516,"&#xfbdf;","word","فَأَصْلِحُوا",["so make peace","maka damaikanlah"]],[5,11,516,"&#xfbe0;","word","بَيْنَ",["between","antara"]],[6,11,516,"&#xfbe1;","word","أَخَوَيْكُمْ",["your brothers","kedua saudaramu"]],[7,11,516,"&#xfbe2;","pause","ۚ",[null,null]],[8,11,516,"&#xfbe3;","word","وَاتَّقُوا",["and fear Allah","dan bertakwalah"]],[9,11,516,"&#xfbe4;","word","اللَّهَ",["and fear Allah","Allah"]],[10,12,516,"&#xfbe5;","word","لَعَلَّكُمْ",["so that you may","agar kamu"]],[11,12,516,"&#xfbe6;","word","تُرْحَمُونَ",["receive mercy","kamu dirahmati"]],[12,12,516,"&#xfbe7;","end","ﯧ",[null,null]]],[[1,12,516,"&#xfbe8;","word","يَا أَيُّهَا",["O you who believe","wahai"]],[2,12,516,"&#xfbe9;","word","الَّذِينَ",["O you who believe","orang-orang yang"]],[3,12,516,"&#xfbea;","word","آمَنُوا",["O you who believe","beriman"]],[4,12,516,"&#xfbeb;","word","لَا",["(Let) not","jangan"]],[5,12,516,"&#xfbec;","word","يَسْخَرْ",["ridicule","memperolok-olok"]],[6,12,516,"&#xfbed;","word","قَوْمٌ",["a people","suatu kamu"]],[7,12,516,"&#xfbee;","word","مِنْ",["[of]","dari"]],[8,12,516,"&#xfbef;","word","قَوْمٍ",["(another) people","kaum"]],[9,13,516,"&#xfbf0;","word","عَسَىٰ",["perhaps","boleh jadi"]],[10,13,516,"&#xfbf1;","word","أَنْ",["that","bahwa"]],[11,13,516,"&#xfbf2;","word","يَكُونُوا",["they may be","adalah mereka"]],[12,13,516,"&#xfbf3;","word","خَيْرًا",["better","lebih baik"]],[13,13,516,"&#xfbf4;","word","مِنْهُمْ",["than them","dari pada mereka"]],[14,13,516,"&#xfbf5;","word","وَلَا",["and (let) not","dan jangan"]],[15,13,516,"&#xfbf6;","word","نِسَاءٌ",["women","wanita"]],[16,13,516,"&#xfbf7;","word","مِنْ",["[of]","dari"]],[17,13,516,"&#xfbf8;","word","نِسَاءٍ",["(other) women","wanita"]],[18,13,516,"&#xfbf9;","word","عَسَىٰ",["perhaps","boleh jadi"]],[19,13,516,"&#xfbfa;","word","أَنْ",["that","bahwa"]],[20,13,516,"&#xfbfb;","word","يَكُنَّ",["they may be","mereka adalah"]],[21,13,516,"&#xfbfc;","word","خَيْرًا",["better","lebih baik"]],[22,14,516,"&#xfbfd;","word","مِنْهُنَّ",["than them","dari mereka"]],[23,14,516,"&#xfbfe;","pause","ۖ",[null,null]],[24,14,516,"&#xfbff;","word","وَلَا",["And (do) not","dan jangan"]],[25,14,516,"&#xfc00;","word","تَلْمِزُوا",["insult","kamu mencela"]],[26,14,516,"&#xfc01;","word","أَنْفُسَكُمْ",["yourselves","dirimu sendiri"]],[27,14,516,"&#xfc02;","word","وَلَا",["and (do) not","dan jangan"]],[28,14,516,"&#xfc03;","word","تَنَابَزُوا",["call each other","kamu panggil memanggil"]],[29,14,516,"&#xfc04;","word","بِالْأَلْقَابِ",["by nicknames","dengan julukan"]],[30,14,516,"&#xfc05;","pause","ۖ",[null,null]],[31,14,516,"&#xfc06;","word","بِئْسَ",["Wretched is","seburuk-buruk"]],[32,14,516,"&#xfc07;","word","الِاسْمُ",["the name","nama"]],[33,15,516,"&#xfc08;","word","الْفُسُوقُ",["(of) disobedience","fasik"]],[34,15,516,"&#xfc09;","word","بَعْدَ",["after","sesudah"]],[35,15,516,"&#xfc0a;","word","الْإِيمَانِ",["the faith","keimanan"]],[36,15,516,"&#xfc0b;","pause","ۚ",[null,null]],[37,15,516,"&#xfc0c;","word","وَمَنْ",["And whoever","dan barang siapa"]],[38,15,516,"&#xfc0d;","word","لَمْ",["(does) not","tidak"]],[39,15,516,"&#xfc0e;","word","يَتُبْ",["repent","berbuat"]],[40,15,516,"&#xfc0f;","word","فَأُولَٰئِكَ",["then those ","maka mereka itu"]],[41,15,516,"&#xfc10;","word","هُمُ",["they","mereka"]],[42,15,516,"&#xfc11;","word","الظَّالِمُونَ",["(are) the wrongdoers","orang-orang yang zalim"]],[43,15,516,"&#xfc12;","end","ﰒ",[null,null]]],[[1,1,517,"&#xfb51;","word","يَا أَيُّهَا",["O you who believe","wahai"]],[2,1,517,"&#xfb52;","word","الَّذِينَ",["O you who believe","orang-orang yang"]],[3,1,517,"&#xfb53;","word","آمَنُوا",["O you who believe","beriman"]],[4,1,517,"&#xfb54;","word","اجْتَنِبُوا",["Avoid","jauhilah"]],[5,1,517,"&#xfb55;","word","كَثِيرًا",["much","banyak"]],[6,1,517,"&#xfb56;","word","مِنَ",["of","dari"]],[7,1,517,"&#xfb57;","word","الظَّنِّ",["the assumption","berprasangka"]],[8,1,517,"&#xfb58;","word","إِنَّ",["Indeed","sesungguhnya"]],[9,1,517,"&#xfb59;","word","بَعْضَ",["some","sebagian"]],[10,1,517,"&#xfb5a;","word","الظَّنِّ",["assumption","berprasangka"]],[11,1,517,"&#xfb5b;","word","إِثْمٌ",["(is) sin","dosa"]],[12,1,517,"&#xfb5c;","pause","ۖ",[null,null]],[13,2,517,"&#xfb5d;","word","وَلَا",["And (do) not","dan jangan "]],[14,2,517,"&#xfb5e;","word","تَجَسَّسُوا",["spy","kamu mencari kesalahan"]],[15,2,517,"&#xfb5f;","word","وَلَا",["and (do) not","dan jangan"]],[16,2,517,"&#xfb60;","word","يَغْتَبْ",["backbite","kamu mengumpat"]],[17,2,517,"&#xfb61;","word","بَعْضُكُمْ",["some of you","sebagian kamu"]],[18,2,517,"&#xfb62;","word","بَعْضًا",["(to) others","sebagian"]],[19,2,517,"&#xfb63;","pause","ۚ",[null,null]],[20,2,517,"&#xfb64;","word","أَيُحِبُّ",["Would like","apakah kamu menyukai"]],[21,2,517,"&#xfb65;","word","أَحَدُكُمْ",["one of you","salah seorang diantara kamu"]],[22,2,517,"&#xfb66;","word","أَنْ",["to","bahwa"]],[23,3,517,"&#xfb67;","word","يَأْكُلَ",["eat","memakan"]],[24,3,517,"&#xfb68;","word","لَحْمَ",["(the) flesh","daging"]],[25,3,517,"&#xfb69;","word","أَخِيهِ",["(of) his brother","saudaranya"]],[26,3,517,"&#xfb6a;","word","مَيْتًا",["dead","yang mati"]],[27,3,517,"&#xfb6b;","word","فَكَرِهْتُمُوهُ",["Nay, you would hate it","maka kamu jijik padanya"]],[28,3,517,"&#xfb6c;","pause","ۚ",[null,null]],[29,3,517,"&#xfb6d;","word","وَاتَّقُوا",["And fear Allah","dan bertakwalah"]],[30,3,517,"&#xfb6e;","word","اللَّهَ",["And fear Allah","Allah"]],[31,3,517,"&#xfb6f;","pause","ۚ",[null,null]],[32,3,517,"&#xfb70;","word","إِنَّ",["indeed","sesungguhnya"]],[33,3,517,"&#xfb71;","word","اللَّهَ",["Allah","Allah"]],[34,3,517,"&#xfb72;","word","تَوَّابٌ",["(is) Oft-Returning","Maha Penerima taubat"]],[35,4,517,"&#xfb73;","word","رَحِيمٌ",["Most Merciful","Maha Penyayang"]],[36,4,517,"&#xfb74;","end","ﭴ",[null,null]]],[[1,4,517,"&#xfb75;","word","يَا أَيُّهَا",["O mankind","wahai"]],[2,4,517,"&#xfb76;","word","النَّاسُ",["O mankind","manusia"]],[3,4,517,"&#xfb77;","word","إِنَّا",["Indeed, We","sesungguhnya Kami"]],[4,4,517,"&#xfb78;","word","خَلَقْنَاكُمْ",["created you","Kami menciptakan Kamu"]],[5,4,517,"&#xfb79;","word","مِنْ",["from","dari"]],[6,4,517,"&#xfb7a;","word","ذَكَرٍ",["a male","laki-laki"]],[7,4,517,"&#xfb7b;","word","وَأُنْثَىٰ",["and a female","dan perempuan"]],[8,4,517,"&#xfb7c;","word","وَجَعَلْنَاكُمْ",["and We made you","dan Kami jadikan kamu"]],[9,5,517,"&#xfb7d;","word","شُعُوبًا",["nations","berbangsa-bangsa"]],[10,5,517,"&#xfb7e;","word","وَقَبَائِلَ",["and tribes","dan bersuku-suku"]],[11,5,517,"&#xfb7f;","word","لِتَعَارَفُوا",["that you may know one another","supaya kamu saling mengenal"]],[12,5,517,"&#xfb80;","pause","ۚ",[null,null]],[13,5,517,"&#xfb81;","word","إِنَّ",["Indeed","sesungguhnya"]],[14,5,517,"&#xfb82;","word","أَكْرَمَكُمْ",["(the) most noble of you","paling mulia diantara kamu "]],[15,5,517,"&#xfb83;","word","عِنْدَ",["near","di sisi"]],[16,5,517,"&#xfb84;","word","اللَّهِ",["Allah","Allah"]],[17,5,517,"&#xfb85;","word","أَتْقَاكُمْ",["(is the) most righteous of you","paling bertakwa diantara kamu"]],[18,5,517,"&#xfb86;","pause","ۚ",[null,null]],[19,5,517,"&#xfb87;","word","إِنَّ",["Indeed","sesungguhnya"]],[20,5,517,"&#xfb88;","word","اللَّهَ",["Allah","Allah"]],[21,6,517,"&#xfb89;","word","عَلِيمٌ",["(is) All-Knower","Maha Mengetahui"]],[22,6,517,"&#xfb8a;","word","خَبِيرٌ",["All-Aware","Maha Melihat"]],[23,6,517,"&#xfb8b;","end","ﮋ",[null,null]]],[[1,6,517,"&#xfb8c;","rub-el-hizb","۞",[null,null]],[2,6,517,"&#xfb8d;","word","قَالَتِ",["Say","berkata"]],[3,6,517,"&#xfb8e;","word","الْأَعْرَابُ",["the Bedouins","orang-orang Arab dusun"]],[4,6,517,"&#xfb8f;","word","آمَنَّا",["We believe","kami telah beriman"]],[5,6,517,"&#xfb90;","pause","ۖ",[null,null]],[6,6,517,"&#xfb91;","word","قُلْ",["Say","katakanlah"]],[7,6,517,"&#xfb92;","word","لَمْ",["Not","belum"]],[8,6,517,"&#xfb93;","word","تُؤْمِنُوا",["you believe","kamu beriman"]],[9,6,517,"&#xfb94;","word","وَلَٰكِنْ",["but","tetapi"]],[10,7,517,"&#xfb95;","word","قُولُوا",["say","katakan"]],[11,7,517,"&#xfb96;","word","أَسْلَمْنَا",["We have submitted","kami telah menyerahkan diri"]],[12,7,517,"&#xfb97;","word","وَلَمَّا",["and has not yet","dan belum"]],[13,7,517,"&#xfb98;","word","يَدْخُلِ",["entered","masuk"]],[14,7,517,"&#xfb99;","word","الْإِيمَانُ",["the faith","keimanan"]],[15,7,517,"&#xfb9a;","word","فِي",["in","dalam"]],[16,7,517,"&#xfb9b;","word","قُلُوبِكُمْ",["your hearts","hati kamu"]],[17,7,517,"&#xfb9c;","pause","ۖ",[null,null]],[18,7,517,"&#xfb9d;","word","وَإِنْ",["But if","dan jika"]],[19,7,517,"&#xfb9e;","word","تُطِيعُوا",["you obey","kamu taat"]],[20,7,517,"&#xfb9f;","word","اللَّهَ",["Allah","Allah"]],[21,8,517,"&#xfba0;","word","وَرَسُولَهُ",["and His Messenger","dan rasul-Nya"]],[22,8,517,"&#xfba1;","word","لَا",["not","tidak"]],[23,8,517,"&#xfba2;","word","يَلِتْكُمْ",["He will deprive you","Dia mengurangi kamu"]],[24,8,517,"&#xfba3;","word","مِنْ",["of","dari"]],[25,8,517,"&#xfba4;","word","أَعْمَالِكُمْ",["your deeds","amalanmu"]],[26,8,517,"&#xfba5;","word","شَيْئًا",["anything","sesuatu pun"]],[27,8,517,"&#xfba6;","pause","ۚ",[null,null]],[28,8,517,"&#xfba7;","word","إِنَّ",["Indeed","sesungguhnya"]],[29,8,517,"&#xfba8;","word","اللَّهَ",["Allah","Allah"]],[30,8,517,"&#xfba9;","word","غَفُورٌ",["(is) Oft-Forgiving","Maha Pengampun"]],[31,8,517,"&#xfbaa;","word","رَحِيمٌ",["Most Merciful","Maha Penyayang"]],[32,8,517,"&#xfbab;","end","ﮫ",[null,null]]],[[1,9,517,"&#xfbac;","word","إِنَّمَا",["Only","sesungguhnya hanyalah"]],[2,9,517,"&#xfbad;","word","الْمُؤْمِنُونَ",["the believers","orang-orang mukmin"]],[3,9,517,"&#xfbae;","word","الَّذِينَ",["(are) those who","orang-orang yang"]],[4,9,517,"&#xfbaf;","word","آمَنُوا",["believe","beriman"]],[5,9,517,"&#xfbb0;","word","بِاللَّهِ",["in Allah","kepada Allah"]],[6,9,517,"&#xfbb1;","word","وَرَسُولِهِ",["and His Messenger","dan rasul-Nya"]],[7,9,517,"&#xfbd3;","word","ثُمَّ",["then","kemudian"]],[8,9,517,"&#xfbd4;","word","لَمْ",["(do) not","tidak"]],[9,9,517,"&#xfbd5;","word","يَرْتَابُوا",["doubt","mereka ragu-ragu"]],[10,10,517,"&#xfbd6;","word","وَجَاهَدُوا",["but strive","dan mereka berjihad"]],[11,10,517,"&#xfbd7;","word","بِأَمْوَالِهِمْ",["with their wealth","dengan harta mereka"]],[12,10,517,"&#xfbd8;","word","وَأَنْفُسِهِمْ",["and their lives","dan diri/jiwa mereka"]],[13,10,517,"&#xfbd9;","word","فِي",["in","di"]],[14,10,517,"&#xfbda;","word","سَبِيلِ",["(the) way","jalan"]],[15,10,517,"&#xfbdb;","word","اللَّهِ",["(of) Allah","Allah"]],[16,10,517,"&#xfbdc;","pause","ۚ",[null,null]],[17,10,517,"&#xfbdd;","word","أُولَٰئِكَ",["Those","mereka itu"]],[18,10,517,"&#xfbde;","word","هُمُ",["[they]","mereka"]],[19,11,517,"&#xfbdf;","word","الصَّادِقُونَ",["(are) the truthful","orang-orang yang benar"]],[20,11,517,"&#xfbe0;","end","ﯠ",[null,null]]],[[1,11,517,"&#xfbe1;","word","قُلْ",["Say","katakanlah"]],[2,11,517,"&#xfbe2;","word","أَتُعَلِّمُونَ",["Will you acquaint","apakah kamu akan memberitahukan"]],[3,11,517,"&#xfbe3;","word","اللَّهَ",["Allah","Allah"]],[4,11,517,"&#xfbe4;","word","بِدِينِكُمْ",["with your religion","tentang agamamu"]],[5,11,517,"&#xfbe5;","word","وَاللَّهُ",["while Allah","dan Allah"]],[6,12,517,"&#xfbe6;","word","يَعْلَمُ",["knows","mengetahui"]],[7,12,517,"&#xfbe7;","word","مَا",["what","apa yang ada "]],[8,12,517,"&#xfbe8;","word","فِي",["(is) in","di"]],[9,12,517,"&#xfbe9;","word","السَّمَاوَاتِ",["the heavens","langit"]],[10,12,517,"&#xfbea;","word","وَمَا",["and what","dan apa yang ada"]],[11,12,517,"&#xfbeb;","word","فِي",["(is) in","di"]],[12,12,517,"&#xfbec;","word","الْأَرْضِ",["the earth","bumi"]],[13,12,517,"&#xfbed;","pause","ۚ",[null,null]],[14,12,517,"&#xfbee;","word","وَاللَّهُ",["And Allah","dan Allah"]],[15,12,517,"&#xfbef;","word","بِكُلِّ",["of every","terhadap segala"]],[16,12,517,"&#xfbf0;","word","شَيْءٍ",["thing","sesuatu"]],[17,12,517,"&#xfbf1;","word","عَلِيمٌ",["(is) All-Knower","Maha Mengetahui"]],[18,13,517,"&#xfbf2;","end","ﯲ",[null,null]]],[[1,13,517,"&#xfbf3;","word","يَمُنُّونَ",["They consider (it) a favor","mereka merasa memberi nikmat"]],[2,13,517,"&#xfbf4;","word","عَلَيْكَ",["to you","atas kamu"]],[3,13,517,"&#xfbf5;","word","أَنْ",["that","bahwa"]],[4,13,517,"&#xfbf6;","word","أَسْلَمُوا",["they have accepted Islam","mereka masuk Islam"]],[5,13,517,"&#xfbf7;","pause","ۖ",[null,null]],[6,13,517,"&#xfbf8;","word","قُلْ",["Say","katakan"]],[7,13,517,"&#xfbf9;","word","لَا",["(Do) not","jangan"]],[8,13,517,"&#xfbfa;","word","تَمُنُّوا",["consider a favor","kamu merasa memberi nikmat"]],[9,13,517,"&#xfbfb;","word","عَلَيَّ",["on me ","atas"]],[10,13,517,"&#xfbfc;","word","إِسْلَامَكُمْ",["your Islam","keislamanmu"]],[11,13,517,"&#xfbfd;","pause","ۖ",[null,null]],[12,13,517,"&#xfbfe;","word","بَلِ",["Nay","bahkan"]],[13,13,517,"&#xfbff;","word","اللَّهُ",["Allah","Allah"]],[14,14,517,"&#xfc00;","word","يَمُنُّ",["has conferred a favor","memberi nikmat"]],[15,14,517,"&#xfc01;","word","عَلَيْكُمْ",["upon you","atas mu"]],[16,14,517,"&#xfc02;","word","أَنْ",["that","bahwa"]],[17,14,517,"&#xfc03;","word","هَدَاكُمْ",["He has guided you","Dia memberi petunjuk kepadamu"]],[18,14,517,"&#xfc04;","word","لِلْإِيمَانِ",["to the faith","kepada keimanan"]],[19,14,517,"&#xfc05;","word","إِنْ",["if","jika"]],[20,14,517,"&#xfc06;","word","كُنْتُمْ",["you are","kamu adalah"]],[21,14,517,"&#xfc07;","word","صَادِقِينَ",["truthful","orang-orang yang benar"]],[22,14,517,"&#xfc08;","end","ﰈ",[null,null]]],[[1,14,517,"&#xfc09;","word","إِنَّ",["Indeed","sesungguhnya"]],[2,14,517,"&#xfc0a;","word","اللَّهَ",["Allah","Allah"]],[3,15,517,"&#xfc0b;","word","يَعْلَمُ",["knows","Maha Mengetahui"]],[4,15,517,"&#xfc0c;","word","غَيْبَ",["(the) unseen","kegaiban"]],[5,15,517,"&#xfc0d;","word","السَّمَاوَاتِ",["(of) the heavens","langit"]],[6,15,517,"&#xfc0e;","word","وَالْأَرْضِ",["and the earth","dan bumi"]],[7,15,517,"&#xfc0f;","pause","ۚ",[null,null]],[8,15,517,"&#xfc10;","word","وَاللَّهُ",["And Allah","dan Allah"]],[9,15,517,"&#xfc11;","word","بَصِيرٌ",["(is) All-Seer","Maha Melihat"]],[10,15,517,"&#xfc12;","word","بِمَا",["of what","terhadap apa"]],[11,15,517,"&#xfc13;","word","تَعْمَلُونَ",["you do","kamu kerjakan"]],[12,15,517,"&#xfc14;","end","ﰔ",[null,null]]]]]}
