{"chapter_number":60,"bismillah_pre":true,"revelation_order":91,"revelation_place":"madinah","name_arabic":"الممتحنة","name_complex":"Al-Mumtaĥanah","name_simple":"Al-Mumtahanah","verses_count":13,"pages":[549,551],"meaning":{"text":"She that is to be examined","en":"She that is to be examined","id":"Wanita yang Diuji"},"verses":[[[1,5151,"60:1","يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِم بِالْمَوَدَّةِ وَقَدْ كَفَرُوا بِمَا جَاءَكُم مِّنَ الْحَقِّ يُخْرِجُونَ الرَّسُولَ وَإِيَّاكُمْ ۙ أَن تُؤْمِنُوا بِاللَّهِ رَبِّكُمْ إِن كُنتُمْ خَرَجْتُمْ جِهَادًا فِي سَبِيلِي وَابْتِغَاءَ مَرْضَاتِي ۚ تُسِرُّونَ إِلَيْهِم بِالْمَوَدَّةِ وَأَنَا أَعْلَمُ بِمَا أَخْفَيْتُمْ وَمَا أَعْلَنتُمْ ۚ وَمَن يَفْعَلْهُ مِنكُمْ فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ",["O you who believe! do not take My enemy and your enemy for friends: would you offer them love while they deny what has come to you of the truth, driving out the Messenger and yourselves because you believe in Allah, your Lord? If you go forth struggling hard in My path and seeking My pleasure, would you manifest love to them? And I know what you conceal and what you manifest; and whoever of you does this, he indeed has gone astray from the straight path.","Wahai orang-orang yang beriman! Janganlah kamu menjadikan musuh-Ku dan musuhmu sebagai teman-teman setia sehingga kamu sampaikan kepada mereka (berita-berita Muhammad), karena rasa kasih sayang; padahal mereka telah ingkar kepada kebenaran yang disampaikan kepadamu. Mereka mengusir Rasul dan kamu sendiri karena kamu beriman kepada Allah, Tuhanmu. Jika kamu benar-benar keluar untuk berjihad pada jalan-Ku dan mencari keridhaan-Ku (janganlah kamu berbuat demikian). Kamu memberitahukan secara rahasia (berita-berita Muhammad) kepada mereka, karena rasa kasih sayang, dan Aku lebih mengetahui apa yang kamu sembunyikan dan apa yang kamu nyatakan. Dan barangsiapa di antara kamu yang melakukannya, maka sungguh, dia telah tersesat dari jalan yang lurus."],549,28,55,219,null,null],[2,5152,"60:2","إِن يَثْقَفُوكُمْ يَكُونُوا لَكُمْ أَعْدَاءً وَيَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ وَأَلْسِنَتَهُم بِالسُّوءِ وَوَدُّوا لَوْ تَكْفُرُونَ",["If they find you, they will be your enemies, and will stretch forth towards you their hands and their tongues with evil, and they ardently desire that you may disbelieve.","Jika mereka menangkapmu, niscaya mereka bertindak sebagai musuh bagimu lalu melepaskan tangan dan lidahnya kepadamu untuk menyakiti dan mereka ingin agar kamu (kembali) kafir."],549,28,55,219,null,null],[3,5153,"60:3","لَن تَنفَعَكُمْ أَرْحَامُكُمْ وَلَا أَوْلَادُكُمْ ۚ يَوْمَ الْقِيَامَةِ يَفْصِلُ بَيْنَكُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",["Your relationship would not profit you, nor your children on the day of resurrection; He will decide between you; and Allah sees what you do.","Kaum kerabatmu dan anak-anakmu tidak akan bermanfaat bagimu pada hari Kiamat. Dia akan memisahkan antara kamu. Dan Allah Maha Melihat apa yang kamu kerjakan."],549,28,55,219,null,null],[4,5154,"60:4","قَدْ كَانَتْ لَكُمْ أُسْوَةٌ حَسَنَةٌ فِي إِبْرَاهِيمَ وَالَّذِينَ مَعَهُ إِذْ قَالُوا لِقَوْمِهِمْ إِنَّا بُرَآءُ مِنكُمْ وَمِمَّا تَعْبُدُونَ مِن دُونِ اللَّهِ كَفَرْنَا بِكُمْ وَبَدَا بَيْنَنَا وَبَيْنَكُمُ الْعَدَاوَةُ وَالْبَغْضَاءُ أَبَدًا حَتَّىٰ تُؤْمِنُوا بِاللَّهِ وَحْدَهُ إِلَّا قَوْلَ إِبْرَاهِيمَ لِأَبِيهِ لَأَسْتَغْفِرَنَّ لَكَ وَمَا أَمْلِكُ لَكَ مِنَ اللَّهِ مِن شَيْءٍ ۖ رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ",["Indeed, there is for you a good example in Ibrahim and those with him when they said to their people: Surely we are clear of you and of what you serve besides Allah; we declare ourselves to be clear of you, and enmity and hatred have appeared between us and you forever until you believe in Allah alone-- but not in what Ibrahim said to his father: I would certainly ask forgiveness for you, and I do not control for you aught from Allah-- Our Lord! on Thee do we rely, and to Thee do we turn, and to Thee is the eventual coming:","Sungguh, telah ada suri teladan yang baik bagimu pada Ibrahim dan orang-orang yang bersama dengannya, ketika mereka berkata kepada kaumnya, “Sesungguhnya kami berlepas diri dari kamu dan dari apa yang kamu sembah selain Allah, kami mengingkari (kekafiran)mu dan telah nyata antara kami dan kamu ada permusuhan dan kebencian untuk selama-lamanya sampai kamu beriman kepada Allah saja,” kecuali perkataan Ibrahim kepada ayahnya, ”Sungguh, aku akan memohonkan ampunan bagimu, namun aku sama sekali tidak dapat menolak (siksaan) Allah terhadapmu.” (Ibrahim berkata), “Ya Tuhan kami, hanya kepada Engkau kami bertawakal dan hanya kepada Engkau kami bertobat dan hanya kepada Engkaulah kami kembali,"],549,28,55,219,null,null],[5,5155,"60:5","رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا ۖ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ",["Our Lord! do not make us a trial for those who disbelieve, and forgive us, our Lord! surely Thou art the Mighty, the Wise.","Ya Tuhan kami, janganlah Engkau jadikan kami (sasaran) fitnah bagi orang-orang kafir. Dan ampunilah kami, ya Tuhan kami. Sesungguhnya Engkau yang Mahaperkasa, Mahabijaksana.”"],549,28,55,219,null,null],[6,5156,"60:6","لَقَدْ كَانَ لَكُمْ فِيهِمْ أُسْوَةٌ حَسَنَةٌ لِّمَن كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الْآخِرَ ۚ وَمَن يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ",["Certainly there is for you in them a good example, for him who fears Allah and the last day; and whoever turns back, then surely Allah is the Self-sufficient, the Praised.","Sungguh, pada mereka itu (Ibrahim dan umatnya) terdapat suri teladan yang baik bagimu; (yaitu) bagi orang yang mengharap (pahala) Allah dan (keselamatan pada) hari kemudian, dan barangsiapa berpaling, maka sesungguhnya Allah, Dialah Yang Mahakaya, Maha Terpuji."],550,28,55,219,null,null],[7,5157,"60:7","عَسَى اللَّهُ أَن يَجْعَلَ بَيْنَكُمْ وَبَيْنَ الَّذِينَ عَادَيْتُم مِّنْهُم مَّوَدَّةً ۚ وَاللَّهُ قَدِيرٌ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ",["It may be that Allah will bring about friendship between you and those whom you hold to be your enemies among them; and Allah is Powerful; and Allah is Forgiving, Merciful.","Mudah-mudahan Allah menimbulkan kasih sayang di antara kamu dengan orang-orang yang pernah kamu musuhi di antara mereka. Allah Mahakuasa. Dan Allah Maha Pengampun, Maha Penyayang."],550,28,55,220,null,null],[8,5158,"60:8","لَّا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ لَمْ يُقَاتِلُوكُمْ فِي الدِّينِ وَلَمْ يُخْرِجُوكُم مِّن دِيَارِكُمْ أَن تَبَرُّوهُمْ وَتُقْسِطُوا إِلَيْهِمْ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ",["Allah does not forbid you respecting those who have not made war against you on account of (your) religion, and have not driven you forth from your homes, that you show them kindness and deal with them justly; surely Allah loves the doers of justice.","Allah tidak melarang kamu berbuat baik dan berlaku adil terhadap orang-orang yang tidak memerangimu dalam urusan agama dan tidak mengusir kamu dari kampung halamanmu. Sesungguhnya Allah mencintai orang-orang yang berlaku adil."],550,28,55,220,null,null],[9,5159,"60:9","إِنَّمَا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ قَاتَلُوكُمْ فِي الدِّينِ وَأَخْرَجُوكُم مِّن دِيَارِكُمْ وَظَاهَرُوا عَلَىٰ إِخْرَاجِكُمْ أَن تَوَلَّوْهُمْ ۚ وَمَن يَتَوَلَّهُمْ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ",["Allah only forbids you respecting those who made war upon you on account of (your) religion, and drove you forth from your homes and backed up (others) in your expulsion, that you make friends with them, and whoever makes friends with them, these are the unjust.","Sesungguhnya Allah hanya melarang kamu menjadikan mereka sebagai kawanmu orang-orang yang memerangi kamu dalam urusan agama dan mengusir kamu dari kampung halamanmu dan membantu (orang lain) untuk mengusirmu. Barangsiapa menjadikan mereka sebagai kawan, mereka itulah orang-orang yang zhalim."],550,28,55,220,null,null],[10,5160,"60:10","يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ فَامْتَحِنُوهُنَّ ۖ اللَّهُ أَعْلَمُ بِإِيمَانِهِنَّ ۖ فَإِنْ عَلِمْتُمُوهُنَّ مُؤْمِنَاتٍ فَلَا تَرْجِعُوهُنَّ إِلَى الْكُفَّارِ ۖ لَا هُنَّ حِلٌّ لَّهُمْ وَلَا هُمْ يَحِلُّونَ لَهُنَّ ۖ وَآتُوهُم مَّا أَنفَقُوا ۚ وَلَا جُنَاحَ عَلَيْكُمْ أَن تَنكِحُوهُنَّ إِذَا آتَيْتُمُوهُنَّ أُجُورَهُنَّ ۚ وَلَا تُمْسِكُوا بِعِصَمِ الْكَوَافِرِ وَاسْأَلُوا مَا أَنفَقْتُمْ وَلْيَسْأَلُوا مَا أَنفَقُوا ۚ ذَٰلِكُمْ حُكْمُ اللَّهِ ۖ يَحْكُمُ بَيْنَكُمْ ۚ وَاللَّهُ عَلِيمٌ حَكِيمٌ",["O you who believe! when believing women come to you flying, then examine them; Allah knows best their faith; then if you find them to be believing women, do not send them back to the unbelievers, neither are these (women) lawful for them, nor are those (men) lawful for them, and give them what they have spent; and no blame attaches to you in marrying them when you give them their dowries; and hold not to the ties of marriage of unbelieving women, and ask for what you have spent, and let them ask for what they have spent. That is Allah's judgment; He judges between you, and Allah is Knowing, Wise.","Wahai orang-orang yang beriman! Apabila perempuan-perempuan mukmin datang berhijrah kepadamu, maka hendaklah kamu uji (keimanan) mereka. Allah lebih mengetahui tentang keimanan mereka; jika kamu telah mengetahui bahwa mereka (benar-benar) beriman maka janganlah kamu kembalikan mereka kepada orang-orang kafir (suami-suami mereka). Mereka tidak halal bagi orang-orang kafir itu dan orang-orang kafir itu tidak halal bagi mereka. Dan berikanlah kepada (suami) mereka mahar yang telah mereka berikan. Dan tidak ada dosa bagimu menikahi mereka apabila kamu bayar kepada mereka maharnya. Dan janganlah kamu tetap berpegang pada tali (pernikahan) dengan perempuan-perempuan kafir; dan hendaklah kamu minta kembali mahar yang telah kamu berikan; dan (jika suaminya tetap kafir) biarkan mereka meminta kembali mahar yang telah mereka bayar (kepada mantan istrinya yang telah beriman). Demikianlah hukum Allah yang ditetapkan-Nya di antara kamu. Dan Allah Maha Mengetahui, Mahabijaksana."],550,28,55,220,null,null],[11,5161,"60:11","وَإِن فَاتَكُمْ شَيْءٌ مِّنْ أَزْوَاجِكُمْ إِلَى الْكُفَّارِ فَعَاقَبْتُمْ فَآتُوا الَّذِينَ ذَهَبَتْ أَزْوَاجُهُم مِّثْلَ مَا أَنفَقُوا ۚ وَاتَّقُوا اللَّهَ الَّذِي أَنتُم بِهِ مُؤْمِنُونَ",["And if anything (out of the dowries) of your wives has passed away from you to the unbelievers, then your turn comes, give to those whose wives have gone away the like of what they have spent, and be careful of (your duty to) Allah in Whom you believe.","Dan jika ada sesuatu (pengembalian mahar) yang belum kamu selesaikan dari istri-istrimu yang lari kepada orang-orang kafir, lalu kamu dapat mengalahkan mereka maka berikanlah (dari harta rampasan) kepada orang-orang yang istrinya lari itu sebanyak mahar yang telah mereka berikan. Dan bertakwalah kamu kepada Allah yang kepada-Nya kamu beriman."],550,28,55,220,null,null],[12,5162,"60:12","يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ عَلَىٰ أَن لَّا يُشْرِكْنَ بِاللَّهِ شَيْئًا وَلَا يَسْرِقْنَ وَلَا يَزْنِينَ وَلَا يَقْتُلْنَ أَوْلَادَهُنَّ وَلَا يَأْتِينَ بِبُهْتَانٍ يَفْتَرِينَهُ بَيْنَ أَيْدِيهِنَّ وَأَرْجُلِهِنَّ وَلَا يَعْصِينَكَ فِي مَعْرُوفٍ ۙ فَبَايِعْهُنَّ وَاسْتَغْفِرْ لَهُنَّ اللَّهَ ۖ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ",["O Prophet! when believing women come to you giving you a pledge that they will not associate aught with Allah, and will not steal, and will not commit fornication, and will not kill their children, and will not bring a calumny which they have forged of themselves, and will not disobey you in what is good, accept their pledge, and ask forgiveness for them from Allah; surely Allah is Forgiving, Merciful.","Wahai Nabi! Apabila perempuan-perempuan yang mukmin datang kepadamu untuk mengadakan bai‘at (janji setia), bahwa mereka tidak akan mempersekutukan sesuatu apa pun dengan Allah; tidak akan mencuri, tidak akan berzina, tidak akan membunuh anak-anaknya, tidak akan berbuat dusta yang mereka ada-adakan antara tangan dan kaki mereka dan tidak akan mendurhakaimu dalam urusan yang baik, maka terimalah janji setia mereka dan mohonkanlah ampunan untuk mereka kepada Allah. Sungguh, Allah Maha Pengampun, Maha Penyayang."],551,28,55,220,null,null],[13,5163,"60:13","يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِمْ قَدْ يَئِسُوا مِنَ الْآخِرَةِ كَمَا يَئِسَ الْكُفَّارُ مِنْ أَصْحَابِ الْقُبُورِ",["O you who believe! do not make friends with a people with whom Allah is wroth; indeed they despair of the hereafter as the unbelievers despair of those in tombs.","Wahai orang-orang yang beriman! Janganlah kamu jadikan orang-orang yang dimurkai Allah sebagai penolongmu, sungguh, mereka telah putus asa terhadap akhirat sebagaimana orang-orang kafir yang telah berada dalam kubur juga berputus asa."],551,28,55,220,null,null]],[[[1,2,549,"&#xfb51;","word","يَا أَيُّهَا",["O you","kamu mengambil/menjadikan"]],[2,2,549,"&#xfb52;","word","الَّذِينَ",["who","musuh-Ku"]],[3,2,549,"&#xfb53;","word","آمَنُوا",["believe","dan musuhmu"]],[4,2,549,"&#xfb54;","word","لَا",["(Do) not","penolong/sahabat"]],[5,2,549,"&#xfb55;","word","تَتَّخِذُوا",["take","kamu menemui/menyampaikan"]],[6,2,549,"&#xfb56;","word","عَدُوِّي",["My enemies","kepada mereka"]],[7,2,549,"&#xfb57;","word","وَعَدُوَّكُمْ",["and your enemies","dengan kasih sayang"]],[8,2,549,"&#xfb58;","word","أَوْلِيَاءَ",["(as) allies","dan sesungguhnya"]],[9,2,549,"&#xfb59;","word","تُلْقُونَ",["offering","orang kafir"]],[10,3,549,"&#xfb5a;","word","إِلَيْهِمْ",["them","terhadap apa"]],[11,3,549,"&#xfb5b;","word","بِالْمَوَدَّةِ",["love","datang kepadamu"]],[12,3,549,"&#xfb5c;","word","وَقَدْ",["while","dari"]],[13,3,549,"&#xfb5d;","word","كَفَرُوا",["they have disbelieved","kebenaran"]],[14,3,549,"&#xfb5e;","word","بِمَا",["in what","mereka mengusir"]],[15,3,549,"&#xfb5f;","word","جَاءَكُمْ",["came to you","rasul"]],[16,3,549,"&#xfb60;","word","مِنَ",["of","dan kamu"]],[17,3,549,"&#xfb61;","word","الْحَقِّ",["the truth","bahwa"]],[18,3,549,"&#xfb62;","word","يُخْرِجُونَ",["driving out","kamu beriman"]],[19,3,549,"&#xfb63;","word","الرَّسُولَ",["the Messenger","kepada Allah"]],[20,4,549,"&#xfb64;","word","وَإِيَّاكُمْ",["and yourselves","Tuhanmu"]],[21,4,549,"&#xfb65;","pause","ۙ",[null,null]],[22,4,549,"&#xfb66;","word","أَنْ",["because","jika"]],[23,4,549,"&#xfb67;","word","تُؤْمِنُوا",["you believe","kamu adalah"]],[24,4,549,"&#xfb68;","word","بِاللَّهِ",["in Allah","kamu keluar"]],[25,4,549,"&#xfb69;","word","رَبِّكُمْ",["your Lord","berjihad/berjuang/bekerja keras"]],[26,4,549,"&#xfb6a;","word","إِنْ",["If","pada"]],[27,4,549,"&#xfb6b;","word","كُنْتُمْ",["you","jalan-Ku"]],[28,4,549,"&#xfb6c;","word","خَرَجْتُمْ",["come forth","dan mencari"]],[29,4,549,"&#xfb6d;","word","جِهَادًا",["(to) strive","keridaan-Ku"]],[30,4,549,"&#xfb6e;","word","فِي",["in","kamu merahasiakan"]],[31,4,549,"&#xfb6f;","word","سَبِيلِي",["My way","kepada mereka"]],[32,5,549,"&#xfb70;","word","وَابْتِغَاءَ",["and (to) seek","dengan kasih sayang"]],[33,5,549,"&#xfb71;","word","مَرْضَاتِي",["My Pleasure","dan Aku"]],[34,5,549,"&#xfb72;","pause","ۚ",[null,null]],[35,5,549,"&#xfb73;","word","تُسِرُّونَ",["You confide","lebih mengetahui"]],[36,5,549,"&#xfb74;","word","إِلَيْهِمْ",["to them","terhadap apa"]],[37,5,549,"&#xfb75;","word","بِالْمَوَدَّةِ",["love","kamu sembunyikan"]],[38,5,549,"&#xfb76;","word","وَأَنَا",["but I Am","dan apa"]],[39,5,549,"&#xfb77;","word","أَعْلَمُ",["most knowing","kamu nyatakan"]],[40,5,549,"&#xfb78;","word","بِمَا",["of what","dan barang siapa"]],[41,5,549,"&#xfb79;","word","أَخْفَيْتُمْ",["you conceal","melakukannya"]],[42,6,549,"&#xfb7a;","word","وَمَا",["and what","diantara kamu"]],[43,6,549,"&#xfb7b;","word","أَعْلَنْتُمْ",["you declare","maka sesungguhnya"]],[44,6,549,"&#xfb7c;","pause","ۚ",[null,null]],[45,6,549,"&#xfb7d;","word","وَمَنْ",["And whoever","sesat"]],[46,6,549,"&#xfb7e;","word","يَفْعَلْهُ",["does it","sama/lurus"]],[47,6,549,"&#xfb7f;","word","مِنْكُمْ",["among you","jalan"]],[48,6,549,"&#xfb80;","word","فَقَدْ",["then certainly",""]],[49,6,549,"&#xfb81;","word","ضَلَّ",["he has strayed",""]],[50,6,549,"&#xfb82;","word","سَوَاءَ",["(from the) straight",""]],[51,6,549,"&#xfb83;","word","السَّبِيلِ",["path",""]],[52,6,549,"&#xfb84;","end","ﮄ",[null,null]]],[[1,6,549,"&#xfb85;","word","إِنْ",["If","jika"]],[2,7,549,"&#xfb86;","word","يَثْقَفُوكُمْ",["they gain dominance over you","mereka menangkap kamu"]],[3,7,549,"&#xfb87;","word","يَكُونُوا",["they would be","mereka adalah"]],[4,7,549,"&#xfb88;","word","لَكُمْ",["to you","bagimu"]],[5,7,549,"&#xfb89;","word","أَعْدَاءً",["enemies","musuh"]],[6,7,549,"&#xfb8a;","word","وَيَبْسُطُوا",["and extend","dan mereka melepaskan"]],[7,7,549,"&#xfb8b;","word","إِلَيْكُمْ",["against you","kepadamu"]],[8,7,549,"&#xfb8c;","word","أَيْدِيَهُمْ",["their hands","tangan-tangan mereka"]],[9,7,549,"&#xfb8d;","word","وَأَلْسِنَتَهُمْ",["and their tongues","dan lidah mereka"]],[10,8,549,"&#xfb8e;","word","بِالسُّوءِ",["with evil","dengan kejahatan (menyakiti)"]],[11,8,549,"&#xfb8f;","word","وَوَدُّوا",["and they desire","dan mereka menginginkan"]],[12,8,549,"&#xfb90;","word","لَوْ",["that","sekiranya/supaya"]],[13,8,549,"&#xfb91;","word","تَكْفُرُونَ",["you would disbelieve","kamu kafir/ingkar"]],[14,8,549,"&#xfb92;","end","ﮒ",[null,null]]],[[1,8,549,"&#xfb93;","word","لَنْ",["Never","tidak"]],[2,8,549,"&#xfb94;","word","تَنْفَعَكُمْ",["will benefit you","memberi manfaat kepadamu"]],[3,8,549,"&#xfb95;","word","أَرْحَامُكُمْ",["your relatives","kerabat-kerabat kamu"]],[4,8,549,"&#xfb96;","word","وَلَا",["and not","dan tidak"]],[5,8,549,"&#xfb97;","word","أَوْلَادُكُمْ",["your children","anak-anak kamu"]],[6,8,549,"&#xfb98;","pause","ۚ",[null,null]],[7,9,549,"&#xfb99;","word","يَوْمَ",["(on the) Day","hari"]],[8,9,549,"&#xfb9a;","word","الْقِيَامَةِ",["(of) the Resurrection","kiamat"]],[9,9,549,"&#xfb9b;","word","يَفْصِلُ",["He will judge","Dia memisahkan"]],[10,9,549,"&#xfb9c;","word","بَيْنَكُمْ",["between you","antara kamu"]],[11,9,549,"&#xfb9d;","pause","ۚ",[null,null]],[12,9,549,"&#xfb9e;","word","وَاللَّهُ",["And Allah","dan Allah"]],[13,9,549,"&#xfb9f;","word","بِمَا",["of what","terhadap apa"]],[14,9,549,"&#xfba0;","word","تَعْمَلُونَ",["you do","kamu kerjakan"]],[15,9,549,"&#xfba1;","word","بَصِيرٌ",["(is) All-Seer","Maha Melihat"]],[16,9,549,"&#xfba2;","end","ﮢ",[null,null]]],[[1,9,549,"&#xfba3;","word","قَدْ",["Indeed","sesungguhnya"]],[2,10,549,"&#xfba4;","word","كَانَتْ",["(there) is","telah ada"]],[3,10,549,"&#xfba5;","word","لَكُمْ",["for you","bagimu"]],[4,10,549,"&#xfba6;","word","أُسْوَةٌ",["an example","suri tauladan"]],[5,10,549,"&#xfba7;","word","حَسَنَةٌ",["good","yang baik"]],[6,10,549,"&#xfba8;","word","فِي",["in","pada"]],[7,10,549,"&#xfba9;","word","إِبْرَاهِيمَ",["Ibrahim","Ibrahim"]],[8,10,549,"&#xfbaa;","word","وَالَّذِينَ",["and those","dan orang-orang yang"]],[9,10,549,"&#xfbab;","word","مَعَهُ",["with him","bersamanya"]],[10,10,549,"&#xfbac;","word","إِذْ",["when","apabila"]],[11,10,549,"&#xfbad;","word","قَالُوا",["they said","mereka mengatakan"]],[12,10,549,"&#xfbae;","word","لِقَوْمِهِمْ",["to their people","kepada kaumnya"]],[13,11,549,"&#xfbaf;","word","إِنَّا",["Indeed, we","sesungguhnya"]],[14,11,549,"&#xfbb0;","word","بُرَآءُ",["(are) disassociated","berlepas diri"]],[15,11,549,"&#xfbb1;","word","مِنْكُمْ",["from you","dari kamu"]],[16,11,549,"&#xfbd3;","word","وَمِمَّا",["and from what","dan dari apa"]],[17,11,549,"&#xfbd4;","word","تَعْبُدُونَ",["you worship","kamu sembah"]],[18,11,549,"&#xfbd5;","word","مِنْ",["from","dari"]],[19,11,549,"&#xfbd6;","word","دُونِ",["besides","selain"]],[20,11,549,"&#xfbd7;","word","اللَّهِ",["Allah","Allah"]],[21,11,549,"&#xfbd8;","word","كَفَرْنَا",["We have denied","kami kafir/ingkar"]],[22,11,549,"&#xfbd9;","word","بِكُمْ",["you","denganmu"]],[23,11,549,"&#xfbda;","word","وَبَدَا",["and has appeared","dan nyata"]],[24,11,549,"&#xfbdb;","word","بَيْنَنَا",["between us","antara kami"]],[25,12,549,"&#xfbdc;","word","وَبَيْنَكُمُ",["and between you","dan antara kamu"]],[26,12,549,"&#xfbdd;","word","الْعَدَاوَةُ",["enmity","permungsuhan"]],[27,12,549,"&#xfbde;","word","وَالْبَغْضَاءُ",["and hatred","dan kebencian"]],[28,12,549,"&#xfbdf;","word","أَبَدًا",["forever","selama-lamanya"]],[29,12,549,"&#xfbe0;","word","حَتَّىٰ",["until","hingga"]],[30,12,549,"&#xfbe1;","word","تُؤْمِنُوا",["you believe","kamu beriman"]],[31,12,549,"&#xfbe2;","word","بِاللَّهِ",["in Allah","kepada Allah"]],[32,12,549,"&#xfbe3;","word","وَحْدَهُ",["Alone","sendiri-Nya"]],[33,12,549,"&#xfbe4;","word","إِلَّا",["Except","kecuali"]],[34,13,549,"&#xfbe5;","word","قَوْلَ",["(the) saying","perkataan"]],[35,13,549,"&#xfbe6;","word","إِبْرَاهِيمَ",["(of) Ibrahim","Ibrahim"]],[36,13,549,"&#xfbe7;","word","لِأَبِيهِ",["to his father","kepada bapaknya"]],[37,13,549,"&#xfbe8;","word","لَأَسْتَغْفِرَنَّ",["Surely I ask forgiveness","sungguh aku memohonkan ampun"]],[38,13,549,"&#xfbe9;","word","لَكَ",["for you","bagimu"]],[39,13,549,"&#xfbea;","word","وَمَا",["but not","dan tidak"]],[40,13,549,"&#xfbeb;","word","أَمْلِكُ",["I have power","aku memiliki/kuasa"]],[41,13,549,"&#xfbec;","word","لَكَ",["for you","bagimu"]],[42,13,549,"&#xfbed;","word","مِنَ",["from","dari"]],[43,13,549,"&#xfbee;","word","اللَّهِ",["Allah","Allah"]],[44,13,549,"&#xfbef;","word","مِنْ",["of","dari"]],[45,13,549,"&#xfbf0;","word","شَيْءٍ",["anything","sesuatu/sedikitpun"]],[46,13,549,"&#xfbf1;","pause","ۖ",[null,null]],[47,14,549,"&#xfbf2;","word","رَبَّنَا",["Our Lord","ya Tuhan kami"]],[48,14,549,"&#xfbf3;","word","عَلَيْكَ",["upon You","atas Engkau"]],[49,14,549,"&#xfbf4;","word","تَوَكَّلْنَا",["we put our trust","kami bertawakal"]],[50,14,549,"&#xfbf5;","word","وَإِلَيْكَ",["and to You","dan kepada Engkau"]],[51,14,549,"&#xfbf6;","word","أَنَبْنَا",["we turn","kami bertaubat"]],[52,14,549,"&#xfbf7;","word","وَإِلَيْكَ",["and to You","dan kepada Engkau"]],[53,14,549,"&#xfbf8;","word","الْمَصِيرُ",["(is) the final return","kami kembali"]],[54,14,549,"&#xfbf9;","end","ﯹ",[null,null]]],[[1,14,549,"&#xfbfa;","word","رَبَّنَا",["Our Lord","ya Tuhan kami"]],[2,14,549,"&#xfbfb;","word","لَا",["(do) not","janganlah"]],[3,14,549,"&#xfbfc;","word","تَجْعَلْنَا",["make us","kami Engkau jadikan kami"]],[4,15,549,"&#xfbfd;","word","فِتْنَةً",["a trial","percobaan"]],[5,15,549,"&#xfbfe;","word","لِلَّذِينَ",["for those who","bagi orang-orang"]],[6,15,549,"&#xfbff;","word","كَفَرُوا",["disbelieve","pembangkang/kafir"]],[7,15,549,"&#xfc00;","word","وَاغْفِرْ",["and forgive","dan ampunilah"]],[8,15,549,"&#xfc01;","word","لَنَا",["us","bagi kami"]],[9,15,549,"&#xfc02;","word","رَبَّنَا",["our Lord","ya Tuhan kami"]],[10,15,549,"&#xfc03;","pause","ۖ",[null,null]],[11,15,549,"&#xfc04;","word","إِنَّكَ",["Indeed You","sesungguhnya Engkau"]],[12,15,549,"&#xfc05;","word","أَنْتَ",["[You]","Engkau"]],[13,15,549,"&#xfc06;","word","الْعَزِيزُ",["(are) the All-Mighty","Maha Perkasa"]],[14,15,549,"&#xfc07;","word","الْحَكِيمُ",["the All-Wise","Maha Bijaksana"]],[15,15,549,"&#xfc08;","end","ﰈ",[null,null]]],[[1,1,550,"&#xfb51;","word","لَقَدْ",["Certainly","sesungguhnya"]],[2,1,550,"&#xfb52;","word","كَانَ",["(there) is","adalah"]],[3,1,550,"&#xfb53;","word","لَكُمْ",["for you","bagimu"]],[4,1,550,"&#xfb54;","word","فِيهِمْ",["in them","didalamnya"]],[5,1,550,"&#xfb55;","word","أُسْوَةٌ",["an example","suri teladan"]],[6,1,550,"&#xfb56;","word","حَسَنَةٌ",["good","yang baik"]],[7,1,550,"&#xfb57;","word","لِمَنْ",["for (he) who","bagi siapa"]],[8,1,550,"&#xfb58;","word","كَانَ",["is","adalah"]],[9,1,550,"&#xfb59;","word","يَرْجُو",["hopeful","mereka mengharap"]],[10,1,550,"&#xfb5a;","word","اللَّهَ",["(in) Allah","Allah"]],[11,1,550,"&#xfb5b;","word","وَالْيَوْمَ",["and the Day","dan hari"]],[12,1,550,"&#xfb5c;","word","الْآخِرَ",["the Last","akhir"]],[13,1,550,"&#xfb5d;","pause","ۚ",[null,null]],[14,2,550,"&#xfb5e;","word","وَمَنْ",["And whoever","dan barang siapa"]],[15,2,550,"&#xfb5f;","word","يَتَوَلَّ",["turns away","berpaling"]],[16,2,550,"&#xfb60;","word","فَإِنَّ",["then indeed","maka sesungguhnya"]],[17,2,550,"&#xfb61;","word","اللَّهَ",["Allah","Allah"]],[18,2,550,"&#xfb62;","word","هُوَ",["He","Dia"]],[19,2,550,"&#xfb63;","word","الْغَنِيُّ",["(is) Free of need","Maha Kaya"]],[20,2,550,"&#xfb64;","word","الْحَمِيدُ",["the Praiseworthy","Maha Terpuji"]],[21,2,550,"&#xfb65;","end","ﭥ",[null,null]]],[[1,2,550,"&#xfb66;","rub-el-hizb","۞",[null,null]],[2,2,550,"&#xfb67;","word","عَسَى",["Perhaps","mudah-mudahan"]],[3,2,550,"&#xfb68;","word","اللَّهُ",["Allah","Allah"]],[4,2,550,"&#xfb69;","word","أَنْ",["[that]","bahwa"]],[5,2,550,"&#xfb6a;","word","يَجْعَلَ",["will put","menjadikan"]],[6,3,550,"&#xfb6b;","word","بَيْنَكُمْ",["between you","diantara kamu"]],[7,3,550,"&#xfb6c;","word","وَبَيْنَ",["and between","dan antara"]],[8,3,550,"&#xfb6d;","word","الَّذِينَ",["those (to) whom","orang-orang yang"]],[9,3,550,"&#xfb6e;","word","عَادَيْتُمْ",["you have been enemies","kamu musuhi"]],[10,3,550,"&#xfb6f;","word","مِنْهُمْ",["among them","diantara mereka"]],[11,3,550,"&#xfb70;","word","مَوَدَّةً",["love","kasih sayang"]],[12,3,550,"&#xfb71;","pause","ۚ",[null,null]],[13,3,550,"&#xfb72;","word","وَاللَّهُ",["And Allah","dan Allah"]],[14,3,550,"&#xfb73;","word","قَدِيرٌ",["(is) All-Powerful","Maha Kuasa"]],[15,3,550,"&#xfb74;","pause","ۚ",[null,null]],[16,3,550,"&#xfb75;","word","وَاللَّهُ",["And Allah","dan Allah"]],[17,3,550,"&#xfb76;","word","غَفُورٌ",["(is) Oft-Forgiving","Maha Pengampun"]],[18,3,550,"&#xfb77;","word","رَحِيمٌ",["Most Merciful","Maha Penyayang"]],[19,4,550,"&#xfb78;","end","ﭸ",[null,null]]],[[1,4,550,"&#xfb79;","word","لَا",["Not","tidak"]],[2,4,550,"&#xfb7a;","word","يَنْهَاكُمُ",["(does) forbid you","melarang kamu"]],[3,4,550,"&#xfb7b;","word","اللَّهُ",["Allah","Allah"]],[4,4,550,"&#xfb7c;","word","عَنِ",["from","dari/terhadap"]],[5,4,550,"&#xfb7d;","word","الَّذِينَ",["those who","orang-orang yang"]],[6,4,550,"&#xfb7e;","word","لَمْ",["(do) not","tidak"]],[7,4,550,"&#xfb7f;","word","يُقَاتِلُوكُمْ",["fight you","memerangi kamu"]],[8,4,550,"&#xfb80;","word","فِي",["in","dalam"]],[9,4,550,"&#xfb81;","word","الدِّينِ",["the religion","agama"]],[10,4,550,"&#xfb82;","word","وَلَمْ",["and (do) not","dan tidak"]],[11,4,550,"&#xfb83;","word","يُخْرِجُوكُمْ",["drive you out","mengusir/mengeluarkan kamu"]],[12,5,550,"&#xfb84;","word","مِنْ",["of","dari"]],[13,5,550,"&#xfb85;","word","دِيَارِكُمْ",["your homes","rumah/kampung halaman"]],[14,5,550,"&#xfb86;","word","أَنْ",["that","bahwa"]],[15,5,550,"&#xfb87;","word","تَبَرُّوهُمْ",["you deal kindly","kamu berbuat baik kepada mereka"]],[16,5,550,"&#xfb88;","word","وَتُقْسِطُوا",["and deal justly","dan kamu berlaku adil"]],[17,5,550,"&#xfb89;","word","إِلَيْهِمْ",["with them","kepada mereka"]],[18,5,550,"&#xfb8a;","pause","ۚ",[null,null]],[19,5,550,"&#xfb8b;","word","إِنَّ",["Indeed","sesungguhnya"]],[20,5,550,"&#xfb8c;","word","اللَّهَ",["Allah","Allah"]],[21,5,550,"&#xfb8d;","word","يُحِبُّ",["loves","menyukai"]],[22,5,550,"&#xfb8e;","word","الْمُقْسِطِينَ",["those who act justly","orang-orang yang berlaku adil"]],[23,6,550,"&#xfb8f;","end","ﮏ",[null,null]]],[[1,6,550,"&#xfb90;","word","إِنَّمَا",["Only","sesungguhnya hanyalah"]],[2,6,550,"&#xfb91;","word","يَنْهَاكُمُ",["forbids you","melarang kamu"]],[3,6,550,"&#xfb92;","word","اللَّهُ",["Allah","Allah"]],[4,6,550,"&#xfb93;","word","عَنِ",["from","dari"]],[5,6,550,"&#xfb94;","word","الَّذِينَ",["those who","orang-orang yang"]],[6,6,550,"&#xfb95;","word","قَاتَلُوكُمْ",["fight you","(mereka) memerangi kamu"]],[7,6,550,"&#xfb96;","word","فِي",["in","dalam"]],[8,6,550,"&#xfb97;","word","الدِّينِ",["the religion","agama"]],[9,6,550,"&#xfb98;","word","وَأَخْرَجُوكُمْ",["and drive you out","dan mengusir/mengeluarkan kamu"]],[10,7,550,"&#xfb99;","word","مِنْ",["of","dari"]],[11,7,550,"&#xfb9a;","word","دِيَارِكُمْ",["your homes","kampung halamanmu"]],[12,7,550,"&#xfb9b;","word","وَظَاهَرُوا",["and support","dan mereka membantu"]],[13,7,550,"&#xfb9c;","word","عَلَىٰ",["in","atas/untuk"]],[14,7,550,"&#xfb9d;","word","إِخْرَاجِكُمْ",["your expulsion","mengusir kamu"]],[15,7,550,"&#xfb9e;","word","أَنْ",["that","bahwa"]],[16,7,550,"&#xfb9f;","word","تَوَلَّوْهُمْ",["you make them allies","kamu menjadikan mereka sebagai kawan"]],[17,7,550,"&#xfba0;","pause","ۚ",[null,null]],[18,7,550,"&#xfba1;","word","وَمَنْ",["And whoever","dan barang siapa"]],[19,7,550,"&#xfba2;","word","يَتَوَلَّهُمْ",["makes them allies","menjadikan mereka sebagai kawan"]],[20,7,550,"&#xfba3;","word","فَأُولَٰئِكَ",["then those","maka mereka itu"]],[21,8,550,"&#xfba4;","word","هُمُ",["[they]","mereka"]],[22,8,550,"&#xfba5;","word","الظَّالِمُونَ",["(are) the wrongdoers","orang-orang yang zalim"]],[23,8,550,"&#xfba6;","end","ﮦ",[null,null]]],[[1,8,550,"&#xfba7;","word","يَا أَيُّهَا",["O you","wahai"]],[2,8,550,"&#xfba8;","word","الَّذِينَ",["who","orang-orang yang"]],[3,8,550,"&#xfba9;","word","آمَنُوا",["believe","beriman"]],[4,8,550,"&#xfbaa;","word","إِذَا",["When","apabila"]],[5,8,550,"&#xfbab;","word","جَاءَكُمُ",["come to you","datang kepadamu"]],[6,8,550,"&#xfbac;","word","الْمُؤْمِنَاتُ",["the believing women","orang perempuan beriman"]],[7,9,550,"&#xfbad;","word","مُهَاجِرَاتٍ",["(as) emigrants","berhijrah"]],[8,9,550,"&#xfbae;","word","فَامْتَحِنُوهُنَّ",["then examine them","maka ujilah mereka"]],[9,9,550,"&#xfbaf;","pause","ۖ",[null,null]],[10,9,550,"&#xfbb0;","word","اللَّهُ",["Allah","Allah"]],[11,9,550,"&#xfbb1;","word","أَعْلَمُ",["(is) most knowing","mengetahui"]],[12,9,550,"&#xfbd3;","word","بِإِيمَانِهِنَّ",["of their faith","tentang keimanan mereka"]],[13,9,550,"&#xfbd4;","pause","ۖ",[null,null]],[14,9,550,"&#xfbd5;","word","فَإِنْ",["And if","maka jika"]],[15,9,550,"&#xfbd6;","word","عَلِمْتُمُوهُنَّ",["you know them","mengetahui mereka"]],[16,9,550,"&#xfbd7;","word","مُؤْمِنَاتٍ",["(to be) believers","wanita-wanita beriman"]],[17,10,550,"&#xfbd8;","word","فَلَا",["then (do) not","maka janganlah"]],[18,10,550,"&#xfbd9;","word","تَرْجِعُوهُنَّ",["return them","kamu kembalikan mereka"]],[19,10,550,"&#xfbda;","word","إِلَى",["to","kepada"]],[20,10,550,"&#xfbdb;","word","الْكُفَّارِ",["the disbelievers","orang-orang kafir"]],[21,10,550,"&#xfbdc;","pause","ۖ",[null,null]],[22,10,550,"&#xfbdd;","word","لَا",["Not","tidak"]],[23,10,550,"&#xfbde;","word","هُنَّ",["they","mereka (wanita beriman)"]],[24,10,550,"&#xfbdf;","word","حِلٌّ",["(are) lawful","halal"]],[25,10,550,"&#xfbe0;","word","لَهُمْ",["for them","bagi mereka"]],[26,10,550,"&#xfbe1;","word","وَلَا",["and not","dan tidak"]],[27,10,550,"&#xfbe2;","word","هُمْ",["they","mereka"]],[28,10,550,"&#xfbe3;","word","يَحِلُّونَ",["are lawful","halal"]],[29,10,550,"&#xfbe4;","word","لَهُنَّ",["for them","bagi mereka"]],[30,10,550,"&#xfbe5;","pause","ۖ",[null,null]],[31,10,550,"&#xfbe6;","word","وَآتُوهُمْ",["But give them","dan berikan kepada mereka"]],[32,11,550,"&#xfbe7;","word","مَا",["what","apa-apa"]],[33,11,550,"&#xfbe8;","word","أَنْفَقُوا",["they have spent","mereka belanjakan"]],[34,11,550,"&#xfbe9;","pause","ۚ",[null,null]],[35,11,550,"&#xfbea;","word","وَلَا",["And not","dan tidak"]],[36,11,550,"&#xfbeb;","word","جُنَاحَ",["any blame","berdosa"]],[37,11,550,"&#xfbec;","word","عَلَيْكُمْ",["upon you","atas kamu"]],[38,11,550,"&#xfbed;","word","أَنْ",["if","bahwa"]],[39,11,550,"&#xfbee;","word","تَنْكِحُوهُنَّ",["you marry them","kamu nikah dengan mereka"]],[40,11,550,"&#xfbef;","word","إِذَا",["when","apabila"]],[41,11,550,"&#xfbf0;","word","آتَيْتُمُوهُنَّ",["you have given them","kamu berikan kepada mereka"]],[42,11,550,"&#xfbf1;","word","أُجُورَهُنَّ",["their (bridal) dues","maskawin mereka"]],[43,11,550,"&#xfbf2;","pause","ۚ",[null,null]],[44,12,550,"&#xfbf3;","word","وَلَا",["And (do) not","dan jangan"]],[45,12,550,"&#xfbf4;","word","تُمْسِكُوا",["hold","kamu tahan/pegang"]],[46,12,550,"&#xfbf5;","word","بِعِصَمِ",["to marriage bonds","dengan tali/ikatan"]],[47,12,550,"&#xfbf6;","word","الْكَوَافِرِ",["(with) disbelieving women","wanita-wanita kafir"]],[48,12,550,"&#xfbf7;","word","وَاسْأَلُوا",["but ask (for)","dan mintalah"]],[49,12,550,"&#xfbf8;","word","مَا",["what","apa"]],[50,12,550,"&#xfbf9;","word","أَنْفَقْتُمْ",["you have spent","kamu belanjakan"]],[51,12,550,"&#xfbfa;","word","وَلْيَسْأَلُوا",["and let them ask","dan agar mereka meminta"]],[52,12,550,"&#xfbfb;","word","مَا",["what","apa"]],[53,12,550,"&#xfbfc;","word","أَنْفَقُوا",["they have spent","yang mereka belanjakan"]],[54,12,550,"&#xfbfd;","pause","ۚ",[null,null]],[55,13,550,"&#xfbfe;","word","ذَٰلِكُمْ",["That","demikian itu"]],[56,13,550,"&#xfbff;","word","حُكْمُ",["(is the) Judgment","ketetapan/hukum"]],[57,13,550,"&#xfc00;","word","اللَّهِ",["(of) Allah","Allah"]],[58,13,550,"&#xfc01;","pause","ۖ",[null,null]],[59,13,550,"&#xfc02;","word","يَحْكُمُ",["He judges","menetapkan/memberi hukum"]],[60,13,550,"&#xfc03;","word","بَيْنَكُمْ",["between you","diantara kamu"]],[61,13,550,"&#xfc04;","pause","ۚ",[null,null]],[62,13,550,"&#xfc05;","word","وَاللَّهُ",["And Allah","dan Allah"]],[63,13,550,"&#xfc06;","word","عَلِيمٌ",["(is) All-Knowing","Maha Mengetahui"]],[64,13,550,"&#xfc07;","word","حَكِيمٌ",["All-Wise","Maha Bijaksana"]],[65,13,550,"&#xfc08;","end","ﰈ",[null,null]]],[[1,13,550,"&#xfc09;","word","وَإِنْ",["And if","dan jika"]],[2,13,550,"&#xfc0a;","word","فَاتَكُمْ",["have gone from you","berlalu/lari padamu"]],[3,14,550,"&#xfc0b;","word","شَيْءٌ",["any","sesuatu"]],[4,14,550,"&#xfc0c;","word","مِنْ",["of","dari"]],[5,14,550,"&#xfc0d;","word","أَزْوَاجِكُمْ",["your wives","isteri-isterimu"]],[6,14,550,"&#xfc0e;","word","إِلَى",["to","kepada"]],[7,14,550,"&#xfc0f;","word","الْكُفَّارِ",["the disbelievers","orang-orang kafir"]],[8,14,550,"&#xfc10;","word","فَعَاقَبْتُمْ",["then your turn comes","lalu kamu mengalahkan"]],[9,14,550,"&#xfc11;","word","فَآتُوا",["then give","maka berikanlah"]],[10,14,550,"&#xfc12;","word","الَّذِينَ",["(to) those who","orang-orang yang"]],[11,14,550,"&#xfc13;","word","ذَهَبَتْ",["have gone","pergi/lari"]],[12,15,550,"&#xfc14;","word","أَزْوَاجُهُمْ",["their wives","isteri-isteri mereka"]],[13,15,550,"&#xfc15;","word","مِثْلَ",["(the) like","seperti/sebesar"]],[14,15,550,"&#xfc16;","word","مَا",["(of) what","apa"]],[15,15,550,"&#xfc17;","word","أَنْفَقُوا",["they had spent","mereka belanjakan"]],[16,15,550,"&#xfc18;","pause","ۚ",[null,null]],[17,15,550,"&#xfc19;","word","وَاتَّقُوا",["And fear","dan bertakwalah"]],[18,15,550,"&#xfc1a;","word","اللَّهَ",["Allah","Allah"]],[19,15,550,"&#xfc1b;","word","الَّذِي",["(in) Whom","yang"]],[20,15,550,"&#xfc1c;","word","أَنْتُمْ",["you","kamu"]],[21,15,550,"&#xfc1d;","word","بِهِ",["[in Him]","kepada-Nya"]],[22,15,550,"&#xfc1e;","word","مُؤْمِنُونَ",["(are) believers","orang-orang yang beriman"]],[23,15,550,"&#xfc1f;","end","ﰟ",[null,null]]],[[1,1,551,"&#xfb51;","word","يَا أَيُّهَا",["O","wahai"]],[2,1,551,"&#xfb52;","word","النَّبِيُّ",["Prophet","nabi"]],[3,1,551,"&#xfb53;","word","إِذَا",["When","apabila"]],[4,1,551,"&#xfb54;","word","جَاءَكَ",["come to you","datang kepadamu"]],[5,1,551,"&#xfb55;","word","الْمُؤْمِنَاتُ",["the believing women","wanita-wanita beriman"]],[6,1,551,"&#xfb56;","word","يُبَايِعْنَكَ",["pledging to you","berjanji setia"]],[7,1,551,"&#xfb57;","word","عَلَىٰ",["[on]","atas"]],[8,1,551,"&#xfb58;","word","أَنْ",["that","bahwa"]],[9,1,551,"&#xfb59;","word","لَا",["not","tidak"]],[10,1,551,"&#xfb5a;","word","يُشْرِكْنَ",["they will associate","mempersekutukan"]],[11,2,551,"&#xfb5b;","word","بِاللَّهِ",["with Allah","dengan Allah"]],[12,2,551,"&#xfb5c;","word","شَيْئًا",["anything","sesuatu"]],[13,2,551,"&#xfb5d;","word","وَلَا",["and not","dan tidak"]],[14,2,551,"&#xfb5e;","word","يَسْرِقْنَ",["they will steal","mereka mencuri"]],[15,2,551,"&#xfb5f;","word","وَلَا",["and not","dan tidak"]],[16,2,551,"&#xfb60;","word","يَزْنِينَ",["they will commit adultery","berizina"]],[17,2,551,"&#xfb61;","word","وَلَا",["and not","dan tidak"]],[18,2,551,"&#xfb62;","word","يَقْتُلْنَ",["they will kill","membunuh"]],[19,2,551,"&#xfb63;","word","أَوْلَادَهُنَّ",["their children","anak-anak mereka"]],[20,2,551,"&#xfb64;","word","وَلَا",["and not","dan tidak"]],[21,2,551,"&#xfb65;","word","يَأْتِينَ",["they bring","datangkan/berbuat"]],[22,3,551,"&#xfb66;","word","بِبُهْتَانٍ",["slander","dengan dusta"]],[23,3,551,"&#xfb67;","word","يَفْتَرِينَهُ",["they invent it","mereka ada-adakannya"]],[24,3,551,"&#xfb68;","word","بَيْنَ",["between","antara"]],[25,3,551,"&#xfb69;","word","أَيْدِيهِنَّ",["their hands","tangan mereka"]],[26,3,551,"&#xfb6a;","word","وَأَرْجُلِهِنَّ",["and their feet","dan kaki-kaki mereka"]],[27,3,551,"&#xfb6b;","word","وَلَا",["and not","dan tidak"]],[28,3,551,"&#xfb6c;","word","يَعْصِينَكَ",["they will disobey you","mereka mendurhakaimu"]],[29,4,551,"&#xfb6d;","word","فِي",["in","dalam"]],[30,4,551,"&#xfb6e;","word","مَعْرُوفٍ",["(the) right","kebaikan"]],[31,4,551,"&#xfb6f;","pause","ۙ",[null,null]],[32,4,551,"&#xfb70;","word","فَبَايِعْهُنَّ",["then accept their pledge","maka terimalah janji setia mereka"]],[33,4,551,"&#xfb71;","word","وَاسْتَغْفِرْ",["and ask forgiveness","dan mohonkan ampun"]],[34,4,551,"&#xfb72;","word","لَهُنَّ",["for them","bagi/untuk mereka"]],[35,4,551,"&#xfb73;","word","اللَّهَ",["(from) Allah","Allah"]],[36,4,551,"&#xfb74;","pause","ۖ",[null,null]],[37,4,551,"&#xfb75;","word","إِنَّ",["Indeed","sesungguhnya"]],[38,4,551,"&#xfb76;","word","اللَّهَ",["Allah","Allah"]],[39,4,551,"&#xfb77;","word","غَفُورٌ",["(is) Oft-Forgiving","Maha Pengampun"]],[40,4,551,"&#xfb78;","word","رَحِيمٌ",["Most Merciful","Maha Penyayang"]],[41,5,551,"&#xfb79;","end","ﭹ",[null,null]]],[[1,5,551,"&#xfb7a;","word","يَا أَيُّهَا",["O you","wahai"]],[2,5,551,"&#xfb7b;","word","الَّذِينَ",["who","orang-orang yang"]],[3,5,551,"&#xfb7c;","word","آمَنُوا",["believe","(mereka) beriman"]],[4,5,551,"&#xfb7d;","word","لَا",["(Do) not","jangan"]],[5,5,551,"&#xfb7e;","word","تَتَوَلَّوْا",["make allies","jadikan sabahat/pemimpin"]],[6,5,551,"&#xfb7f;","word","قَوْمًا",["(of) a people","kaum"]],[7,5,551,"&#xfb80;","word","غَضِبَ",["(The) wrath","memurkai"]],[8,5,551,"&#xfb81;","word","اللَّهُ",["(of) Allah","Allah"]],[9,5,551,"&#xfb82;","word","عَلَيْهِمْ",["(is) upon them","atas mereka"]],[10,6,551,"&#xfb83;","word","قَدْ",["Indeed","sesungguhnya"]],[11,6,551,"&#xfb84;","word","يَئِسُوا",["they despair","mereka putus asa"]],[12,6,551,"&#xfb85;","word","مِنَ",["of","dari/terhadap"]],[13,6,551,"&#xfb86;","word","الْآخِرَةِ",["the Hereafter","akhitat"]],[14,6,551,"&#xfb87;","word","كَمَا",["as","sebagaimana"]],[15,6,551,"&#xfb88;","word","يَئِسَ",["despair","berputus asa"]],[16,6,551,"&#xfb89;","word","الْكُفَّارُ",["the disbelievers","orang-orang kafir"]],[17,6,551,"&#xfb8a;","word","مِنْ",["of","dari"]],[18,6,551,"&#xfb8b;","word","أَصْحَابِ",["(the) companions","penghuni"]],[19,6,551,"&#xfb8c;","word","الْقُبُورِ",["(of) the graves","kubur"]],[20,6,551,"&#xfb8d;","end","ﮍ",[null,null]]]]]}
