{"verses":[{"id":386,"verse_key":"3:93","text_uthmani_simple":"كل الطعام كان حلا لبنى اسرءيل الا ما حرم اسرءيل على نفسه من قبل ان تنزل التورىة قل فاتوا۟ بالتورىة فاتلوها ان كنتم صدقين"},{"id":387,"verse_key":"3:94","text_uthmani_simple":"فمن افترى على الله الكذب منۢ بعد ذلك فاو۟لئك هم الظلمون"},{"id":388,"verse_key":"3:95","text_uthmani_simple":"قل صدق الله فاتبعوا۟ ملة ابرهيم حنيفا وما كان من المشركين"},{"id":389,"verse_key":"3:96","text_uthmani_simple":"ان اول بيت وضع للناس للذى ببكة مباركا وهدى للعلمين"},{"id":390,"verse_key":"3:97","text_uthmani_simple":"فيه ءايتۢ بينت مقام ابرهيم ومن دخله كان ءامنا ولله على الناس حج البيت من استطاع اليه سبيلا ومن كفر فان الله غنى عن العلمين"},{"id":391,"verse_key":"3:98","text_uthmani_simple":"قل ياهل الكتب لم تكفرون بـايت الله والله شهيد على ما تعملون"},{"id":392,"verse_key":"3:99","text_uthmani_simple":"قل ياهل الكتب لم تصدون عن سبيل الله من ءامن تبغونها عوجا وانتم شهداء وما الله بغفل عما تعملون"},{"id":393,"verse_key":"3:100","text_uthmani_simple":"يايها الذين ءامنوا۟ ان تطيعوا۟ فريقا من الذين اوتوا۟ الكتب يردوكم بعد ايمنكم كفرين"},{"id":394,"verse_key":"3:101","text_uthmani_simple":"وكيف تكفرون وانتم تتلى عليكم ءايت الله وفيكم رسوله ومن يعتصم بالله فقد هدى الى صرط مستقيم"},{"id":395,"verse_key":"3:102","text_uthmani_simple":"يايها الذين ءامنوا۟ اتقوا۟ الله حق تقاته ولا تموتن الا وانتم مسلمون"},{"id":396,"verse_key":"3:103","text_uthmani_simple":"واعتصموا۟ بحبل الله جميعا ولا تفرقوا۟ واذكروا۟ نعمت الله عليكم اذ كنتم اعداء فالف بين قلوبكم فاصبحتم بنعمته اخونا وكنتم على شفا حفرة من النار فانقذكم منها كذلك يبين الله لكم ءايته لعلكم تهتدون"},{"id":397,"verse_key":"3:104","text_uthmani_simple":"ولتكن منكم امة يدعون الى الخير ويامرون بالمعروف وينهون عن المنكر واو۟لئك هم المفلحون"},{"id":398,"verse_key":"3:105","text_uthmani_simple":"ولا تكونوا۟ كالذين تفرقوا۟ واختلفوا۟ منۢ بعد ما جاءهم البينت واو۟لئك لهم عذاب عظيم"},{"id":399,"verse_key":"3:106","text_uthmani_simple":"يوم تبيض وجوه وتسود وجوه فاما الذين اسودت وجوههم اكفرتم بعد ايمنكم فذوقوا۟ العذاب بما كنتم تكفرون"},{"id":400,"verse_key":"3:107","text_uthmani_simple":"واما الذين ابيضت وجوههم ففى رحمة الله هم فيها خلدون"},{"id":401,"verse_key":"3:108","text_uthmani_simple":"تلك ءايت الله نتلوها عليك بالحق وما الله يريد ظلما للعلمين"},{"id":402,"verse_key":"3:109","text_uthmani_simple":"ولله ما فى السموت وما فى الارض والى الله ترجع الامور"},{"id":403,"verse_key":"3:110","text_uthmani_simple":"كنتم خير امة اخرجت للناس تامرون بالمعروف وتنهون عن المنكر وتؤمنون بالله ولو ءامن اهل الكتب لكان خيرا لهم منهم المؤمنون واكثرهم الفسقون"},{"id":404,"verse_key":"3:111","text_uthmani_simple":"لن يضروكم الا اذى وان يقتلوكم يولوكم الادبار ثم لا ينصرون"},{"id":405,"verse_key":"3:112","text_uthmani_simple":"ضربت عليهم الذلة اين ما ثقفوا۟ الا بحبل من الله وحبل من الناس وباءو بغضب من الله وضربت عليهم المسكنة ذلك بانهم كانوا۟ يكفرون بـايت الله ويقتلون الانۢبياء بغير حق ذلك بما عصوا۟ وكانوا۟ يعتدون"},{"id":406,"verse_key":"3:113","text_uthmani_simple":"ليسوا۟ سواء من اهل الكتب امة قائمة يتلون ءايت الله ءاناء اليل وهم يسجدون"},{"id":407,"verse_key":"3:114","text_uthmani_simple":"يؤمنون بالله واليوم الءاخر ويامرون بالمعروف وينهون عن المنكر ويسرعون فى الخيرت واو۟لئك من الصلحين"},{"id":408,"verse_key":"3:115","text_uthmani_simple":"وما يفعلوا۟ من خير فلن يكفروه والله عليمۢ بالمتقين"},{"id":409,"verse_key":"3:116","text_uthmani_simple":"ان الذين كفروا۟ لن تغنى عنهم امولهم ولا اولدهم من الله شيـا واو۟لئك اصحب النار هم فيها خلدون"},{"id":410,"verse_key":"3:117","text_uthmani_simple":"مثل ما ينفقون فى هذه الحيوة الدنيا كمثل ريح فيها صر اصابت حرث قوم ظلموا۟ انفسهم فاهلكته وما ظلمهم الله ولكن انفسهم يظلمون"},{"id":411,"verse_key":"3:118","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تتخذوا۟ بطانة من دونكم لا يالونكم خبالا ودوا۟ ما عنتم قد بدت البغضاء من افوههم وما تخفى صدورهم اكبر قد بينا لكم الءايت ان كنتم تعقلون"},{"id":412,"verse_key":"3:119","text_uthmani_simple":"هانتم او۟لاء تحبونهم ولا يحبونكم وتؤمنون بالكتب كله واذا لقوكم قالوا۟ ءامنا واذا خلوا۟ عضوا۟ عليكم الانامل من الغيظ قل موتوا۟ بغيظكم ان الله عليمۢ بذات الصدور"},{"id":413,"verse_key":"3:120","text_uthmani_simple":"ان تمسسكم حسنة تسؤهم وان تصبكم سيئة يفرحوا۟ بها وان تصبروا۟ وتتقوا۟ لا يضركم كيدهم شيـا ان الله بما يعملون محيط"},{"id":414,"verse_key":"3:121","text_uthmani_simple":"واذ غدوت من اهلك تبوئ المؤمنين مقعد للقتال والله سميع عليم"},{"id":415,"verse_key":"3:122","text_uthmani_simple":"اذ همت طائفتان منكم ان تفشلا والله وليهما وعلى الله فليتوكل المؤمنون"},{"id":416,"verse_key":"3:123","text_uthmani_simple":"ولقد نصركم الله ببدر وانتم اذلة فاتقوا۟ الله لعلكم تشكرون"},{"id":417,"verse_key":"3:124","text_uthmani_simple":"اذ تقول للمؤمنين الن يكفيكم ان يمدكم ربكم بثلثة ءالف من الملئكة منزلين"},{"id":418,"verse_key":"3:125","text_uthmani_simple":"بلى ان تصبروا۟ وتتقوا۟ وياتوكم من فورهم هذا يمددكم ربكم بخمسة ءالف من الملئكة مسومين"},{"id":419,"verse_key":"3:126","text_uthmani_simple":"وما جعله الله الا بشرى لكم ولتطمئن قلوبكم به وما النصر الا من عند الله العزيز الحكيم"},{"id":420,"verse_key":"3:127","text_uthmani_simple":"ليقطع طرفا من الذين كفروا۟ او يكبتهم فينقلبوا۟ خائبين"},{"id":421,"verse_key":"3:128","text_uthmani_simple":"ليس لك من الامر شىء او يتوب عليهم او يعذبهم فانهم ظلمون"},{"id":422,"verse_key":"3:129","text_uthmani_simple":"ولله ما فى السموت وما فى الارض يغفر لمن يشاء ويعذب من يشاء والله غفور رحيم"},{"id":423,"verse_key":"3:130","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تاكلوا۟ الربوا۟ اضعفا مضعفة واتقوا۟ الله لعلكم تفلحون"},{"id":424,"verse_key":"3:131","text_uthmani_simple":"واتقوا۟ النار التى اعدت للكفرين"},{"id":425,"verse_key":"3:132","text_uthmani_simple":"واطيعوا۟ الله والرسول لعلكم ترحمون"},{"id":426,"verse_key":"3:133","text_uthmani_simple":"وسارعوا۟ الى مغفرة من ربكم وجنة عرضها السموت والارض اعدت للمتقين"},{"id":427,"verse_key":"3:134","text_uthmani_simple":"الذين ينفقون فى السراء والضراء والكظمين الغيظ والعافين عن الناس والله يحب المحسنين"},{"id":428,"verse_key":"3:135","text_uthmani_simple":"والذين اذا فعلوا۟ فحشة او ظلموا۟ انفسهم ذكروا۟ الله فاستغفروا۟ لذنوبهم ومن يغفر الذنوب الا الله ولم يصروا۟ على ما فعلوا۟ وهم يعلمون"},{"id":429,"verse_key":"3:136","text_uthmani_simple":"او۟لئك جزاؤهم مغفرة من ربهم وجنت تجرى من تحتها الانهر خلدين فيها ونعم اجر العملين"},{"id":430,"verse_key":"3:137","text_uthmani_simple":"قد خلت من قبلكم سنن فسيروا۟ فى الارض فانظروا۟ كيف كان عقبة المكذبين"},{"id":431,"verse_key":"3:138","text_uthmani_simple":"هذا بيان للناس وهدى وموعظة للمتقين"},{"id":432,"verse_key":"3:139","text_uthmani_simple":"ولا تهنوا۟ ولا تحزنوا۟ وانتم الاعلون ان كنتم مؤمنين"},{"id":433,"verse_key":"3:140","text_uthmani_simple":"ان يمسسكم قرح فقد مس القوم قرح مثله وتلك الايام نداولها بين الناس وليعلم الله الذين ءامنوا۟ ويتخذ منكم شهداء والله لا يحب الظلمين"},{"id":434,"verse_key":"3:141","text_uthmani_simple":"وليمحص الله الذين ءامنوا۟ ويمحق الكفرين"},{"id":435,"verse_key":"3:142","text_uthmani_simple":"ام حسبتم ان تدخلوا۟ الجنة ولما يعلم الله الذين جهدوا۟ منكم ويعلم الصبرين"},{"id":436,"verse_key":"3:143","text_uthmani_simple":"ولقد كنتم تمنون الموت من قبل ان تلقوه فقد رايتموه وانتم تنظرون"},{"id":437,"verse_key":"3:144","text_uthmani_simple":"وما محمد الا رسول قد خلت من قبله الرسل افاي۟ن مات او قتل انقلبتم على اعقبكم ومن ينقلب على عقبيه فلن يضر الله شيـا وسيجزى الله الشكرين"},{"id":438,"verse_key":"3:145","text_uthmani_simple":"وما كان لنفس ان تموت الا باذن الله كتبا مؤجلا ومن يرد ثواب الدنيا نؤته منها ومن يرد ثواب الءاخرة نؤته منها وسنجزى الشكرين"},{"id":439,"verse_key":"3:146","text_uthmani_simple":"وكاين من نبى قتل معه ربيون كثير فما وهنوا۟ لما اصابهم فى سبيل الله وما ضعفوا۟ وما استكانوا۟ والله يحب الصبرين"},{"id":440,"verse_key":"3:147","text_uthmani_simple":"وما كان قولهم الا ان قالوا۟ ربنا اغفر لنا ذنوبنا واسرافنا فى امرنا وثبت اقدامنا وانصرنا على القوم الكفرين"},{"id":441,"verse_key":"3:148","text_uthmani_simple":"فـاتىهم الله ثواب الدنيا وحسن ثواب الءاخرة والله يحب المحسنين"},{"id":442,"verse_key":"3:149","text_uthmani_simple":"يايها الذين ءامنوا۟ ان تطيعوا۟ الذين كفروا۟ يردوكم على اعقبكم فتنقلبوا۟ خسرين"},{"id":443,"verse_key":"3:150","text_uthmani_simple":"بل الله مولىكم وهو خير النصرين"},{"id":444,"verse_key":"3:151","text_uthmani_simple":"سنلقى فى قلوب الذين كفروا۟ الرعب بما اشركوا۟ بالله ما لم ينزل به سلطنا وماوىهم النار وبئس مثوى الظلمين"},{"id":445,"verse_key":"3:152","text_uthmani_simple":"ولقد صدقكم الله وعده اذ تحسونهم باذنه حتى اذا فشلتم وتنزعتم فى الامر وعصيتم منۢ بعد ما ارىكم ما تحبون منكم من يريد الدنيا ومنكم من يريد الءاخرة ثم صرفكم عنهم ليبتليكم ولقد عفا عنكم والله ذو فضل على المؤمنين"},{"id":446,"verse_key":"3:153","text_uthmani_simple":"اذ تصعدون ولا تلون على احد والرسول يدعوكم فى اخرىكم فاثبكم غمۢا بغم لكيلا تحزنوا۟ على ما فاتكم ولا ما اصبكم والله خبيرۢ بما تعملون"},{"id":447,"verse_key":"3:154","text_uthmani_simple":"ثم انزل عليكم منۢ بعد الغم امنة نعاسا يغشى طائفة منكم وطائفة قد اهمتهم انفسهم يظنون بالله غير الحق ظن الجهلية يقولون هل لنا من الامر من شىء قل ان الامر كله لله يخفون فى انفسهم ما لا يبدون لك يقولون لو كان لنا من الامر شىء ما قتلنا ههنا قل لو كنتم فى بيوتكم لبرز الذين كتب عليهم القتل الى مضاجعهم وليبتلى الله ما فى صدوركم وليمحص ما فى قلوبكم والله عليمۢ بذات الصدور"},{"id":448,"verse_key":"3:155","text_uthmani_simple":"ان الذين تولوا۟ منكم يوم التقى الجمعان انما استزلهم الشيطن ببعض ما كسبوا۟ ولقد عفا الله عنهم ان الله غفور حليم"},{"id":449,"verse_key":"3:156","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تكونوا۟ كالذين كفروا۟ وقالوا۟ لاخونهم اذا ضربوا۟ فى الارض او كانوا۟ غزى لو كانوا۟ عندنا ما ماتوا۟ وما قتلوا۟ ليجعل الله ذلك حسرة فى قلوبهم والله يحى ويميت والله بما تعملون بصير"},{"id":450,"verse_key":"3:157","text_uthmani_simple":"ولئن قتلتم فى سبيل الله او متم لمغفرة من الله ورحمة خير مما يجمعون"},{"id":451,"verse_key":"3:158","text_uthmani_simple":"ولئن متم او قتلتم لالى الله تحشرون"},{"id":452,"verse_key":"3:159","text_uthmani_simple":"فبما رحمة من الله لنت لهم ولو كنت فظا غليظ القلب لانفضوا۟ من حولك فاعف عنهم واستغفر لهم وشاورهم فى الامر فاذا عزمت فتوكل على الله ان الله يحب المتوكلين"},{"id":453,"verse_key":"3:160","text_uthmani_simple":"ان ينصركم الله فلا غالب لكم وان يخذلكم فمن ذا الذى ينصركم منۢ بعده وعلى الله فليتوكل المؤمنون"},{"id":454,"verse_key":"3:161","text_uthmani_simple":"وما كان لنبى ان يغل ومن يغلل يات بما غل يوم القيمة ثم توفى كل نفس ما كسبت وهم لا يظلمون"},{"id":455,"verse_key":"3:162","text_uthmani_simple":"افمن اتبع رضون الله كمنۢ باء بسخط من الله وماوىه جهنم وبئس المصير"},{"id":456,"verse_key":"3:163","text_uthmani_simple":"هم درجت عند الله والله بصيرۢ بما يعملون"},{"id":457,"verse_key":"3:164","text_uthmani_simple":"لقد من الله على المؤمنين اذ بعث فيهم رسولا من انفسهم يتلوا۟ عليهم ءايته ويزكيهم ويعلمهم الكتب والحكمة وان كانوا۟ من قبل لفى ضلل مبين"},{"id":458,"verse_key":"3:165","text_uthmani_simple":"اولما اصبتكم مصيبة قد اصبتم مثليها قلتم انى هذا قل هو من عند انفسكم ان الله على كل شىء قدير"},{"id":459,"verse_key":"3:166","text_uthmani_simple":"وما اصبكم يوم التقى الجمعان فباذن الله وليعلم المؤمنين"},{"id":460,"verse_key":"3:167","text_uthmani_simple":"وليعلم الذين نافقوا۟ وقيل لهم تعالوا۟ قتلوا۟ فى سبيل الله او ادفعوا۟ قالوا۟ لو نعلم قتالا لاتبعنكم هم للكفر يومئذ اقرب منهم للايمن يقولون بافوههم ما ليس فى قلوبهم والله اعلم بما يكتمون"},{"id":461,"verse_key":"3:168","text_uthmani_simple":"الذين قالوا۟ لاخونهم وقعدوا۟ لو اطاعونا ما قتلوا۟ قل فادرءوا۟ عن انفسكم الموت ان كنتم صدقين"},{"id":462,"verse_key":"3:169","text_uthmani_simple":"ولا تحسبن الذين قتلوا۟ فى سبيل الله اموتۢا بل احياء عند ربهم يرزقون"},{"id":463,"verse_key":"3:170","text_uthmani_simple":"فرحين بما ءاتىهم الله من فضله ويستبشرون بالذين لم يلحقوا۟ بهم من خلفهم الا خوف عليهم ولا هم يحزنون"},{"id":464,"verse_key":"3:171","text_uthmani_simple":"يستبشرون بنعمة من الله وفضل وان الله لا يضيع اجر المؤمنين"},{"id":465,"verse_key":"3:172","text_uthmani_simple":"الذين استجابوا۟ لله والرسول منۢ بعد ما اصابهم القرح للذين احسنوا۟ منهم واتقوا۟ اجر عظيم"},{"id":466,"verse_key":"3:173","text_uthmani_simple":"الذين قال لهم الناس ان الناس قد جمعوا۟ لكم فاخشوهم فزادهم ايمنا وقالوا۟ حسبنا الله ونعم الوكيل"},{"id":467,"verse_key":"3:174","text_uthmani_simple":"فانقلبوا۟ بنعمة من الله وفضل لم يمسسهم سوء واتبعوا۟ رضون الله والله ذو فضل عظيم"},{"id":468,"verse_key":"3:175","text_uthmani_simple":"انما ذلكم الشيطن يخوف اولياءه فلا تخافوهم وخافون ان كنتم مؤمنين"},{"id":469,"verse_key":"3:176","text_uthmani_simple":"ولا يحزنك الذين يسرعون فى الكفر انهم لن يضروا۟ الله شيـا يريد الله الا يجعل لهم حظا فى الءاخرة ولهم عذاب عظيم"},{"id":470,"verse_key":"3:177","text_uthmani_simple":"ان الذين اشتروا۟ الكفر بالايمن لن يضروا۟ الله شيـا ولهم عذاب اليم"},{"id":471,"verse_key":"3:178","text_uthmani_simple":"ولا يحسبن الذين كفروا۟ انما نملى لهم خير لانفسهم انما نملى لهم ليزدادوا۟ اثما ولهم عذاب مهين"},{"id":472,"verse_key":"3:179","text_uthmani_simple":"ما كان الله ليذر المؤمنين على ما انتم عليه حتى يميز الخبيث من الطيب وما كان الله ليطلعكم على الغيب ولكن الله يجتبى من رسله من يشاء فـامنوا۟ بالله ورسله وان تؤمنوا۟ وتتقوا۟ فلكم اجر عظيم"},{"id":473,"verse_key":"3:180","text_uthmani_simple":"ولا يحسبن الذين يبخلون بما ءاتىهم الله من فضله هو خيرا لهم بل هو شر لهم سيطوقون ما بخلوا۟ به يوم القيمة ولله ميرث السموت والارض والله بما تعملون خبير"},{"id":474,"verse_key":"3:181","text_uthmani_simple":"لقد سمع الله قول الذين قالوا۟ ان الله فقير ونحن اغنياء سنكتب ما قالوا۟ وقتلهم الانۢبياء بغير حق ونقول ذوقوا۟ عذاب الحريق"},{"id":475,"verse_key":"3:182","text_uthmani_simple":"ذلك بما قدمت ايديكم وان الله ليس بظلام للعبيد"},{"id":476,"verse_key":"3:183","text_uthmani_simple":"الذين قالوا۟ ان الله عهد الينا الا نؤمن لرسول حتى ياتينا بقربان تاكله النار قل قد جاءكم رسل من قبلى بالبينت وبالذى قلتم فلم قتلتموهم ان كنتم صدقين"},{"id":477,"verse_key":"3:184","text_uthmani_simple":"فان كذبوك فقد كذب رسل من قبلك جاءو بالبينت والزبر والكتب المنير"},{"id":478,"verse_key":"3:185","text_uthmani_simple":"كل نفس ذائقة الموت وانما توفون اجوركم يوم القيمة فمن زحزح عن النار وادخل الجنة فقد فاز وما الحيوة الدنيا الا متع الغرور"},{"id":479,"verse_key":"3:186","text_uthmani_simple":"لتبلون فى امولكم وانفسكم ولتسمعن من الذين اوتوا۟ الكتب من قبلكم ومن الذين اشركوا۟ اذى كثيرا وان تصبروا۟ وتتقوا۟ فان ذلك من عزم الامور"},{"id":480,"verse_key":"3:187","text_uthmani_simple":"واذ اخذ الله ميثق الذين اوتوا۟ الكتب لتبيننه للناس ولا تكتمونه فنبذوه وراء ظهورهم واشتروا۟ به ثمنا قليلا فبئس ما يشترون"},{"id":481,"verse_key":"3:188","text_uthmani_simple":"لا تحسبن الذين يفرحون بما اتوا۟ ويحبون ان يحمدوا۟ بما لم يفعلوا۟ فلا تحسبنهم بمفازة من العذاب ولهم عذاب اليم"},{"id":482,"verse_key":"3:189","text_uthmani_simple":"ولله ملك السموت والارض والله على كل شىء قدير"},{"id":483,"verse_key":"3:190","text_uthmani_simple":"ان فى خلق السموت والارض واختلف اليل والنهار لءايت لاو۟لى الالبب"},{"id":484,"verse_key":"3:191","text_uthmani_simple":"الذين يذكرون الله قيما وقعودا وعلى جنوبهم ويتفكرون فى خلق السموت والارض ربنا ما خلقت هذا بطلا سبحنك فقنا عذاب النار"},{"id":485,"verse_key":"3:192","text_uthmani_simple":"ربنا انك من تدخل النار فقد اخزيته وما للظلمين من انصار"},{"id":486,"verse_key":"3:193","text_uthmani_simple":"ربنا اننا سمعنا مناديا ينادى للايمن ان ءامنوا۟ بربكم فـامنا ربنا فاغفر لنا ذنوبنا وكفر عنا سيـاتنا وتوفنا مع الابرار"},{"id":487,"verse_key":"3:194","text_uthmani_simple":"ربنا وءاتنا ما وعدتنا على رسلك ولا تخزنا يوم القيمة انك لا تخلف الميعاد"},{"id":488,"verse_key":"3:195","text_uthmani_simple":"فاستجاب لهم ربهم انى لا اضيع عمل عمل منكم من ذكر او انثى بعضكم منۢ بعض فالذين هاجروا۟ واخرجوا۟ من ديرهم واوذوا۟ فى سبيلى وقتلوا۟ وقتلوا۟ لاكفرن عنهم سيـاتهم ولادخلنهم جنت تجرى من تحتها الانهر ثوابا من عند الله والله عنده حسن الثواب"},{"id":489,"verse_key":"3:196","text_uthmani_simple":"لا يغرنك تقلب الذين كفروا۟ فى البلد"},{"id":490,"verse_key":"3:197","text_uthmani_simple":"متع قليل ثم ماوىهم جهنم وبئس المهاد"},{"id":491,"verse_key":"3:198","text_uthmani_simple":"لكن الذين اتقوا۟ ربهم لهم جنت تجرى من تحتها الانهر خلدين فيها نزلا من عند الله وما عند الله خير للابرار"},{"id":492,"verse_key":"3:199","text_uthmani_simple":"وان من اهل الكتب لمن يؤمن بالله وما انزل اليكم وما انزل اليهم خشعين لله لا يشترون بـايت الله ثمنا قليلا او۟لئك لهم اجرهم عند ربهم ان الله سريع الحساب"},{"id":493,"verse_key":"3:200","text_uthmani_simple":"يايها الذين ءامنوا۟ اصبروا۟ وصابروا۟ ورابطوا۟ واتقوا۟ الله لعلكم تفلحون"},{"id":494,"verse_key":"4:1","text_uthmani_simple":"يايها الناس اتقوا۟ ربكم الذى خلقكم من نفس وحدة وخلق منها زوجها وبث منهما رجالا كثيرا ونساء واتقوا۟ الله الذى تساءلون به والارحام ان الله كان عليكم رقيبا"},{"id":495,"verse_key":"4:2","text_uthmani_simple":"وءاتوا۟ اليتمى امولهم ولا تتبدلوا۟ الخبيث بالطيب ولا تاكلوا۟ امولهم الى امولكم انه كان حوبا كبيرا"},{"id":496,"verse_key":"4:3","text_uthmani_simple":"وان خفتم الا تقسطوا۟ فى اليتمى فانكحوا۟ ما طاب لكم من النساء مثنى وثلث وربع فان خفتم الا تعدلوا۟ فوحدة او ما ملكت ايمنكم ذلك ادنى الا تعولوا۟"},{"id":497,"verse_key":"4:4","text_uthmani_simple":"وءاتوا۟ النساء صدقتهن نحلة فان طبن لكم عن شىء منه نفسا فكلوه هنيـا مريـا"},{"id":498,"verse_key":"4:5","text_uthmani_simple":"ولا تؤتوا۟ السفهاء امولكم التى جعل الله لكم قيما وارزقوهم فيها واكسوهم وقولوا۟ لهم قولا معروفا"},{"id":499,"verse_key":"4:6","text_uthmani_simple":"وابتلوا۟ اليتمى حتى اذا بلغوا۟ النكاح فان ءانستم منهم رشدا فادفعوا۟ اليهم امولهم ولا تاكلوها اسرافا وبدارا ان يكبروا۟ ومن كان غنيا فليستعفف ومن كان فقيرا فلياكل بالمعروف فاذا دفعتم اليهم امولهم فاشهدوا۟ عليهم وكفى بالله حسيبا"},{"id":500,"verse_key":"4:7","text_uthmani_simple":"للرجال نصيب مما ترك الولدان والاقربون وللنساء نصيب مما ترك الولدان والاقربون مما قل منه او كثر نصيبا مفروضا"},{"id":501,"verse_key":"4:8","text_uthmani_simple":"واذا حضر القسمة او۟لوا۟ القربى واليتمى والمسكين فارزقوهم منه وقولوا۟ لهم قولا معروفا"},{"id":502,"verse_key":"4:9","text_uthmani_simple":"وليخش الذين لو تركوا۟ من خلفهم ذرية ضعفا خافوا۟ عليهم فليتقوا۟ الله وليقولوا۟ قولا سديدا"},{"id":503,"verse_key":"4:10","text_uthmani_simple":"ان الذين ياكلون امول اليتمى ظلما انما ياكلون فى بطونهم نارا وسيصلون سعيرا"},{"id":504,"verse_key":"4:11","text_uthmani_simple":"يوصيكم الله فى اولدكم للذكر مثل حظ الانثيين فان كن نساء فوق اثنتين فلهن ثلثا ما ترك وان كانت وحدة فلها النصف ولابويه لكل وحد منهما السدس مما ترك ان كان له ولد فان لم يكن له ولد وورثه ابواه فلامه الثلث فان كان له اخوة فلامه السدس منۢ بعد وصية يوصى بها او دين ءاباؤكم وابناؤكم لا تدرون ايهم اقرب لكم نفعا فريضة من الله ان الله كان عليما حكيما"},{"id":505,"verse_key":"4:12","text_uthmani_simple":"ولكم نصف ما ترك ازوجكم ان لم يكن لهن ولد فان كان لهن ولد فلكم الربع مما تركن منۢ بعد وصية يوصين بها او دين ولهن الربع مما تركتم ان لم يكن لكم ولد فان كان لكم ولد فلهن الثمن مما تركتم منۢ بعد وصية توصون بها او دين وان كان رجل يورث كللة او امراة وله اخ او اخت فلكل وحد منهما السدس فان كانوا۟ اكثر من ذلك فهم شركاء فى الثلث منۢ بعد وصية يوصى بها او دين غير مضار وصية من الله والله عليم حليم"},{"id":506,"verse_key":"4:13","text_uthmani_simple":"تلك حدود الله ومن يطع الله ورسوله يدخله جنت تجرى من تحتها الانهر خلدين فيها وذلك الفوز العظيم"},{"id":507,"verse_key":"4:14","text_uthmani_simple":"ومن يعص الله ورسوله ويتعد حدوده يدخله نارا خلدا فيها وله عذاب مهين"},{"id":508,"verse_key":"4:15","text_uthmani_simple":"والتى ياتين الفحشة من نسائكم فاستشهدوا۟ عليهن اربعة منكم فان شهدوا۟ فامسكوهن فى البيوت حتى يتوفىهن الموت او يجعل الله لهن سبيلا"},{"id":509,"verse_key":"4:16","text_uthmani_simple":"والذان ياتينها منكم فـاذوهما فان تابا واصلحا فاعرضوا۟ عنهما ان الله كان توابا رحيما"},{"id":510,"verse_key":"4:17","text_uthmani_simple":"انما التوبة على الله للذين يعملون السوء بجهلة ثم يتوبون من قريب فاو۟لئك يتوب الله عليهم وكان الله عليما حكيما"},{"id":511,"verse_key":"4:18","text_uthmani_simple":"وليست التوبة للذين يعملون السيـات حتى اذا حضر احدهم الموت قال انى تبت الـن ولا الذين يموتون وهم كفار او۟لئك اعتدنا لهم عذابا اليما"},{"id":512,"verse_key":"4:19","text_uthmani_simple":"يايها الذين ءامنوا۟ لا يحل لكم ان ترثوا۟ النساء كرها ولا تعضلوهن لتذهبوا۟ ببعض ما ءاتيتموهن الا ان ياتين بفحشة مبينة وعاشروهن بالمعروف فان كرهتموهن فعسى ان تكرهوا۟ شيـا ويجعل الله فيه خيرا كثيرا"},{"id":513,"verse_key":"4:20","text_uthmani_simple":"وان اردتم استبدال زوج مكان زوج وءاتيتم احدىهن قنطارا فلا تاخذوا۟ منه شيـا اتاخذونه بهتنا واثما مبينا"},{"id":514,"verse_key":"4:21","text_uthmani_simple":"وكيف تاخذونه وقد افضى بعضكم الى بعض واخذن منكم ميثقا غليظا"},{"id":515,"verse_key":"4:22","text_uthmani_simple":"ولا تنكحوا۟ ما نكح ءاباؤكم من النساء الا ما قد سلف انه كان فحشة ومقتا وساء سبيلا"},{"id":516,"verse_key":"4:23","text_uthmani_simple":"حرمت عليكم امهتكم وبناتكم واخوتكم وعمتكم وخلتكم وبنات الاخ وبنات الاخت وامهتكم التى ارضعنكم واخوتكم من الرضعة وامهت نسائكم وربئبكم التى فى حجوركم من نسائكم التى دخلتم بهن فان لم تكونوا۟ دخلتم بهن فلا جناح عليكم وحلئل ابنائكم الذين من اصلبكم وان تجمعوا۟ بين الاختين الا ما قد سلف ان الله كان غفورا رحيما"}],"meta":{"filters":{"juz_number":"4"}}}
