{"verses":[{"id":4511,"verse_key":"46:1","text_uthmani_simple":"حم"},{"id":4512,"verse_key":"46:2","text_uthmani_simple":"تنزيل الكتب من الله العزيز الحكيم"},{"id":4513,"verse_key":"46:3","text_uthmani_simple":"ما خلقنا السموت والارض وما بينهما الا بالحق واجل مسمى والذين كفروا۟ عما انذروا۟ معرضون"},{"id":4514,"verse_key":"46:4","text_uthmani_simple":"قل ارءيتم ما تدعون من دون الله ارونى ماذا خلقوا۟ من الارض ام لهم شرك فى السموت ائتونى بكتب من قبل هذا او اثرة من علم ان كنتم صدقين"},{"id":4515,"verse_key":"46:5","text_uthmani_simple":"ومن اضل ممن يدعوا۟ من دون الله من لا يستجيب له الى يوم القيمة وهم عن دعائهم غفلون"},{"id":4516,"verse_key":"46:6","text_uthmani_simple":"واذا حشر الناس كانوا۟ لهم اعداء وكانوا۟ بعبادتهم كفرين"},{"id":4517,"verse_key":"46:7","text_uthmani_simple":"واذا تتلى عليهم ءايتنا بينت قال الذين كفروا۟ للحق لما جاءهم هذا سحر مبين"},{"id":4518,"verse_key":"46:8","text_uthmani_simple":"ام يقولون افترىه قل ان افتريته فلا تملكون لى من الله شيـا هو اعلم بما تفيضون فيه كفى به شهيدۢا بينى وبينكم وهو الغفور الرحيم"},{"id":4519,"verse_key":"46:9","text_uthmani_simple":"قل ما كنت بدعا من الرسل وما ادرى ما يفعل بى ولا بكم ان اتبع الا ما يوحى الى وما انا۠ الا نذير مبين"},{"id":4520,"verse_key":"46:10","text_uthmani_simple":"قل ارءيتم ان كان من عند الله وكفرتم به وشهد شاهد منۢ بنى اسرءيل على مثله فـامن واستكبرتم ان الله لا يهدى القوم الظلمين"},{"id":4521,"verse_key":"46:11","text_uthmani_simple":"وقال الذين كفروا۟ للذين ءامنوا۟ لو كان خيرا ما سبقونا اليه واذ لم يهتدوا۟ به فسيقولون هذا افك قديم"},{"id":4522,"verse_key":"46:12","text_uthmani_simple":"ومن قبله كتب موسى اماما ورحمة وهذا كتب مصدق لسانا عربيا لينذر الذين ظلموا۟ وبشرى للمحسنين"},{"id":4523,"verse_key":"46:13","text_uthmani_simple":"ان الذين قالوا۟ ربنا الله ثم استقموا۟ فلا خوف عليهم ولا هم يحزنون"},{"id":4524,"verse_key":"46:14","text_uthmani_simple":"او۟لئك اصحب الجنة خلدين فيها جزاءۢ بما كانوا۟ يعملون"},{"id":4525,"verse_key":"46:15","text_uthmani_simple":"ووصينا الانسن بولديه احسنا حملته امه كرها ووضعته كرها وحمله وفصله ثلثون شهرا حتى اذا بلغ اشده وبلغ اربعين سنة قال رب اوزعنى ان اشكر نعمتك التى انعمت على وعلى ولدى وان اعمل صلحا ترضىه واصلح لى فى ذريتى انى تبت اليك وانى من المسلمين"},{"id":4526,"verse_key":"46:16","text_uthmani_simple":"او۟لئك الذين نتقبل عنهم احسن ما عملوا۟ ونتجاوز عن سيـاتهم فى اصحب الجنة وعد الصدق الذى كانوا۟ يوعدون"},{"id":4527,"verse_key":"46:17","text_uthmani_simple":"والذى قال لولديه اف لكما اتعداننى ان اخرج وقد خلت القرون من قبلى وهما يستغيثان الله ويلك ءامن ان وعد الله حق فيقول ما هذا الا اسطير الاولين"},{"id":4528,"verse_key":"46:18","text_uthmani_simple":"او۟لئك الذين حق عليهم القول فى امم قد خلت من قبلهم من الجن والانس انهم كانوا۟ خسرين"},{"id":4529,"verse_key":"46:19","text_uthmani_simple":"ولكل درجت مما عملوا۟ وليوفيهم اعملهم وهم لا يظلمون"},{"id":4530,"verse_key":"46:20","text_uthmani_simple":"ويوم يعرض الذين كفروا۟ على النار اذهبتم طيبتكم فى حياتكم الدنيا واستمتعتم بها فاليوم تجزون عذاب الهون بما كنتم تستكبرون فى الارض بغير الحق وبما كنتم تفسقون"},{"id":4531,"verse_key":"46:21","text_uthmani_simple":"واذكر اخا عاد اذ انذر قومه بالاحقاف وقد خلت النذر منۢ بين يديه ومن خلفه الا تعبدوا۟ الا الله انى اخاف عليكم عذاب يوم عظيم"},{"id":4532,"verse_key":"46:22","text_uthmani_simple":"قالوا۟ اجئتنا لتافكنا عن ءالهتنا فاتنا بما تعدنا ان كنت من الصدقين"},{"id":4533,"verse_key":"46:23","text_uthmani_simple":"قال انما العلم عند الله وابلغكم ما ارسلت به ولكنى ارىكم قوما تجهلون"},{"id":4534,"verse_key":"46:24","text_uthmani_simple":"فلما راوه عارضا مستقبل اوديتهم قالوا۟ هذا عارض ممطرنا بل هو ما استعجلتم به ريح فيها عذاب اليم"},{"id":4535,"verse_key":"46:25","text_uthmani_simple":"تدمر كل شىءۭ بامر ربها فاصبحوا۟ لا يرى الا مسكنهم كذلك نجزى القوم المجرمين"},{"id":4536,"verse_key":"46:26","text_uthmani_simple":"ولقد مكنهم فيما ان مكنكم فيه وجعلنا لهم سمعا وابصرا وافـدة فما اغنى عنهم سمعهم ولا ابصرهم ولا افـدتهم من شىء اذ كانوا۟ يجحدون بـايت الله وحاق بهم ما كانوا۟ به يستهزءون"},{"id":4537,"verse_key":"46:27","text_uthmani_simple":"ولقد اهلكنا ما حولكم من القرى وصرفنا الءايت لعلهم يرجعون"},{"id":4538,"verse_key":"46:28","text_uthmani_simple":"فلولا نصرهم الذين اتخذوا۟ من دون الله قربانا ءالهةۢ بل ضلوا۟ عنهم وذلك افكهم وما كانوا۟ يفترون"},{"id":4539,"verse_key":"46:29","text_uthmani_simple":"واذ صرفنا اليك نفرا من الجن يستمعون القرءان فلما حضروه قالوا۟ انصتوا۟ فلما قضى ولوا۟ الى قومهم منذرين"},{"id":4540,"verse_key":"46:30","text_uthmani_simple":"قالوا۟ يقومنا انا سمعنا كتبا انزل منۢ بعد موسى مصدقا لما بين يديه يهدى الى الحق والى طريق مستقيم"},{"id":4541,"verse_key":"46:31","text_uthmani_simple":"يقومنا اجيبوا۟ داعى الله وءامنوا۟ به يغفر لكم من ذنوبكم ويجركم من عذاب اليم"},{"id":4542,"verse_key":"46:32","text_uthmani_simple":"ومن لا يجب داعى الله فليس بمعجز فى الارض وليس له من دونه اولياء او۟لئك فى ضلل مبين"},{"id":4543,"verse_key":"46:33","text_uthmani_simple":"اولم يروا۟ ان الله الذى خلق السموت والارض ولم يعى بخلقهن بقدر على ان يحى الموتى بلى انه على كل شىء قدير"},{"id":4544,"verse_key":"46:34","text_uthmani_simple":"ويوم يعرض الذين كفروا۟ على النار اليس هذا بالحق قالوا۟ بلى وربنا قال فذوقوا۟ العذاب بما كنتم تكفرون"},{"id":4545,"verse_key":"46:35","text_uthmani_simple":"فاصبر كما صبر او۟لوا۟ العزم من الرسل ولا تستعجل لهم كانهم يوم يرون ما يوعدون لم يلبثوا۟ الا ساعة من نهارۭ بلغ فهل يهلك الا القوم الفسقون"},{"id":4546,"verse_key":"47:1","text_uthmani_simple":"الذين كفروا۟ وصدوا۟ عن سبيل الله اضل اعملهم"},{"id":4547,"verse_key":"47:2","text_uthmani_simple":"والذين ءامنوا۟ وعملوا۟ الصلحت وءامنوا۟ بما نزل على محمد وهو الحق من ربهم كفر عنهم سيـاتهم واصلح بالهم"},{"id":4548,"verse_key":"47:3","text_uthmani_simple":"ذلك بان الذين كفروا۟ اتبعوا۟ البطل وان الذين ءامنوا۟ اتبعوا۟ الحق من ربهم كذلك يضرب الله للناس امثلهم"},{"id":4549,"verse_key":"47:4","text_uthmani_simple":"فاذا لقيتم الذين كفروا۟ فضرب الرقاب حتى اذا اثخنتموهم فشدوا۟ الوثاق فاما منۢا بعد واما فداء حتى تضع الحرب اوزارها ذلك ولو يشاء الله لانتصر منهم ولكن ليبلوا۟ بعضكم ببعض والذين قتلوا۟ فى سبيل الله فلن يضل اعملهم"},{"id":4550,"verse_key":"47:5","text_uthmani_simple":"سيهديهم ويصلح بالهم"},{"id":4551,"verse_key":"47:6","text_uthmani_simple":"ويدخلهم الجنة عرفها لهم"},{"id":4552,"verse_key":"47:7","text_uthmani_simple":"يايها الذين ءامنوا۟ ان تنصروا۟ الله ينصركم ويثبت اقدامكم"},{"id":4553,"verse_key":"47:8","text_uthmani_simple":"والذين كفروا۟ فتعسا لهم واضل اعملهم"},{"id":4554,"verse_key":"47:9","text_uthmani_simple":"ذلك بانهم كرهوا۟ ما انزل الله فاحبط اعملهم"},{"id":4555,"verse_key":"47:10","text_uthmani_simple":"افلم يسيروا۟ فى الارض فينظروا۟ كيف كان عقبة الذين من قبلهم دمر الله عليهم وللكفرين امثلها"},{"id":4556,"verse_key":"47:11","text_uthmani_simple":"ذلك بان الله مولى الذين ءامنوا۟ وان الكفرين لا مولى لهم"},{"id":4557,"verse_key":"47:12","text_uthmani_simple":"ان الله يدخل الذين ءامنوا۟ وعملوا۟ الصلحت جنت تجرى من تحتها الانهر والذين كفروا۟ يتمتعون وياكلون كما تاكل الانعم والنار مثوى لهم"},{"id":4558,"verse_key":"47:13","text_uthmani_simple":"وكاين من قرية هى اشد قوة من قريتك التى اخرجتك اهلكنهم فلا ناصر لهم"},{"id":4559,"verse_key":"47:14","text_uthmani_simple":"افمن كان على بينة من ربه كمن زين له سوء عمله واتبعوا۟ اهواءهم"},{"id":4560,"verse_key":"47:15","text_uthmani_simple":"مثل الجنة التى وعد المتقون فيها انهر من ماء غير ءاسن وانهر من لبن لم يتغير طعمه وانهر من خمر لذة للشربين وانهر من عسل مصفى ولهم فيها من كل الثمرت ومغفرة من ربهم كمن هو خلد فى النار وسقوا۟ ماء حميما فقطع امعاءهم"},{"id":4561,"verse_key":"47:16","text_uthmani_simple":"ومنهم من يستمع اليك حتى اذا خرجوا۟ من عندك قالوا۟ للذين اوتوا۟ العلم ماذا قال ءانفا او۟لئك الذين طبع الله على قلوبهم واتبعوا۟ اهواءهم"},{"id":4562,"verse_key":"47:17","text_uthmani_simple":"والذين اهتدوا۟ زادهم هدى وءاتىهم تقوىهم"},{"id":4563,"verse_key":"47:18","text_uthmani_simple":"فهل ينظرون الا الساعة ان تاتيهم بغتة فقد جاء اشراطها فانى لهم اذا جاءتهم ذكرىهم"},{"id":4564,"verse_key":"47:19","text_uthmani_simple":"فاعلم انه لا اله الا الله واستغفر لذنۢبك وللمؤمنين والمؤمنت والله يعلم متقلبكم ومثوىكم"},{"id":4565,"verse_key":"47:20","text_uthmani_simple":"ويقول الذين ءامنوا۟ لولا نزلت سورة فاذا انزلت سورة محكمة وذكر فيها القتال رايت الذين فى قلوبهم مرض ينظرون اليك نظر المغشى عليه من الموت فاولى لهم"},{"id":4566,"verse_key":"47:21","text_uthmani_simple":"طاعة وقول معروف فاذا عزم الامر فلو صدقوا۟ الله لكان خيرا لهم"},{"id":4567,"verse_key":"47:22","text_uthmani_simple":"فهل عسيتم ان توليتم ان تفسدوا۟ فى الارض وتقطعوا۟ ارحامكم"},{"id":4568,"verse_key":"47:23","text_uthmani_simple":"او۟لئك الذين لعنهم الله فاصمهم واعمى ابصرهم"},{"id":4569,"verse_key":"47:24","text_uthmani_simple":"افلا يتدبرون القرءان ام على قلوب اقفالها"},{"id":4570,"verse_key":"47:25","text_uthmani_simple":"ان الذين ارتدوا۟ على ادبرهم منۢ بعد ما تبين لهم الهدى الشيطن سول لهم واملى لهم"},{"id":4571,"verse_key":"47:26","text_uthmani_simple":"ذلك بانهم قالوا۟ للذين كرهوا۟ ما نزل الله سنطيعكم فى بعض الامر والله يعلم اسرارهم"},{"id":4572,"verse_key":"47:27","text_uthmani_simple":"فكيف اذا توفتهم الملئكة يضربون وجوههم وادبرهم"},{"id":4573,"verse_key":"47:28","text_uthmani_simple":"ذلك بانهم اتبعوا۟ ما اسخط الله وكرهوا۟ رضونه فاحبط اعملهم"},{"id":4574,"verse_key":"47:29","text_uthmani_simple":"ام حسب الذين فى قلوبهم مرض ان لن يخرج الله اضغنهم"},{"id":4575,"verse_key":"47:30","text_uthmani_simple":"ولو نشاء لارينكهم فلعرفتهم بسيمهم ولتعرفنهم فى لحن القول والله يعلم اعملكم"},{"id":4576,"verse_key":"47:31","text_uthmani_simple":"ولنبلونكم حتى نعلم المجهدين منكم والصبرين ونبلوا۟ اخباركم"},{"id":4577,"verse_key":"47:32","text_uthmani_simple":"ان الذين كفروا۟ وصدوا۟ عن سبيل الله وشاقوا۟ الرسول منۢ بعد ما تبين لهم الهدى لن يضروا۟ الله شيـا وسيحبط اعملهم"},{"id":4578,"verse_key":"47:33","text_uthmani_simple":"يايها الذين ءامنوا۟ اطيعوا۟ الله واطيعوا۟ الرسول ولا تبطلوا۟ اعملكم"},{"id":4579,"verse_key":"47:34","text_uthmani_simple":"ان الذين كفروا۟ وصدوا۟ عن سبيل الله ثم ماتوا۟ وهم كفار فلن يغفر الله لهم"},{"id":4580,"verse_key":"47:35","text_uthmani_simple":"فلا تهنوا۟ وتدعوا۟ الى السلم وانتم الاعلون والله معكم ولن يتركم اعملكم"},{"id":4581,"verse_key":"47:36","text_uthmani_simple":"انما الحيوة الدنيا لعب ولهو وان تؤمنوا۟ وتتقوا۟ يؤتكم اجوركم ولا يسـلكم امولكم"},{"id":4582,"verse_key":"47:37","text_uthmani_simple":"ان يسـلكموها فيحفكم تبخلوا۟ ويخرج اضغنكم"},{"id":4583,"verse_key":"47:38","text_uthmani_simple":"هانتم هؤلاء تدعون لتنفقوا۟ فى سبيل الله فمنكم من يبخل ومن يبخل فانما يبخل عن نفسه والله الغنى وانتم الفقراء وان تتولوا۟ يستبدل قوما غيركم ثم لا يكونوا۟ امثلكم"},{"id":4584,"verse_key":"48:1","text_uthmani_simple":"انا فتحنا لك فتحا مبينا"},{"id":4585,"verse_key":"48:2","text_uthmani_simple":"ليغفر لك الله ما تقدم من ذنۢبك وما تاخر ويتم نعمته عليك ويهديك صرطا مستقيما"},{"id":4586,"verse_key":"48:3","text_uthmani_simple":"وينصرك الله نصرا عزيزا"},{"id":4587,"verse_key":"48:4","text_uthmani_simple":"هو الذى انزل السكينة فى قلوب المؤمنين ليزدادوا۟ ايمنا مع ايمنهم ولله جنود السموت والارض وكان الله عليما حكيما"},{"id":4588,"verse_key":"48:5","text_uthmani_simple":"ليدخل المؤمنين والمؤمنت جنت تجرى من تحتها الانهر خلدين فيها ويكفر عنهم سيـاتهم وكان ذلك عند الله فوزا عظيما"},{"id":4589,"verse_key":"48:6","text_uthmani_simple":"ويعذب المنفقين والمنفقت والمشركين والمشركت الظانين بالله ظن السوء عليهم دائرة السوء وغضب الله عليهم ولعنهم واعد لهم جهنم وساءت مصيرا"},{"id":4590,"verse_key":"48:7","text_uthmani_simple":"ولله جنود السموت والارض وكان الله عزيزا حكيما"},{"id":4591,"verse_key":"48:8","text_uthmani_simple":"انا ارسلنك شهدا ومبشرا ونذيرا"},{"id":4592,"verse_key":"48:9","text_uthmani_simple":"لتؤمنوا۟ بالله ورسوله وتعزروه وتوقروه وتسبحوه بكرة واصيلا"},{"id":4593,"verse_key":"48:10","text_uthmani_simple":"ان الذين يبايعونك انما يبايعون الله يد الله فوق ايديهم فمن نكث فانما ينكث على نفسه ومن اوفى بما عهد عليه الله فسيؤتيه اجرا عظيما"},{"id":4594,"verse_key":"48:11","text_uthmani_simple":"سيقول لك المخلفون من الاعراب شغلتنا امولنا واهلونا فاستغفر لنا يقولون بالسنتهم ما ليس فى قلوبهم قل فمن يملك لكم من الله شيـا ان اراد بكم ضرا او اراد بكم نفعۢا بل كان الله بما تعملون خبيرۢا"},{"id":4595,"verse_key":"48:12","text_uthmani_simple":"بل ظننتم ان لن ينقلب الرسول والمؤمنون الى اهليهم ابدا وزين ذلك فى قلوبكم وظننتم ظن السوء وكنتم قومۢا بورا"},{"id":4596,"verse_key":"48:13","text_uthmani_simple":"ومن لم يؤمنۢ بالله ورسوله فانا اعتدنا للكفرين سعيرا"},{"id":4597,"verse_key":"48:14","text_uthmani_simple":"ولله ملك السموت والارض يغفر لمن يشاء ويعذب من يشاء وكان الله غفورا رحيما"},{"id":4598,"verse_key":"48:15","text_uthmani_simple":"سيقول المخلفون اذا انطلقتم الى مغانم لتاخذوها ذرونا نتبعكم يريدون ان يبدلوا۟ كلم الله قل لن تتبعونا كذلكم قال الله من قبل فسيقولون بل تحسدوننا بل كانوا۟ لا يفقهون الا قليلا"},{"id":4599,"verse_key":"48:16","text_uthmani_simple":"قل للمخلفين من الاعراب ستدعون الى قوم او۟لى باس شديد تقتلونهم او يسلمون فان تطيعوا۟ يؤتكم الله اجرا حسنا وان تتولوا۟ كما توليتم من قبل يعذبكم عذابا اليما"},{"id":4600,"verse_key":"48:17","text_uthmani_simple":"ليس على الاعمى حرج ولا على الاعرج حرج ولا على المريض حرج ومن يطع الله ورسوله يدخله جنت تجرى من تحتها الانهر ومن يتول يعذبه عذابا اليما"},{"id":4601,"verse_key":"48:18","text_uthmani_simple":"لقد رضى الله عن المؤمنين اذ يبايعونك تحت الشجرة فعلم ما فى قلوبهم فانزل السكينة عليهم واثبهم فتحا قريبا"},{"id":4602,"verse_key":"48:19","text_uthmani_simple":"ومغانم كثيرة ياخذونها وكان الله عزيزا حكيما"},{"id":4603,"verse_key":"48:20","text_uthmani_simple":"وعدكم الله مغانم كثيرة تاخذونها فعجل لكم هذه وكف ايدى الناس عنكم ولتكون ءاية للمؤمنين ويهديكم صرطا مستقيما"},{"id":4604,"verse_key":"48:21","text_uthmani_simple":"واخرى لم تقدروا۟ عليها قد احاط الله بها وكان الله على كل شىء قديرا"},{"id":4605,"verse_key":"48:22","text_uthmani_simple":"ولو قتلكم الذين كفروا۟ لولوا۟ الادبر ثم لا يجدون وليا ولا نصيرا"},{"id":4606,"verse_key":"48:23","text_uthmani_simple":"سنة الله التى قد خلت من قبل ولن تجد لسنة الله تبديلا"},{"id":4607,"verse_key":"48:24","text_uthmani_simple":"وهو الذى كف ايديهم عنكم وايديكم عنهم ببطن مكة منۢ بعد ان اظفركم عليهم وكان الله بما تعملون بصيرا"},{"id":4608,"verse_key":"48:25","text_uthmani_simple":"هم الذين كفروا۟ وصدوكم عن المسجد الحرام والهدى معكوفا ان يبلغ محله ولولا رجال مؤمنون ونساء مؤمنت لم تعلموهم ان تطـوهم فتصيبكم منهم معرةۢ بغير علم ليدخل الله فى رحمته من يشاء لو تزيلوا۟ لعذبنا الذين كفروا۟ منهم عذابا اليما"},{"id":4609,"verse_key":"48:26","text_uthmani_simple":"اذ جعل الذين كفروا۟ فى قلوبهم الحمية حمية الجهلية فانزل الله سكينته على رسوله وعلى المؤمنين والزمهم كلمة التقوى وكانوا۟ احق بها واهلها وكان الله بكل شىء عليما"},{"id":4610,"verse_key":"48:27","text_uthmani_simple":"لقد صدق الله رسوله الرءيا بالحق لتدخلن المسجد الحرام ان شاء الله ءامنين محلقين رءوسكم ومقصرين لا تخافون فعلم ما لم تعلموا۟ فجعل من دون ذلك فتحا قريبا"},{"id":4611,"verse_key":"48:28","text_uthmani_simple":"هو الذى ارسل رسوله بالهدى ودين الحق ليظهره على الدين كله وكفى بالله شهيدا"},{"id":4612,"verse_key":"48:29","text_uthmani_simple":"محمد رسول الله والذين معه اشداء على الكفار رحماء بينهم ترىهم ركعا سجدا يبتغون فضلا من الله ورضونا سيماهم فى وجوههم من اثر السجود ذلك مثلهم فى التورىة ومثلهم فى الانجيل كزرع اخرج شطـه فـازره فاستغلظ فاستوى على سوقه يعجب الزراع ليغيظ بهم الكفار وعد الله الذين ءامنوا۟ وعملوا۟ الصلحت منهم مغفرة واجرا عظيمۢا"},{"id":4613,"verse_key":"49:1","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تقدموا۟ بين يدى الله ورسوله واتقوا۟ الله ان الله سميع عليم"},{"id":4614,"verse_key":"49:2","text_uthmani_simple":"يايها الذين ءامنوا۟ لا ترفعوا۟ اصوتكم فوق صوت النبى ولا تجهروا۟ له بالقول كجهر بعضكم لبعض ان تحبط اعملكم وانتم لا تشعرون"},{"id":4615,"verse_key":"49:3","text_uthmani_simple":"ان الذين يغضون اصوتهم عند رسول الله او۟لئك الذين امتحن الله قلوبهم للتقوى لهم مغفرة واجر عظيم"},{"id":4616,"verse_key":"49:4","text_uthmani_simple":"ان الذين ينادونك من وراء الحجرت اكثرهم لا يعقلون"},{"id":4617,"verse_key":"49:5","text_uthmani_simple":"ولو انهم صبروا۟ حتى تخرج اليهم لكان خيرا لهم والله غفور رحيم"},{"id":4618,"verse_key":"49:6","text_uthmani_simple":"يايها الذين ءامنوا۟ ان جاءكم فاسقۢ بنبا فتبينوا۟ ان تصيبوا۟ قومۢا بجهلة فتصبحوا۟ على ما فعلتم ندمين"},{"id":4619,"verse_key":"49:7","text_uthmani_simple":"واعلموا۟ ان فيكم رسول الله لو يطيعكم فى كثير من الامر لعنتم ولكن الله حبب اليكم الايمن وزينه فى قلوبكم وكره اليكم الكفر والفسوق والعصيان او۟لئك هم الرشدون"},{"id":4620,"verse_key":"49:8","text_uthmani_simple":"فضلا من الله ونعمة والله عليم حكيم"},{"id":4621,"verse_key":"49:9","text_uthmani_simple":"وان طائفتان من المؤمنين اقتتلوا۟ فاصلحوا۟ بينهما فانۢ بغت احدىهما على الاخرى فقتلوا۟ التى تبغى حتى تفىء الى امر الله فان فاءت فاصلحوا۟ بينهما بالعدل واقسطوا۟ ان الله يحب المقسطين"},{"id":4622,"verse_key":"49:10","text_uthmani_simple":"انما المؤمنون اخوة فاصلحوا۟ بين اخويكم واتقوا۟ الله لعلكم ترحمون"},{"id":4623,"verse_key":"49:11","text_uthmani_simple":"يايها الذين ءامنوا۟ لا يسخر قوم من قوم عسى ان يكونوا۟ خيرا منهم ولا نساء من نساء عسى ان يكن خيرا منهن ولا تلمزوا۟ انفسكم ولا تنابزوا۟ بالالقب بئس الاسم الفسوق بعد الايمن ومن لم يتب فاو۟لئك هم الظلمون"},{"id":4624,"verse_key":"49:12","text_uthmani_simple":"يايها الذين ءامنوا۟ اجتنبوا۟ كثيرا من الظن ان بعض الظن اثم ولا تجسسوا۟ ولا يغتب بعضكم بعضا ايحب احدكم ان ياكل لحم اخيه ميتا فكرهتموه واتقوا۟ الله ان الله تواب رحيم"},{"id":4625,"verse_key":"49:13","text_uthmani_simple":"يايها الناس انا خلقنكم من ذكر وانثى وجعلنكم شعوبا وقبائل لتعارفوا۟ ان اكرمكم عند الله اتقىكم ان الله عليم خبير"},{"id":4626,"verse_key":"49:14","text_uthmani_simple":"قالت الاعراب ءامنا قل لم تؤمنوا۟ ولكن قولوا۟ اسلمنا ولما يدخل الايمن فى قلوبكم وان تطيعوا۟ الله ورسوله لا يلتكم من اعملكم شيـا ان الله غفور رحيم"},{"id":4627,"verse_key":"49:15","text_uthmani_simple":"انما المؤمنون الذين ءامنوا۟ بالله ورسوله ثم لم يرتابوا۟ وجهدوا۟ بامولهم وانفسهم فى سبيل الله او۟لئك هم الصدقون"},{"id":4628,"verse_key":"49:16","text_uthmani_simple":"قل اتعلمون الله بدينكم والله يعلم ما فى السموت وما فى الارض والله بكل شىء عليم"},{"id":4629,"verse_key":"49:17","text_uthmani_simple":"يمنون عليك ان اسلموا۟ قل لا تمنوا۟ على اسلمكم بل الله يمن عليكم ان هدىكم للايمن ان كنتم صدقين"},{"id":4630,"verse_key":"49:18","text_uthmani_simple":"ان الله يعلم غيب السموت والارض والله بصيرۢ بما تعملون"},{"id":4631,"verse_key":"50:1","text_uthmani_simple":"ق والقرءان المجيد"},{"id":4632,"verse_key":"50:2","text_uthmani_simple":"بل عجبوا۟ ان جاءهم منذر منهم فقال الكفرون هذا شىء عجيب"},{"id":4633,"verse_key":"50:3","text_uthmani_simple":"اءذا متنا وكنا ترابا ذلك رجعۢ بعيد"},{"id":4634,"verse_key":"50:4","text_uthmani_simple":"قد علمنا ما تنقص الارض منهم وعندنا كتب حفيظۢ"},{"id":4635,"verse_key":"50:5","text_uthmani_simple":"بل كذبوا۟ بالحق لما جاءهم فهم فى امر مريج"},{"id":4636,"verse_key":"50:6","text_uthmani_simple":"افلم ينظروا۟ الى السماء فوقهم كيف بنينها وزينها وما لها من فروج"},{"id":4637,"verse_key":"50:7","text_uthmani_simple":"والارض مددنها والقينا فيها روسى وانۢبتنا فيها من كل زوجۭ بهيج"},{"id":4638,"verse_key":"50:8","text_uthmani_simple":"تبصرة وذكرى لكل عبد منيب"},{"id":4639,"verse_key":"50:9","text_uthmani_simple":"ونزلنا من السماء ماء مبركا فانۢبتنا به جنت وحب الحصيد"},{"id":4640,"verse_key":"50:10","text_uthmani_simple":"والنخل باسقت لها طلع نضيد"},{"id":4641,"verse_key":"50:11","text_uthmani_simple":"رزقا للعباد واحيينا به بلدة ميتا كذلك الخروج"},{"id":4642,"verse_key":"50:12","text_uthmani_simple":"كذبت قبلهم قوم نوح واصحب الرس وثمود"},{"id":4643,"verse_key":"50:13","text_uthmani_simple":"وعاد وفرعون واخون لوط"},{"id":4644,"verse_key":"50:14","text_uthmani_simple":"واصحب الايكة وقوم تبع كل كذب الرسل فحق وعيد"},{"id":4645,"verse_key":"50:15","text_uthmani_simple":"افعيينا بالخلق الاول بل هم فى لبس من خلق جديد"},{"id":4646,"verse_key":"50:16","text_uthmani_simple":"ولقد خلقنا الانسن ونعلم ما توسوس به نفسه ونحن اقرب اليه من حبل الوريد"},{"id":4647,"verse_key":"50:17","text_uthmani_simple":"اذ يتلقى المتلقيان عن اليمين وعن الشمال قعيد"},{"id":4648,"verse_key":"50:18","text_uthmani_simple":"ما يلفظ من قول الا لديه رقيب عتيد"},{"id":4649,"verse_key":"50:19","text_uthmani_simple":"وجاءت سكرة الموت بالحق ذلك ما كنت منه تحيد"},{"id":4650,"verse_key":"50:20","text_uthmani_simple":"ونفخ فى الصور ذلك يوم الوعيد"},{"id":4651,"verse_key":"50:21","text_uthmani_simple":"وجاءت كل نفس معها سائق وشهيد"},{"id":4652,"verse_key":"50:22","text_uthmani_simple":"لقد كنت فى غفلة من هذا فكشفنا عنك غطاءك فبصرك اليوم حديد"},{"id":4653,"verse_key":"50:23","text_uthmani_simple":"وقال قرينه هذا ما لدى عتيد"},{"id":4654,"verse_key":"50:24","text_uthmani_simple":"القيا فى جهنم كل كفار عنيد"},{"id":4655,"verse_key":"50:25","text_uthmani_simple":"مناع للخير معتد مريب"},{"id":4656,"verse_key":"50:26","text_uthmani_simple":"الذى جعل مع الله الها ءاخر فالقياه فى العذاب الشديد"},{"id":4657,"verse_key":"50:27","text_uthmani_simple":"قال قرينه ربنا ما اطغيته ولكن كان فى ضللۭ بعيد"},{"id":4658,"verse_key":"50:28","text_uthmani_simple":"قال لا تختصموا۟ لدى وقد قدمت اليكم بالوعيد"},{"id":4659,"verse_key":"50:29","text_uthmani_simple":"ما يبدل القول لدى وما انا۠ بظلم للعبيد"},{"id":4660,"verse_key":"50:30","text_uthmani_simple":"يوم نقول لجهنم هل امتلات وتقول هل من مزيد"},{"id":4661,"verse_key":"50:31","text_uthmani_simple":"وازلفت الجنة للمتقين غير بعيد"},{"id":4662,"verse_key":"50:32","text_uthmani_simple":"هذا ما توعدون لكل اواب حفيظ"},{"id":4663,"verse_key":"50:33","text_uthmani_simple":"من خشى الرحمن بالغيب وجاء بقلب منيب"},{"id":4664,"verse_key":"50:34","text_uthmani_simple":"ادخلوها بسلم ذلك يوم الخلود"},{"id":4665,"verse_key":"50:35","text_uthmani_simple":"لهم ما يشاءون فيها ولدينا مزيد"},{"id":4666,"verse_key":"50:36","text_uthmani_simple":"وكم اهلكنا قبلهم من قرن هم اشد منهم بطشا فنقبوا۟ فى البلد هل من محيص"},{"id":4667,"verse_key":"50:37","text_uthmani_simple":"ان فى ذلك لذكرى لمن كان له قلب او القى السمع وهو شهيد"},{"id":4668,"verse_key":"50:38","text_uthmani_simple":"ولقد خلقنا السموت والارض وما بينهما فى ستة ايام وما مسنا من لغوب"},{"id":4669,"verse_key":"50:39","text_uthmani_simple":"فاصبر على ما يقولون وسبح بحمد ربك قبل طلوع الشمس وقبل الغروب"},{"id":4670,"verse_key":"50:40","text_uthmani_simple":"ومن اليل فسبحه وادبر السجود"},{"id":4671,"verse_key":"50:41","text_uthmani_simple":"واستمع يوم يناد المناد من مكان قريب"},{"id":4672,"verse_key":"50:42","text_uthmani_simple":"يوم يسمعون الصيحة بالحق ذلك يوم الخروج"},{"id":4673,"verse_key":"50:43","text_uthmani_simple":"انا نحن نحى ونميت والينا المصير"},{"id":4674,"verse_key":"50:44","text_uthmani_simple":"يوم تشقق الارض عنهم سراعا ذلك حشر علينا يسير"},{"id":4675,"verse_key":"50:45","text_uthmani_simple":"نحن اعلم بما يقولون وما انت عليهم بجبار فذكر بالقرءان من يخاف وعيد"},{"id":4676,"verse_key":"51:1","text_uthmani_simple":"والذريت ذروا"},{"id":4677,"verse_key":"51:2","text_uthmani_simple":"فالحملت وقرا"},{"id":4678,"verse_key":"51:3","text_uthmani_simple":"فالجريت يسرا"},{"id":4679,"verse_key":"51:4","text_uthmani_simple":"فالمقسمت امرا"},{"id":4680,"verse_key":"51:5","text_uthmani_simple":"انما توعدون لصادق"},{"id":4681,"verse_key":"51:6","text_uthmani_simple":"وان الدين لوقع"},{"id":4682,"verse_key":"51:7","text_uthmani_simple":"والسماء ذات الحبك"},{"id":4683,"verse_key":"51:8","text_uthmani_simple":"انكم لفى قول مختلف"},{"id":4684,"verse_key":"51:9","text_uthmani_simple":"يؤفك عنه من افك"},{"id":4685,"verse_key":"51:10","text_uthmani_simple":"قتل الخرصون"},{"id":4686,"verse_key":"51:11","text_uthmani_simple":"الذين هم فى غمرة ساهون"},{"id":4687,"verse_key":"51:12","text_uthmani_simple":"يسـلون ايان يوم الدين"},{"id":4688,"verse_key":"51:13","text_uthmani_simple":"يوم هم على النار يفتنون"},{"id":4689,"verse_key":"51:14","text_uthmani_simple":"ذوقوا۟ فتنتكم هذا الذى كنتم به تستعجلون"},{"id":4690,"verse_key":"51:15","text_uthmani_simple":"ان المتقين فى جنت وعيون"},{"id":4691,"verse_key":"51:16","text_uthmani_simple":"ءاخذين ما ءاتىهم ربهم انهم كانوا۟ قبل ذلك محسنين"},{"id":4692,"verse_key":"51:17","text_uthmani_simple":"كانوا۟ قليلا من اليل ما يهجعون"},{"id":4693,"verse_key":"51:18","text_uthmani_simple":"وبالاسحار هم يستغفرون"},{"id":4694,"verse_key":"51:19","text_uthmani_simple":"وفى امولهم حق للسائل والمحروم"},{"id":4695,"verse_key":"51:20","text_uthmani_simple":"وفى الارض ءايت للموقنين"},{"id":4696,"verse_key":"51:21","text_uthmani_simple":"وفى انفسكم افلا تبصرون"},{"id":4697,"verse_key":"51:22","text_uthmani_simple":"وفى السماء رزقكم وما توعدون"},{"id":4698,"verse_key":"51:23","text_uthmani_simple":"فورب السماء والارض انه لحق مثل ما انكم تنطقون"},{"id":4699,"verse_key":"51:24","text_uthmani_simple":"هل اتىك حديث ضيف ابرهيم المكرمين"},{"id":4700,"verse_key":"51:25","text_uthmani_simple":"اذ دخلوا۟ عليه فقالوا۟ سلما قال سلم قوم منكرون"},{"id":4701,"verse_key":"51:26","text_uthmani_simple":"فراغ الى اهله فجاء بعجل سمين"},{"id":4702,"verse_key":"51:27","text_uthmani_simple":"فقربه اليهم قال الا تاكلون"},{"id":4703,"verse_key":"51:28","text_uthmani_simple":"فاوجس منهم خيفة قالوا۟ لا تخف وبشروه بغلم عليم"},{"id":4704,"verse_key":"51:29","text_uthmani_simple":"فاقبلت امراته فى صرة فصكت وجهها وقالت عجوز عقيم"},{"id":4705,"verse_key":"51:30","text_uthmani_simple":"قالوا۟ كذلك قال ربك انه هو الحكيم العليم"}],"meta":{"filters":{"juz_number":"26"}}}
