{"verses":[{"id":2484,"verse_key":"21:1","text_uthmani_simple":"اقترب للناس حسابهم وهم فى غفلة معرضون"},{"id":2485,"verse_key":"21:2","text_uthmani_simple":"ما ياتيهم من ذكر من ربهم محدث الا استمعوه وهم يلعبون"},{"id":2486,"verse_key":"21:3","text_uthmani_simple":"لاهية قلوبهم واسروا۟ النجوى الذين ظلموا۟ هل هذا الا بشر مثلكم افتاتون السحر وانتم تبصرون"},{"id":2487,"verse_key":"21:4","text_uthmani_simple":"قال ربى يعلم القول فى السماء والارض وهو السميع العليم"},{"id":2488,"verse_key":"21:5","text_uthmani_simple":"بل قالوا۟ اضغث احلمۭ بل افترىه بل هو شاعر فلياتنا بـاية كما ارسل الاولون"},{"id":2489,"verse_key":"21:6","text_uthmani_simple":"ما ءامنت قبلهم من قرية اهلكنها افهم يؤمنون"},{"id":2490,"verse_key":"21:7","text_uthmani_simple":"وما ارسلنا قبلك الا رجالا نوحى اليهم فسـلوا۟ اهل الذكر ان كنتم لا تعلمون"},{"id":2491,"verse_key":"21:8","text_uthmani_simple":"وما جعلنهم جسدا لا ياكلون الطعام وما كانوا۟ خلدين"},{"id":2492,"verse_key":"21:9","text_uthmani_simple":"ثم صدقنهم الوعد فانجينهم ومن نشاء واهلكنا المسرفين"},{"id":2493,"verse_key":"21:10","text_uthmani_simple":"لقد انزلنا اليكم كتبا فيه ذكركم افلا تعقلون"},{"id":2494,"verse_key":"21:11","text_uthmani_simple":"وكم قصمنا من قرية كانت ظالمة وانشانا بعدها قوما ءاخرين"},{"id":2495,"verse_key":"21:12","text_uthmani_simple":"فلما احسوا۟ باسنا اذا هم منها يركضون"},{"id":2496,"verse_key":"21:13","text_uthmani_simple":"لا تركضوا۟ وارجعوا۟ الى ما اترفتم فيه ومسكنكم لعلكم تسـلون"},{"id":2497,"verse_key":"21:14","text_uthmani_simple":"قالوا۟ يويلنا انا كنا ظلمين"},{"id":2498,"verse_key":"21:15","text_uthmani_simple":"فما زالت تلك دعوىهم حتى جعلنهم حصيدا خمدين"},{"id":2499,"verse_key":"21:16","text_uthmani_simple":"وما خلقنا السماء والارض وما بينهما لعبين"},{"id":2500,"verse_key":"21:17","text_uthmani_simple":"لو اردنا ان نتخذ لهوا لاتخذنه من لدنا ان كنا فعلين"},{"id":2501,"verse_key":"21:18","text_uthmani_simple":"بل نقذف بالحق على البطل فيدمغه فاذا هو زاهق ولكم الويل مما تصفون"},{"id":2502,"verse_key":"21:19","text_uthmani_simple":"وله من فى السموت والارض ومن عنده لا يستكبرون عن عبادته ولا يستحسرون"},{"id":2503,"verse_key":"21:20","text_uthmani_simple":"يسبحون اليل والنهار لا يفترون"},{"id":2504,"verse_key":"21:21","text_uthmani_simple":"ام اتخذوا۟ ءالهة من الارض هم ينشرون"},{"id":2505,"verse_key":"21:22","text_uthmani_simple":"لو كان فيهما ءالهة الا الله لفسدتا فسبحن الله رب العرش عما يصفون"},{"id":2506,"verse_key":"21:23","text_uthmani_simple":"لا يسـل عما يفعل وهم يسـلون"},{"id":2507,"verse_key":"21:24","text_uthmani_simple":"ام اتخذوا۟ من دونه ءالهة قل هاتوا۟ برهنكم هذا ذكر من معى وذكر من قبلى بل اكثرهم لا يعلمون الحق فهم معرضون"},{"id":2508,"verse_key":"21:25","text_uthmani_simple":"وما ارسلنا من قبلك من رسول الا نوحى اليه انه لا اله الا انا۠ فاعبدون"},{"id":2509,"verse_key":"21:26","text_uthmani_simple":"وقالوا۟ اتخذ الرحمن ولدا سبحنه بل عباد مكرمون"},{"id":2510,"verse_key":"21:27","text_uthmani_simple":"لا يسبقونه بالقول وهم بامره يعملون"},{"id":2511,"verse_key":"21:28","text_uthmani_simple":"يعلم ما بين ايديهم وما خلفهم ولا يشفعون الا لمن ارتضى وهم من خشيته مشفقون"},{"id":2512,"verse_key":"21:29","text_uthmani_simple":"ومن يقل منهم انى اله من دونه فذلك نجزيه جهنم كذلك نجزى الظلمين"},{"id":2513,"verse_key":"21:30","text_uthmani_simple":"اولم ير الذين كفروا۟ ان السموت والارض كانتا رتقا ففتقنهما وجعلنا من الماء كل شىء حى افلا يؤمنون"},{"id":2514,"verse_key":"21:31","text_uthmani_simple":"وجعلنا فى الارض روسى ان تميد بهم وجعلنا فيها فجاجا سبلا لعلهم يهتدون"},{"id":2515,"verse_key":"21:32","text_uthmani_simple":"وجعلنا السماء سقفا محفوظا وهم عن ءايتها معرضون"},{"id":2516,"verse_key":"21:33","text_uthmani_simple":"وهو الذى خلق اليل والنهار والشمس والقمر كل فى فلك يسبحون"},{"id":2517,"verse_key":"21:34","text_uthmani_simple":"وما جعلنا لبشر من قبلك الخلد افاي۟ن مت فهم الخلدون"},{"id":2518,"verse_key":"21:35","text_uthmani_simple":"كل نفس ذائقة الموت ونبلوكم بالشر والخير فتنة والينا ترجعون"},{"id":2519,"verse_key":"21:36","text_uthmani_simple":"واذا رءاك الذين كفروا۟ ان يتخذونك الا هزوا اهذا الذى يذكر ءالهتكم وهم بذكر الرحمن هم كفرون"},{"id":2520,"verse_key":"21:37","text_uthmani_simple":"خلق الانسن من عجل ساو۟ريكم ءايتى فلا تستعجلون"},{"id":2521,"verse_key":"21:38","text_uthmani_simple":"ويقولون متى هذا الوعد ان كنتم صدقين"},{"id":2522,"verse_key":"21:39","text_uthmani_simple":"لو يعلم الذين كفروا۟ حين لا يكفون عن وجوههم النار ولا عن ظهورهم ولا هم ينصرون"},{"id":2523,"verse_key":"21:40","text_uthmani_simple":"بل تاتيهم بغتة فتبهتهم فلا يستطيعون ردها ولا هم ينظرون"},{"id":2524,"verse_key":"21:41","text_uthmani_simple":"ولقد استهزئ برسل من قبلك فحاق بالذين سخروا۟ منهم ما كانوا۟ به يستهزءون"},{"id":2525,"verse_key":"21:42","text_uthmani_simple":"قل من يكلؤكم باليل والنهار من الرحمن بل هم عن ذكر ربهم معرضون"},{"id":2526,"verse_key":"21:43","text_uthmani_simple":"ام لهم ءالهة تمنعهم من دوننا لا يستطيعون نصر انفسهم ولا هم منا يصحبون"},{"id":2527,"verse_key":"21:44","text_uthmani_simple":"بل متعنا هؤلاء وءاباءهم حتى طال عليهم العمر افلا يرون انا ناتى الارض ننقصها من اطرافها افهم الغلبون"},{"id":2528,"verse_key":"21:45","text_uthmani_simple":"قل انما انذركم بالوحى ولا يسمع الصم الدعاء اذا ما ينذرون"},{"id":2529,"verse_key":"21:46","text_uthmani_simple":"ولئن مستهم نفحة من عذاب ربك ليقولن يويلنا انا كنا ظلمين"},{"id":2530,"verse_key":"21:47","text_uthmani_simple":"ونضع الموزين القسط ليوم القيمة فلا تظلم نفس شيـا وان كان مثقال حبة من خردل اتينا بها وكفى بنا حسبين"},{"id":2531,"verse_key":"21:48","text_uthmani_simple":"ولقد ءاتينا موسى وهرون الفرقان وضياء وذكرا للمتقين"},{"id":2532,"verse_key":"21:49","text_uthmani_simple":"الذين يخشون ربهم بالغيب وهم من الساعة مشفقون"},{"id":2533,"verse_key":"21:50","text_uthmani_simple":"وهذا ذكر مبارك انزلنه افانتم له منكرون"},{"id":2534,"verse_key":"21:51","text_uthmani_simple":"ولقد ءاتينا ابرهيم رشده من قبل وكنا به علمين"},{"id":2535,"verse_key":"21:52","text_uthmani_simple":"اذ قال لابيه وقومه ما هذه التماثيل التى انتم لها عكفون"},{"id":2536,"verse_key":"21:53","text_uthmani_simple":"قالوا۟ وجدنا ءاباءنا لها عبدين"},{"id":2537,"verse_key":"21:54","text_uthmani_simple":"قال لقد كنتم انتم وءاباؤكم فى ضلل مبين"},{"id":2538,"verse_key":"21:55","text_uthmani_simple":"قالوا۟ اجئتنا بالحق ام انت من اللعبين"},{"id":2539,"verse_key":"21:56","text_uthmani_simple":"قال بل ربكم رب السموت والارض الذى فطرهن وانا۠ على ذلكم من الشهدين"},{"id":2540,"verse_key":"21:57","text_uthmani_simple":"وتالله لاكيدن اصنمكم بعد ان تولوا۟ مدبرين"},{"id":2541,"verse_key":"21:58","text_uthmani_simple":"فجعلهم جذذا الا كبيرا لهم لعلهم اليه يرجعون"},{"id":2542,"verse_key":"21:59","text_uthmani_simple":"قالوا۟ من فعل هذا بـالهتنا انه لمن الظلمين"},{"id":2543,"verse_key":"21:60","text_uthmani_simple":"قالوا۟ سمعنا فتى يذكرهم يقال له ابرهيم"},{"id":2544,"verse_key":"21:61","text_uthmani_simple":"قالوا۟ فاتوا۟ به على اعين الناس لعلهم يشهدون"},{"id":2545,"verse_key":"21:62","text_uthmani_simple":"قالوا۟ ءانت فعلت هذا بـالهتنا يابرهيم"},{"id":2546,"verse_key":"21:63","text_uthmani_simple":"قال بل فعله كبيرهم هذا فسـلوهم ان كانوا۟ ينطقون"},{"id":2547,"verse_key":"21:64","text_uthmani_simple":"فرجعوا۟ الى انفسهم فقالوا۟ انكم انتم الظلمون"},{"id":2548,"verse_key":"21:65","text_uthmani_simple":"ثم نكسوا۟ على رءوسهم لقد علمت ما هؤلاء ينطقون"},{"id":2549,"verse_key":"21:66","text_uthmani_simple":"قال افتعبدون من دون الله ما لا ينفعكم شيـا ولا يضركم"},{"id":2550,"verse_key":"21:67","text_uthmani_simple":"اف لكم ولما تعبدون من دون الله افلا تعقلون"},{"id":2551,"verse_key":"21:68","text_uthmani_simple":"قالوا۟ حرقوه وانصروا۟ ءالهتكم ان كنتم فعلين"},{"id":2552,"verse_key":"21:69","text_uthmani_simple":"قلنا ينار كونى بردا وسلما على ابرهيم"},{"id":2553,"verse_key":"21:70","text_uthmani_simple":"وارادوا۟ به كيدا فجعلنهم الاخسرين"},{"id":2554,"verse_key":"21:71","text_uthmani_simple":"ونجينه ولوطا الى الارض التى بركنا فيها للعلمين"},{"id":2555,"verse_key":"21:72","text_uthmani_simple":"ووهبنا له اسحق ويعقوب نافلة وكلا جعلنا صلحين"},{"id":2556,"verse_key":"21:73","text_uthmani_simple":"وجعلنهم ائمة يهدون بامرنا واوحينا اليهم فعل الخيرت واقام الصلوة وايتاء الزكوة وكانوا۟ لنا عبدين"},{"id":2557,"verse_key":"21:74","text_uthmani_simple":"ولوطا ءاتينه حكما وعلما ونجينه من القرية التى كانت تعمل الخبئث انهم كانوا۟ قوم سوء فسقين"},{"id":2558,"verse_key":"21:75","text_uthmani_simple":"وادخلنه فى رحمتنا انه من الصلحين"},{"id":2559,"verse_key":"21:76","text_uthmani_simple":"ونوحا اذ نادى من قبل فاستجبنا له فنجينه واهله من الكرب العظيم"},{"id":2560,"verse_key":"21:77","text_uthmani_simple":"ونصرنه من القوم الذين كذبوا۟ بـايتنا انهم كانوا۟ قوم سوء فاغرقنهم اجمعين"},{"id":2561,"verse_key":"21:78","text_uthmani_simple":"وداود وسليمن اذ يحكمان فى الحرث اذ نفشت فيه غنم القوم وكنا لحكمهم شهدين"},{"id":2562,"verse_key":"21:79","text_uthmani_simple":"ففهمنها سليمن وكلا ءاتينا حكما وعلما وسخرنا مع داود الجبال يسبحن والطير وكنا فعلين"},{"id":2563,"verse_key":"21:80","text_uthmani_simple":"وعلمنه صنعة لبوس لكم لتحصنكم منۢ باسكم فهل انتم شكرون"},{"id":2564,"verse_key":"21:81","text_uthmani_simple":"ولسليمن الريح عاصفة تجرى بامره الى الارض التى بركنا فيها وكنا بكل شىء علمين"},{"id":2565,"verse_key":"21:82","text_uthmani_simple":"ومن الشيطين من يغوصون له ويعملون عملا دون ذلك وكنا لهم حفظين"},{"id":2566,"verse_key":"21:83","text_uthmani_simple":"وايوب اذ نادى ربه انى مسنى الضر وانت ارحم الرحمين"},{"id":2567,"verse_key":"21:84","text_uthmani_simple":"فاستجبنا له فكشفنا ما به من ضر وءاتينه اهله ومثلهم معهم رحمة من عندنا وذكرى للعبدين"},{"id":2568,"verse_key":"21:85","text_uthmani_simple":"واسمعيل وادريس وذا الكفل كل من الصبرين"},{"id":2569,"verse_key":"21:86","text_uthmani_simple":"وادخلنهم فى رحمتنا انهم من الصلحين"},{"id":2570,"verse_key":"21:87","text_uthmani_simple":"وذا النون اذ ذهب مغضبا فظن ان لن نقدر عليه فنادى فى الظلمت ان لا اله الا انت سبحنك انى كنت من الظلمين"},{"id":2571,"verse_key":"21:88","text_uthmani_simple":"فاستجبنا له ونجينه من الغم وكذلك نۨجى المؤمنين"},{"id":2572,"verse_key":"21:89","text_uthmani_simple":"وزكريا اذ نادى ربه رب لا تذرنى فردا وانت خير الورثين"},{"id":2573,"verse_key":"21:90","text_uthmani_simple":"فاستجبنا له ووهبنا له يحيى واصلحنا له زوجه انهم كانوا۟ يسرعون فى الخيرت ويدعوننا رغبا ورهبا وكانوا۟ لنا خشعين"},{"id":2574,"verse_key":"21:91","text_uthmani_simple":"والتى احصنت فرجها فنفخنا فيها من روحنا وجعلنها وابنها ءاية للعلمين"},{"id":2575,"verse_key":"21:92","text_uthmani_simple":"ان هذه امتكم امة وحدة وانا۠ ربكم فاعبدون"},{"id":2576,"verse_key":"21:93","text_uthmani_simple":"وتقطعوا۟ امرهم بينهم كل الينا رجعون"},{"id":2577,"verse_key":"21:94","text_uthmani_simple":"فمن يعمل من الصلحت وهو مؤمن فلا كفران لسعيه وانا له كتبون"},{"id":2578,"verse_key":"21:95","text_uthmani_simple":"وحرم على قرية اهلكنها انهم لا يرجعون"},{"id":2579,"verse_key":"21:96","text_uthmani_simple":"حتى اذا فتحت ياجوج وماجوج وهم من كل حدب ينسلون"},{"id":2580,"verse_key":"21:97","text_uthmani_simple":"واقترب الوعد الحق فاذا هى شخصة ابصر الذين كفروا۟ يويلنا قد كنا فى غفلة من هذا بل كنا ظلمين"},{"id":2581,"verse_key":"21:98","text_uthmani_simple":"انكم وما تعبدون من دون الله حصب جهنم انتم لها وردون"},{"id":2582,"verse_key":"21:99","text_uthmani_simple":"لو كان هؤلاء ءالهة ما وردوها وكل فيها خلدون"},{"id":2583,"verse_key":"21:100","text_uthmani_simple":"لهم فيها زفير وهم فيها لا يسمعون"},{"id":2584,"verse_key":"21:101","text_uthmani_simple":"ان الذين سبقت لهم منا الحسنى او۟لئك عنها مبعدون"},{"id":2585,"verse_key":"21:102","text_uthmani_simple":"لا يسمعون حسيسها وهم فى ما اشتهت انفسهم خلدون"},{"id":2586,"verse_key":"21:103","text_uthmani_simple":"لا يحزنهم الفزع الاكبر وتتلقىهم الملئكة هذا يومكم الذى كنتم توعدون"},{"id":2587,"verse_key":"21:104","text_uthmani_simple":"يوم نطوى السماء كطى السجل للكتب كما بدانا اول خلق نعيده وعدا علينا انا كنا فعلين"},{"id":2588,"verse_key":"21:105","text_uthmani_simple":"ولقد كتبنا فى الزبور منۢ بعد الذكر ان الارض يرثها عبادى الصلحون"},{"id":2589,"verse_key":"21:106","text_uthmani_simple":"ان فى هذا لبلغا لقوم عبدين"},{"id":2590,"verse_key":"21:107","text_uthmani_simple":"وما ارسلنك الا رحمة للعلمين"},{"id":2591,"verse_key":"21:108","text_uthmani_simple":"قل انما يوحى الى انما الهكم اله وحد فهل انتم مسلمون"},{"id":2592,"verse_key":"21:109","text_uthmani_simple":"فان تولوا۟ فقل ءاذنتكم على سواء وان ادرى اقريب ام بعيد ما توعدون"},{"id":2593,"verse_key":"21:110","text_uthmani_simple":"انه يعلم الجهر من القول ويعلم ما تكتمون"},{"id":2594,"verse_key":"21:111","text_uthmani_simple":"وان ادرى لعله فتنة لكم ومتع الى حين"},{"id":2595,"verse_key":"21:112","text_uthmani_simple":"قل رب احكم بالحق وربنا الرحمن المستعان على ما تصفون"},{"id":2596,"verse_key":"22:1","text_uthmani_simple":"يايها الناس اتقوا۟ ربكم ان زلزلة الساعة شىء عظيم"},{"id":2597,"verse_key":"22:2","text_uthmani_simple":"يوم ترونها تذهل كل مرضعة عما ارضعت وتضع كل ذات حمل حملها وترى الناس سكرى وما هم بسكرى ولكن عذاب الله شديد"},{"id":2598,"verse_key":"22:3","text_uthmani_simple":"ومن الناس من يجدل فى الله بغير علم ويتبع كل شيطن مريد"},{"id":2599,"verse_key":"22:4","text_uthmani_simple":"كتب عليه انه من تولاه فانه يضله ويهديه الى عذاب السعير"},{"id":2600,"verse_key":"22:5","text_uthmani_simple":"يايها الناس ان كنتم فى ريب من البعث فانا خلقنكم من تراب ثم من نطفة ثم من علقة ثم من مضغة مخلقة وغير مخلقة لنبين لكم ونقر فى الارحام ما نشاء الى اجل مسمى ثم نخرجكم طفلا ثم لتبلغوا۟ اشدكم ومنكم من يتوفى ومنكم من يرد الى ارذل العمر لكيلا يعلم منۢ بعد علم شيـا وترى الارض هامدة فاذا انزلنا عليها الماء اهتزت وربت وانۢبتت من كل زوجۭ بهيج"},{"id":2601,"verse_key":"22:6","text_uthmani_simple":"ذلك بان الله هو الحق وانه يحى الموتى وانه على كل شىء قدير"},{"id":2602,"verse_key":"22:7","text_uthmani_simple":"وان الساعة ءاتية لا ريب فيها وان الله يبعث من فى القبور"},{"id":2603,"verse_key":"22:8","text_uthmani_simple":"ومن الناس من يجدل فى الله بغير علم ولا هدى ولا كتب منير"},{"id":2604,"verse_key":"22:9","text_uthmani_simple":"ثانى عطفه ليضل عن سبيل الله له فى الدنيا خزى ونذيقه يوم القيمة عذاب الحريق"},{"id":2605,"verse_key":"22:10","text_uthmani_simple":"ذلك بما قدمت يداك وان الله ليس بظلم للعبيد"},{"id":2606,"verse_key":"22:11","text_uthmani_simple":"ومن الناس من يعبد الله على حرف فان اصابه خير اطمان به وان اصابته فتنة انقلب على وجهه خسر الدنيا والءاخرة ذلك هو الخسران المبين"},{"id":2607,"verse_key":"22:12","text_uthmani_simple":"يدعوا۟ من دون الله ما لا يضره وما لا ينفعه ذلك هو الضلل البعيد"},{"id":2608,"verse_key":"22:13","text_uthmani_simple":"يدعوا۟ لمن ضره اقرب من نفعه لبئس المولى ولبئس العشير"},{"id":2609,"verse_key":"22:14","text_uthmani_simple":"ان الله يدخل الذين ءامنوا۟ وعملوا۟ الصلحت جنت تجرى من تحتها الانهر ان الله يفعل ما يريد"},{"id":2610,"verse_key":"22:15","text_uthmani_simple":"من كان يظن ان لن ينصره الله فى الدنيا والءاخرة فليمدد بسبب الى السماء ثم ليقطع فلينظر هل يذهبن كيده ما يغيظ"},{"id":2611,"verse_key":"22:16","text_uthmani_simple":"وكذلك انزلنه ءايتۭ بينت وان الله يهدى من يريد"},{"id":2612,"verse_key":"22:17","text_uthmani_simple":"ان الذين ءامنوا۟ والذين هادوا۟ والصبـين والنصرى والمجوس والذين اشركوا۟ ان الله يفصل بينهم يوم القيمة ان الله على كل شىء شهيد"},{"id":2613,"verse_key":"22:18","text_uthmani_simple":"الم تر ان الله يسجد له من فى السموت ومن فى الارض والشمس والقمر والنجوم والجبال والشجر والدواب وكثير من الناس وكثير حق عليه العذاب ومن يهن الله فما له من مكرم ان الله يفعل ما يشاء"},{"id":2614,"verse_key":"22:19","text_uthmani_simple":"هذان خصمان اختصموا۟ فى ربهم فالذين كفروا۟ قطعت لهم ثياب من نار يصب من فوق رءوسهم الحميم"},{"id":2615,"verse_key":"22:20","text_uthmani_simple":"يصهر به ما فى بطونهم والجلود"},{"id":2616,"verse_key":"22:21","text_uthmani_simple":"ولهم مقمع من حديد"},{"id":2617,"verse_key":"22:22","text_uthmani_simple":"كلما ارادوا۟ ان يخرجوا۟ منها من غم اعيدوا۟ فيها وذوقوا۟ عذاب الحريق"},{"id":2618,"verse_key":"22:23","text_uthmani_simple":"ان الله يدخل الذين ءامنوا۟ وعملوا۟ الصلحت جنت تجرى من تحتها الانهر يحلون فيها من اساور من ذهب ولؤلؤا ولباسهم فيها حرير"},{"id":2619,"verse_key":"22:24","text_uthmani_simple":"وهدوا۟ الى الطيب من القول وهدوا۟ الى صرط الحميد"},{"id":2620,"verse_key":"22:25","text_uthmani_simple":"ان الذين كفروا۟ ويصدون عن سبيل الله والمسجد الحرام الذى جعلنه للناس سواء العكف فيه والباد ومن يرد فيه بالحادۭ بظلم نذقه من عذاب اليم"},{"id":2621,"verse_key":"22:26","text_uthmani_simple":"واذ بوانا لابرهيم مكان البيت ان لا تشرك بى شيـا وطهر بيتى للطائفين والقائمين والركع السجود"},{"id":2622,"verse_key":"22:27","text_uthmani_simple":"واذن فى الناس بالحج ياتوك رجالا وعلى كل ضامر ياتين من كل فج عميق"},{"id":2623,"verse_key":"22:28","text_uthmani_simple":"ليشهدوا۟ منفع لهم ويذكروا۟ اسم الله فى ايام معلومت على ما رزقهم منۢ بهيمة الانعم فكلوا۟ منها واطعموا۟ البائس الفقير"},{"id":2624,"verse_key":"22:29","text_uthmani_simple":"ثم ليقضوا۟ تفثهم وليوفوا۟ نذورهم وليطوفوا۟ بالبيت العتيق"},{"id":2625,"verse_key":"22:30","text_uthmani_simple":"ذلك ومن يعظم حرمت الله فهو خير له عند ربه واحلت لكم الانعم الا ما يتلى عليكم فاجتنبوا۟ الرجس من الاوثن واجتنبوا۟ قول الزور"},{"id":2626,"verse_key":"22:31","text_uthmani_simple":"حنفاء لله غير مشركين به ومن يشرك بالله فكانما خر من السماء فتخطفه الطير او تهوى به الريح فى مكان سحيق"},{"id":2627,"verse_key":"22:32","text_uthmani_simple":"ذلك ومن يعظم شعئر الله فانها من تقوى القلوب"},{"id":2628,"verse_key":"22:33","text_uthmani_simple":"لكم فيها منفع الى اجل مسمى ثم محلها الى البيت العتيق"},{"id":2629,"verse_key":"22:34","text_uthmani_simple":"ولكل امة جعلنا منسكا ليذكروا۟ اسم الله على ما رزقهم منۢ بهيمة الانعم فالهكم اله وحد فله اسلموا۟ وبشر المخبتين"},{"id":2630,"verse_key":"22:35","text_uthmani_simple":"الذين اذا ذكر الله وجلت قلوبهم والصبرين على ما اصابهم والمقيمى الصلوة ومما رزقنهم ينفقون"},{"id":2631,"verse_key":"22:36","text_uthmani_simple":"والبدن جعلنها لكم من شعئر الله لكم فيها خير فاذكروا۟ اسم الله عليها صواف فاذا وجبت جنوبها فكلوا۟ منها واطعموا۟ القانع والمعتر كذلك سخرنها لكم لعلكم تشكرون"},{"id":2632,"verse_key":"22:37","text_uthmani_simple":"لن ينال الله لحومها ولا دماؤها ولكن يناله التقوى منكم كذلك سخرها لكم لتكبروا۟ الله على ما هدىكم وبشر المحسنين"},{"id":2633,"verse_key":"22:38","text_uthmani_simple":"ان الله يدفع عن الذين ءامنوا۟ ان الله لا يحب كل خوان كفور"},{"id":2634,"verse_key":"22:39","text_uthmani_simple":"اذن للذين يقتلون بانهم ظلموا۟ وان الله على نصرهم لقدير"},{"id":2635,"verse_key":"22:40","text_uthmani_simple":"الذين اخرجوا۟ من ديرهم بغير حق الا ان يقولوا۟ ربنا الله ولولا دفع الله الناس بعضهم ببعض لهدمت صومع وبيع وصلوت ومسجد يذكر فيها اسم الله كثيرا ولينصرن الله من ينصره ان الله لقوى عزيز"},{"id":2636,"verse_key":"22:41","text_uthmani_simple":"الذين ان مكنهم فى الارض اقاموا۟ الصلوة وءاتوا۟ الزكوة وامروا۟ بالمعروف ونهوا۟ عن المنكر ولله عقبة الامور"},{"id":2637,"verse_key":"22:42","text_uthmani_simple":"وان يكذبوك فقد كذبت قبلهم قوم نوح وعاد وثمود"},{"id":2638,"verse_key":"22:43","text_uthmani_simple":"وقوم ابرهيم وقوم لوط"},{"id":2639,"verse_key":"22:44","text_uthmani_simple":"واصحب مدين وكذب موسى فامليت للكفرين ثم اخذتهم فكيف كان نكير"},{"id":2640,"verse_key":"22:45","text_uthmani_simple":"فكاين من قرية اهلكنها وهى ظالمة فهى خاوية على عروشها وبئر معطلة وقصر مشيد"},{"id":2641,"verse_key":"22:46","text_uthmani_simple":"افلم يسيروا۟ فى الارض فتكون لهم قلوب يعقلون بها او ءاذان يسمعون بها فانها لا تعمى الابصر ولكن تعمى القلوب التى فى الصدور"},{"id":2642,"verse_key":"22:47","text_uthmani_simple":"ويستعجلونك بالعذاب ولن يخلف الله وعده وان يوما عند ربك كالف سنة مما تعدون"},{"id":2643,"verse_key":"22:48","text_uthmani_simple":"وكاين من قرية امليت لها وهى ظالمة ثم اخذتها والى المصير"},{"id":2644,"verse_key":"22:49","text_uthmani_simple":"قل يايها الناس انما انا۠ لكم نذير مبين"},{"id":2645,"verse_key":"22:50","text_uthmani_simple":"فالذين ءامنوا۟ وعملوا۟ الصلحت لهم مغفرة ورزق كريم"},{"id":2646,"verse_key":"22:51","text_uthmani_simple":"والذين سعوا۟ فى ءايتنا معجزين او۟لئك اصحب الجحيم"},{"id":2647,"verse_key":"22:52","text_uthmani_simple":"وما ارسلنا من قبلك من رسول ولا نبى الا اذا تمنى القى الشيطن فى امنيته فينسخ الله ما يلقى الشيطن ثم يحكم الله ءايته والله عليم حكيم"},{"id":2648,"verse_key":"22:53","text_uthmani_simple":"ليجعل ما يلقى الشيطن فتنة للذين فى قلوبهم مرض والقاسية قلوبهم وان الظلمين لفى شقاقۭ بعيد"},{"id":2649,"verse_key":"22:54","text_uthmani_simple":"وليعلم الذين اوتوا۟ العلم انه الحق من ربك فيؤمنوا۟ به فتخبت له قلوبهم وان الله لهاد الذين ءامنوا۟ الى صرط مستقيم"},{"id":2650,"verse_key":"22:55","text_uthmani_simple":"ولا يزال الذين كفروا۟ فى مرية منه حتى تاتيهم الساعة بغتة او ياتيهم عذاب يوم عقيم"},{"id":2651,"verse_key":"22:56","text_uthmani_simple":"الملك يومئذ لله يحكم بينهم فالذين ءامنوا۟ وعملوا۟ الصلحت فى جنت النعيم"},{"id":2652,"verse_key":"22:57","text_uthmani_simple":"والذين كفروا۟ وكذبوا۟ بـايتنا فاو۟لئك لهم عذاب مهين"},{"id":2653,"verse_key":"22:58","text_uthmani_simple":"والذين هاجروا۟ فى سبيل الله ثم قتلوا۟ او ماتوا۟ ليرزقنهم الله رزقا حسنا وان الله لهو خير الرزقين"},{"id":2654,"verse_key":"22:59","text_uthmani_simple":"ليدخلنهم مدخلا يرضونه وان الله لعليم حليم"},{"id":2655,"verse_key":"22:60","text_uthmani_simple":"ذلك ومن عاقب بمثل ما عوقب به ثم بغى عليه لينصرنه الله ان الله لعفو غفور"},{"id":2656,"verse_key":"22:61","text_uthmani_simple":"ذلك بان الله يولج اليل فى النهار ويولج النهار فى اليل وان الله سميعۢ بصير"},{"id":2657,"verse_key":"22:62","text_uthmani_simple":"ذلك بان الله هو الحق وان ما يدعون من دونه هو البطل وان الله هو العلى الكبير"},{"id":2658,"verse_key":"22:63","text_uthmani_simple":"الم تر ان الله انزل من السماء ماء فتصبح الارض مخضرة ان الله لطيف خبير"},{"id":2659,"verse_key":"22:64","text_uthmani_simple":"له ما فى السموت وما فى الارض وان الله لهو الغنى الحميد"},{"id":2660,"verse_key":"22:65","text_uthmani_simple":"الم تر ان الله سخر لكم ما فى الارض والفلك تجرى فى البحر بامره ويمسك السماء ان تقع على الارض الا باذنه ان الله بالناس لرءوف رحيم"},{"id":2661,"verse_key":"22:66","text_uthmani_simple":"وهو الذى احياكم ثم يميتكم ثم يحييكم ان الانسن لكفور"},{"id":2662,"verse_key":"22:67","text_uthmani_simple":"لكل امة جعلنا منسكا هم ناسكوه فلا ينزعنك فى الامر وادع الى ربك انك لعلى هدى مستقيم"},{"id":2663,"verse_key":"22:68","text_uthmani_simple":"وان جدلوك فقل الله اعلم بما تعملون"},{"id":2664,"verse_key":"22:69","text_uthmani_simple":"الله يحكم بينكم يوم القيمة فيما كنتم فيه تختلفون"},{"id":2665,"verse_key":"22:70","text_uthmani_simple":"الم تعلم ان الله يعلم ما فى السماء والارض ان ذلك فى كتب ان ذلك على الله يسير"},{"id":2666,"verse_key":"22:71","text_uthmani_simple":"ويعبدون من دون الله ما لم ينزل به سلطنا وما ليس لهم به علم وما للظلمين من نصير"},{"id":2667,"verse_key":"22:72","text_uthmani_simple":"واذا تتلى عليهم ءايتنا بينت تعرف فى وجوه الذين كفروا۟ المنكر يكادون يسطون بالذين يتلون عليهم ءايتنا قل افانبئكم بشر من ذلكم النار وعدها الله الذين كفروا۟ وبئس المصير"},{"id":2668,"verse_key":"22:73","text_uthmani_simple":"يايها الناس ضرب مثل فاستمعوا۟ له ان الذين تدعون من دون الله لن يخلقوا۟ ذبابا ولو اجتمعوا۟ له وان يسلبهم الذباب شيـا لا يستنقذوه منه ضعف الطالب والمطلوب"},{"id":2669,"verse_key":"22:74","text_uthmani_simple":"ما قدروا۟ الله حق قدره ان الله لقوى عزيز"},{"id":2670,"verse_key":"22:75","text_uthmani_simple":"الله يصطفى من الملئكة رسلا ومن الناس ان الله سميعۢ بصير"},{"id":2671,"verse_key":"22:76","text_uthmani_simple":"يعلم ما بين ايديهم وما خلفهم والى الله ترجع الامور"},{"id":2672,"verse_key":"22:77","text_uthmani_simple":"يايها الذين ءامنوا۟ اركعوا۟ واسجدوا۟ واعبدوا۟ ربكم وافعلوا۟ الخير لعلكم تفلحون"},{"id":2673,"verse_key":"22:78","text_uthmani_simple":"وجهدوا۟ فى الله حق جهاده هو اجتبىكم وما جعل عليكم فى الدين من حرج ملة ابيكم ابرهيم هو سمىكم المسلمين من قبل وفى هذا ليكون الرسول شهيدا عليكم وتكونوا۟ شهداء على الناس فاقيموا۟ الصلوة وءاتوا۟ الزكوة واعتصموا۟ بالله هو مولىكم فنعم المولى ونعم النصير"}],"meta":{"filters":{"juz_number":"17"}}}
