{"verses":[{"id":1649,"verse_key":"12:53","text_uthmani_simple":"وما ابرئ نفسى ان النفس لامارةۢ بالسوء الا ما رحم ربى ان ربى غفور رحيم"},{"id":1650,"verse_key":"12:54","text_uthmani_simple":"وقال الملك ائتونى به استخلصه لنفسى فلما كلمه قال انك اليوم لدينا مكين امين"},{"id":1651,"verse_key":"12:55","text_uthmani_simple":"قال اجعلنى على خزائن الارض انى حفيظ عليم"},{"id":1652,"verse_key":"12:56","text_uthmani_simple":"وكذلك مكنا ليوسف فى الارض يتبوا منها حيث يشاء نصيب برحمتنا من نشاء ولا نضيع اجر المحسنين"},{"id":1653,"verse_key":"12:57","text_uthmani_simple":"ولاجر الءاخرة خير للذين ءامنوا۟ وكانوا۟ يتقون"},{"id":1654,"verse_key":"12:58","text_uthmani_simple":"وجاء اخوة يوسف فدخلوا۟ عليه فعرفهم وهم له منكرون"},{"id":1655,"verse_key":"12:59","text_uthmani_simple":"ولما جهزهم بجهازهم قال ائتونى باخ لكم من ابيكم الا ترون انى اوفى الكيل وانا۠ خير المنزلين"},{"id":1656,"verse_key":"12:60","text_uthmani_simple":"فان لم تاتونى به فلا كيل لكم عندى ولا تقربون"},{"id":1657,"verse_key":"12:61","text_uthmani_simple":"قالوا۟ سنرود عنه اباه وانا لفعلون"},{"id":1658,"verse_key":"12:62","text_uthmani_simple":"وقال لفتينه اجعلوا۟ بضعتهم فى رحالهم لعلهم يعرفونها اذا انقلبوا۟ الى اهلهم لعلهم يرجعون"},{"id":1659,"verse_key":"12:63","text_uthmani_simple":"فلما رجعوا۟ الى ابيهم قالوا۟ يابانا منع منا الكيل فارسل معنا اخانا نكتل وانا له لحفظون"},{"id":1660,"verse_key":"12:64","text_uthmani_simple":"قال هل ءامنكم عليه الا كما امنتكم على اخيه من قبل فالله خير حفظا وهو ارحم الرحمين"},{"id":1661,"verse_key":"12:65","text_uthmani_simple":"ولما فتحوا۟ متعهم وجدوا۟ بضعتهم ردت اليهم قالوا۟ يابانا ما نبغى هذه بضعتنا ردت الينا ونمير اهلنا ونحفظ اخانا ونزداد كيل بعير ذلك كيل يسير"},{"id":1662,"verse_key":"12:66","text_uthmani_simple":"قال لن ارسله معكم حتى تؤتون موثقا من الله لتاتننى به الا ان يحاط بكم فلما ءاتوه موثقهم قال الله على ما نقول وكيل"},{"id":1663,"verse_key":"12:67","text_uthmani_simple":"وقال يبنى لا تدخلوا۟ منۢ باب وحد وادخلوا۟ من ابوب متفرقة وما اغنى عنكم من الله من شىء ان الحكم الا لله عليه توكلت وعليه فليتوكل المتوكلون"},{"id":1664,"verse_key":"12:68","text_uthmani_simple":"ولما دخلوا۟ من حيث امرهم ابوهم ما كان يغنى عنهم من الله من شىء الا حاجة فى نفس يعقوب قضىها وانه لذو علم لما علمنه ولكن اكثر الناس لا يعلمون"},{"id":1665,"verse_key":"12:69","text_uthmani_simple":"ولما دخلوا۟ على يوسف ءاوى اليه اخاه قال انى انا۠ اخوك فلا تبتئس بما كانوا۟ يعملون"},{"id":1666,"verse_key":"12:70","text_uthmani_simple":"فلما جهزهم بجهازهم جعل السقاية فى رحل اخيه ثم اذن مؤذن ايتها العير انكم لسرقون"},{"id":1667,"verse_key":"12:71","text_uthmani_simple":"قالوا۟ واقبلوا۟ عليهم ماذا تفقدون"},{"id":1668,"verse_key":"12:72","text_uthmani_simple":"قالوا۟ نفقد صواع الملك ولمن جاء به حمل بعير وانا۠ به زعيم"},{"id":1669,"verse_key":"12:73","text_uthmani_simple":"قالوا۟ تالله لقد علمتم ما جئنا لنفسد فى الارض وما كنا سرقين"},{"id":1670,"verse_key":"12:74","text_uthmani_simple":"قالوا۟ فما جزؤه ان كنتم كذبين"},{"id":1671,"verse_key":"12:75","text_uthmani_simple":"قالوا۟ جزؤه من وجد فى رحله فهو جزؤه كذلك نجزى الظلمين"},{"id":1672,"verse_key":"12:76","text_uthmani_simple":"فبدا باوعيتهم قبل وعاء اخيه ثم استخرجها من وعاء اخيه كذلك كدنا ليوسف ما كان لياخذ اخاه فى دين الملك الا ان يشاء الله نرفع درجت من نشاء وفوق كل ذى علم عليم"},{"id":1673,"verse_key":"12:77","text_uthmani_simple":"قالوا۟ ان يسرق فقد سرق اخ له من قبل فاسرها يوسف فى نفسه ولم يبدها لهم قال انتم شر مكانا والله اعلم بما تصفون"},{"id":1674,"verse_key":"12:78","text_uthmani_simple":"قالوا۟ يايها العزيز ان له ابا شيخا كبيرا فخذ احدنا مكانه انا نرىك من المحسنين"},{"id":1675,"verse_key":"12:79","text_uthmani_simple":"قال معاذ الله ان ناخذ الا من وجدنا متعنا عنده انا اذا لظلمون"},{"id":1676,"verse_key":"12:80","text_uthmani_simple":"فلما استيـسوا۟ منه خلصوا۟ نجيا قال كبيرهم الم تعلموا۟ ان اباكم قد اخذ عليكم موثقا من الله ومن قبل ما فرطتم فى يوسف فلن ابرح الارض حتى ياذن لى ابى او يحكم الله لى وهو خير الحكمين"},{"id":1677,"verse_key":"12:81","text_uthmani_simple":"ارجعوا۟ الى ابيكم فقولوا۟ يابانا ان ابنك سرق وما شهدنا الا بما علمنا وما كنا للغيب حفظين"},{"id":1678,"verse_key":"12:82","text_uthmani_simple":"وسـل القرية التى كنا فيها والعير التى اقبلنا فيها وانا لصدقون"},{"id":1679,"verse_key":"12:83","text_uthmani_simple":"قال بل سولت لكم انفسكم امرا فصبر جميل عسى الله ان ياتينى بهم جميعا انه هو العليم الحكيم"},{"id":1680,"verse_key":"12:84","text_uthmani_simple":"وتولى عنهم وقال ياسفى على يوسف وابيضت عيناه من الحزن فهو كظيم"},{"id":1681,"verse_key":"12:85","text_uthmani_simple":"قالوا۟ تالله تفتؤا۟ تذكر يوسف حتى تكون حرضا او تكون من الهلكين"},{"id":1682,"verse_key":"12:86","text_uthmani_simple":"قال انما اشكوا۟ بثى وحزنى الى الله واعلم من الله ما لا تعلمون"},{"id":1683,"verse_key":"12:87","text_uthmani_simple":"يبنى اذهبوا۟ فتحسسوا۟ من يوسف واخيه ولا تا۟يـسوا۟ من روح الله انه لا يا۟يـس من روح الله الا القوم الكفرون"},{"id":1684,"verse_key":"12:88","text_uthmani_simple":"فلما دخلوا۟ عليه قالوا۟ يايها العزيز مسنا واهلنا الضر وجئنا ببضعة مزجىة فاوف لنا الكيل وتصدق علينا ان الله يجزى المتصدقين"},{"id":1685,"verse_key":"12:89","text_uthmani_simple":"قال هل علمتم ما فعلتم بيوسف واخيه اذ انتم جهلون"},{"id":1686,"verse_key":"12:90","text_uthmani_simple":"قالوا۟ اءنك لانت يوسف قال انا۠ يوسف وهذا اخى قد من الله علينا انه من يتق ويصبر فان الله لا يضيع اجر المحسنين"},{"id":1687,"verse_key":"12:91","text_uthmani_simple":"قالوا۟ تالله لقد ءاثرك الله علينا وان كنا لخطـين"},{"id":1688,"verse_key":"12:92","text_uthmani_simple":"قال لا تثريب عليكم اليوم يغفر الله لكم وهو ارحم الرحمين"},{"id":1689,"verse_key":"12:93","text_uthmani_simple":"اذهبوا۟ بقميصى هذا فالقوه على وجه ابى يات بصيرا واتونى باهلكم اجمعين"},{"id":1690,"verse_key":"12:94","text_uthmani_simple":"ولما فصلت العير قال ابوهم انى لاجد ريح يوسف لولا ان تفندون"},{"id":1691,"verse_key":"12:95","text_uthmani_simple":"قالوا۟ تالله انك لفى ضللك القديم"},{"id":1692,"verse_key":"12:96","text_uthmani_simple":"فلما ان جاء البشير القىه على وجهه فارتد بصيرا قال الم اقل لكم انى اعلم من الله ما لا تعلمون"},{"id":1693,"verse_key":"12:97","text_uthmani_simple":"قالوا۟ يابانا استغفر لنا ذنوبنا انا كنا خطـين"},{"id":1694,"verse_key":"12:98","text_uthmani_simple":"قال سوف استغفر لكم ربى انه هو الغفور الرحيم"},{"id":1695,"verse_key":"12:99","text_uthmani_simple":"فلما دخلوا۟ على يوسف ءاوى اليه ابويه وقال ادخلوا۟ مصر ان شاء الله ءامنين"},{"id":1696,"verse_key":"12:100","text_uthmani_simple":"ورفع ابويه على العرش وخروا۟ له سجدا وقال يابت هذا تاويل رءيى من قبل قد جعلها ربى حقا وقد احسن بى اذ اخرجنى من السجن وجاء بكم من البدو منۢ بعد ان نزغ الشيطن بينى وبين اخوتى ان ربى لطيف لما يشاء انه هو العليم الحكيم"},{"id":1697,"verse_key":"12:101","text_uthmani_simple":"رب قد ءاتيتنى من الملك وعلمتنى من تاويل الاحاديث فاطر السموت والارض انت ولى فى الدنيا والءاخرة توفنى مسلما والحقنى بالصلحين"},{"id":1698,"verse_key":"12:102","text_uthmani_simple":"ذلك من انۢباء الغيب نوحيه اليك وما كنت لديهم اذ اجمعوا۟ امرهم وهم يمكرون"},{"id":1699,"verse_key":"12:103","text_uthmani_simple":"وما اكثر الناس ولو حرصت بمؤمنين"},{"id":1700,"verse_key":"12:104","text_uthmani_simple":"وما تسـلهم عليه من اجر ان هو الا ذكر للعلمين"},{"id":1701,"verse_key":"12:105","text_uthmani_simple":"وكاين من ءاية فى السموت والارض يمرون عليها وهم عنها معرضون"},{"id":1702,"verse_key":"12:106","text_uthmani_simple":"وما يؤمن اكثرهم بالله الا وهم مشركون"},{"id":1703,"verse_key":"12:107","text_uthmani_simple":"افامنوا۟ ان تاتيهم غشية من عذاب الله او تاتيهم الساعة بغتة وهم لا يشعرون"},{"id":1704,"verse_key":"12:108","text_uthmani_simple":"قل هذه سبيلى ادعوا۟ الى الله على بصيرة انا۠ ومن اتبعنى وسبحن الله وما انا۠ من المشركين"},{"id":1705,"verse_key":"12:109","text_uthmani_simple":"وما ارسلنا من قبلك الا رجالا نوحى اليهم من اهل القرى افلم يسيروا۟ فى الارض فينظروا۟ كيف كان عقبة الذين من قبلهم ولدار الءاخرة خير للذين اتقوا۟ افلا تعقلون"},{"id":1706,"verse_key":"12:110","text_uthmani_simple":"حتى اذا استيـس الرسل وظنوا۟ انهم قد كذبوا۟ جاءهم نصرنا فنجى من نشاء ولا يرد باسنا عن القوم المجرمين"},{"id":1707,"verse_key":"12:111","text_uthmani_simple":"لقد كان فى قصصهم عبرة لاو۟لى الالبب ما كان حديثا يفترى ولكن تصديق الذى بين يديه وتفصيل كل شىء وهدى ورحمة لقوم يؤمنون"},{"id":1708,"verse_key":"13:1","text_uthmani_simple":"المر تلك ءايت الكتب والذى انزل اليك من ربك الحق ولكن اكثر الناس لا يؤمنون"},{"id":1709,"verse_key":"13:2","text_uthmani_simple":"الله الذى رفع السموت بغير عمد ترونها ثم استوى على العرش وسخر الشمس والقمر كل يجرى لاجل مسمى يدبر الامر يفصل الءايت لعلكم بلقاء ربكم توقنون"},{"id":1710,"verse_key":"13:3","text_uthmani_simple":"وهو الذى مد الارض وجعل فيها روسى وانهرا ومن كل الثمرت جعل فيها زوجين اثنين يغشى اليل النهار ان فى ذلك لءايت لقوم يتفكرون"},{"id":1711,"verse_key":"13:4","text_uthmani_simple":"وفى الارض قطع متجورت وجنت من اعنب وزرع ونخيل صنوان وغير صنوان يسقى بماء وحد ونفضل بعضها على بعض فى الاكل ان فى ذلك لءايت لقوم يعقلون"},{"id":1712,"verse_key":"13:5","text_uthmani_simple":"وان تعجب فعجب قولهم اءذا كنا تربا اءنا لفى خلق جديد او۟لئك الذين كفروا۟ بربهم واو۟لئك الاغلل فى اعناقهم واو۟لئك اصحب النار هم فيها خلدون"},{"id":1713,"verse_key":"13:6","text_uthmani_simple":"ويستعجلونك بالسيئة قبل الحسنة وقد خلت من قبلهم المثلت وان ربك لذو مغفرة للناس على ظلمهم وان ربك لشديد العقاب"},{"id":1714,"verse_key":"13:7","text_uthmani_simple":"ويقول الذين كفروا۟ لولا انزل عليه ءاية من ربه انما انت منذر ولكل قوم هاد"},{"id":1715,"verse_key":"13:8","text_uthmani_simple":"الله يعلم ما تحمل كل انثى وما تغيض الارحام وما تزداد وكل شىء عنده بمقدار"},{"id":1716,"verse_key":"13:9","text_uthmani_simple":"علم الغيب والشهدة الكبير المتعال"},{"id":1717,"verse_key":"13:10","text_uthmani_simple":"سواء منكم من اسر القول ومن جهر به ومن هو مستخفۭ باليل وساربۢ بالنهار"},{"id":1718,"verse_key":"13:11","text_uthmani_simple":"له معقبت منۢ بين يديه ومن خلفه يحفظونه من امر الله ان الله لا يغير ما بقوم حتى يغيروا۟ ما بانفسهم واذا اراد الله بقوم سوءا فلا مرد له وما لهم من دونه من وال"},{"id":1719,"verse_key":"13:12","text_uthmani_simple":"هو الذى يريكم البرق خوفا وطمعا وينشئ السحاب الثقال"},{"id":1720,"verse_key":"13:13","text_uthmani_simple":"ويسبح الرعد بحمده والملئكة من خيفته ويرسل الصوعق فيصيب بها من يشاء وهم يجدلون فى الله وهو شديد المحال"},{"id":1721,"verse_key":"13:14","text_uthmani_simple":"له دعوة الحق والذين يدعون من دونه لا يستجيبون لهم بشىء الا كبسط كفيه الى الماء ليبلغ فاه وما هو ببلغه وما دعاء الكفرين الا فى ضلل"},{"id":1722,"verse_key":"13:15","text_uthmani_simple":"ولله يسجد من فى السموت والارض طوعا وكرها وظللهم بالغدو والءاصال"},{"id":1723,"verse_key":"13:16","text_uthmani_simple":"قل من رب السموت والارض قل الله قل افاتخذتم من دونه اولياء لا يملكون لانفسهم نفعا ولا ضرا قل هل يستوى الاعمى والبصير ام هل تستوى الظلمت والنور ام جعلوا۟ لله شركاء خلقوا۟ كخلقه فتشبه الخلق عليهم قل الله خلق كل شىء وهو الوحد القهر"},{"id":1724,"verse_key":"13:17","text_uthmani_simple":"انزل من السماء ماء فسالت اوديةۢ بقدرها فاحتمل السيل زبدا رابيا ومما يوقدون عليه فى النار ابتغاء حلية او متع زبد مثله كذلك يضرب الله الحق والبطل فاما الزبد فيذهب جفاء واما ما ينفع الناس فيمكث فى الارض كذلك يضرب الله الامثال"},{"id":1725,"verse_key":"13:18","text_uthmani_simple":"للذين استجابوا۟ لربهم الحسنى والذين لم يستجيبوا۟ له لو ان لهم ما فى الارض جميعا ومثله معه لافتدوا۟ به او۟لئك لهم سوء الحساب وماوىهم جهنم وبئس المهاد"},{"id":1726,"verse_key":"13:19","text_uthmani_simple":"افمن يعلم انما انزل اليك من ربك الحق كمن هو اعمى انما يتذكر او۟لوا۟ الالبب"},{"id":1727,"verse_key":"13:20","text_uthmani_simple":"الذين يوفون بعهد الله ولا ينقضون الميثق"},{"id":1728,"verse_key":"13:21","text_uthmani_simple":"والذين يصلون ما امر الله به ان يوصل ويخشون ربهم ويخافون سوء الحساب"},{"id":1729,"verse_key":"13:22","text_uthmani_simple":"والذين صبروا۟ ابتغاء وجه ربهم واقاموا۟ الصلوة وانفقوا۟ مما رزقنهم سرا وعلانية ويدرءون بالحسنة السيئة او۟لئك لهم عقبى الدار"},{"id":1730,"verse_key":"13:23","text_uthmani_simple":"جنت عدن يدخلونها ومن صلح من ءابائهم وازوجهم وذريتهم والملئكة يدخلون عليهم من كل باب"},{"id":1731,"verse_key":"13:24","text_uthmani_simple":"سلم عليكم بما صبرتم فنعم عقبى الدار"},{"id":1732,"verse_key":"13:25","text_uthmani_simple":"والذين ينقضون عهد الله منۢ بعد ميثقه ويقطعون ما امر الله به ان يوصل ويفسدون فى الارض او۟لئك لهم اللعنة ولهم سوء الدار"},{"id":1733,"verse_key":"13:26","text_uthmani_simple":"الله يبسط الرزق لمن يشاء ويقدر وفرحوا۟ بالحيوة الدنيا وما الحيوة الدنيا فى الءاخرة الا متع"},{"id":1734,"verse_key":"13:27","text_uthmani_simple":"ويقول الذين كفروا۟ لولا انزل عليه ءاية من ربه قل ان الله يضل من يشاء ويهدى اليه من اناب"},{"id":1735,"verse_key":"13:28","text_uthmani_simple":"الذين ءامنوا۟ وتطمئن قلوبهم بذكر الله الا بذكر الله تطمئن القلوب"},{"id":1736,"verse_key":"13:29","text_uthmani_simple":"الذين ءامنوا۟ وعملوا۟ الصلحت طوبى لهم وحسن مـاب"},{"id":1737,"verse_key":"13:30","text_uthmani_simple":"كذلك ارسلنك فى امة قد خلت من قبلها امم لتتلوا۟ عليهم الذى اوحينا اليك وهم يكفرون بالرحمن قل هو ربى لا اله الا هو عليه توكلت واليه متاب"},{"id":1738,"verse_key":"13:31","text_uthmani_simple":"ولو ان قرءانا سيرت به الجبال او قطعت به الارض او كلم به الموتى بل لله الامر جميعا افلم يا۟يـس الذين ءامنوا۟ ان لو يشاء الله لهدى الناس جميعا ولا يزال الذين كفروا۟ تصيبهم بما صنعوا۟ قارعة او تحل قريبا من دارهم حتى ياتى وعد الله ان الله لا يخلف الميعاد"},{"id":1739,"verse_key":"13:32","text_uthmani_simple":"ولقد استهزئ برسل من قبلك فامليت للذين كفروا۟ ثم اخذتهم فكيف كان عقاب"},{"id":1740,"verse_key":"13:33","text_uthmani_simple":"افمن هو قائم على كل نفسۭ بما كسبت وجعلوا۟ لله شركاء قل سموهم ام تنبـونه بما لا يعلم فى الارض ام بظهر من القول بل زين للذين كفروا۟ مكرهم وصدوا۟ عن السبيل ومن يضلل الله فما له من هاد"},{"id":1741,"verse_key":"13:34","text_uthmani_simple":"لهم عذاب فى الحيوة الدنيا ولعذاب الءاخرة اشق وما لهم من الله من واق"},{"id":1742,"verse_key":"13:35","text_uthmani_simple":"مثل الجنة التى وعد المتقون تجرى من تحتها الانهر اكلها دائم وظلها تلك عقبى الذين اتقوا۟ وعقبى الكفرين النار"},{"id":1743,"verse_key":"13:36","text_uthmani_simple":"والذين ءاتينهم الكتب يفرحون بما انزل اليك ومن الاحزاب من ينكر بعضه قل انما امرت ان اعبد الله ولا اشرك به اليه ادعوا۟ واليه مـاب"},{"id":1744,"verse_key":"13:37","text_uthmani_simple":"وكذلك انزلنه حكما عربيا ولئن اتبعت اهواءهم بعدما جاءك من العلم ما لك من الله من ولى ولا واق"},{"id":1745,"verse_key":"13:38","text_uthmani_simple":"ولقد ارسلنا رسلا من قبلك وجعلنا لهم ازوجا وذرية وما كان لرسول ان ياتى بـاية الا باذن الله لكل اجل كتاب"},{"id":1746,"verse_key":"13:39","text_uthmani_simple":"يمحوا۟ الله ما يشاء ويثبت وعنده ام الكتب"},{"id":1747,"verse_key":"13:40","text_uthmani_simple":"وان ما نرينك بعض الذى نعدهم او نتوفينك فانما عليك البلغ وعلينا الحساب"},{"id":1748,"verse_key":"13:41","text_uthmani_simple":"اولم يروا۟ انا ناتى الارض ننقصها من اطرافها والله يحكم لا معقب لحكمه وهو سريع الحساب"},{"id":1749,"verse_key":"13:42","text_uthmani_simple":"وقد مكر الذين من قبلهم فلله المكر جميعا يعلم ما تكسب كل نفس وسيعلم الكفر لمن عقبى الدار"},{"id":1750,"verse_key":"13:43","text_uthmani_simple":"ويقول الذين كفروا۟ لست مرسلا قل كفى بالله شهيدۢا بينى وبينكم ومن عنده علم الكتب"},{"id":1751,"verse_key":"14:1","text_uthmani_simple":"الر كتب انزلنه اليك لتخرج الناس من الظلمت الى النور باذن ربهم الى صرط العزيز الحميد"},{"id":1752,"verse_key":"14:2","text_uthmani_simple":"الله الذى له ما فى السموت وما فى الارض وويل للكفرين من عذاب شديد"},{"id":1753,"verse_key":"14:3","text_uthmani_simple":"الذين يستحبون الحيوة الدنيا على الءاخرة ويصدون عن سبيل الله ويبغونها عوجا او۟لئك فى ضللۭ بعيد"},{"id":1754,"verse_key":"14:4","text_uthmani_simple":"وما ارسلنا من رسول الا بلسان قومه ليبين لهم فيضل الله من يشاء ويهدى من يشاء وهو العزيز الحكيم"},{"id":1755,"verse_key":"14:5","text_uthmani_simple":"ولقد ارسلنا موسى بـايتنا ان اخرج قومك من الظلمت الى النور وذكرهم بايىم الله ان فى ذلك لءايت لكل صبار شكور"},{"id":1756,"verse_key":"14:6","text_uthmani_simple":"واذ قال موسى لقومه اذكروا۟ نعمة الله عليكم اذ انجىكم من ءال فرعون يسومونكم سوء العذاب ويذبحون ابناءكم ويستحيون نساءكم وفى ذلكم بلاء من ربكم عظيم"},{"id":1757,"verse_key":"14:7","text_uthmani_simple":"واذ تاذن ربكم لئن شكرتم لازيدنكم ولئن كفرتم ان عذابى لشديد"},{"id":1758,"verse_key":"14:8","text_uthmani_simple":"وقال موسى ان تكفروا۟ انتم ومن فى الارض جميعا فان الله لغنى حميد"},{"id":1759,"verse_key":"14:9","text_uthmani_simple":"الم ياتكم نبؤا۟ الذين من قبلكم قوم نوح وعاد وثمود والذين منۢ بعدهم لا يعلمهم الا الله جاءتهم رسلهم بالبينت فردوا۟ ايديهم فى افوههم وقالوا۟ انا كفرنا بما ارسلتم به وانا لفى شك مما تدعوننا اليه مريب"},{"id":1760,"verse_key":"14:10","text_uthmani_simple":"قالت رسلهم افى الله شك فاطر السموت والارض يدعوكم ليغفر لكم من ذنوبكم ويؤخركم الى اجل مسمى قالوا۟ ان انتم الا بشر مثلنا تريدون ان تصدونا عما كان يعبد ءاباؤنا فاتونا بسلطن مبين"},{"id":1761,"verse_key":"14:11","text_uthmani_simple":"قالت لهم رسلهم ان نحن الا بشر مثلكم ولكن الله يمن على من يشاء من عباده وما كان لنا ان ناتيكم بسلطن الا باذن الله وعلى الله فليتوكل المؤمنون"},{"id":1762,"verse_key":"14:12","text_uthmani_simple":"وما لنا الا نتوكل على الله وقد هدىنا سبلنا ولنصبرن على ما ءاذيتمونا وعلى الله فليتوكل المتوكلون"},{"id":1763,"verse_key":"14:13","text_uthmani_simple":"وقال الذين كفروا۟ لرسلهم لنخرجنكم من ارضنا او لتعودن فى ملتنا فاوحى اليهم ربهم لنهلكن الظلمين"},{"id":1764,"verse_key":"14:14","text_uthmani_simple":"ولنسكننكم الارض منۢ بعدهم ذلك لمن خاف مقامى وخاف وعيد"},{"id":1765,"verse_key":"14:15","text_uthmani_simple":"واستفتحوا۟ وخاب كل جبار عنيد"},{"id":1766,"verse_key":"14:16","text_uthmani_simple":"من ورائه جهنم ويسقى من ماء صديد"},{"id":1767,"verse_key":"14:17","text_uthmani_simple":"يتجرعه ولا يكاد يسيغه وياتيه الموت من كل مكان وما هو بميت ومن ورائه عذاب غليظ"},{"id":1768,"verse_key":"14:18","text_uthmani_simple":"مثل الذين كفروا۟ بربهم اعملهم كرماد اشتدت به الريح فى يوم عاصف لا يقدرون مما كسبوا۟ على شىء ذلك هو الضلل البعيد"},{"id":1769,"verse_key":"14:19","text_uthmani_simple":"الم تر ان الله خلق السموت والارض بالحق ان يشا يذهبكم ويات بخلق جديد"},{"id":1770,"verse_key":"14:20","text_uthmani_simple":"وما ذلك على الله بعزيز"},{"id":1771,"verse_key":"14:21","text_uthmani_simple":"وبرزوا۟ لله جميعا فقال الضعفؤا۟ للذين استكبروا۟ انا كنا لكم تبعا فهل انتم مغنون عنا من عذاب الله من شىء قالوا۟ لو هدىنا الله لهدينكم سواء علينا اجزعنا ام صبرنا ما لنا من محيص"},{"id":1772,"verse_key":"14:22","text_uthmani_simple":"وقال الشيطن لما قضى الامر ان الله وعدكم وعد الحق ووعدتكم فاخلفتكم وما كان لى عليكم من سلطن الا ان دعوتكم فاستجبتم لى فلا تلومونى ولوموا۟ انفسكم ما انا۠ بمصرخكم وما انتم بمصرخى انى كفرت بما اشركتمون من قبل ان الظلمين لهم عذاب اليم"},{"id":1773,"verse_key":"14:23","text_uthmani_simple":"وادخل الذين ءامنوا۟ وعملوا۟ الصلحت جنت تجرى من تحتها الانهر خلدين فيها باذن ربهم تحيتهم فيها سلم"},{"id":1774,"verse_key":"14:24","text_uthmani_simple":"الم تر كيف ضرب الله مثلا كلمة طيبة كشجرة طيبة اصلها ثابت وفرعها فى السماء"},{"id":1775,"verse_key":"14:25","text_uthmani_simple":"تؤتى اكلها كل حينۭ باذن ربها ويضرب الله الامثال للناس لعلهم يتذكرون"},{"id":1776,"verse_key":"14:26","text_uthmani_simple":"ومثل كلمة خبيثة كشجرة خبيثة اجتثت من فوق الارض ما لها من قرار"},{"id":1777,"verse_key":"14:27","text_uthmani_simple":"يثبت الله الذين ءامنوا۟ بالقول الثابت فى الحيوة الدنيا وفى الءاخرة ويضل الله الظلمين ويفعل الله ما يشاء"},{"id":1778,"verse_key":"14:28","text_uthmani_simple":"الم تر الى الذين بدلوا۟ نعمت الله كفرا واحلوا۟ قومهم دار البوار"},{"id":1779,"verse_key":"14:29","text_uthmani_simple":"جهنم يصلونها وبئس القرار"},{"id":1780,"verse_key":"14:30","text_uthmani_simple":"وجعلوا۟ لله اندادا ليضلوا۟ عن سبيله قل تمتعوا۟ فان مصيركم الى النار"},{"id":1781,"verse_key":"14:31","text_uthmani_simple":"قل لعبادى الذين ءامنوا۟ يقيموا۟ الصلوة وينفقوا۟ مما رزقنهم سرا وعلانية من قبل ان ياتى يوم لا بيع فيه ولا خلل"},{"id":1782,"verse_key":"14:32","text_uthmani_simple":"الله الذى خلق السموت والارض وانزل من السماء ماء فاخرج به من الثمرت رزقا لكم وسخر لكم الفلك لتجرى فى البحر بامره وسخر لكم الانهر"},{"id":1783,"verse_key":"14:33","text_uthmani_simple":"وسخر لكم الشمس والقمر دائبين وسخر لكم اليل والنهار"},{"id":1784,"verse_key":"14:34","text_uthmani_simple":"وءاتىكم من كل ما سالتموه وان تعدوا۟ نعمت الله لا تحصوها ان الانسن لظلوم كفار"},{"id":1785,"verse_key":"14:35","text_uthmani_simple":"واذ قال ابرهيم رب اجعل هذا البلد ءامنا واجنبنى وبنى ان نعبد الاصنام"},{"id":1786,"verse_key":"14:36","text_uthmani_simple":"رب انهن اضللن كثيرا من الناس فمن تبعنى فانه منى ومن عصانى فانك غفور رحيم"},{"id":1787,"verse_key":"14:37","text_uthmani_simple":"ربنا انى اسكنت من ذريتى بواد غير ذى زرع عند بيتك المحرم ربنا ليقيموا۟ الصلوة فاجعل افـدة من الناس تهوى اليهم وارزقهم من الثمرت لعلهم يشكرون"},{"id":1788,"verse_key":"14:38","text_uthmani_simple":"ربنا انك تعلم ما نخفى وما نعلن وما يخفى على الله من شىء فى الارض ولا فى السماء"},{"id":1789,"verse_key":"14:39","text_uthmani_simple":"الحمد لله الذى وهب لى على الكبر اسمعيل واسحق ان ربى لسميع الدعاء"},{"id":1790,"verse_key":"14:40","text_uthmani_simple":"رب اجعلنى مقيم الصلوة ومن ذريتى ربنا وتقبل دعاء"},{"id":1791,"verse_key":"14:41","text_uthmani_simple":"ربنا اغفر لى ولولدى وللمؤمنين يوم يقوم الحساب"},{"id":1792,"verse_key":"14:42","text_uthmani_simple":"ولا تحسبن الله غفلا عما يعمل الظلمون انما يؤخرهم ليوم تشخص فيه الابصر"},{"id":1793,"verse_key":"14:43","text_uthmani_simple":"مهطعين مقنعى رءوسهم لا يرتد اليهم طرفهم وافـدتهم هواء"},{"id":1794,"verse_key":"14:44","text_uthmani_simple":"وانذر الناس يوم ياتيهم العذاب فيقول الذين ظلموا۟ ربنا اخرنا الى اجل قريب نجب دعوتك ونتبع الرسل اولم تكونوا۟ اقسمتم من قبل ما لكم من زوال"},{"id":1795,"verse_key":"14:45","text_uthmani_simple":"وسكنتم فى مسكن الذين ظلموا۟ انفسهم وتبين لكم كيف فعلنا بهم وضربنا لكم الامثال"},{"id":1796,"verse_key":"14:46","text_uthmani_simple":"وقد مكروا۟ مكرهم وعند الله مكرهم وان كان مكرهم لتزول منه الجبال"},{"id":1797,"verse_key":"14:47","text_uthmani_simple":"فلا تحسبن الله مخلف وعده رسله ان الله عزيز ذو انتقام"},{"id":1798,"verse_key":"14:48","text_uthmani_simple":"يوم تبدل الارض غير الارض والسموت وبرزوا۟ لله الوحد القهار"},{"id":1799,"verse_key":"14:49","text_uthmani_simple":"وترى المجرمين يومئذ مقرنين فى الاصفاد"},{"id":1800,"verse_key":"14:50","text_uthmani_simple":"سرابيلهم من قطران وتغشى وجوههم النار"},{"id":1801,"verse_key":"14:51","text_uthmani_simple":"ليجزى الله كل نفس ما كسبت ان الله سريع الحساب"},{"id":1802,"verse_key":"14:52","text_uthmani_simple":"هذا بلغ للناس ولينذروا۟ به وليعلموا۟ انما هو اله وحد وليذكر او۟لوا۟ الالبب"}],"meta":{"filters":{"juz_number":"13"}}}
