{"verses":[{"id":1201,"verse_key":"8:41","text_uthmani_simple":"واعلموا۟ انما غنمتم من شىء فان لله خمسه وللرسول ولذى القربى واليتمى والمسكين وابن السبيل ان كنتم ءامنتم بالله وما انزلنا على عبدنا يوم الفرقان يوم التقى الجمعان والله على كل شىء قدير"},{"id":1202,"verse_key":"8:42","text_uthmani_simple":"اذ انتم بالعدوة الدنيا وهم بالعدوة القصوى والركب اسفل منكم ولو تواعدتم لاختلفتم فى الميعد ولكن ليقضى الله امرا كان مفعولا ليهلك من هلك عنۢ بينة ويحيى من حى عنۢ بينة وان الله لسميع عليم"},{"id":1203,"verse_key":"8:43","text_uthmani_simple":"اذ يريكهم الله فى منامك قليلا ولو ارىكهم كثيرا لفشلتم ولتنزعتم فى الامر ولكن الله سلم انه عليمۢ بذات الصدور"},{"id":1204,"verse_key":"8:44","text_uthmani_simple":"واذ يريكموهم اذ التقيتم فى اعينكم قليلا ويقللكم فى اعينهم ليقضى الله امرا كان مفعولا والى الله ترجع الامور"},{"id":1205,"verse_key":"8:45","text_uthmani_simple":"يايها الذين ءامنوا۟ اذا لقيتم فئة فاثبتوا۟ واذكروا۟ الله كثيرا لعلكم تفلحون"},{"id":1206,"verse_key":"8:46","text_uthmani_simple":"واطيعوا۟ الله ورسوله ولا تنزعوا۟ فتفشلوا۟ وتذهب ريحكم واصبروا۟ ان الله مع الصبرين"},{"id":1207,"verse_key":"8:47","text_uthmani_simple":"ولا تكونوا۟ كالذين خرجوا۟ من ديرهم بطرا ورئاء الناس ويصدون عن سبيل الله والله بما يعملون محيط"},{"id":1208,"verse_key":"8:48","text_uthmani_simple":"واذ زين لهم الشيطن اعملهم وقال لا غالب لكم اليوم من الناس وانى جار لكم فلما تراءت الفئتان نكص على عقبيه وقال انى برىء منكم انى ارى ما لا ترون انى اخاف الله والله شديد العقاب"},{"id":1209,"verse_key":"8:49","text_uthmani_simple":"اذ يقول المنفقون والذين فى قلوبهم مرض غر هؤلاء دينهم ومن يتوكل على الله فان الله عزيز حكيم"},{"id":1210,"verse_key":"8:50","text_uthmani_simple":"ولو ترى اذ يتوفى الذين كفروا۟ الملئكة يضربون وجوههم وادبرهم وذوقوا۟ عذاب الحريق"},{"id":1211,"verse_key":"8:51","text_uthmani_simple":"ذلك بما قدمت ايديكم وان الله ليس بظلم للعبيد"},{"id":1212,"verse_key":"8:52","text_uthmani_simple":"كداب ءال فرعون والذين من قبلهم كفروا۟ بـايت الله فاخذهم الله بذنوبهم ان الله قوى شديد العقاب"},{"id":1213,"verse_key":"8:53","text_uthmani_simple":"ذلك بان الله لم يك مغيرا نعمة انعمها على قوم حتى يغيروا۟ ما بانفسهم وان الله سميع عليم"},{"id":1214,"verse_key":"8:54","text_uthmani_simple":"كداب ءال فرعون والذين من قبلهم كذبوا۟ بـايت ربهم فاهلكنهم بذنوبهم واغرقنا ءال فرعون وكل كانوا۟ ظلمين"},{"id":1215,"verse_key":"8:55","text_uthmani_simple":"ان شر الدواب عند الله الذين كفروا۟ فهم لا يؤمنون"},{"id":1216,"verse_key":"8:56","text_uthmani_simple":"الذين عهدت منهم ثم ينقضون عهدهم فى كل مرة وهم لا يتقون"},{"id":1217,"verse_key":"8:57","text_uthmani_simple":"فاما تثقفنهم فى الحرب فشرد بهم من خلفهم لعلهم يذكرون"},{"id":1218,"verse_key":"8:58","text_uthmani_simple":"واما تخافن من قوم خيانة فانۢبذ اليهم على سواء ان الله لا يحب الخائنين"},{"id":1219,"verse_key":"8:59","text_uthmani_simple":"ولا يحسبن الذين كفروا۟ سبقوا۟ انهم لا يعجزون"},{"id":1220,"verse_key":"8:60","text_uthmani_simple":"واعدوا۟ لهم ما استطعتم من قوة ومن رباط الخيل ترهبون به عدو الله وعدوكم وءاخرين من دونهم لا تعلمونهم الله يعلمهم وما تنفقوا۟ من شىء فى سبيل الله يوف اليكم وانتم لا تظلمون"},{"id":1221,"verse_key":"8:61","text_uthmani_simple":"وان جنحوا۟ للسلم فاجنح لها وتوكل على الله انه هو السميع العليم"},{"id":1222,"verse_key":"8:62","text_uthmani_simple":"وان يريدوا۟ ان يخدعوك فان حسبك الله هو الذى ايدك بنصره وبالمؤمنين"},{"id":1223,"verse_key":"8:63","text_uthmani_simple":"والف بين قلوبهم لو انفقت ما فى الارض جميعا ما الفت بين قلوبهم ولكن الله الف بينهم انه عزيز حكيم"},{"id":1224,"verse_key":"8:64","text_uthmani_simple":"يايها النبى حسبك الله ومن اتبعك من المؤمنين"},{"id":1225,"verse_key":"8:65","text_uthmani_simple":"يايها النبى حرض المؤمنين على القتال ان يكن منكم عشرون صبرون يغلبوا۟ ما۟ئتين وان يكن منكم ما۟ئة يغلبوا۟ الفا من الذين كفروا۟ بانهم قوم لا يفقهون"},{"id":1226,"verse_key":"8:66","text_uthmani_simple":"الـن خفف الله عنكم وعلم ان فيكم ضعفا فان يكن منكم ما۟ئة صابرة يغلبوا۟ ما۟ئتين وان يكن منكم الف يغلبوا۟ الفين باذن الله والله مع الصبرين"},{"id":1227,"verse_key":"8:67","text_uthmani_simple":"ما كان لنبى ان يكون له اسرى حتى يثخن فى الارض تريدون عرض الدنيا والله يريد الءاخرة والله عزيز حكيم"},{"id":1228,"verse_key":"8:68","text_uthmani_simple":"لولا كتب من الله سبق لمسكم فيما اخذتم عذاب عظيم"},{"id":1229,"verse_key":"8:69","text_uthmani_simple":"فكلوا۟ مما غنمتم حللا طيبا واتقوا۟ الله ان الله غفور رحيم"},{"id":1230,"verse_key":"8:70","text_uthmani_simple":"يايها النبى قل لمن فى ايديكم من الاسرى ان يعلم الله فى قلوبكم خيرا يؤتكم خيرا مما اخذ منكم ويغفر لكم والله غفور رحيم"},{"id":1231,"verse_key":"8:71","text_uthmani_simple":"وان يريدوا۟ خيانتك فقد خانوا۟ الله من قبل فامكن منهم والله عليم حكيم"},{"id":1232,"verse_key":"8:72","text_uthmani_simple":"ان الذين ءامنوا۟ وهاجروا۟ وجهدوا۟ بامولهم وانفسهم فى سبيل الله والذين ءاووا۟ ونصروا۟ او۟لئك بعضهم اولياء بعض والذين ءامنوا۟ ولم يهاجروا۟ ما لكم من وليتهم من شىء حتى يهاجروا۟ وان استنصروكم فى الدين فعليكم النصر الا على قومۭ بينكم وبينهم ميثق والله بما تعملون بصير"},{"id":1233,"verse_key":"8:73","text_uthmani_simple":"والذين كفروا۟ بعضهم اولياء بعض الا تفعلوه تكن فتنة فى الارض وفساد كبير"},{"id":1234,"verse_key":"8:74","text_uthmani_simple":"والذين ءامنوا۟ وهاجروا۟ وجهدوا۟ فى سبيل الله والذين ءاووا۟ ونصروا۟ او۟لئك هم المؤمنون حقا لهم مغفرة ورزق كريم"},{"id":1235,"verse_key":"8:75","text_uthmani_simple":"والذين ءامنوا۟ منۢ بعد وهاجروا۟ وجهدوا۟ معكم فاو۟لئك منكم واو۟لوا۟ الارحام بعضهم اولى ببعض فى كتب الله ان الله بكل شىء عليمۢ"},{"id":1236,"verse_key":"9:1","text_uthmani_simple":"براءة من الله ورسوله الى الذين عهدتم من المشركين"},{"id":1237,"verse_key":"9:2","text_uthmani_simple":"فسيحوا۟ فى الارض اربعة اشهر واعلموا۟ انكم غير معجزى الله وان الله مخزى الكفرين"},{"id":1238,"verse_key":"9:3","text_uthmani_simple":"واذن من الله ورسوله الى الناس يوم الحج الاكبر ان الله برىء من المشركين ورسوله فان تبتم فهو خير لكم وان توليتم فاعلموا۟ انكم غير معجزى الله وبشر الذين كفروا۟ بعذاب اليم"},{"id":1239,"verse_key":"9:4","text_uthmani_simple":"الا الذين عهدتم من المشركين ثم لم ينقصوكم شيـا ولم يظهروا۟ عليكم احدا فاتموا۟ اليهم عهدهم الى مدتهم ان الله يحب المتقين"},{"id":1240,"verse_key":"9:5","text_uthmani_simple":"فاذا انسلخ الاشهر الحرم فاقتلوا۟ المشركين حيث وجدتموهم وخذوهم واحصروهم واقعدوا۟ لهم كل مرصد فان تابوا۟ واقاموا۟ الصلوة وءاتوا۟ الزكوة فخلوا۟ سبيلهم ان الله غفور رحيم"},{"id":1241,"verse_key":"9:6","text_uthmani_simple":"وان احد من المشركين استجارك فاجره حتى يسمع كلم الله ثم ابلغه مامنه ذلك بانهم قوم لا يعلمون"},{"id":1242,"verse_key":"9:7","text_uthmani_simple":"كيف يكون للمشركين عهد عند الله وعند رسوله الا الذين عهدتم عند المسجد الحرام فما استقموا۟ لكم فاستقيموا۟ لهم ان الله يحب المتقين"},{"id":1243,"verse_key":"9:8","text_uthmani_simple":"كيف وان يظهروا۟ عليكم لا يرقبوا۟ فيكم الا ولا ذمة يرضونكم بافوههم وتابى قلوبهم واكثرهم فسقون"},{"id":1244,"verse_key":"9:9","text_uthmani_simple":"اشتروا۟ بـايت الله ثمنا قليلا فصدوا۟ عن سبيله انهم ساء ما كانوا۟ يعملون"},{"id":1245,"verse_key":"9:10","text_uthmani_simple":"لا يرقبون فى مؤمن الا ولا ذمة واو۟لئك هم المعتدون"},{"id":1246,"verse_key":"9:11","text_uthmani_simple":"فان تابوا۟ واقاموا۟ الصلوة وءاتوا۟ الزكوة فاخونكم فى الدين ونفصل الءايت لقوم يعلمون"},{"id":1247,"verse_key":"9:12","text_uthmani_simple":"وان نكثوا۟ ايمنهم منۢ بعد عهدهم وطعنوا۟ فى دينكم فقتلوا۟ ائمة الكفر انهم لا ايمن لهم لعلهم ينتهون"},{"id":1248,"verse_key":"9:13","text_uthmani_simple":"الا تقتلون قوما نكثوا۟ ايمنهم وهموا۟ باخراج الرسول وهم بدءوكم اول مرة اتخشونهم فالله احق ان تخشوه ان كنتم مؤمنين"},{"id":1249,"verse_key":"9:14","text_uthmani_simple":"قتلوهم يعذبهم الله بايديكم ويخزهم وينصركم عليهم ويشف صدور قوم مؤمنين"},{"id":1250,"verse_key":"9:15","text_uthmani_simple":"ويذهب غيظ قلوبهم ويتوب الله على من يشاء والله عليم حكيم"},{"id":1251,"verse_key":"9:16","text_uthmani_simple":"ام حسبتم ان تتركوا۟ ولما يعلم الله الذين جهدوا۟ منكم ولم يتخذوا۟ من دون الله ولا رسوله ولا المؤمنين وليجة والله خبيرۢ بما تعملون"},{"id":1252,"verse_key":"9:17","text_uthmani_simple":"ما كان للمشركين ان يعمروا۟ مسجد الله شهدين على انفسهم بالكفر او۟لئك حبطت اعملهم وفى النار هم خلدون"},{"id":1253,"verse_key":"9:18","text_uthmani_simple":"انما يعمر مسجد الله من ءامن بالله واليوم الءاخر واقام الصلوة وءاتى الزكوة ولم يخش الا الله فعسى او۟لئك ان يكونوا۟ من المهتدين"},{"id":1254,"verse_key":"9:19","text_uthmani_simple":"اجعلتم سقاية الحاج وعمارة المسجد الحرام كمن ءامن بالله واليوم الءاخر وجهد فى سبيل الله لا يستون عند الله والله لا يهدى القوم الظلمين"},{"id":1255,"verse_key":"9:20","text_uthmani_simple":"الذين ءامنوا۟ وهاجروا۟ وجهدوا۟ فى سبيل الله بامولهم وانفسهم اعظم درجة عند الله واو۟لئك هم الفائزون"},{"id":1256,"verse_key":"9:21","text_uthmani_simple":"يبشرهم ربهم برحمة منه ورضون وجنت لهم فيها نعيم مقيم"},{"id":1257,"verse_key":"9:22","text_uthmani_simple":"خلدين فيها ابدا ان الله عنده اجر عظيم"},{"id":1258,"verse_key":"9:23","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تتخذوا۟ ءاباءكم واخونكم اولياء ان استحبوا۟ الكفر على الايمن ومن يتولهم منكم فاو۟لئك هم الظلمون"},{"id":1259,"verse_key":"9:24","text_uthmani_simple":"قل ان كان ءاباؤكم وابناؤكم واخونكم وازوجكم وعشيرتكم وامول اقترفتموها وتجرة تخشون كسادها ومسكن ترضونها احب اليكم من الله ورسوله وجهاد فى سبيله فتربصوا۟ حتى ياتى الله بامره والله لا يهدى القوم الفسقين"},{"id":1260,"verse_key":"9:25","text_uthmani_simple":"لقد نصركم الله فى مواطن كثيرة ويوم حنين اذ اعجبتكم كثرتكم فلم تغن عنكم شيـا وضاقت عليكم الارض بما رحبت ثم وليتم مدبرين"},{"id":1261,"verse_key":"9:26","text_uthmani_simple":"ثم انزل الله سكينته على رسوله وعلى المؤمنين وانزل جنودا لم تروها وعذب الذين كفروا۟ وذلك جزاء الكفرين"},{"id":1262,"verse_key":"9:27","text_uthmani_simple":"ثم يتوب الله منۢ بعد ذلك على من يشاء والله غفور رحيم"},{"id":1263,"verse_key":"9:28","text_uthmani_simple":"يايها الذين ءامنوا۟ انما المشركون نجس فلا يقربوا۟ المسجد الحرام بعد عامهم هذا وان خفتم عيلة فسوف يغنيكم الله من فضله ان شاء ان الله عليم حكيم"},{"id":1264,"verse_key":"9:29","text_uthmani_simple":"قتلوا۟ الذين لا يؤمنون بالله ولا باليوم الءاخر ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين اوتوا۟ الكتب حتى يعطوا۟ الجزية عن يد وهم صغرون"},{"id":1265,"verse_key":"9:30","text_uthmani_simple":"وقالت اليهود عزير ابن الله وقالت النصرى المسيح ابن الله ذلك قولهم بافوههم يضهـون قول الذين كفروا۟ من قبل قتلهم الله انى يؤفكون"},{"id":1266,"verse_key":"9:31","text_uthmani_simple":"اتخذوا۟ احبارهم ورهبنهم اربابا من دون الله والمسيح ابن مريم وما امروا۟ الا ليعبدوا۟ الها وحدا لا اله الا هو سبحنه عما يشركون"},{"id":1267,"verse_key":"9:32","text_uthmani_simple":"يريدون ان يطفـوا۟ نور الله بافوههم ويابى الله الا ان يتم نوره ولو كره الكفرون"},{"id":1268,"verse_key":"9:33","text_uthmani_simple":"هو الذى ارسل رسوله بالهدى ودين الحق ليظهره على الدين كله ولو كره المشركون"},{"id":1269,"verse_key":"9:34","text_uthmani_simple":"يايها الذين ءامنوا۟ ان كثيرا من الاحبار والرهبان لياكلون امول الناس بالبطل ويصدون عن سبيل الله والذين يكنزون الذهب والفضة ولا ينفقونها فى سبيل الله فبشرهم بعذاب اليم"},{"id":1270,"verse_key":"9:35","text_uthmani_simple":"يوم يحمى عليها فى نار جهنم فتكوى بها جباههم وجنوبهم وظهورهم هذا ما كنزتم لانفسكم فذوقوا۟ ما كنتم تكنزون"},{"id":1271,"verse_key":"9:36","text_uthmani_simple":"ان عدة الشهور عند الله اثنا عشر شهرا فى كتب الله يوم خلق السموت والارض منها اربعة حرم ذلك الدين القيم فلا تظلموا۟ فيهن انفسكم وقتلوا۟ المشركين كافة كما يقتلونكم كافة واعلموا۟ ان الله مع المتقين"},{"id":1272,"verse_key":"9:37","text_uthmani_simple":"انما النسىء زيادة فى الكفر يضل به الذين كفروا۟ يحلونه عاما ويحرمونه عاما ليواطـوا۟ عدة ما حرم الله فيحلوا۟ ما حرم الله زين لهم سوء اعملهم والله لا يهدى القوم الكفرين"},{"id":1273,"verse_key":"9:38","text_uthmani_simple":"يايها الذين ءامنوا۟ ما لكم اذا قيل لكم انفروا۟ فى سبيل الله اثاقلتم الى الارض ارضيتم بالحيوة الدنيا من الءاخرة فما متع الحيوة الدنيا فى الءاخرة الا قليل"},{"id":1274,"verse_key":"9:39","text_uthmani_simple":"الا تنفروا۟ يعذبكم عذابا اليما ويستبدل قوما غيركم ولا تضروه شيـا والله على كل شىء قدير"},{"id":1275,"verse_key":"9:40","text_uthmani_simple":"الا تنصروه فقد نصره الله اذ اخرجه الذين كفروا۟ ثانى اثنين اذ هما فى الغار اذ يقول لصحبه لا تحزن ان الله معنا فانزل الله سكينته عليه وايده بجنود لم تروها وجعل كلمة الذين كفروا۟ السفلى وكلمة الله هى العليا والله عزيز حكيم"},{"id":1276,"verse_key":"9:41","text_uthmani_simple":"انفروا۟ خفافا وثقالا وجهدوا۟ بامولكم وانفسكم فى سبيل الله ذلكم خير لكم ان كنتم تعلمون"},{"id":1277,"verse_key":"9:42","text_uthmani_simple":"لو كان عرضا قريبا وسفرا قاصدا لاتبعوك ولكنۢ بعدت عليهم الشقة وسيحلفون بالله لو استطعنا لخرجنا معكم يهلكون انفسهم والله يعلم انهم لكذبون"},{"id":1278,"verse_key":"9:43","text_uthmani_simple":"عفا الله عنك لم اذنت لهم حتى يتبين لك الذين صدقوا۟ وتعلم الكذبين"},{"id":1279,"verse_key":"9:44","text_uthmani_simple":"لا يستـذنك الذين يؤمنون بالله واليوم الءاخر ان يجهدوا۟ بامولهم وانفسهم والله عليمۢ بالمتقين"},{"id":1280,"verse_key":"9:45","text_uthmani_simple":"انما يستـذنك الذين لا يؤمنون بالله واليوم الءاخر وارتابت قلوبهم فهم فى ريبهم يترددون"},{"id":1281,"verse_key":"9:46","text_uthmani_simple":"ولو ارادوا۟ الخروج لاعدوا۟ له عدة ولكن كره الله انۢبعاثهم فثبطهم وقيل اقعدوا۟ مع القعدين"},{"id":1282,"verse_key":"9:47","text_uthmani_simple":"لو خرجوا۟ فيكم ما زادوكم الا خبالا ولاوضعوا۟ خللكم يبغونكم الفتنة وفيكم سمعون لهم والله عليمۢ بالظلمين"},{"id":1283,"verse_key":"9:48","text_uthmani_simple":"لقد ابتغوا۟ الفتنة من قبل وقلبوا۟ لك الامور حتى جاء الحق وظهر امر الله وهم كرهون"},{"id":1284,"verse_key":"9:49","text_uthmani_simple":"ومنهم من يقول ائذن لى ولا تفتنى الا فى الفتنة سقطوا۟ وان جهنم لمحيطةۢ بالكفرين"},{"id":1285,"verse_key":"9:50","text_uthmani_simple":"ان تصبك حسنة تسؤهم وان تصبك مصيبة يقولوا۟ قد اخذنا امرنا من قبل ويتولوا۟ وهم فرحون"},{"id":1286,"verse_key":"9:51","text_uthmani_simple":"قل لن يصيبنا الا ما كتب الله لنا هو مولىنا وعلى الله فليتوكل المؤمنون"},{"id":1287,"verse_key":"9:52","text_uthmani_simple":"قل هل تربصون بنا الا احدى الحسنيين ونحن نتربص بكم ان يصيبكم الله بعذاب من عنده او بايدينا فتربصوا۟ انا معكم متربصون"},{"id":1288,"verse_key":"9:53","text_uthmani_simple":"قل انفقوا۟ طوعا او كرها لن يتقبل منكم انكم كنتم قوما فسقين"},{"id":1289,"verse_key":"9:54","text_uthmani_simple":"وما منعهم ان تقبل منهم نفقتهم الا انهم كفروا۟ بالله وبرسوله ولا ياتون الصلوة الا وهم كسالى ولا ينفقون الا وهم كرهون"},{"id":1290,"verse_key":"9:55","text_uthmani_simple":"فلا تعجبك امولهم ولا اولدهم انما يريد الله ليعذبهم بها فى الحيوة الدنيا وتزهق انفسهم وهم كفرون"},{"id":1291,"verse_key":"9:56","text_uthmani_simple":"ويحلفون بالله انهم لمنكم وما هم منكم ولكنهم قوم يفرقون"},{"id":1292,"verse_key":"9:57","text_uthmani_simple":"لو يجدون ملجـا او مغرت او مدخلا لولوا۟ اليه وهم يجمحون"},{"id":1293,"verse_key":"9:58","text_uthmani_simple":"ومنهم من يلمزك فى الصدقت فان اعطوا۟ منها رضوا۟ وان لم يعطوا۟ منها اذا هم يسخطون"},{"id":1294,"verse_key":"9:59","text_uthmani_simple":"ولو انهم رضوا۟ ما ءاتىهم الله ورسوله وقالوا۟ حسبنا الله سيؤتينا الله من فضله ورسوله انا الى الله رغبون"},{"id":1295,"verse_key":"9:60","text_uthmani_simple":"انما الصدقت للفقراء والمسكين والعملين عليها والمؤلفة قلوبهم وفى الرقاب والغرمين وفى سبيل الله وابن السبيل فريضة من الله والله عليم حكيم"},{"id":1296,"verse_key":"9:61","text_uthmani_simple":"ومنهم الذين يؤذون النبى ويقولون هو اذن قل اذن خير لكم يؤمن بالله ويؤمن للمؤمنين ورحمة للذين ءامنوا۟ منكم والذين يؤذون رسول الله لهم عذاب اليم"},{"id":1297,"verse_key":"9:62","text_uthmani_simple":"يحلفون بالله لكم ليرضوكم والله ورسوله احق ان يرضوه ان كانوا۟ مؤمنين"},{"id":1298,"verse_key":"9:63","text_uthmani_simple":"الم يعلموا۟ انه من يحادد الله ورسوله فان له نار جهنم خلدا فيها ذلك الخزى العظيم"},{"id":1299,"verse_key":"9:64","text_uthmani_simple":"يحذر المنفقون ان تنزل عليهم سورة تنبئهم بما فى قلوبهم قل استهزءوا۟ ان الله مخرج ما تحذرون"},{"id":1300,"verse_key":"9:65","text_uthmani_simple":"ولئن سالتهم ليقولن انما كنا نخوض ونلعب قل ابالله وءايته ورسوله كنتم تستهزءون"},{"id":1301,"verse_key":"9:66","text_uthmani_simple":"لا تعتذروا۟ قد كفرتم بعد ايمنكم ان نعف عن طائفة منكم نعذب طائفةۢ بانهم كانوا۟ مجرمين"},{"id":1302,"verse_key":"9:67","text_uthmani_simple":"المنفقون والمنفقت بعضهم منۢ بعض يامرون بالمنكر وينهون عن المعروف ويقبضون ايديهم نسوا۟ الله فنسيهم ان المنفقين هم الفسقون"},{"id":1303,"verse_key":"9:68","text_uthmani_simple":"وعد الله المنفقين والمنفقت والكفار نار جهنم خلدين فيها هى حسبهم ولعنهم الله ولهم عذاب مقيم"},{"id":1304,"verse_key":"9:69","text_uthmani_simple":"كالذين من قبلكم كانوا۟ اشد منكم قوة واكثر امولا واولدا فاستمتعوا۟ بخلقهم فاستمتعتم بخلقكم كما استمتع الذين من قبلكم بخلقهم وخضتم كالذى خاضوا۟ او۟لئك حبطت اعملهم فى الدنيا والءاخرة واو۟لئك هم الخسرون"},{"id":1305,"verse_key":"9:70","text_uthmani_simple":"الم ياتهم نبا الذين من قبلهم قوم نوح وعاد وثمود وقوم ابرهيم واصحب مدين والمؤتفكت اتتهم رسلهم بالبينت فما كان الله ليظلمهم ولكن كانوا۟ انفسهم يظلمون"},{"id":1306,"verse_key":"9:71","text_uthmani_simple":"والمؤمنون والمؤمنت بعضهم اولياء بعض يامرون بالمعروف وينهون عن المنكر ويقيمون الصلوة ويؤتون الزكوة ويطيعون الله ورسوله او۟لئك سيرحمهم الله ان الله عزيز حكيم"},{"id":1307,"verse_key":"9:72","text_uthmani_simple":"وعد الله المؤمنين والمؤمنت جنت تجرى من تحتها الانهر خلدين فيها ومسكن طيبة فى جنت عدن ورضون من الله اكبر ذلك هو الفوز العظيم"},{"id":1308,"verse_key":"9:73","text_uthmani_simple":"يايها النبى جهد الكفار والمنفقين واغلظ عليهم وماوىهم جهنم وبئس المصير"},{"id":1309,"verse_key":"9:74","text_uthmani_simple":"يحلفون بالله ما قالوا۟ ولقد قالوا۟ كلمة الكفر وكفروا۟ بعد اسلمهم وهموا۟ بما لم ينالوا۟ وما نقموا۟ الا ان اغنىهم الله ورسوله من فضله فان يتوبوا۟ يك خيرا لهم وان يتولوا۟ يعذبهم الله عذابا اليما فى الدنيا والءاخرة وما لهم فى الارض من ولى ولا نصير"},{"id":1310,"verse_key":"9:75","text_uthmani_simple":"ومنهم من عهد الله لئن ءاتىنا من فضله لنصدقن ولنكونن من الصلحين"},{"id":1311,"verse_key":"9:76","text_uthmani_simple":"فلما ءاتىهم من فضله بخلوا۟ به وتولوا۟ وهم معرضون"},{"id":1312,"verse_key":"9:77","text_uthmani_simple":"فاعقبهم نفاقا فى قلوبهم الى يوم يلقونه بما اخلفوا۟ الله ما وعدوه وبما كانوا۟ يكذبون"},{"id":1313,"verse_key":"9:78","text_uthmani_simple":"الم يعلموا۟ ان الله يعلم سرهم ونجوىهم وان الله علم الغيوب"},{"id":1314,"verse_key":"9:79","text_uthmani_simple":"الذين يلمزون المطوعين من المؤمنين فى الصدقت والذين لا يجدون الا جهدهم فيسخرون منهم سخر الله منهم ولهم عذاب اليم"},{"id":1315,"verse_key":"9:80","text_uthmani_simple":"استغفر لهم او لا تستغفر لهم ان تستغفر لهم سبعين مرة فلن يغفر الله لهم ذلك بانهم كفروا۟ بالله ورسوله والله لا يهدى القوم الفسقين"},{"id":1316,"verse_key":"9:81","text_uthmani_simple":"فرح المخلفون بمقعدهم خلف رسول الله وكرهوا۟ ان يجهدوا۟ بامولهم وانفسهم فى سبيل الله وقالوا۟ لا تنفروا۟ فى الحر قل نار جهنم اشد حرا لو كانوا۟ يفقهون"},{"id":1317,"verse_key":"9:82","text_uthmani_simple":"فليضحكوا۟ قليلا وليبكوا۟ كثيرا جزاءۢ بما كانوا۟ يكسبون"},{"id":1318,"verse_key":"9:83","text_uthmani_simple":"فان رجعك الله الى طائفة منهم فاستـذنوك للخروج فقل لن تخرجوا۟ معى ابدا ولن تقتلوا۟ معى عدوا انكم رضيتم بالقعود اول مرة فاقعدوا۟ مع الخلفين"},{"id":1319,"verse_key":"9:84","text_uthmani_simple":"ولا تصل على احد منهم مات ابدا ولا تقم على قبره انهم كفروا۟ بالله ورسوله وماتوا۟ وهم فسقون"},{"id":1320,"verse_key":"9:85","text_uthmani_simple":"ولا تعجبك امولهم واولدهم انما يريد الله ان يعذبهم بها فى الدنيا وتزهق انفسهم وهم كفرون"},{"id":1321,"verse_key":"9:86","text_uthmani_simple":"واذا انزلت سورة ان ءامنوا۟ بالله وجهدوا۟ مع رسوله استـذنك او۟لوا۟ الطول منهم وقالوا۟ ذرنا نكن مع القعدين"},{"id":1322,"verse_key":"9:87","text_uthmani_simple":"رضوا۟ بان يكونوا۟ مع الخوالف وطبع على قلوبهم فهم لا يفقهون"},{"id":1323,"verse_key":"9:88","text_uthmani_simple":"لكن الرسول والذين ءامنوا۟ معه جهدوا۟ بامولهم وانفسهم واو۟لئك لهم الخيرت واو۟لئك هم المفلحون"},{"id":1324,"verse_key":"9:89","text_uthmani_simple":"اعد الله لهم جنت تجرى من تحتها الانهر خلدين فيها ذلك الفوز العظيم"},{"id":1325,"verse_key":"9:90","text_uthmani_simple":"وجاء المعذرون من الاعراب ليؤذن لهم وقعد الذين كذبوا۟ الله ورسوله سيصيب الذين كفروا۟ منهم عذاب اليم"},{"id":1326,"verse_key":"9:91","text_uthmani_simple":"ليس على الضعفاء ولا على المرضى ولا على الذين لا يجدون ما ينفقون حرج اذا نصحوا۟ لله ورسوله ما على المحسنين من سبيل والله غفور رحيم"},{"id":1327,"verse_key":"9:92","text_uthmani_simple":"ولا على الذين اذا ما اتوك لتحملهم قلت لا اجد ما احملكم عليه تولوا۟ واعينهم تفيض من الدمع حزنا الا يجدوا۟ ما ينفقون"}],"meta":{"filters":{"juz_number":"10"}}}
