{"verses":[{"id":900,"verse_key":"6:111","text_uthmani_simple":"ولو اننا نزلنا اليهم الملئكة وكلمهم الموتى وحشرنا عليهم كل شىء قبلا ما كانوا۟ ليؤمنوا۟ الا ان يشاء الله ولكن اكثرهم يجهلون"},{"id":901,"verse_key":"6:112","text_uthmani_simple":"وكذلك جعلنا لكل نبى عدوا شيطين الانس والجن يوحى بعضهم الى بعض زخرف القول غرورا ولو شاء ربك ما فعلوه فذرهم وما يفترون"},{"id":902,"verse_key":"6:113","text_uthmani_simple":"ولتصغى اليه افـدة الذين لا يؤمنون بالءاخرة وليرضوه وليقترفوا۟ ما هم مقترفون"},{"id":903,"verse_key":"6:114","text_uthmani_simple":"افغير الله ابتغى حكما وهو الذى انزل اليكم الكتب مفصلا والذين ءاتينهم الكتب يعلمون انه منزل من ربك بالحق فلا تكونن من الممترين"},{"id":904,"verse_key":"6:115","text_uthmani_simple":"وتمت كلمت ربك صدقا وعدلا لا مبدل لكلمته وهو السميع العليم"},{"id":905,"verse_key":"6:116","text_uthmani_simple":"وان تطع اكثر من فى الارض يضلوك عن سبيل الله ان يتبعون الا الظن وان هم الا يخرصون"},{"id":906,"verse_key":"6:117","text_uthmani_simple":"ان ربك هو اعلم من يضل عن سبيله وهو اعلم بالمهتدين"},{"id":907,"verse_key":"6:118","text_uthmani_simple":"فكلوا۟ مما ذكر اسم الله عليه ان كنتم بـايته مؤمنين"},{"id":908,"verse_key":"6:119","text_uthmani_simple":"وما لكم الا تاكلوا۟ مما ذكر اسم الله عليه وقد فصل لكم ما حرم عليكم الا ما اضطررتم اليه وان كثيرا ليضلون باهوائهم بغير علم ان ربك هو اعلم بالمعتدين"},{"id":909,"verse_key":"6:120","text_uthmani_simple":"وذروا۟ ظهر الاثم وباطنه ان الذين يكسبون الاثم سيجزون بما كانوا۟ يقترفون"},{"id":910,"verse_key":"6:121","text_uthmani_simple":"ولا تاكلوا۟ مما لم يذكر اسم الله عليه وانه لفسق وان الشيطين ليوحون الى اوليائهم ليجدلوكم وان اطعتموهم انكم لمشركون"},{"id":911,"verse_key":"6:122","text_uthmani_simple":"اومن كان ميتا فاحيينه وجعلنا له نورا يمشى به فى الناس كمن مثله فى الظلمت ليس بخارج منها كذلك زين للكفرين ما كانوا۟ يعملون"},{"id":912,"verse_key":"6:123","text_uthmani_simple":"وكذلك جعلنا فى كل قرية اكبر مجرميها ليمكروا۟ فيها وما يمكرون الا بانفسهم وما يشعرون"},{"id":913,"verse_key":"6:124","text_uthmani_simple":"واذا جاءتهم ءاية قالوا۟ لن نؤمن حتى نؤتى مثل ما اوتى رسل الله الله اعلم حيث يجعل رسالته سيصيب الذين اجرموا۟ صغار عند الله وعذاب شديدۢ بما كانوا۟ يمكرون"},{"id":914,"verse_key":"6:125","text_uthmani_simple":"فمن يرد الله ان يهديه يشرح صدره للاسلم ومن يرد ان يضله يجعل صدره ضيقا حرجا كانما يصعد فى السماء كذلك يجعل الله الرجس على الذين لا يؤمنون"},{"id":915,"verse_key":"6:126","text_uthmani_simple":"وهذا صرط ربك مستقيما قد فصلنا الءايت لقوم يذكرون"},{"id":916,"verse_key":"6:127","text_uthmani_simple":"لهم دار السلم عند ربهم وهو وليهم بما كانوا۟ يعملون"},{"id":917,"verse_key":"6:128","text_uthmani_simple":"ويوم يحشرهم جميعا يمعشر الجن قد استكثرتم من الانس وقال اولياؤهم من الانس ربنا استمتع بعضنا ببعض وبلغنا اجلنا الذى اجلت لنا قال النار مثوىكم خلدين فيها الا ما شاء الله ان ربك حكيم عليم"},{"id":918,"verse_key":"6:129","text_uthmani_simple":"وكذلك نولى بعض الظلمين بعضۢا بما كانوا۟ يكسبون"},{"id":919,"verse_key":"6:130","text_uthmani_simple":"يمعشر الجن والانس الم ياتكم رسل منكم يقصون عليكم ءايتى وينذرونكم لقاء يومكم هذا قالوا۟ شهدنا على انفسنا وغرتهم الحيوة الدنيا وشهدوا۟ على انفسهم انهم كانوا۟ كفرين"},{"id":920,"verse_key":"6:131","text_uthmani_simple":"ذلك ان لم يكن ربك مهلك القرى بظلم واهلها غفلون"},{"id":921,"verse_key":"6:132","text_uthmani_simple":"ولكل درجت مما عملوا۟ وما ربك بغفل عما يعملون"},{"id":922,"verse_key":"6:133","text_uthmani_simple":"وربك الغنى ذو الرحمة ان يشا يذهبكم ويستخلف منۢ بعدكم ما يشاء كما انشاكم من ذرية قوم ءاخرين"},{"id":923,"verse_key":"6:134","text_uthmani_simple":"ان ما توعدون لءات وما انتم بمعجزين"},{"id":924,"verse_key":"6:135","text_uthmani_simple":"قل يقوم اعملوا۟ على مكانتكم انى عامل فسوف تعلمون من تكون له عقبة الدار انه لا يفلح الظلمون"},{"id":925,"verse_key":"6:136","text_uthmani_simple":"وجعلوا۟ لله مما ذرا من الحرث والانعم نصيبا فقالوا۟ هذا لله بزعمهم وهذا لشركائنا فما كان لشركائهم فلا يصل الى الله وما كان لله فهو يصل الى شركائهم ساء ما يحكمون"},{"id":926,"verse_key":"6:137","text_uthmani_simple":"وكذلك زين لكثير من المشركين قتل اولدهم شركاؤهم ليردوهم وليلبسوا۟ عليهم دينهم ولو شاء الله ما فعلوه فذرهم وما يفترون"},{"id":927,"verse_key":"6:138","text_uthmani_simple":"وقالوا۟ هذه انعم وحرث حجر لا يطعمها الا من نشاء بزعمهم وانعم حرمت ظهورها وانعم لا يذكرون اسم الله عليها افتراء عليه سيجزيهم بما كانوا۟ يفترون"},{"id":928,"verse_key":"6:139","text_uthmani_simple":"وقالوا۟ ما فى بطون هذه الانعم خالصة لذكورنا ومحرم على ازوجنا وان يكن ميتة فهم فيه شركاء سيجزيهم وصفهم انه حكيم عليم"},{"id":929,"verse_key":"6:140","text_uthmani_simple":"قد خسر الذين قتلوا۟ اولدهم سفهۢا بغير علم وحرموا۟ ما رزقهم الله افتراء على الله قد ضلوا۟ وما كانوا۟ مهتدين"},{"id":930,"verse_key":"6:141","text_uthmani_simple":"وهو الذى انشا جنت معروشت وغير معروشت والنخل والزرع مختلفا اكله والزيتون والرمان متشبها وغير متشبه كلوا۟ من ثمره اذا اثمر وءاتوا۟ حقه يوم حصاده ولا تسرفوا۟ انه لا يحب المسرفين"},{"id":931,"verse_key":"6:142","text_uthmani_simple":"ومن الانعم حمولة وفرشا كلوا۟ مما رزقكم الله ولا تتبعوا۟ خطوت الشيطن انه لكم عدو مبين"},{"id":932,"verse_key":"6:143","text_uthmani_simple":"ثمنية ازوج من الضان اثنين ومن المعز اثنين قل ءالذكرين حرم ام الانثيين اما اشتملت عليه ارحام الانثيين نبـونى بعلم ان كنتم صدقين"},{"id":933,"verse_key":"6:144","text_uthmani_simple":"ومن الابل اثنين ومن البقر اثنين قل ءالذكرين حرم ام الانثيين اما اشتملت عليه ارحام الانثيين ام كنتم شهداء اذ وصىكم الله بهذا فمن اظلم ممن افترى على الله كذبا ليضل الناس بغير علم ان الله لا يهدى القوم الظلمين"},{"id":934,"verse_key":"6:145","text_uthmani_simple":"قل لا اجد فى ما اوحى الى محرما على طاعم يطعمه الا ان يكون ميتة او دما مسفوحا او لحم خنزير فانه رجس او فسقا اهل لغير الله به فمن اضطر غير باغ ولا عاد فان ربك غفور رحيم"},{"id":935,"verse_key":"6:146","text_uthmani_simple":"وعلى الذين هادوا۟ حرمنا كل ذى ظفر ومن البقر والغنم حرمنا عليهم شحومهما الا ما حملت ظهورهما او الحوايا او ما اختلط بعظم ذلك جزينهم ببغيهم وانا لصدقون"},{"id":936,"verse_key":"6:147","text_uthmani_simple":"فان كذبوك فقل ربكم ذو رحمة وسعة ولا يرد باسه عن القوم المجرمين"},{"id":937,"verse_key":"6:148","text_uthmani_simple":"سيقول الذين اشركوا۟ لو شاء الله ما اشركنا ولا ءاباؤنا ولا حرمنا من شىء كذلك كذب الذين من قبلهم حتى ذاقوا۟ باسنا قل هل عندكم من علم فتخرجوه لنا ان تتبعون الا الظن وان انتم الا تخرصون"},{"id":938,"verse_key":"6:149","text_uthmani_simple":"قل فلله الحجة البلغة فلو شاء لهدىكم اجمعين"},{"id":939,"verse_key":"6:150","text_uthmani_simple":"قل هلم شهداءكم الذين يشهدون ان الله حرم هذا فان شهدوا۟ فلا تشهد معهم ولا تتبع اهواء الذين كذبوا۟ بـايتنا والذين لا يؤمنون بالءاخرة وهم بربهم يعدلون"},{"id":940,"verse_key":"6:151","text_uthmani_simple":"قل تعالوا۟ اتل ما حرم ربكم عليكم الا تشركوا۟ به شيـا وبالولدين احسنا ولا تقتلوا۟ اولدكم من املق نحن نرزقكم واياهم ولا تقربوا۟ الفوحش ما ظهر منها وما بطن ولا تقتلوا۟ النفس التى حرم الله الا بالحق ذلكم وصىكم به لعلكم تعقلون"},{"id":941,"verse_key":"6:152","text_uthmani_simple":"ولا تقربوا۟ مال اليتيم الا بالتى هى احسن حتى يبلغ اشده واوفوا۟ الكيل والميزان بالقسط لا نكلف نفسا الا وسعها واذا قلتم فاعدلوا۟ ولو كان ذا قربى وبعهد الله اوفوا۟ ذلكم وصىكم به لعلكم تذكرون"},{"id":942,"verse_key":"6:153","text_uthmani_simple":"وان هذا صرطى مستقيما فاتبعوه ولا تتبعوا۟ السبل فتفرق بكم عن سبيله ذلكم وصىكم به لعلكم تتقون"},{"id":943,"verse_key":"6:154","text_uthmani_simple":"ثم ءاتينا موسى الكتب تماما على الذى احسن وتفصيلا لكل شىء وهدى ورحمة لعلهم بلقاء ربهم يؤمنون"},{"id":944,"verse_key":"6:155","text_uthmani_simple":"وهذا كتب انزلنه مبارك فاتبعوه واتقوا۟ لعلكم ترحمون"},{"id":945,"verse_key":"6:156","text_uthmani_simple":"ان تقولوا۟ انما انزل الكتب على طائفتين من قبلنا وان كنا عن دراستهم لغفلين"},{"id":946,"verse_key":"6:157","text_uthmani_simple":"او تقولوا۟ لو انا انزل علينا الكتب لكنا اهدى منهم فقد جاءكم بينة من ربكم وهدى ورحمة فمن اظلم ممن كذب بـايت الله وصدف عنها سنجزى الذين يصدفون عن ءايتنا سوء العذاب بما كانوا۟ يصدفون"},{"id":947,"verse_key":"6:158","text_uthmani_simple":"هل ينظرون الا ان تاتيهم الملئكة او ياتى ربك او ياتى بعض ءايت ربك يوم ياتى بعض ءايت ربك لا ينفع نفسا ايمنها لم تكن ءامنت من قبل او كسبت فى ايمنها خيرا قل انتظروا۟ انا منتظرون"},{"id":948,"verse_key":"6:159","text_uthmani_simple":"ان الذين فرقوا۟ دينهم وكانوا۟ شيعا لست منهم فى شىء انما امرهم الى الله ثم ينبئهم بما كانوا۟ يفعلون"},{"id":949,"verse_key":"6:160","text_uthmani_simple":"من جاء بالحسنة فله عشر امثالها ومن جاء بالسيئة فلا يجزى الا مثلها وهم لا يظلمون"},{"id":950,"verse_key":"6:161","text_uthmani_simple":"قل اننى هدىنى ربى الى صرط مستقيم دينا قيما ملة ابرهيم حنيفا وما كان من المشركين"},{"id":951,"verse_key":"6:162","text_uthmani_simple":"قل ان صلاتى ونسكى ومحياى ومماتى لله رب العلمين"},{"id":952,"verse_key":"6:163","text_uthmani_simple":"لا شريك له وبذلك امرت وانا۠ اول المسلمين"},{"id":953,"verse_key":"6:164","text_uthmani_simple":"قل اغير الله ابغى ربا وهو رب كل شىء ولا تكسب كل نفس الا عليها ولا تزر وازرة وزر اخرى ثم الى ربكم مرجعكم فينبئكم بما كنتم فيه تختلفون"},{"id":954,"verse_key":"6:165","text_uthmani_simple":"وهو الذى جعلكم خلئف الارض ورفع بعضكم فوق بعض درجت ليبلوكم فى ما ءاتىكم ان ربك سريع العقاب وانه لغفور رحيمۢ"},{"id":955,"verse_key":"7:1","text_uthmani_simple":"المص"},{"id":956,"verse_key":"7:2","text_uthmani_simple":"كتب انزل اليك فلا يكن فى صدرك حرج منه لتنذر به وذكرى للمؤمنين"},{"id":957,"verse_key":"7:3","text_uthmani_simple":"اتبعوا۟ ما انزل اليكم من ربكم ولا تتبعوا۟ من دونه اولياء قليلا ما تذكرون"},{"id":958,"verse_key":"7:4","text_uthmani_simple":"وكم من قرية اهلكنها فجاءها باسنا بيتا او هم قائلون"},{"id":959,"verse_key":"7:5","text_uthmani_simple":"فما كان دعوىهم اذ جاءهم باسنا الا ان قالوا۟ انا كنا ظلمين"},{"id":960,"verse_key":"7:6","text_uthmani_simple":"فلنسـلن الذين ارسل اليهم ولنسـلن المرسلين"},{"id":961,"verse_key":"7:7","text_uthmani_simple":"فلنقصن عليهم بعلم وما كنا غائبين"},{"id":962,"verse_key":"7:8","text_uthmani_simple":"والوزن يومئذ الحق فمن ثقلت موزينه فاو۟لئك هم المفلحون"},{"id":963,"verse_key":"7:9","text_uthmani_simple":"ومن خفت موزينه فاو۟لئك الذين خسروا۟ انفسهم بما كانوا۟ بـايتنا يظلمون"},{"id":964,"verse_key":"7:10","text_uthmani_simple":"ولقد مكنكم فى الارض وجعلنا لكم فيها معيش قليلا ما تشكرون"},{"id":965,"verse_key":"7:11","text_uthmani_simple":"ولقد خلقنكم ثم صورنكم ثم قلنا للملئكة اسجدوا۟ لءادم فسجدوا۟ الا ابليس لم يكن من السجدين"},{"id":966,"verse_key":"7:12","text_uthmani_simple":"قال ما منعك الا تسجد اذ امرتك قال انا۠ خير منه خلقتنى من نار وخلقته من طين"},{"id":967,"verse_key":"7:13","text_uthmani_simple":"قال فاهبط منها فما يكون لك ان تتكبر فيها فاخرج انك من الصغرين"},{"id":968,"verse_key":"7:14","text_uthmani_simple":"قال انظرنى الى يوم يبعثون"},{"id":969,"verse_key":"7:15","text_uthmani_simple":"قال انك من المنظرين"},{"id":970,"verse_key":"7:16","text_uthmani_simple":"قال فبما اغويتنى لاقعدن لهم صرطك المستقيم"},{"id":971,"verse_key":"7:17","text_uthmani_simple":"ثم لءاتينهم منۢ بين ايديهم ومن خلفهم وعن ايمنهم وعن شمائلهم ولا تجد اكثرهم شكرين"},{"id":972,"verse_key":"7:18","text_uthmani_simple":"قال اخرج منها مذءوما مدحورا لمن تبعك منهم لاملان جهنم منكم اجمعين"},{"id":973,"verse_key":"7:19","text_uthmani_simple":"ويـادم اسكن انت وزوجك الجنة فكلا من حيث شئتما ولا تقربا هذه الشجرة فتكونا من الظلمين"},{"id":974,"verse_key":"7:20","text_uthmani_simple":"فوسوس لهما الشيطن ليبدى لهما ما ورى عنهما من سوءتهما وقال ما نهىكما ربكما عن هذه الشجرة الا ان تكونا ملكين او تكونا من الخلدين"},{"id":975,"verse_key":"7:21","text_uthmani_simple":"وقاسمهما انى لكما لمن النصحين"},{"id":976,"verse_key":"7:22","text_uthmani_simple":"فدلىهما بغرور فلما ذاقا الشجرة بدت لهما سوءتهما وطفقا يخصفان عليهما من ورق الجنة ونادىهما ربهما الم انهكما عن تلكما الشجرة واقل لكما ان الشيطن لكما عدو مبين"},{"id":977,"verse_key":"7:23","text_uthmani_simple":"قالا ربنا ظلمنا انفسنا وان لم تغفر لنا وترحمنا لنكونن من الخسرين"},{"id":978,"verse_key":"7:24","text_uthmani_simple":"قال اهبطوا۟ بعضكم لبعض عدو ولكم فى الارض مستقر ومتع الى حين"},{"id":979,"verse_key":"7:25","text_uthmani_simple":"قال فيها تحيون وفيها تموتون ومنها تخرجون"},{"id":980,"verse_key":"7:26","text_uthmani_simple":"يبنى ءادم قد انزلنا عليكم لباسا يورى سوءتكم وريشا ولباس التقوى ذلك خير ذلك من ءايت الله لعلهم يذكرون"},{"id":981,"verse_key":"7:27","text_uthmani_simple":"يبنى ءادم لا يفتننكم الشيطن كما اخرج ابويكم من الجنة ينزع عنهما لباسهما ليريهما سوءتهما انه يرىكم هو وقبيله من حيث لا ترونهم انا جعلنا الشيطين اولياء للذين لا يؤمنون"},{"id":982,"verse_key":"7:28","text_uthmani_simple":"واذا فعلوا۟ فحشة قالوا۟ وجدنا عليها ءاباءنا والله امرنا بها قل ان الله لا يامر بالفحشاء اتقولون على الله ما لا تعلمون"},{"id":983,"verse_key":"7:29","text_uthmani_simple":"قل امر ربى بالقسط واقيموا۟ وجوهكم عند كل مسجد وادعوه مخلصين له الدين كما بداكم تعودون"},{"id":984,"verse_key":"7:30","text_uthmani_simple":"فريقا هدى وفريقا حق عليهم الضللة انهم اتخذوا۟ الشيطين اولياء من دون الله ويحسبون انهم مهتدون"},{"id":985,"verse_key":"7:31","text_uthmani_simple":"يبنى ءادم خذوا۟ زينتكم عند كل مسجد وكلوا۟ واشربوا۟ ولا تسرفوا۟ انه لا يحب المسرفين"},{"id":986,"verse_key":"7:32","text_uthmani_simple":"قل من حرم زينة الله التى اخرج لعباده والطيبت من الرزق قل هى للذين ءامنوا۟ فى الحيوة الدنيا خالصة يوم القيمة كذلك نفصل الءايت لقوم يعلمون"},{"id":987,"verse_key":"7:33","text_uthmani_simple":"قل انما حرم ربى الفوحش ما ظهر منها وما بطن والاثم والبغى بغير الحق وان تشركوا۟ بالله ما لم ينزل به سلطنا وان تقولوا۟ على الله ما لا تعلمون"},{"id":988,"verse_key":"7:34","text_uthmani_simple":"ولكل امة اجل فاذا جاء اجلهم لا يستاخرون ساعة ولا يستقدمون"},{"id":989,"verse_key":"7:35","text_uthmani_simple":"يبنى ءادم اما ياتينكم رسل منكم يقصون عليكم ءايتى فمن اتقى واصلح فلا خوف عليهم ولا هم يحزنون"},{"id":990,"verse_key":"7:36","text_uthmani_simple":"والذين كذبوا۟ بـايتنا واستكبروا۟ عنها او۟لئك اصحب النار هم فيها خلدون"},{"id":991,"verse_key":"7:37","text_uthmani_simple":"فمن اظلم ممن افترى على الله كذبا او كذب بـايته او۟لئك ينالهم نصيبهم من الكتب حتى اذا جاءتهم رسلنا يتوفونهم قالوا۟ اين ما كنتم تدعون من دون الله قالوا۟ ضلوا۟ عنا وشهدوا۟ على انفسهم انهم كانوا۟ كفرين"},{"id":992,"verse_key":"7:38","text_uthmani_simple":"قال ادخلوا۟ فى امم قد خلت من قبلكم من الجن والانس فى النار كلما دخلت امة لعنت اختها حتى اذا اداركوا۟ فيها جميعا قالت اخرىهم لاولىهم ربنا هؤلاء اضلونا فـاتهم عذابا ضعفا من النار قال لكل ضعف ولكن لا تعلمون"},{"id":993,"verse_key":"7:39","text_uthmani_simple":"وقالت اولىهم لاخرىهم فما كان لكم علينا من فضل فذوقوا۟ العذاب بما كنتم تكسبون"},{"id":994,"verse_key":"7:40","text_uthmani_simple":"ان الذين كذبوا۟ بـايتنا واستكبروا۟ عنها لا تفتح لهم ابوب السماء ولا يدخلون الجنة حتى يلج الجمل فى سم الخياط وكذلك نجزى المجرمين"},{"id":995,"verse_key":"7:41","text_uthmani_simple":"لهم من جهنم مهاد ومن فوقهم غواش وكذلك نجزى الظلمين"},{"id":996,"verse_key":"7:42","text_uthmani_simple":"والذين ءامنوا۟ وعملوا۟ الصلحت لا نكلف نفسا الا وسعها او۟لئك اصحب الجنة هم فيها خلدون"},{"id":997,"verse_key":"7:43","text_uthmani_simple":"ونزعنا ما فى صدورهم من غل تجرى من تحتهم الانهر وقالوا۟ الحمد لله الذى هدىنا لهذا وما كنا لنهتدى لولا ان هدىنا الله لقد جاءت رسل ربنا بالحق ونودوا۟ ان تلكم الجنة اورثتموها بما كنتم تعملون"},{"id":998,"verse_key":"7:44","text_uthmani_simple":"ونادى اصحب الجنة اصحب النار ان قد وجدنا ما وعدنا ربنا حقا فهل وجدتم ما وعد ربكم حقا قالوا۟ نعم فاذن مؤذنۢ بينهم ان لعنة الله على الظلمين"},{"id":999,"verse_key":"7:45","text_uthmani_simple":"الذين يصدون عن سبيل الله ويبغونها عوجا وهم بالءاخرة كفرون"},{"id":1000,"verse_key":"7:46","text_uthmani_simple":"وبينهما حجاب وعلى الاعراف رجال يعرفون كلۢا بسيمىهم ونادوا۟ اصحب الجنة ان سلم عليكم لم يدخلوها وهم يطمعون"},{"id":1001,"verse_key":"7:47","text_uthmani_simple":"واذا صرفت ابصرهم تلقاء اصحب النار قالوا۟ ربنا لا تجعلنا مع القوم الظلمين"},{"id":1002,"verse_key":"7:48","text_uthmani_simple":"ونادى اصحب الاعراف رجالا يعرفونهم بسيمىهم قالوا۟ ما اغنى عنكم جمعكم وما كنتم تستكبرون"},{"id":1003,"verse_key":"7:49","text_uthmani_simple":"اهؤلاء الذين اقسمتم لا ينالهم الله برحمة ادخلوا۟ الجنة لا خوف عليكم ولا انتم تحزنون"},{"id":1004,"verse_key":"7:50","text_uthmani_simple":"ونادى اصحب النار اصحب الجنة ان افيضوا۟ علينا من الماء او مما رزقكم الله قالوا۟ ان الله حرمهما على الكفرين"},{"id":1005,"verse_key":"7:51","text_uthmani_simple":"الذين اتخذوا۟ دينهم لهوا ولعبا وغرتهم الحيوة الدنيا فاليوم ننسىهم كما نسوا۟ لقاء يومهم هذا وما كانوا۟ بـايتنا يجحدون"},{"id":1006,"verse_key":"7:52","text_uthmani_simple":"ولقد جئنهم بكتب فصلنه على علم هدى ورحمة لقوم يؤمنون"},{"id":1007,"verse_key":"7:53","text_uthmani_simple":"هل ينظرون الا تاويله يوم ياتى تاويله يقول الذين نسوه من قبل قد جاءت رسل ربنا بالحق فهل لنا من شفعاء فيشفعوا۟ لنا او نرد فنعمل غير الذى كنا نعمل قد خسروا۟ انفسهم وضل عنهم ما كانوا۟ يفترون"},{"id":1008,"verse_key":"7:54","text_uthmani_simple":"ان ربكم الله الذى خلق السموت والارض فى ستة ايام ثم استوى على العرش يغشى اليل النهار يطلبه حثيثا والشمس والقمر والنجوم مسخرتۭ بامره الا له الخلق والامر تبارك الله رب العلمين"},{"id":1009,"verse_key":"7:55","text_uthmani_simple":"ادعوا۟ ربكم تضرعا وخفية انه لا يحب المعتدين"},{"id":1010,"verse_key":"7:56","text_uthmani_simple":"ولا تفسدوا۟ فى الارض بعد اصلحها وادعوه خوفا وطمعا ان رحمت الله قريب من المحسنين"},{"id":1011,"verse_key":"7:57","text_uthmani_simple":"وهو الذى يرسل الريح بشرۢا بين يدى رحمته حتى اذا اقلت سحابا ثقالا سقنه لبلد ميت فانزلنا به الماء فاخرجنا به من كل الثمرت كذلك نخرج الموتى لعلكم تذكرون"},{"id":1012,"verse_key":"7:58","text_uthmani_simple":"والبلد الطيب يخرج نباته باذن ربه والذى خبث لا يخرج الا نكدا كذلك نصرف الءايت لقوم يشكرون"},{"id":1013,"verse_key":"7:59","text_uthmani_simple":"لقد ارسلنا نوحا الى قومه فقال يقوم اعبدوا۟ الله ما لكم من اله غيره انى اخاف عليكم عذاب يوم عظيم"},{"id":1014,"verse_key":"7:60","text_uthmani_simple":"قال الملا من قومه انا لنرىك فى ضلل مبين"},{"id":1015,"verse_key":"7:61","text_uthmani_simple":"قال يقوم ليس بى ضللة ولكنى رسول من رب العلمين"},{"id":1016,"verse_key":"7:62","text_uthmani_simple":"ابلغكم رسلت ربى وانصح لكم واعلم من الله ما لا تعلمون"},{"id":1017,"verse_key":"7:63","text_uthmani_simple":"اوعجبتم ان جاءكم ذكر من ربكم على رجل منكم لينذركم ولتتقوا۟ ولعلكم ترحمون"},{"id":1018,"verse_key":"7:64","text_uthmani_simple":"فكذبوه فانجينه والذين معه فى الفلك واغرقنا الذين كذبوا۟ بـايتنا انهم كانوا۟ قوما عمين"},{"id":1019,"verse_key":"7:65","text_uthmani_simple":"والى عاد اخاهم هودا قال يقوم اعبدوا۟ الله ما لكم من اله غيره افلا تتقون"},{"id":1020,"verse_key":"7:66","text_uthmani_simple":"قال الملا الذين كفروا۟ من قومه انا لنرىك فى سفاهة وانا لنظنك من الكذبين"},{"id":1021,"verse_key":"7:67","text_uthmani_simple":"قال يقوم ليس بى سفاهة ولكنى رسول من رب العلمين"},{"id":1022,"verse_key":"7:68","text_uthmani_simple":"ابلغكم رسلت ربى وانا۠ لكم ناصح امين"},{"id":1023,"verse_key":"7:69","text_uthmani_simple":"اوعجبتم ان جاءكم ذكر من ربكم على رجل منكم لينذركم واذكروا۟ اذ جعلكم خلفاء منۢ بعد قوم نوح وزادكم فى الخلق بصۜطة فاذكروا۟ ءالاء الله لعلكم تفلحون"},{"id":1024,"verse_key":"7:70","text_uthmani_simple":"قالوا۟ اجئتنا لنعبد الله وحده ونذر ما كان يعبد ءاباؤنا فاتنا بما تعدنا ان كنت من الصدقين"},{"id":1025,"verse_key":"7:71","text_uthmani_simple":"قال قد وقع عليكم من ربكم رجس وغضب اتجدلوننى فى اسماء سميتموها انتم وءاباؤكم ما نزل الله بها من سلطن فانتظروا۟ انى معكم من المنتظرين"},{"id":1026,"verse_key":"7:72","text_uthmani_simple":"فانجينه والذين معه برحمة منا وقطعنا دابر الذين كذبوا۟ بـايتنا وما كانوا۟ مؤمنين"},{"id":1027,"verse_key":"7:73","text_uthmani_simple":"والى ثمود اخاهم صلحا قال يقوم اعبدوا۟ الله ما لكم من اله غيره قد جاءتكم بينة من ربكم هذه ناقة الله لكم ءاية فذروها تاكل فى ارض الله ولا تمسوها بسوء فياخذكم عذاب اليم"},{"id":1028,"verse_key":"7:74","text_uthmani_simple":"واذكروا۟ اذ جعلكم خلفاء منۢ بعد عاد وبواكم فى الارض تتخذون من سهولها قصورا وتنحتون الجبال بيوتا فاذكروا۟ ءالاء الله ولا تعثوا۟ فى الارض مفسدين"},{"id":1029,"verse_key":"7:75","text_uthmani_simple":"قال الملا الذين استكبروا۟ من قومه للذين استضعفوا۟ لمن ءامن منهم اتعلمون ان صلحا مرسل من ربه قالوا۟ انا بما ارسل به مؤمنون"},{"id":1030,"verse_key":"7:76","text_uthmani_simple":"قال الذين استكبروا۟ انا بالذى ءامنتم به كفرون"},{"id":1031,"verse_key":"7:77","text_uthmani_simple":"فعقروا۟ الناقة وعتوا۟ عن امر ربهم وقالوا۟ يصلح ائتنا بما تعدنا ان كنت من المرسلين"},{"id":1032,"verse_key":"7:78","text_uthmani_simple":"فاخذتهم الرجفة فاصبحوا۟ فى دارهم جثمين"},{"id":1033,"verse_key":"7:79","text_uthmani_simple":"فتولى عنهم وقال يقوم لقد ابلغتكم رسالة ربى ونصحت لكم ولكن لا تحبون النصحين"},{"id":1034,"verse_key":"7:80","text_uthmani_simple":"ولوطا اذ قال لقومه اتاتون الفحشة ما سبقكم بها من احد من العلمين"},{"id":1035,"verse_key":"7:81","text_uthmani_simple":"انكم لتاتون الرجال شهوة من دون النساء بل انتم قوم مسرفون"},{"id":1036,"verse_key":"7:82","text_uthmani_simple":"وما كان جواب قومه الا ان قالوا۟ اخرجوهم من قريتكم انهم اناس يتطهرون"},{"id":1037,"verse_key":"7:83","text_uthmani_simple":"فانجينه واهله الا امراته كانت من الغبرين"},{"id":1038,"verse_key":"7:84","text_uthmani_simple":"وامطرنا عليهم مطرا فانظر كيف كان عقبة المجرمين"},{"id":1039,"verse_key":"7:85","text_uthmani_simple":"والى مدين اخاهم شعيبا قال يقوم اعبدوا۟ الله ما لكم من اله غيره قد جاءتكم بينة من ربكم فاوفوا۟ الكيل والميزان ولا تبخسوا۟ الناس اشياءهم ولا تفسدوا۟ فى الارض بعد اصلحها ذلكم خير لكم ان كنتم مؤمنين"},{"id":1040,"verse_key":"7:86","text_uthmani_simple":"ولا تقعدوا۟ بكل صرط توعدون وتصدون عن سبيل الله من ءامن به وتبغونها عوجا واذكروا۟ اذ كنتم قليلا فكثركم وانظروا۟ كيف كان عقبة المفسدين"},{"id":1041,"verse_key":"7:87","text_uthmani_simple":"وان كان طائفة منكم ءامنوا۟ بالذى ارسلت به وطائفة لم يؤمنوا۟ فاصبروا۟ حتى يحكم الله بيننا وهو خير الحكمين"}],"meta":{"filters":{"juz_number":"8"}}}
