{"verses":[{"id":751,"verse_key":"5:82","text_uthmani_simple":"لتجدن اشد الناس عدوة للذين ءامنوا۟ اليهود والذين اشركوا۟ ولتجدن اقربهم مودة للذين ءامنوا۟ الذين قالوا۟ انا نصرى ذلك بان منهم قسيسين ورهبانا وانهم لا يستكبرون"},{"id":752,"verse_key":"5:83","text_uthmani_simple":"واذا سمعوا۟ ما انزل الى الرسول ترى اعينهم تفيض من الدمع مما عرفوا۟ من الحق يقولون ربنا ءامنا فاكتبنا مع الشهدين"},{"id":753,"verse_key":"5:84","text_uthmani_simple":"وما لنا لا نؤمن بالله وما جاءنا من الحق ونطمع ان يدخلنا ربنا مع القوم الصلحين"},{"id":754,"verse_key":"5:85","text_uthmani_simple":"فاثبهم الله بما قالوا۟ جنت تجرى من تحتها الانهر خلدين فيها وذلك جزاء المحسنين"},{"id":755,"verse_key":"5:86","text_uthmani_simple":"والذين كفروا۟ وكذبوا۟ بـايتنا او۟لئك اصحب الجحيم"},{"id":756,"verse_key":"5:87","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تحرموا۟ طيبت ما احل الله لكم ولا تعتدوا۟ ان الله لا يحب المعتدين"},{"id":757,"verse_key":"5:88","text_uthmani_simple":"وكلوا۟ مما رزقكم الله حللا طيبا واتقوا۟ الله الذى انتم به مؤمنون"},{"id":758,"verse_key":"5:89","text_uthmani_simple":"لا يؤاخذكم الله باللغو فى ايمنكم ولكن يؤاخذكم بما عقدتم الايمن فكفرته اطعام عشرة مسكين من اوسط ما تطعمون اهليكم او كسوتهم او تحرير رقبة فمن لم يجد فصيام ثلثة ايام ذلك كفرة ايمنكم اذا حلفتم واحفظوا۟ ايمنكم كذلك يبين الله لكم ءايته لعلكم تشكرون"},{"id":759,"verse_key":"5:90","text_uthmani_simple":"يايها الذين ءامنوا۟ انما الخمر والميسر والانصاب والازلم رجس من عمل الشيطن فاجتنبوه لعلكم تفلحون"},{"id":760,"verse_key":"5:91","text_uthmani_simple":"انما يريد الشيطن ان يوقع بينكم العدوة والبغضاء فى الخمر والميسر ويصدكم عن ذكر الله وعن الصلوة فهل انتم منتهون"},{"id":761,"verse_key":"5:92","text_uthmani_simple":"واطيعوا۟ الله واطيعوا۟ الرسول واحذروا۟ فان توليتم فاعلموا۟ انما على رسولنا البلغ المبين"},{"id":762,"verse_key":"5:93","text_uthmani_simple":"ليس على الذين ءامنوا۟ وعملوا۟ الصلحت جناح فيما طعموا۟ اذا ما اتقوا۟ وءامنوا۟ وعملوا۟ الصلحت ثم اتقوا۟ وءامنوا۟ ثم اتقوا۟ واحسنوا۟ والله يحب المحسنين"},{"id":763,"verse_key":"5:94","text_uthmani_simple":"يايها الذين ءامنوا۟ ليبلونكم الله بشىء من الصيد تناله ايديكم ورماحكم ليعلم الله من يخافه بالغيب فمن اعتدى بعد ذلك فله عذاب اليم"},{"id":764,"verse_key":"5:95","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تقتلوا۟ الصيد وانتم حرم ومن قتله منكم متعمدا فجزاء مثل ما قتل من النعم يحكم به ذوا عدل منكم هديۢا بلغ الكعبة او كفرة طعام مسكين او عدل ذلك صياما ليذوق وبال امره عفا الله عما سلف ومن عاد فينتقم الله منه والله عزيز ذو انتقام"},{"id":765,"verse_key":"5:96","text_uthmani_simple":"احل لكم صيد البحر وطعامه متعا لكم وللسيارة وحرم عليكم صيد البر ما دمتم حرما واتقوا۟ الله الذى اليه تحشرون"},{"id":766,"verse_key":"5:97","text_uthmani_simple":"جعل الله الكعبة البيت الحرام قيما للناس والشهر الحرام والهدى والقلئد ذلك لتعلموا۟ ان الله يعلم ما فى السموت وما فى الارض وان الله بكل شىء عليم"},{"id":767,"verse_key":"5:98","text_uthmani_simple":"اعلموا۟ ان الله شديد العقاب وان الله غفور رحيم"},{"id":768,"verse_key":"5:99","text_uthmani_simple":"ما على الرسول الا البلغ والله يعلم ما تبدون وما تكتمون"},{"id":769,"verse_key":"5:100","text_uthmani_simple":"قل لا يستوى الخبيث والطيب ولو اعجبك كثرة الخبيث فاتقوا۟ الله ياو۟لى الالبب لعلكم تفلحون"},{"id":770,"verse_key":"5:101","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تسـلوا۟ عن اشياء ان تبد لكم تسؤكم وان تسـلوا۟ عنها حين ينزل القرءان تبد لكم عفا الله عنها والله غفور حليم"},{"id":771,"verse_key":"5:102","text_uthmani_simple":"قد سالها قوم من قبلكم ثم اصبحوا۟ بها كفرين"},{"id":772,"verse_key":"5:103","text_uthmani_simple":"ما جعل الله منۢ بحيرة ولا سائبة ولا وصيلة ولا حام ولكن الذين كفروا۟ يفترون على الله الكذب واكثرهم لا يعقلون"},{"id":773,"verse_key":"5:104","text_uthmani_simple":"واذا قيل لهم تعالوا۟ الى ما انزل الله والى الرسول قالوا۟ حسبنا ما وجدنا عليه ءاباءنا اولو كان ءاباؤهم لا يعلمون شيـا ولا يهتدون"},{"id":774,"verse_key":"5:105","text_uthmani_simple":"يايها الذين ءامنوا۟ عليكم انفسكم لا يضركم من ضل اذا اهتديتم الى الله مرجعكم جميعا فينبئكم بما كنتم تعملون"},{"id":775,"verse_key":"5:106","text_uthmani_simple":"يايها الذين ءامنوا۟ شهدة بينكم اذا حضر احدكم الموت حين الوصية اثنان ذوا عدل منكم او ءاخران من غيركم ان انتم ضربتم فى الارض فاصبتكم مصيبة الموت تحبسونهما منۢ بعد الصلوة فيقسمان بالله ان ارتبتم لا نشترى به ثمنا ولو كان ذا قربى ولا نكتم شهدة الله انا اذا لمن الءاثمين"},{"id":776,"verse_key":"5:107","text_uthmani_simple":"فان عثر على انهما استحقا اثما فـاخران يقومان مقامهما من الذين استحق عليهم الاولين فيقسمان بالله لشهدتنا احق من شهدتهما وما اعتدينا انا اذا لمن الظلمين"},{"id":777,"verse_key":"5:108","text_uthmani_simple":"ذلك ادنى ان ياتوا۟ بالشهدة على وجهها او يخافوا۟ ان ترد ايمنۢ بعد ايمنهم واتقوا۟ الله واسمعوا۟ والله لا يهدى القوم الفسقين"},{"id":778,"verse_key":"5:109","text_uthmani_simple":"يوم يجمع الله الرسل فيقول ماذا اجبتم قالوا۟ لا علم لنا انك انت علم الغيوب"},{"id":779,"verse_key":"5:110","text_uthmani_simple":"اذ قال الله يعيسى ابن مريم اذكر نعمتى عليك وعلى ولدتك اذ ايدتك بروح القدس تكلم الناس فى المهد وكهلا واذ علمتك الكتب والحكمة والتورىة والانجيل واذ تخلق من الطين كهيـة الطير باذنى فتنفخ فيها فتكون طيرۢا باذنى وتبرئ الاكمه والابرص باذنى واذ تخرج الموتى باذنى واذ كففت بنى اسرءيل عنك اذ جئتهم بالبينت فقال الذين كفروا۟ منهم ان هذا الا سحر مبين"},{"id":780,"verse_key":"5:111","text_uthmani_simple":"واذ اوحيت الى الحوارين ان ءامنوا۟ بى وبرسولى قالوا۟ ءامنا واشهد باننا مسلمون"},{"id":781,"verse_key":"5:112","text_uthmani_simple":"اذ قال الحواريون يعيسى ابن مريم هل يستطيع ربك ان ينزل علينا مائدة من السماء قال اتقوا۟ الله ان كنتم مؤمنين"},{"id":782,"verse_key":"5:113","text_uthmani_simple":"قالوا۟ نريد ان ناكل منها وتطمئن قلوبنا ونعلم ان قد صدقتنا ونكون عليها من الشهدين"},{"id":783,"verse_key":"5:114","text_uthmani_simple":"قال عيسى ابن مريم اللهم ربنا انزل علينا مائدة من السماء تكون لنا عيدا لاولنا وءاخرنا وءاية منك وارزقنا وانت خير الرزقين"},{"id":784,"verse_key":"5:115","text_uthmani_simple":"قال الله انى منزلها عليكم فمن يكفر بعد منكم فانى اعذبه عذابا لا اعذبه احدا من العلمين"},{"id":785,"verse_key":"5:116","text_uthmani_simple":"واذ قال الله يعيسى ابن مريم ءانت قلت للناس اتخذونى وامى الهين من دون الله قال سبحنك ما يكون لى ان اقول ما ليس لى بحق ان كنت قلته فقد علمته تعلم ما فى نفسى ولا اعلم ما فى نفسك انك انت علم الغيوب"},{"id":786,"verse_key":"5:117","text_uthmani_simple":"ما قلت لهم الا ما امرتنى به ان اعبدوا۟ الله ربى وربكم وكنت عليهم شهيدا ما دمت فيهم فلما توفيتنى كنت انت الرقيب عليهم وانت على كل شىء شهيد"},{"id":787,"verse_key":"5:118","text_uthmani_simple":"ان تعذبهم فانهم عبادك وان تغفر لهم فانك انت العزيز الحكيم"},{"id":788,"verse_key":"5:119","text_uthmani_simple":"قال الله هذا يوم ينفع الصدقين صدقهم لهم جنت تجرى من تحتها الانهر خلدين فيها ابدا رضى الله عنهم ورضوا۟ عنه ذلك الفوز العظيم"},{"id":789,"verse_key":"5:120","text_uthmani_simple":"لله ملك السموت والارض وما فيهن وهو على كل شىء قديرۢ"},{"id":790,"verse_key":"6:1","text_uthmani_simple":"الحمد لله الذى خلق السموت والارض وجعل الظلمت والنور ثم الذين كفروا۟ بربهم يعدلون"},{"id":791,"verse_key":"6:2","text_uthmani_simple":"هو الذى خلقكم من طين ثم قضى اجلا واجل مسمى عنده ثم انتم تمترون"},{"id":792,"verse_key":"6:3","text_uthmani_simple":"وهو الله فى السموت وفى الارض يعلم سركم وجهركم ويعلم ما تكسبون"},{"id":793,"verse_key":"6:4","text_uthmani_simple":"وما تاتيهم من ءاية من ءايت ربهم الا كانوا۟ عنها معرضين"},{"id":794,"verse_key":"6:5","text_uthmani_simple":"فقد كذبوا۟ بالحق لما جاءهم فسوف ياتيهم انۢبؤا۟ ما كانوا۟ به يستهزءون"},{"id":795,"verse_key":"6:6","text_uthmani_simple":"الم يروا۟ كم اهلكنا من قبلهم من قرن مكنهم فى الارض ما لم نمكن لكم وارسلنا السماء عليهم مدرارا وجعلنا الانهر تجرى من تحتهم فاهلكنهم بذنوبهم وانشانا منۢ بعدهم قرنا ءاخرين"},{"id":796,"verse_key":"6:7","text_uthmani_simple":"ولو نزلنا عليك كتبا فى قرطاس فلمسوه بايديهم لقال الذين كفروا۟ ان هذا الا سحر مبين"},{"id":797,"verse_key":"6:8","text_uthmani_simple":"وقالوا۟ لولا انزل عليه ملك ولو انزلنا ملكا لقضى الامر ثم لا ينظرون"},{"id":798,"verse_key":"6:9","text_uthmani_simple":"ولو جعلنه ملكا لجعلنه رجلا وللبسنا عليهم ما يلبسون"},{"id":799,"verse_key":"6:10","text_uthmani_simple":"ولقد استهزئ برسل من قبلك فحاق بالذين سخروا۟ منهم ما كانوا۟ به يستهزءون"},{"id":800,"verse_key":"6:11","text_uthmani_simple":"قل سيروا۟ فى الارض ثم انظروا۟ كيف كان عقبة المكذبين"},{"id":801,"verse_key":"6:12","text_uthmani_simple":"قل لمن ما فى السموت والارض قل لله كتب على نفسه الرحمة ليجمعنكم الى يوم القيمة لا ريب فيه الذين خسروا۟ انفسهم فهم لا يؤمنون"},{"id":802,"verse_key":"6:13","text_uthmani_simple":"وله ما سكن فى اليل والنهار وهو السميع العليم"},{"id":803,"verse_key":"6:14","text_uthmani_simple":"قل اغير الله اتخذ وليا فاطر السموت والارض وهو يطعم ولا يطعم قل انى امرت ان اكون اول من اسلم ولا تكونن من المشركين"},{"id":804,"verse_key":"6:15","text_uthmani_simple":"قل انى اخاف ان عصيت ربى عذاب يوم عظيم"},{"id":805,"verse_key":"6:16","text_uthmani_simple":"من يصرف عنه يومئذ فقد رحمه وذلك الفوز المبين"},{"id":806,"verse_key":"6:17","text_uthmani_simple":"وان يمسسك الله بضر فلا كاشف له الا هو وان يمسسك بخير فهو على كل شىء قدير"},{"id":807,"verse_key":"6:18","text_uthmani_simple":"وهو القاهر فوق عباده وهو الحكيم الخبير"},{"id":808,"verse_key":"6:19","text_uthmani_simple":"قل اى شىء اكبر شهدة قل الله شهيدۢ بينى وبينكم واوحى الى هذا القرءان لانذركم به ومنۢ بلغ ائنكم لتشهدون ان مع الله ءالهة اخرى قل لا اشهد قل انما هو اله وحد واننى برىء مما تشركون"},{"id":809,"verse_key":"6:20","text_uthmani_simple":"الذين ءاتينهم الكتب يعرفونه كما يعرفون ابناءهم الذين خسروا۟ انفسهم فهم لا يؤمنون"},{"id":810,"verse_key":"6:21","text_uthmani_simple":"ومن اظلم ممن افترى على الله كذبا او كذب بـايته انه لا يفلح الظلمون"},{"id":811,"verse_key":"6:22","text_uthmani_simple":"ويوم نحشرهم جميعا ثم نقول للذين اشركوا۟ اين شركاؤكم الذين كنتم تزعمون"},{"id":812,"verse_key":"6:23","text_uthmani_simple":"ثم لم تكن فتنتهم الا ان قالوا۟ والله ربنا ما كنا مشركين"},{"id":813,"verse_key":"6:24","text_uthmani_simple":"انظر كيف كذبوا۟ على انفسهم وضل عنهم ما كانوا۟ يفترون"},{"id":814,"verse_key":"6:25","text_uthmani_simple":"ومنهم من يستمع اليك وجعلنا على قلوبهم اكنة ان يفقهوه وفى ءاذانهم وقرا وان يروا۟ كل ءاية لا يؤمنوا۟ بها حتى اذا جاءوك يجدلونك يقول الذين كفروا۟ ان هذا الا اسطير الاولين"},{"id":815,"verse_key":"6:26","text_uthmani_simple":"وهم ينهون عنه وينـون عنه وان يهلكون الا انفسهم وما يشعرون"},{"id":816,"verse_key":"6:27","text_uthmani_simple":"ولو ترى اذ وقفوا۟ على النار فقالوا۟ يليتنا نرد ولا نكذب بـايت ربنا ونكون من المؤمنين"},{"id":817,"verse_key":"6:28","text_uthmani_simple":"بل بدا لهم ما كانوا۟ يخفون من قبل ولو ردوا۟ لعادوا۟ لما نهوا۟ عنه وانهم لكذبون"},{"id":818,"verse_key":"6:29","text_uthmani_simple":"وقالوا۟ ان هى الا حياتنا الدنيا وما نحن بمبعوثين"},{"id":819,"verse_key":"6:30","text_uthmani_simple":"ولو ترى اذ وقفوا۟ على ربهم قال اليس هذا بالحق قالوا۟ بلى وربنا قال فذوقوا۟ العذاب بما كنتم تكفرون"},{"id":820,"verse_key":"6:31","text_uthmani_simple":"قد خسر الذين كذبوا۟ بلقاء الله حتى اذا جاءتهم الساعة بغتة قالوا۟ يحسرتنا على ما فرطنا فيها وهم يحملون اوزارهم على ظهورهم الا ساء ما يزرون"},{"id":821,"verse_key":"6:32","text_uthmani_simple":"وما الحيوة الدنيا الا لعب ولهو وللدار الءاخرة خير للذين يتقون افلا تعقلون"},{"id":822,"verse_key":"6:33","text_uthmani_simple":"قد نعلم انه ليحزنك الذى يقولون فانهم لا يكذبونك ولكن الظلمين بـايت الله يجحدون"},{"id":823,"verse_key":"6:34","text_uthmani_simple":"ولقد كذبت رسل من قبلك فصبروا۟ على ما كذبوا۟ واوذوا۟ حتى اتىهم نصرنا ولا مبدل لكلمت الله ولقد جاءك من نباى۟ المرسلين"},{"id":824,"verse_key":"6:35","text_uthmani_simple":"وان كان كبر عليك اعراضهم فان استطعت ان تبتغى نفقا فى الارض او سلما فى السماء فتاتيهم بـاية ولو شاء الله لجمعهم على الهدى فلا تكونن من الجهلين"},{"id":825,"verse_key":"6:36","text_uthmani_simple":"انما يستجيب الذين يسمعون والموتى يبعثهم الله ثم اليه يرجعون"},{"id":826,"verse_key":"6:37","text_uthmani_simple":"وقالوا۟ لولا نزل عليه ءاية من ربه قل ان الله قادر على ان ينزل ءاية ولكن اكثرهم لا يعلمون"},{"id":827,"verse_key":"6:38","text_uthmani_simple":"وما من دابة فى الارض ولا طئر يطير بجناحيه الا امم امثالكم ما فرطنا فى الكتب من شىء ثم الى ربهم يحشرون"},{"id":828,"verse_key":"6:39","text_uthmani_simple":"والذين كذبوا۟ بـايتنا صم وبكم فى الظلمت من يشا الله يضلله ومن يشا يجعله على صرط مستقيم"},{"id":829,"verse_key":"6:40","text_uthmani_simple":"قل ارءيتكم ان اتىكم عذاب الله او اتتكم الساعة اغير الله تدعون ان كنتم صدقين"},{"id":830,"verse_key":"6:41","text_uthmani_simple":"بل اياه تدعون فيكشف ما تدعون اليه ان شاء وتنسون ما تشركون"},{"id":831,"verse_key":"6:42","text_uthmani_simple":"ولقد ارسلنا الى امم من قبلك فاخذنهم بالباساء والضراء لعلهم يتضرعون"},{"id":832,"verse_key":"6:43","text_uthmani_simple":"فلولا اذ جاءهم باسنا تضرعوا۟ ولكن قست قلوبهم وزين لهم الشيطن ما كانوا۟ يعملون"},{"id":833,"verse_key":"6:44","text_uthmani_simple":"فلما نسوا۟ ما ذكروا۟ به فتحنا عليهم ابوب كل شىء حتى اذا فرحوا۟ بما اوتوا۟ اخذنهم بغتة فاذا هم مبلسون"},{"id":834,"verse_key":"6:45","text_uthmani_simple":"فقطع دابر القوم الذين ظلموا۟ والحمد لله رب العلمين"},{"id":835,"verse_key":"6:46","text_uthmani_simple":"قل ارءيتم ان اخذ الله سمعكم وابصركم وختم على قلوبكم من اله غير الله ياتيكم به انظر كيف نصرف الءايت ثم هم يصدفون"},{"id":836,"verse_key":"6:47","text_uthmani_simple":"قل ارءيتكم ان اتىكم عذاب الله بغتة او جهرة هل يهلك الا القوم الظلمون"},{"id":837,"verse_key":"6:48","text_uthmani_simple":"وما نرسل المرسلين الا مبشرين ومنذرين فمن ءامن واصلح فلا خوف عليهم ولا هم يحزنون"},{"id":838,"verse_key":"6:49","text_uthmani_simple":"والذين كذبوا۟ بـايتنا يمسهم العذاب بما كانوا۟ يفسقون"},{"id":839,"verse_key":"6:50","text_uthmani_simple":"قل لا اقول لكم عندى خزائن الله ولا اعلم الغيب ولا اقول لكم انى ملك ان اتبع الا ما يوحى الى قل هل يستوى الاعمى والبصير افلا تتفكرون"},{"id":840,"verse_key":"6:51","text_uthmani_simple":"وانذر به الذين يخافون ان يحشروا۟ الى ربهم ليس لهم من دونه ولى ولا شفيع لعلهم يتقون"},{"id":841,"verse_key":"6:52","text_uthmani_simple":"ولا تطرد الذين يدعون ربهم بالغدوة والعشى يريدون وجهه ما عليك من حسابهم من شىء وما من حسابك عليهم من شىء فتطردهم فتكون من الظلمين"},{"id":842,"verse_key":"6:53","text_uthmani_simple":"وكذلك فتنا بعضهم ببعض ليقولوا۟ اهؤلاء من الله عليهم منۢ بيننا اليس الله باعلم بالشكرين"},{"id":843,"verse_key":"6:54","text_uthmani_simple":"واذا جاءك الذين يؤمنون بـايتنا فقل سلم عليكم كتب ربكم على نفسه الرحمة انه من عمل منكم سوءۢا بجهلة ثم تاب منۢ بعده واصلح فانه غفور رحيم"},{"id":844,"verse_key":"6:55","text_uthmani_simple":"وكذلك نفصل الءايت ولتستبين سبيل المجرمين"},{"id":845,"verse_key":"6:56","text_uthmani_simple":"قل انى نهيت ان اعبد الذين تدعون من دون الله قل لا اتبع اهواءكم قد ضللت اذا وما انا۠ من المهتدين"},{"id":846,"verse_key":"6:57","text_uthmani_simple":"قل انى على بينة من ربى وكذبتم به ما عندى ما تستعجلون به ان الحكم الا لله يقص الحق وهو خير الفصلين"},{"id":847,"verse_key":"6:58","text_uthmani_simple":"قل لو ان عندى ما تستعجلون به لقضى الامر بينى وبينكم والله اعلم بالظلمين"},{"id":848,"verse_key":"6:59","text_uthmani_simple":"وعنده مفاتح الغيب لا يعلمها الا هو ويعلم ما فى البر والبحر وما تسقط من ورقة الا يعلمها ولا حبة فى ظلمت الارض ولا رطب ولا يابس الا فى كتب مبين"},{"id":849,"verse_key":"6:60","text_uthmani_simple":"وهو الذى يتوفىكم باليل ويعلم ما جرحتم بالنهار ثم يبعثكم فيه ليقضى اجل مسمى ثم اليه مرجعكم ثم ينبئكم بما كنتم تعملون"},{"id":850,"verse_key":"6:61","text_uthmani_simple":"وهو القاهر فوق عباده ويرسل عليكم حفظة حتى اذا جاء احدكم الموت توفته رسلنا وهم لا يفرطون"},{"id":851,"verse_key":"6:62","text_uthmani_simple":"ثم ردوا۟ الى الله مولىهم الحق الا له الحكم وهو اسرع الحسبين"},{"id":852,"verse_key":"6:63","text_uthmani_simple":"قل من ينجيكم من ظلمت البر والبحر تدعونه تضرعا وخفية لئن انجىنا من هذه لنكونن من الشكرين"},{"id":853,"verse_key":"6:64","text_uthmani_simple":"قل الله ينجيكم منها ومن كل كرب ثم انتم تشركون"},{"id":854,"verse_key":"6:65","text_uthmani_simple":"قل هو القادر على ان يبعث عليكم عذابا من فوقكم او من تحت ارجلكم او يلبسكم شيعا ويذيق بعضكم باس بعض انظر كيف نصرف الءايت لعلهم يفقهون"},{"id":855,"verse_key":"6:66","text_uthmani_simple":"وكذب به قومك وهو الحق قل لست عليكم بوكيل"},{"id":856,"verse_key":"6:67","text_uthmani_simple":"لكل نبا مستقر وسوف تعلمون"},{"id":857,"verse_key":"6:68","text_uthmani_simple":"واذا رايت الذين يخوضون فى ءايتنا فاعرض عنهم حتى يخوضوا۟ فى حديث غيره واما ينسينك الشيطن فلا تقعد بعد الذكرى مع القوم الظلمين"},{"id":858,"verse_key":"6:69","text_uthmani_simple":"وما على الذين يتقون من حسابهم من شىء ولكن ذكرى لعلهم يتقون"},{"id":859,"verse_key":"6:70","text_uthmani_simple":"وذر الذين اتخذوا۟ دينهم لعبا ولهوا وغرتهم الحيوة الدنيا وذكر به ان تبسل نفسۢ بما كسبت ليس لها من دون الله ولى ولا شفيع وان تعدل كل عدل لا يؤخذ منها او۟لئك الذين ابسلوا۟ بما كسبوا۟ لهم شراب من حميم وعذاب اليمۢ بما كانوا۟ يكفرون"},{"id":860,"verse_key":"6:71","text_uthmani_simple":"قل اندعوا۟ من دون الله ما لا ينفعنا ولا يضرنا ونرد على اعقابنا بعد اذ هدىنا الله كالذى استهوته الشيطين فى الارض حيران له اصحب يدعونه الى الهدى ائتنا قل ان هدى الله هو الهدى وامرنا لنسلم لرب العلمين"},{"id":861,"verse_key":"6:72","text_uthmani_simple":"وان اقيموا۟ الصلوة واتقوه وهو الذى اليه تحشرون"},{"id":862,"verse_key":"6:73","text_uthmani_simple":"وهو الذى خلق السموت والارض بالحق ويوم يقول كن فيكون قوله الحق وله الملك يوم ينفخ فى الصور علم الغيب والشهدة وهو الحكيم الخبير"},{"id":863,"verse_key":"6:74","text_uthmani_simple":"واذ قال ابرهيم لابيه ءازر اتتخذ اصناما ءالهة انى ارىك وقومك فى ضلل مبين"},{"id":864,"verse_key":"6:75","text_uthmani_simple":"وكذلك نرى ابرهيم ملكوت السموت والارض وليكون من الموقنين"},{"id":865,"verse_key":"6:76","text_uthmani_simple":"فلما جن عليه اليل رءا كوكبا قال هذا ربى فلما افل قال لا احب الءافلين"},{"id":866,"verse_key":"6:77","text_uthmani_simple":"فلما رءا القمر بازغا قال هذا ربى فلما افل قال لئن لم يهدنى ربى لاكونن من القوم الضالين"},{"id":867,"verse_key":"6:78","text_uthmani_simple":"فلما رءا الشمس بازغة قال هذا ربى هذا اكبر فلما افلت قال يقوم انى برىء مما تشركون"},{"id":868,"verse_key":"6:79","text_uthmani_simple":"انى وجهت وجهى للذى فطر السموت والارض حنيفا وما انا۠ من المشركين"},{"id":869,"verse_key":"6:80","text_uthmani_simple":"وحاجه قومه قال اتحجونى فى الله وقد هدىن ولا اخاف ما تشركون به الا ان يشاء ربى شيـا وسع ربى كل شىء علما افلا تتذكرون"},{"id":870,"verse_key":"6:81","text_uthmani_simple":"وكيف اخاف ما اشركتم ولا تخافون انكم اشركتم بالله ما لم ينزل به عليكم سلطنا فاى الفريقين احق بالامن ان كنتم تعلمون"},{"id":871,"verse_key":"6:82","text_uthmani_simple":"الذين ءامنوا۟ ولم يلبسوا۟ ايمنهم بظلم او۟لئك لهم الامن وهم مهتدون"},{"id":872,"verse_key":"6:83","text_uthmani_simple":"وتلك حجتنا ءاتينها ابرهيم على قومه نرفع درجت من نشاء ان ربك حكيم عليم"},{"id":873,"verse_key":"6:84","text_uthmani_simple":"ووهبنا له اسحق ويعقوب كلا هدينا ونوحا هدينا من قبل ومن ذريته داود وسليمن وايوب ويوسف وموسى وهرون وكذلك نجزى المحسنين"},{"id":874,"verse_key":"6:85","text_uthmani_simple":"وزكريا ويحيى وعيسى والياس كل من الصلحين"},{"id":875,"verse_key":"6:86","text_uthmani_simple":"واسمعيل واليسع ويونس ولوطا وكلا فضلنا على العلمين"},{"id":876,"verse_key":"6:87","text_uthmani_simple":"ومن ءابائهم وذريتهم واخونهم واجتبينهم وهدينهم الى صرط مستقيم"},{"id":877,"verse_key":"6:88","text_uthmani_simple":"ذلك هدى الله يهدى به من يشاء من عباده ولو اشركوا۟ لحبط عنهم ما كانوا۟ يعملون"},{"id":878,"verse_key":"6:89","text_uthmani_simple":"او۟لئك الذين ءاتينهم الكتب والحكم والنبوة فان يكفر بها هؤلاء فقد وكلنا بها قوما ليسوا۟ بها بكفرين"},{"id":879,"verse_key":"6:90","text_uthmani_simple":"او۟لئك الذين هدى الله فبهدىهم اقتده قل لا اسـلكم عليه اجرا ان هو الا ذكرى للعلمين"},{"id":880,"verse_key":"6:91","text_uthmani_simple":"وما قدروا۟ الله حق قدره اذ قالوا۟ ما انزل الله على بشر من شىء قل من انزل الكتب الذى جاء به موسى نورا وهدى للناس تجعلونه قراطيس تبدونها وتخفون كثيرا وعلمتم ما لم تعلموا۟ انتم ولا ءاباؤكم قل الله ثم ذرهم فى خوضهم يلعبون"},{"id":881,"verse_key":"6:92","text_uthmani_simple":"وهذا كتب انزلنه مبارك مصدق الذى بين يديه ولتنذر ام القرى ومن حولها والذين يؤمنون بالءاخرة يؤمنون به وهم على صلاتهم يحافظون"},{"id":882,"verse_key":"6:93","text_uthmani_simple":"ومن اظلم ممن افترى على الله كذبا او قال اوحى الى ولم يوح اليه شىء ومن قال سانزل مثل ما انزل الله ولو ترى اذ الظلمون فى غمرت الموت والملئكة باسطوا۟ ايديهم اخرجوا۟ انفسكم اليوم تجزون عذاب الهون بما كنتم تقولون على الله غير الحق وكنتم عن ءايته تستكبرون"},{"id":883,"verse_key":"6:94","text_uthmani_simple":"ولقد جئتمونا فردى كما خلقنكم اول مرة وتركتم ما خولنكم وراء ظهوركم وما نرى معكم شفعاءكم الذين زعمتم انهم فيكم شركؤا۟ لقد تقطع بينكم وضل عنكم ما كنتم تزعمون"},{"id":884,"verse_key":"6:95","text_uthmani_simple":"ان الله فالق الحب والنوى يخرج الحى من الميت ومخرج الميت من الحى ذلكم الله فانى تؤفكون"},{"id":885,"verse_key":"6:96","text_uthmani_simple":"فالق الاصباح وجعل اليل سكنا والشمس والقمر حسبانا ذلك تقدير العزيز العليم"},{"id":886,"verse_key":"6:97","text_uthmani_simple":"وهو الذى جعل لكم النجوم لتهتدوا۟ بها فى ظلمت البر والبحر قد فصلنا الءايت لقوم يعلمون"},{"id":887,"verse_key":"6:98","text_uthmani_simple":"وهو الذى انشاكم من نفس وحدة فمستقر ومستودع قد فصلنا الءايت لقوم يفقهون"},{"id":888,"verse_key":"6:99","text_uthmani_simple":"وهو الذى انزل من السماء ماء فاخرجنا به نبات كل شىء فاخرجنا منه خضرا نخرج منه حبا متراكبا ومن النخل من طلعها قنوان دانية وجنت من اعناب والزيتون والرمان مشتبها وغير متشبه انظروا۟ الى ثمره اذا اثمر وينعه ان فى ذلكم لءايت لقوم يؤمنون"},{"id":889,"verse_key":"6:100","text_uthmani_simple":"وجعلوا۟ لله شركاء الجن وخلقهم وخرقوا۟ له بنين وبنتۭ بغير علم سبحنه وتعلى عما يصفون"},{"id":890,"verse_key":"6:101","text_uthmani_simple":"بديع السموت والارض انى يكون له ولد ولم تكن له صحبة وخلق كل شىء وهو بكل شىء عليم"},{"id":891,"verse_key":"6:102","text_uthmani_simple":"ذلكم الله ربكم لا اله الا هو خلق كل شىء فاعبدوه وهو على كل شىء وكيل"},{"id":892,"verse_key":"6:103","text_uthmani_simple":"لا تدركه الابصر وهو يدرك الابصر وهو اللطيف الخبير"},{"id":893,"verse_key":"6:104","text_uthmani_simple":"قد جاءكم بصائر من ربكم فمن ابصر فلنفسه ومن عمى فعليها وما انا۠ عليكم بحفيظ"},{"id":894,"verse_key":"6:105","text_uthmani_simple":"وكذلك نصرف الءايت وليقولوا۟ درست ولنبينه لقوم يعلمون"},{"id":895,"verse_key":"6:106","text_uthmani_simple":"اتبع ما اوحى اليك من ربك لا اله الا هو واعرض عن المشركين"},{"id":896,"verse_key":"6:107","text_uthmani_simple":"ولو شاء الله ما اشركوا۟ وما جعلنك عليهم حفيظا وما انت عليهم بوكيل"},{"id":897,"verse_key":"6:108","text_uthmani_simple":"ولا تسبوا۟ الذين يدعون من دون الله فيسبوا۟ الله عدوۢا بغير علم كذلك زينا لكل امة عملهم ثم الى ربهم مرجعهم فينبئهم بما كانوا۟ يعملون"},{"id":898,"verse_key":"6:109","text_uthmani_simple":"واقسموا۟ بالله جهد ايمنهم لئن جاءتهم ءاية ليؤمنن بها قل انما الءايت عند الله وما يشعركم انها اذا جاءت لا يؤمنون"},{"id":899,"verse_key":"6:110","text_uthmani_simple":"ونقلب افـدتهم وابصرهم كما لم يؤمنوا۟ به اول مرة ونذرهم فى طغينهم يعمهون"}],"meta":{"filters":{"juz_number":"7"}}}
