{"verses":[{"id":1,"verse_key":"1:1","text_uthmani_simple":"بسم الله الرحمن الرحيم"},{"id":2,"verse_key":"1:2","text_uthmani_simple":"الحمد لله رب العلمين"},{"id":3,"verse_key":"1:3","text_uthmani_simple":"الرحمن الرحيم"},{"id":4,"verse_key":"1:4","text_uthmani_simple":"ملك يوم الدين"},{"id":5,"verse_key":"1:5","text_uthmani_simple":"اياك نعبد واياك نستعين"},{"id":6,"verse_key":"1:6","text_uthmani_simple":"اهدنا الصرط المستقيم"},{"id":7,"verse_key":"1:7","text_uthmani_simple":"صرط الذين انعمت عليهم غير المغضوب عليهم ولا الضالين"},{"id":8,"verse_key":"2:1","text_uthmani_simple":"الم"},{"id":9,"verse_key":"2:2","text_uthmani_simple":"ذلك الكتب لا ريب فيه هدى للمتقين"},{"id":10,"verse_key":"2:3","text_uthmani_simple":"الذين يؤمنون بالغيب ويقيمون الصلوة ومما رزقنهم ينفقون"},{"id":11,"verse_key":"2:4","text_uthmani_simple":"والذين يؤمنون بما انزل اليك وما انزل من قبلك وبالءاخرة هم يوقنون"},{"id":12,"verse_key":"2:5","text_uthmani_simple":"او۟لئك على هدى من ربهم واو۟لئك هم المفلحون"},{"id":13,"verse_key":"2:6","text_uthmani_simple":"ان الذين كفروا۟ سواء عليهم ءانذرتهم ام لم تنذرهم لا يؤمنون"},{"id":14,"verse_key":"2:7","text_uthmani_simple":"ختم الله على قلوبهم وعلى سمعهم وعلى ابصرهم غشوة ولهم عذاب عظيم"},{"id":15,"verse_key":"2:8","text_uthmani_simple":"ومن الناس من يقول ءامنا بالله وباليوم الءاخر وما هم بمؤمنين"},{"id":16,"verse_key":"2:9","text_uthmani_simple":"يخدعون الله والذين ءامنوا۟ وما يخدعون الا انفسهم وما يشعرون"},{"id":17,"verse_key":"2:10","text_uthmani_simple":"فى قلوبهم مرض فزادهم الله مرضا ولهم عذاب اليمۢ بما كانوا۟ يكذبون"},{"id":18,"verse_key":"2:11","text_uthmani_simple":"واذا قيل لهم لا تفسدوا۟ فى الارض قالوا۟ انما نحن مصلحون"},{"id":19,"verse_key":"2:12","text_uthmani_simple":"الا انهم هم المفسدون ولكن لا يشعرون"},{"id":20,"verse_key":"2:13","text_uthmani_simple":"واذا قيل لهم ءامنوا۟ كما ءامن الناس قالوا۟ انؤمن كما ءامن السفهاء الا انهم هم السفهاء ولكن لا يعلمون"},{"id":21,"verse_key":"2:14","text_uthmani_simple":"واذا لقوا۟ الذين ءامنوا۟ قالوا۟ ءامنا واذا خلوا۟ الى شيطينهم قالوا۟ انا معكم انما نحن مستهزءون"},{"id":22,"verse_key":"2:15","text_uthmani_simple":"الله يستهزئ بهم ويمدهم فى طغينهم يعمهون"},{"id":23,"verse_key":"2:16","text_uthmani_simple":"او۟لئك الذين اشتروا۟ الضللة بالهدى فما ربحت تجرتهم وما كانوا۟ مهتدين"},{"id":24,"verse_key":"2:17","text_uthmani_simple":"مثلهم كمثل الذى استوقد نارا فلما اضاءت ما حوله ذهب الله بنورهم وتركهم فى ظلمت لا يبصرون"},{"id":25,"verse_key":"2:18","text_uthmani_simple":"صمۢ بكم عمى فهم لا يرجعون"},{"id":26,"verse_key":"2:19","text_uthmani_simple":"او كصيب من السماء فيه ظلمت ورعد وبرق يجعلون اصبعهم فى ءاذانهم من الصوعق حذر الموت والله محيطۢ بالكفرين"},{"id":27,"verse_key":"2:20","text_uthmani_simple":"يكاد البرق يخطف ابصرهم كلما اضاء لهم مشوا۟ فيه واذا اظلم عليهم قاموا۟ ولو شاء الله لذهب بسمعهم وابصرهم ان الله على كل شىء قدير"},{"id":28,"verse_key":"2:21","text_uthmani_simple":"يايها الناس اعبدوا۟ ربكم الذى خلقكم والذين من قبلكم لعلكم تتقون"},{"id":29,"verse_key":"2:22","text_uthmani_simple":"الذى جعل لكم الارض فرشا والسماء بناء وانزل من السماء ماء فاخرج به من الثمرت رزقا لكم فلا تجعلوا۟ لله اندادا وانتم تعلمون"},{"id":30,"verse_key":"2:23","text_uthmani_simple":"وان كنتم فى ريب مما نزلنا على عبدنا فاتوا۟ بسورة من مثله وادعوا۟ شهداءكم من دون الله ان كنتم صدقين"},{"id":31,"verse_key":"2:24","text_uthmani_simple":"فان لم تفعلوا۟ ولن تفعلوا۟ فاتقوا۟ النار التى وقودها الناس والحجارة اعدت للكفرين"},{"id":32,"verse_key":"2:25","text_uthmani_simple":"وبشر الذين ءامنوا۟ وعملوا۟ الصلحت ان لهم جنت تجرى من تحتها الانهر كلما رزقوا۟ منها من ثمرة رزقا قالوا۟ هذا الذى رزقنا من قبل واتوا۟ به متشبها ولهم فيها ازوج مطهرة وهم فيها خلدون"},{"id":33,"verse_key":"2:26","text_uthmani_simple":"ان الله لا يستحى ان يضرب مثلا ما بعوضة فما فوقها فاما الذين ءامنوا۟ فيعلمون انه الحق من ربهم واما الذين كفروا۟ فيقولون ماذا اراد الله بهذا مثلا يضل به كثيرا ويهدى به كثيرا وما يضل به الا الفسقين"},{"id":34,"verse_key":"2:27","text_uthmani_simple":"الذين ينقضون عهد الله منۢ بعد ميثقه ويقطعون ما امر الله به ان يوصل ويفسدون فى الارض او۟لئك هم الخسرون"},{"id":35,"verse_key":"2:28","text_uthmani_simple":"كيف تكفرون بالله وكنتم اموتا فاحيكم ثم يميتكم ثم يحييكم ثم اليه ترجعون"},{"id":36,"verse_key":"2:29","text_uthmani_simple":"هو الذى خلق لكم ما فى الارض جميعا ثم استوى الى السماء فسوىهن سبع سموت وهو بكل شىء عليم"},{"id":37,"verse_key":"2:30","text_uthmani_simple":"واذ قال ربك للملئكة انى جاعل فى الارض خليفة قالوا۟ اتجعل فيها من يفسد فيها ويسفك الدماء ونحن نسبح بحمدك ونقدس لك قال انى اعلم ما لا تعلمون"},{"id":38,"verse_key":"2:31","text_uthmani_simple":"وعلم ءادم الاسماء كلها ثم عرضهم على الملئكة فقال انۢبـونى باسماء هؤلاء ان كنتم صدقين"},{"id":39,"verse_key":"2:32","text_uthmani_simple":"قالوا۟ سبحنك لا علم لنا الا ما علمتنا انك انت العليم الحكيم"},{"id":40,"verse_key":"2:33","text_uthmani_simple":"قال يـادم انۢبئهم باسمائهم فلما انۢباهم باسمائهم قال الم اقل لكم انى اعلم غيب السموت والارض واعلم ما تبدون وما كنتم تكتمون"},{"id":41,"verse_key":"2:34","text_uthmani_simple":"واذ قلنا للملئكة اسجدوا۟ لءادم فسجدوا۟ الا ابليس ابى واستكبر وكان من الكفرين"},{"id":42,"verse_key":"2:35","text_uthmani_simple":"وقلنا يـادم اسكن انت وزوجك الجنة وكلا منها رغدا حيث شئتما ولا تقربا هذه الشجرة فتكونا من الظلمين"},{"id":43,"verse_key":"2:36","text_uthmani_simple":"فازلهما الشيطن عنها فاخرجهما مما كانا فيه وقلنا اهبطوا۟ بعضكم لبعض عدو ولكم فى الارض مستقر ومتع الى حين"},{"id":44,"verse_key":"2:37","text_uthmani_simple":"فتلقى ءادم من ربه كلمت فتاب عليه انه هو التواب الرحيم"},{"id":45,"verse_key":"2:38","text_uthmani_simple":"قلنا اهبطوا۟ منها جميعا فاما ياتينكم منى هدى فمن تبع هداى فلا خوف عليهم ولا هم يحزنون"},{"id":46,"verse_key":"2:39","text_uthmani_simple":"والذين كفروا۟ وكذبوا۟ بـايتنا او۟لئك اصحب النار هم فيها خلدون"},{"id":47,"verse_key":"2:40","text_uthmani_simple":"يبنى اسرءيل اذكروا۟ نعمتى التى انعمت عليكم واوفوا۟ بعهدى اوف بعهدكم وايى فارهبون"},{"id":48,"verse_key":"2:41","text_uthmani_simple":"وءامنوا۟ بما انزلت مصدقا لما معكم ولا تكونوا۟ اول كافرۭ به ولا تشتروا۟ بـايتى ثمنا قليلا وايى فاتقون"},{"id":49,"verse_key":"2:42","text_uthmani_simple":"ولا تلبسوا۟ الحق بالبطل وتكتموا۟ الحق وانتم تعلمون"},{"id":50,"verse_key":"2:43","text_uthmani_simple":"واقيموا۟ الصلوة وءاتوا۟ الزكوة واركعوا۟ مع الركعين"},{"id":51,"verse_key":"2:44","text_uthmani_simple":"اتامرون الناس بالبر وتنسون انفسكم وانتم تتلون الكتب افلا تعقلون"},{"id":52,"verse_key":"2:45","text_uthmani_simple":"واستعينوا۟ بالصبر والصلوة وانها لكبيرة الا على الخشعين"},{"id":53,"verse_key":"2:46","text_uthmani_simple":"الذين يظنون انهم ملقوا۟ ربهم وانهم اليه رجعون"},{"id":54,"verse_key":"2:47","text_uthmani_simple":"يبنى اسرءيل اذكروا۟ نعمتى التى انعمت عليكم وانى فضلتكم على العلمين"},{"id":55,"verse_key":"2:48","text_uthmani_simple":"واتقوا۟ يوما لا تجزى نفس عن نفس شيـا ولا يقبل منها شفعة ولا يؤخذ منها عدل ولا هم ينصرون"},{"id":56,"verse_key":"2:49","text_uthmani_simple":"واذ نجينكم من ءال فرعون يسومونكم سوء العذاب يذبحون ابناءكم ويستحيون نساءكم وفى ذلكم بلاء من ربكم عظيم"},{"id":57,"verse_key":"2:50","text_uthmani_simple":"واذ فرقنا بكم البحر فانجينكم واغرقنا ءال فرعون وانتم تنظرون"},{"id":58,"verse_key":"2:51","text_uthmani_simple":"واذ وعدنا موسى اربعين ليلة ثم اتخذتم العجل منۢ بعده وانتم ظلمون"},{"id":59,"verse_key":"2:52","text_uthmani_simple":"ثم عفونا عنكم منۢ بعد ذلك لعلكم تشكرون"},{"id":60,"verse_key":"2:53","text_uthmani_simple":"واذ ءاتينا موسى الكتب والفرقان لعلكم تهتدون"},{"id":61,"verse_key":"2:54","text_uthmani_simple":"واذ قال موسى لقومه يقوم انكم ظلمتم انفسكم باتخاذكم العجل فتوبوا۟ الى بارئكم فاقتلوا۟ انفسكم ذلكم خير لكم عند بارئكم فتاب عليكم انه هو التواب الرحيم"},{"id":62,"verse_key":"2:55","text_uthmani_simple":"واذ قلتم يموسى لن نؤمن لك حتى نرى الله جهرة فاخذتكم الصعقة وانتم تنظرون"},{"id":63,"verse_key":"2:56","text_uthmani_simple":"ثم بعثنكم منۢ بعد موتكم لعلكم تشكرون"},{"id":64,"verse_key":"2:57","text_uthmani_simple":"وظللنا عليكم الغمام وانزلنا عليكم المن والسلوى كلوا۟ من طيبت ما رزقنكم وما ظلمونا ولكن كانوا۟ انفسهم يظلمون"},{"id":65,"verse_key":"2:58","text_uthmani_simple":"واذ قلنا ادخلوا۟ هذه القرية فكلوا۟ منها حيث شئتم رغدا وادخلوا۟ الباب سجدا وقولوا۟ حطة نغفر لكم خطيكم وسنزيد المحسنين"},{"id":66,"verse_key":"2:59","text_uthmani_simple":"فبدل الذين ظلموا۟ قولا غير الذى قيل لهم فانزلنا على الذين ظلموا۟ رجزا من السماء بما كانوا۟ يفسقون"},{"id":67,"verse_key":"2:60","text_uthmani_simple":"واذ استسقى موسى لقومه فقلنا اضرب بعصاك الحجر فانفجرت منه اثنتا عشرة عينا قد علم كل اناس مشربهم كلوا۟ واشربوا۟ من رزق الله ولا تعثوا۟ فى الارض مفسدين"},{"id":68,"verse_key":"2:61","text_uthmani_simple":"واذ قلتم يموسى لن نصبر على طعام وحد فادع لنا ربك يخرج لنا مما تنۢبت الارض منۢ بقلها وقثائها وفومها وعدسها وبصلها قال اتستبدلون الذى هو ادنى بالذى هو خير اهبطوا۟ مصرا فان لكم ما سالتم وضربت عليهم الذلة والمسكنة وباءو بغضب من الله ذلك بانهم كانوا۟ يكفرون بـايت الله ويقتلون النبين بغير الحق ذلك بما عصوا۟ وكانوا۟ يعتدون"},{"id":69,"verse_key":"2:62","text_uthmani_simple":"ان الذين ءامنوا۟ والذين هادوا۟ والنصرى والصبـين من ءامن بالله واليوم الءاخر وعمل صلحا فلهم اجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون"},{"id":70,"verse_key":"2:63","text_uthmani_simple":"واذ اخذنا ميثقكم ورفعنا فوقكم الطور خذوا۟ ما ءاتينكم بقوة واذكروا۟ ما فيه لعلكم تتقون"},{"id":71,"verse_key":"2:64","text_uthmani_simple":"ثم توليتم منۢ بعد ذلك فلولا فضل الله عليكم ورحمته لكنتم من الخسرين"},{"id":72,"verse_key":"2:65","text_uthmani_simple":"ولقد علمتم الذين اعتدوا۟ منكم فى السبت فقلنا لهم كونوا۟ قردة خسـين"},{"id":73,"verse_key":"2:66","text_uthmani_simple":"فجعلنها نكلا لما بين يديها وما خلفها وموعظة للمتقين"},{"id":74,"verse_key":"2:67","text_uthmani_simple":"واذ قال موسى لقومه ان الله يامركم ان تذبحوا۟ بقرة قالوا۟ اتتخذنا هزوا قال اعوذ بالله ان اكون من الجهلين"},{"id":75,"verse_key":"2:68","text_uthmani_simple":"قالوا۟ ادع لنا ربك يبين لنا ما هى قال انه يقول انها بقرة لا فارض ولا بكر عوانۢ بين ذلك فافعلوا۟ ما تؤمرون"},{"id":76,"verse_key":"2:69","text_uthmani_simple":"قالوا۟ ادع لنا ربك يبين لنا ما لونها قال انه يقول انها بقرة صفراء فاقع لونها تسر النظرين"},{"id":77,"verse_key":"2:70","text_uthmani_simple":"قالوا۟ ادع لنا ربك يبين لنا ما هى ان البقر تشبه علينا وانا ان شاء الله لمهتدون"},{"id":78,"verse_key":"2:71","text_uthmani_simple":"قال انه يقول انها بقرة لا ذلول تثير الارض ولا تسقى الحرث مسلمة لا شية فيها قالوا۟ الـن جئت بالحق فذبحوها وما كادوا۟ يفعلون"},{"id":79,"verse_key":"2:72","text_uthmani_simple":"واذ قتلتم نفسا فادرتم فيها والله مخرج ما كنتم تكتمون"},{"id":80,"verse_key":"2:73","text_uthmani_simple":"فقلنا اضربوه ببعضها كذلك يحى الله الموتى ويريكم ءايته لعلكم تعقلون"},{"id":81,"verse_key":"2:74","text_uthmani_simple":"ثم قست قلوبكم منۢ بعد ذلك فهى كالحجارة او اشد قسوة وان من الحجارة لما يتفجر منه الانهر وان منها لما يشقق فيخرج منه الماء وان منها لما يهبط من خشية الله وما الله بغفل عما تعملون"},{"id":82,"verse_key":"2:75","text_uthmani_simple":"افتطمعون ان يؤمنوا۟ لكم وقد كان فريق منهم يسمعون كلم الله ثم يحرفونه منۢ بعد ما عقلوه وهم يعلمون"},{"id":83,"verse_key":"2:76","text_uthmani_simple":"واذا لقوا۟ الذين ءامنوا۟ قالوا۟ ءامنا واذا خلا بعضهم الى بعض قالوا۟ اتحدثونهم بما فتح الله عليكم ليحاجوكم به عند ربكم افلا تعقلون"},{"id":84,"verse_key":"2:77","text_uthmani_simple":"اولا يعلمون ان الله يعلم ما يسرون وما يعلنون"},{"id":85,"verse_key":"2:78","text_uthmani_simple":"ومنهم اميون لا يعلمون الكتب الا امانى وان هم الا يظنون"},{"id":86,"verse_key":"2:79","text_uthmani_simple":"فويل للذين يكتبون الكتب بايديهم ثم يقولون هذا من عند الله ليشتروا۟ به ثمنا قليلا فويل لهم مما كتبت ايديهم وويل لهم مما يكسبون"},{"id":87,"verse_key":"2:80","text_uthmani_simple":"وقالوا۟ لن تمسنا النار الا اياما معدودة قل اتخذتم عند الله عهدا فلن يخلف الله عهده ام تقولون على الله ما لا تعلمون"},{"id":88,"verse_key":"2:81","text_uthmani_simple":"بلى من كسب سيئة واحطت به خطيـته فاو۟لئك اصحب النار هم فيها خلدون"},{"id":89,"verse_key":"2:82","text_uthmani_simple":"والذين ءامنوا۟ وعملوا۟ الصلحت او۟لئك اصحب الجنة هم فيها خلدون"},{"id":90,"verse_key":"2:83","text_uthmani_simple":"واذ اخذنا ميثق بنى اسرءيل لا تعبدون الا الله وبالولدين احسانا وذى القربى واليتمى والمسكين وقولوا۟ للناس حسنا واقيموا۟ الصلوة وءاتوا۟ الزكوة ثم توليتم الا قليلا منكم وانتم معرضون"},{"id":91,"verse_key":"2:84","text_uthmani_simple":"واذ اخذنا ميثقكم لا تسفكون دماءكم ولا تخرجون انفسكم من ديركم ثم اقررتم وانتم تشهدون"},{"id":92,"verse_key":"2:85","text_uthmani_simple":"ثم انتم هؤلاء تقتلون انفسكم وتخرجون فريقا منكم من ديرهم تظهرون عليهم بالاثم والعدون وان ياتوكم اسرى تفدوهم وهو محرم عليكم اخراجهم افتؤمنون ببعض الكتب وتكفرون ببعض فما جزاء من يفعل ذلك منكم الا خزى فى الحيوة الدنيا ويوم القيمة يردون الى اشد العذاب وما الله بغفل عما تعملون"},{"id":93,"verse_key":"2:86","text_uthmani_simple":"او۟لئك الذين اشتروا۟ الحيوة الدنيا بالءاخرة فلا يخفف عنهم العذاب ولا هم ينصرون"},{"id":94,"verse_key":"2:87","text_uthmani_simple":"ولقد ءاتينا موسى الكتب وقفينا منۢ بعده بالرسل وءاتينا عيسى ابن مريم البينت وايدنه بروح القدس افكلما جاءكم رسولۢ بما لا تهوى انفسكم استكبرتم ففريقا كذبتم وفريقا تقتلون"},{"id":95,"verse_key":"2:88","text_uthmani_simple":"وقالوا۟ قلوبنا غلفۢ بل لعنهم الله بكفرهم فقليلا ما يؤمنون"},{"id":96,"verse_key":"2:89","text_uthmani_simple":"ولما جاءهم كتب من عند الله مصدق لما معهم وكانوا۟ من قبل يستفتحون على الذين كفروا۟ فلما جاءهم ما عرفوا۟ كفروا۟ به فلعنة الله على الكفرين"},{"id":97,"verse_key":"2:90","text_uthmani_simple":"بئسما اشتروا۟ به انفسهم ان يكفروا۟ بما انزل الله بغيا ان ينزل الله من فضله على من يشاء من عباده فباءو بغضب على غضب وللكفرين عذاب مهين"},{"id":98,"verse_key":"2:91","text_uthmani_simple":"واذا قيل لهم ءامنوا۟ بما انزل الله قالوا۟ نؤمن بما انزل علينا ويكفرون بما وراءه وهو الحق مصدقا لما معهم قل فلم تقتلون انۢبياء الله من قبل ان كنتم مؤمنين"},{"id":99,"verse_key":"2:92","text_uthmani_simple":"ولقد جاءكم موسى بالبينت ثم اتخذتم العجل منۢ بعده وانتم ظلمون"},{"id":100,"verse_key":"2:93","text_uthmani_simple":"واذ اخذنا ميثقكم ورفعنا فوقكم الطور خذوا۟ ما ءاتينكم بقوة واسمعوا۟ قالوا۟ سمعنا وعصينا واشربوا۟ فى قلوبهم العجل بكفرهم قل بئسما يامركم به ايمنكم ان كنتم مؤمنين"},{"id":101,"verse_key":"2:94","text_uthmani_simple":"قل ان كانت لكم الدار الءاخرة عند الله خالصة من دون الناس فتمنوا۟ الموت ان كنتم صدقين"},{"id":102,"verse_key":"2:95","text_uthmani_simple":"ولن يتمنوه ابدۢا بما قدمت ايديهم والله عليمۢ بالظلمين"},{"id":103,"verse_key":"2:96","text_uthmani_simple":"ولتجدنهم احرص الناس على حيوة ومن الذين اشركوا۟ يود احدهم لو يعمر الف سنة وما هو بمزحزحه من العذاب ان يعمر والله بصيرۢ بما يعملون"},{"id":104,"verse_key":"2:97","text_uthmani_simple":"قل من كان عدوا لجبريل فانه نزله على قلبك باذن الله مصدقا لما بين يديه وهدى وبشرى للمؤمنين"},{"id":105,"verse_key":"2:98","text_uthmani_simple":"من كان عدوا لله وملئكته ورسله وجبريل وميكىل فان الله عدو للكفرين"},{"id":106,"verse_key":"2:99","text_uthmani_simple":"ولقد انزلنا اليك ءايتۭ بينت وما يكفر بها الا الفسقون"},{"id":107,"verse_key":"2:100","text_uthmani_simple":"اوكلما عهدوا۟ عهدا نبذه فريق منهم بل اكثرهم لا يؤمنون"},{"id":108,"verse_key":"2:101","text_uthmani_simple":"ولما جاءهم رسول من عند الله مصدق لما معهم نبذ فريق من الذين اوتوا۟ الكتب كتب الله وراء ظهورهم كانهم لا يعلمون"},{"id":109,"verse_key":"2:102","text_uthmani_simple":"واتبعوا۟ ما تتلوا۟ الشيطين على ملك سليمن وما كفر سليمن ولكن الشيطين كفروا۟ يعلمون الناس السحر وما انزل على الملكين ببابل هروت ومروت وما يعلمان من احد حتى يقولا انما نحن فتنة فلا تكفر فيتعلمون منهما ما يفرقون به بين المرء وزوجه وما هم بضارين به من احد الا باذن الله ويتعلمون ما يضرهم ولا ينفعهم ولقد علموا۟ لمن اشترىه ما له فى الءاخرة من خلق ولبئس ما شروا۟ به انفسهم لو كانوا۟ يعلمون"},{"id":110,"verse_key":"2:103","text_uthmani_simple":"ولو انهم ءامنوا۟ واتقوا۟ لمثوبة من عند الله خير لو كانوا۟ يعلمون"},{"id":111,"verse_key":"2:104","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تقولوا۟ رعنا وقولوا۟ انظرنا واسمعوا۟ وللكفرين عذاب اليم"},{"id":112,"verse_key":"2:105","text_uthmani_simple":"ما يود الذين كفروا۟ من اهل الكتب ولا المشركين ان ينزل عليكم من خير من ربكم والله يختص برحمته من يشاء والله ذو الفضل العظيم"},{"id":113,"verse_key":"2:106","text_uthmani_simple":"ما ننسخ من ءاية او ننسها نات بخير منها او مثلها الم تعلم ان الله على كل شىء قدير"},{"id":114,"verse_key":"2:107","text_uthmani_simple":"الم تعلم ان الله له ملك السموت والارض وما لكم من دون الله من ولى ولا نصير"},{"id":115,"verse_key":"2:108","text_uthmani_simple":"ام تريدون ان تسـلوا۟ رسولكم كما سئل موسى من قبل ومن يتبدل الكفر بالايمن فقد ضل سواء السبيل"},{"id":116,"verse_key":"2:109","text_uthmani_simple":"ود كثير من اهل الكتب لو يردونكم منۢ بعد ايمنكم كفارا حسدا من عند انفسهم منۢ بعد ما تبين لهم الحق فاعفوا۟ واصفحوا۟ حتى ياتى الله بامره ان الله على كل شىء قدير"},{"id":117,"verse_key":"2:110","text_uthmani_simple":"واقيموا۟ الصلوة وءاتوا۟ الزكوة وما تقدموا۟ لانفسكم من خير تجدوه عند الله ان الله بما تعملون بصير"},{"id":118,"verse_key":"2:111","text_uthmani_simple":"وقالوا۟ لن يدخل الجنة الا من كان هودا او نصرى تلك امانيهم قل هاتوا۟ برهنكم ان كنتم صدقين"},{"id":119,"verse_key":"2:112","text_uthmani_simple":"بلى من اسلم وجهه لله وهو محسن فله اجره عند ربه ولا خوف عليهم ولا هم يحزنون"},{"id":120,"verse_key":"2:113","text_uthmani_simple":"وقالت اليهود ليست النصرى على شىء وقالت النصرى ليست اليهود على شىء وهم يتلون الكتب كذلك قال الذين لا يعلمون مثل قولهم فالله يحكم بينهم يوم القيمة فيما كانوا۟ فيه يختلفون"},{"id":121,"verse_key":"2:114","text_uthmani_simple":"ومن اظلم ممن منع مسجد الله ان يذكر فيها اسمه وسعى فى خرابها او۟لئك ما كان لهم ان يدخلوها الا خائفين لهم فى الدنيا خزى ولهم فى الءاخرة عذاب عظيم"},{"id":122,"verse_key":"2:115","text_uthmani_simple":"ولله المشرق والمغرب فاينما تولوا۟ فثم وجه الله ان الله وسع عليم"},{"id":123,"verse_key":"2:116","text_uthmani_simple":"وقالوا۟ اتخذ الله ولدا سبحنه بل له ما فى السموت والارض كل له قنتون"},{"id":124,"verse_key":"2:117","text_uthmani_simple":"بديع السموت والارض واذا قضى امرا فانما يقول له كن فيكون"},{"id":125,"verse_key":"2:118","text_uthmani_simple":"وقال الذين لا يعلمون لولا يكلمنا الله او تاتينا ءاية كذلك قال الذين من قبلهم مثل قولهم تشبهت قلوبهم قد بينا الءايت لقوم يوقنون"},{"id":126,"verse_key":"2:119","text_uthmani_simple":"انا ارسلنك بالحق بشيرا ونذيرا ولا تسـل عن اصحب الجحيم"},{"id":127,"verse_key":"2:120","text_uthmani_simple":"ولن ترضى عنك اليهود ولا النصرى حتى تتبع ملتهم قل ان هدى الله هو الهدى ولئن اتبعت اهواءهم بعد الذى جاءك من العلم ما لك من الله من ولى ولا نصير"},{"id":128,"verse_key":"2:121","text_uthmani_simple":"الذين ءاتينهم الكتب يتلونه حق تلاوته او۟لئك يؤمنون به ومن يكفر به فاو۟لئك هم الخسرون"},{"id":129,"verse_key":"2:122","text_uthmani_simple":"يبنى اسرءيل اذكروا۟ نعمتى التى انعمت عليكم وانى فضلتكم على العلمين"},{"id":130,"verse_key":"2:123","text_uthmani_simple":"واتقوا۟ يوما لا تجزى نفس عن نفس شيـا ولا يقبل منها عدل ولا تنفعها شفعة ولا هم ينصرون"},{"id":131,"verse_key":"2:124","text_uthmani_simple":"واذ ابتلى ابرهم ربه بكلمت فاتمهن قال انى جاعلك للناس اماما قال ومن ذريتى قال لا ينال عهدى الظلمين"},{"id":132,"verse_key":"2:125","text_uthmani_simple":"واذ جعلنا البيت مثابة للناس وامنا واتخذوا۟ من مقام ابرهم مصلى وعهدنا الى ابرهم واسمعيل ان طهرا بيتى للطائفين والعكفين والركع السجود"},{"id":133,"verse_key":"2:126","text_uthmani_simple":"واذ قال ابرهم رب اجعل هذا بلدا ءامنا وارزق اهله من الثمرت من ءامن منهم بالله واليوم الءاخر قال ومن كفر فامتعه قليلا ثم اضطره الى عذاب النار وبئس المصير"},{"id":134,"verse_key":"2:127","text_uthmani_simple":"واذ يرفع ابرهم القواعد من البيت واسمعيل ربنا تقبل منا انك انت السميع العليم"},{"id":135,"verse_key":"2:128","text_uthmani_simple":"ربنا واجعلنا مسلمين لك ومن ذريتنا امة مسلمة لك وارنا مناسكنا وتب علينا انك انت التواب الرحيم"},{"id":136,"verse_key":"2:129","text_uthmani_simple":"ربنا وابعث فيهم رسولا منهم يتلوا۟ عليهم ءايتك ويعلمهم الكتب والحكمة ويزكيهم انك انت العزيز الحكيم"},{"id":137,"verse_key":"2:130","text_uthmani_simple":"ومن يرغب عن ملة ابرهم الا من سفه نفسه ولقد اصطفينه فى الدنيا وانه فى الءاخرة لمن الصلحين"},{"id":138,"verse_key":"2:131","text_uthmani_simple":"اذ قال له ربه اسلم قال اسلمت لرب العلمين"},{"id":139,"verse_key":"2:132","text_uthmani_simple":"ووصى بها ابرهم بنيه ويعقوب يبنى ان الله اصطفى لكم الدين فلا تموتن الا وانتم مسلمون"},{"id":140,"verse_key":"2:133","text_uthmani_simple":"ام كنتم شهداء اذ حضر يعقوب الموت اذ قال لبنيه ما تعبدون منۢ بعدى قالوا۟ نعبد الهك واله ءابائك ابرهم واسمعيل واسحق الها وحدا ونحن له مسلمون"},{"id":141,"verse_key":"2:134","text_uthmani_simple":"تلك امة قد خلت لها ما كسبت ولكم ما كسبتم ولا تسـلون عما كانوا۟ يعملون"},{"id":142,"verse_key":"2:135","text_uthmani_simple":"وقالوا۟ كونوا۟ هودا او نصرى تهتدوا۟ قل بل ملة ابرهم حنيفا وما كان من المشركين"},{"id":143,"verse_key":"2:136","text_uthmani_simple":"قولوا۟ ءامنا بالله وما انزل الينا وما انزل الى ابرهم واسمعيل واسحق ويعقوب والاسباط وما اوتى موسى وعيسى وما اوتى النبيون من ربهم لا نفرق بين احد منهم ونحن له مسلمون"},{"id":144,"verse_key":"2:137","text_uthmani_simple":"فان ءامنوا۟ بمثل ما ءامنتم به فقد اهتدوا۟ وان تولوا۟ فانما هم فى شقاق فسيكفيكهم الله وهو السميع العليم"},{"id":145,"verse_key":"2:138","text_uthmani_simple":"صبغة الله ومن احسن من الله صبغة ونحن له عبدون"},{"id":146,"verse_key":"2:139","text_uthmani_simple":"قل اتحاجوننا فى الله وهو ربنا وربكم ولنا اعملنا ولكم اعملكم ونحن له مخلصون"},{"id":147,"verse_key":"2:140","text_uthmani_simple":"ام تقولون ان ابرهم واسمعيل واسحق ويعقوب والاسباط كانوا۟ هودا او نصرى قل ءانتم اعلم ام الله ومن اظلم ممن كتم شهدة عنده من الله وما الله بغفل عما تعملون"},{"id":148,"verse_key":"2:141","text_uthmani_simple":"تلك امة قد خلت لها ما كسبت ولكم ما كسبتم ولا تسـلون عما كانوا۟ يعملون"}],"meta":{"filters":{"juz_number":"1"}}}
