{"verses":[{"id":260,"verse_key":"2:253","text_uthmani_simple":"تلك الرسل فضلنا بعضهم على بعض منهم من كلم الله ورفع بعضهم درجت وءاتينا عيسى ابن مريم البينت وايدنه بروح القدس ولو شاء الله ما اقتتل الذين منۢ بعدهم منۢ بعد ما جاءتهم البينت ولكن اختلفوا۟ فمنهم من ءامن ومنهم من كفر ولو شاء الله ما اقتتلوا۟ ولكن الله يفعل ما يريد"},{"id":261,"verse_key":"2:254","text_uthmani_simple":"يايها الذين ءامنوا۟ انفقوا۟ مما رزقنكم من قبل ان ياتى يوم لا بيع فيه ولا خلة ولا شفعة والكفرون هم الظلمون"},{"id":262,"verse_key":"2:255","text_uthmani_simple":"الله لا اله الا هو الحى القيوم لا تاخذه سنة ولا نوم له ما فى السموت وما فى الارض من ذا الذى يشفع عنده الا باذنه يعلم ما بين ايديهم وما خلفهم ولا يحيطون بشىء من علمه الا بما شاء وسع كرسيه السموت والارض ولا يـوده حفظهما وهو العلى العظيم"},{"id":263,"verse_key":"2:256","text_uthmani_simple":"لا اكراه فى الدين قد تبين الرشد من الغى فمن يكفر بالطغوت ويؤمنۢ بالله فقد استمسك بالعروة الوثقى لا انفصام لها والله سميع عليم"},{"id":264,"verse_key":"2:257","text_uthmani_simple":"الله ولى الذين ءامنوا۟ يخرجهم من الظلمت الى النور والذين كفروا۟ اولياؤهم الطغوت يخرجونهم من النور الى الظلمت او۟لئك اصحب النار هم فيها خلدون"},{"id":265,"verse_key":"2:258","text_uthmani_simple":"الم تر الى الذى حاج ابرهم فى ربه ان ءاتىه الله الملك اذ قال ابرهم ربى الذى يحى ويميت قال انا۠ احى واميت قال ابرهم فان الله ياتى بالشمس من المشرق فات بها من المغرب فبهت الذى كفر والله لا يهدى القوم الظلمين"},{"id":266,"verse_key":"2:259","text_uthmani_simple":"او كالذى مر على قرية وهى خاوية على عروشها قال انى يحى هذه الله بعد موتها فاماته الله ما۟ئة عام ثم بعثه قال كم لبثت قال لبثت يوما او بعض يوم قال بل لبثت ما۟ئة عام فانظر الى طعامك وشرابك لم يتسنه وانظر الى حمارك ولنجعلك ءاية للناس وانظر الى العظام كيف ننشزها ثم نكسوها لحما فلما تبين له قال اعلم ان الله على كل شىء قدير"},{"id":267,"verse_key":"2:260","text_uthmani_simple":"واذ قال ابرهم رب ارنى كيف تحى الموتى قال اولم تؤمن قال بلى ولكن ليطمئن قلبى قال فخذ اربعة من الطير فصرهن اليك ثم اجعل على كل جبل منهن جزءا ثم ادعهن ياتينك سعيا واعلم ان الله عزيز حكيم"},{"id":268,"verse_key":"2:261","text_uthmani_simple":"مثل الذين ينفقون امولهم فى سبيل الله كمثل حبة انۢبتت سبع سنابل فى كل سنۢبلة ما۟ئة حبة والله يضعف لمن يشاء والله وسع عليم"},{"id":269,"verse_key":"2:262","text_uthmani_simple":"الذين ينفقون امولهم فى سبيل الله ثم لا يتبعون ما انفقوا۟ منا ولا اذى لهم اجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون"},{"id":270,"verse_key":"2:263","text_uthmani_simple":"قول معروف ومغفرة خير من صدقة يتبعها اذى والله غنى حليم"},{"id":271,"verse_key":"2:264","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تبطلوا۟ صدقتكم بالمن والاذى كالذى ينفق ماله رئاء الناس ولا يؤمن بالله واليوم الءاخر فمثله كمثل صفوان عليه تراب فاصابه وابل فتركه صلدا لا يقدرون على شىء مما كسبوا۟ والله لا يهدى القوم الكفرين"},{"id":272,"verse_key":"2:265","text_uthmani_simple":"ومثل الذين ينفقون امولهم ابتغاء مرضات الله وتثبيتا من انفسهم كمثل جنةۭ بربوة اصابها وابل فـاتت اكلها ضعفين فان لم يصبها وابل فطل والله بما تعملون بصير"},{"id":273,"verse_key":"2:266","text_uthmani_simple":"ايود احدكم ان تكون له جنة من نخيل واعناب تجرى من تحتها الانهر له فيها من كل الثمرت واصابه الكبر وله ذرية ضعفاء فاصابها اعصار فيه نار فاحترقت كذلك يبين الله لكم الءايت لعلكم تتفكرون"},{"id":274,"verse_key":"2:267","text_uthmani_simple":"يايها الذين ءامنوا۟ انفقوا۟ من طيبت ما كسبتم ومما اخرجنا لكم من الارض ولا تيمموا۟ الخبيث منه تنفقون ولستم بـاخذيه الا ان تغمضوا۟ فيه واعلموا۟ ان الله غنى حميد"},{"id":275,"verse_key":"2:268","text_uthmani_simple":"الشيطن يعدكم الفقر ويامركم بالفحشاء والله يعدكم مغفرة منه وفضلا والله وسع عليم"},{"id":276,"verse_key":"2:269","text_uthmani_simple":"يؤتى الحكمة من يشاء ومن يؤت الحكمة فقد اوتى خيرا كثيرا وما يذكر الا او۟لوا۟ الالبب"},{"id":277,"verse_key":"2:270","text_uthmani_simple":"وما انفقتم من نفقة او نذرتم من نذر فان الله يعلمه وما للظلمين من انصار"},{"id":278,"verse_key":"2:271","text_uthmani_simple":"ان تبدوا۟ الصدقت فنعما هى وان تخفوها وتؤتوها الفقراء فهو خير لكم ويكفر عنكم من سيـاتكم والله بما تعملون خبير"},{"id":279,"verse_key":"2:272","text_uthmani_simple":"ليس عليك هدىهم ولكن الله يهدى من يشاء وما تنفقوا۟ من خير فلانفسكم وما تنفقون الا ابتغاء وجه الله وما تنفقوا۟ من خير يوف اليكم وانتم لا تظلمون"},{"id":280,"verse_key":"2:273","text_uthmani_simple":"للفقراء الذين احصروا۟ فى سبيل الله لا يستطيعون ضربا فى الارض يحسبهم الجاهل اغنياء من التعفف تعرفهم بسيمهم لا يسـلون الناس الحافا وما تنفقوا۟ من خير فان الله به عليم"},{"id":281,"verse_key":"2:274","text_uthmani_simple":"الذين ينفقون امولهم باليل والنهار سرا وعلانية فلهم اجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون"},{"id":282,"verse_key":"2:275","text_uthmani_simple":"الذين ياكلون الربوا۟ لا يقومون الا كما يقوم الذى يتخبطه الشيطن من المس ذلك بانهم قالوا۟ انما البيع مثل الربوا۟ واحل الله البيع وحرم الربوا۟ فمن جاءه موعظة من ربه فانتهى فله ما سلف وامره الى الله ومن عاد فاو۟لئك اصحب النار هم فيها خلدون"},{"id":283,"verse_key":"2:276","text_uthmani_simple":"يمحق الله الربوا۟ ويربى الصدقت والله لا يحب كل كفار اثيم"},{"id":284,"verse_key":"2:277","text_uthmani_simple":"ان الذين ءامنوا۟ وعملوا۟ الصلحت واقاموا۟ الصلوة وءاتوا۟ الزكوة لهم اجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون"},{"id":285,"verse_key":"2:278","text_uthmani_simple":"يايها الذين ءامنوا۟ اتقوا۟ الله وذروا۟ ما بقى من الربوا۟ ان كنتم مؤمنين"},{"id":286,"verse_key":"2:279","text_uthmani_simple":"فان لم تفعلوا۟ فاذنوا۟ بحرب من الله ورسوله وان تبتم فلكم رءوس امولكم لا تظلمون ولا تظلمون"},{"id":287,"verse_key":"2:280","text_uthmani_simple":"وان كان ذو عسرة فنظرة الى ميسرة وان تصدقوا۟ خير لكم ان كنتم تعلمون"},{"id":288,"verse_key":"2:281","text_uthmani_simple":"واتقوا۟ يوما ترجعون فيه الى الله ثم توفى كل نفس ما كسبت وهم لا يظلمون"},{"id":289,"verse_key":"2:282","text_uthmani_simple":"يايها الذين ءامنوا۟ اذا تداينتم بدين الى اجل مسمى فاكتبوه وليكتب بينكم كاتبۢ بالعدل ولا ياب كاتب ان يكتب كما علمه الله فليكتب وليملل الذى عليه الحق وليتق الله ربه ولا يبخس منه شيـا فان كان الذى عليه الحق سفيها او ضعيفا او لا يستطيع ان يمل هو فليملل وليه بالعدل واستشهدوا۟ شهيدين من رجالكم فان لم يكونا رجلين فرجل وامراتان ممن ترضون من الشهداء ان تضل احدىهما فتذكر احدىهما الاخرى ولا ياب الشهداء اذا ما دعوا۟ ولا تسـموا۟ ان تكتبوه صغيرا او كبيرا الى اجله ذلكم اقسط عند الله واقوم للشهدة وادنى الا ترتابوا۟ الا ان تكون تجرة حاضرة تديرونها بينكم فليس عليكم جناح الا تكتبوها واشهدوا۟ اذا تبايعتم ولا يضار كاتب ولا شهيد وان تفعلوا۟ فانه فسوقۢ بكم واتقوا۟ الله ويعلمكم الله والله بكل شىء عليم"},{"id":290,"verse_key":"2:283","text_uthmani_simple":"وان كنتم على سفر ولم تجدوا۟ كاتبا فرهن مقبوضة فان امن بعضكم بعضا فليؤد الذى اؤتمن امنته وليتق الله ربه ولا تكتموا۟ الشهدة ومن يكتمها فانه ءاثم قلبه والله بما تعملون عليم"},{"id":291,"verse_key":"2:284","text_uthmani_simple":"لله ما فى السموت وما فى الارض وان تبدوا۟ ما فى انفسكم او تخفوه يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء والله على كل شىء قدير"},{"id":292,"verse_key":"2:285","text_uthmani_simple":"ءامن الرسول بما انزل اليه من ربه والمؤمنون كل ءامن بالله وملئكته وكتبه ورسله لا نفرق بين احد من رسله وقالوا۟ سمعنا واطعنا غفرانك ربنا واليك المصير"},{"id":293,"verse_key":"2:286","text_uthmani_simple":"لا يكلف الله نفسا الا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا ان نسينا او اخطانا ربنا ولا تحمل علينا اصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا انت مولىنا فانصرنا على القوم الكفرين"},{"id":294,"verse_key":"3:1","text_uthmani_simple":"الم"},{"id":295,"verse_key":"3:2","text_uthmani_simple":"الله لا اله الا هو الحى القيوم"},{"id":296,"verse_key":"3:3","text_uthmani_simple":"نزل عليك الكتب بالحق مصدقا لما بين يديه وانزل التورىة والانجيل"},{"id":297,"verse_key":"3:4","text_uthmani_simple":"من قبل هدى للناس وانزل الفرقان ان الذين كفروا۟ بـايت الله لهم عذاب شديد والله عزيز ذو انتقام"},{"id":298,"verse_key":"3:5","text_uthmani_simple":"ان الله لا يخفى عليه شىء فى الارض ولا فى السماء"},{"id":299,"verse_key":"3:6","text_uthmani_simple":"هو الذى يصوركم فى الارحام كيف يشاء لا اله الا هو العزيز الحكيم"},{"id":300,"verse_key":"3:7","text_uthmani_simple":"هو الذى انزل عليك الكتب منه ءايت محكمت هن ام الكتب واخر متشبهت فاما الذين فى قلوبهم زيغ فيتبعون ما تشبه منه ابتغاء الفتنة وابتغاء تاويله وما يعلم تاويله الا الله والرسخون فى العلم يقولون ءامنا به كل من عند ربنا وما يذكر الا او۟لوا۟ الالبب"},{"id":301,"verse_key":"3:8","text_uthmani_simple":"ربنا لا تزغ قلوبنا بعد اذ هديتنا وهب لنا من لدنك رحمة انك انت الوهاب"},{"id":302,"verse_key":"3:9","text_uthmani_simple":"ربنا انك جامع الناس ليوم لا ريب فيه ان الله لا يخلف الميعاد"},{"id":303,"verse_key":"3:10","text_uthmani_simple":"ان الذين كفروا۟ لن تغنى عنهم امولهم ولا اولدهم من الله شيـا واو۟لئك هم وقود النار"},{"id":304,"verse_key":"3:11","text_uthmani_simple":"كداب ءال فرعون والذين من قبلهم كذبوا۟ بـايتنا فاخذهم الله بذنوبهم والله شديد العقاب"},{"id":305,"verse_key":"3:12","text_uthmani_simple":"قل للذين كفروا۟ ستغلبون وتحشرون الى جهنم وبئس المهاد"},{"id":306,"verse_key":"3:13","text_uthmani_simple":"قد كان لكم ءاية فى فئتين التقتا فئة تقتل فى سبيل الله واخرى كافرة يرونهم مثليهم راى العين والله يؤيد بنصره من يشاء ان فى ذلك لعبرة لاو۟لى الابصر"},{"id":307,"verse_key":"3:14","text_uthmani_simple":"زين للناس حب الشهوت من النساء والبنين والقنطير المقنطرة من الذهب والفضة والخيل المسومة والانعم والحرث ذلك متع الحيوة الدنيا والله عنده حسن المـاب"},{"id":308,"verse_key":"3:15","text_uthmani_simple":"قل اؤنبئكم بخير من ذلكم للذين اتقوا۟ عند ربهم جنت تجرى من تحتها الانهر خلدين فيها وازوج مطهرة ورضون من الله والله بصيرۢ بالعباد"},{"id":309,"verse_key":"3:16","text_uthmani_simple":"الذين يقولون ربنا اننا ءامنا فاغفر لنا ذنوبنا وقنا عذاب النار"},{"id":310,"verse_key":"3:17","text_uthmani_simple":"الصبرين والصدقين والقنتين والمنفقين والمستغفرين بالاسحار"},{"id":311,"verse_key":"3:18","text_uthmani_simple":"شهد الله انه لا اله الا هو والملئكة واو۟لوا۟ العلم قائمۢا بالقسط لا اله الا هو العزيز الحكيم"},{"id":312,"verse_key":"3:19","text_uthmani_simple":"ان الدين عند الله الاسلم وما اختلف الذين اوتوا۟ الكتب الا منۢ بعد ما جاءهم العلم بغيۢا بينهم ومن يكفر بـايت الله فان الله سريع الحساب"},{"id":313,"verse_key":"3:20","text_uthmani_simple":"فان حاجوك فقل اسلمت وجهى لله ومن اتبعن وقل للذين اوتوا۟ الكتب والامين ءاسلمتم فان اسلموا۟ فقد اهتدوا۟ وان تولوا۟ فانما عليك البلغ والله بصيرۢ بالعباد"},{"id":314,"verse_key":"3:21","text_uthmani_simple":"ان الذين يكفرون بـايت الله ويقتلون النبين بغير حق ويقتلون الذين يامرون بالقسط من الناس فبشرهم بعذاب اليم"},{"id":315,"verse_key":"3:22","text_uthmani_simple":"او۟لئك الذين حبطت اعملهم فى الدنيا والءاخرة وما لهم من نصرين"},{"id":316,"verse_key":"3:23","text_uthmani_simple":"الم تر الى الذين اوتوا۟ نصيبا من الكتب يدعون الى كتب الله ليحكم بينهم ثم يتولى فريق منهم وهم معرضون"},{"id":317,"verse_key":"3:24","text_uthmani_simple":"ذلك بانهم قالوا۟ لن تمسنا النار الا اياما معدودت وغرهم فى دينهم ما كانوا۟ يفترون"},{"id":318,"verse_key":"3:25","text_uthmani_simple":"فكيف اذا جمعنهم ليوم لا ريب فيه ووفيت كل نفس ما كسبت وهم لا يظلمون"},{"id":319,"verse_key":"3:26","text_uthmani_simple":"قل اللهم ملك الملك تؤتى الملك من تشاء وتنزع الملك ممن تشاء وتعز من تشاء وتذل من تشاء بيدك الخير انك على كل شىء قدير"},{"id":320,"verse_key":"3:27","text_uthmani_simple":"تولج اليل فى النهار وتولج النهار فى اليل وتخرج الحى من الميت وتخرج الميت من الحى وترزق من تشاء بغير حساب"},{"id":321,"verse_key":"3:28","text_uthmani_simple":"لا يتخذ المؤمنون الكفرين اولياء من دون المؤمنين ومن يفعل ذلك فليس من الله فى شىء الا ان تتقوا۟ منهم تقىة ويحذركم الله نفسه والى الله المصير"},{"id":322,"verse_key":"3:29","text_uthmani_simple":"قل ان تخفوا۟ ما فى صدوركم او تبدوه يعلمه الله ويعلم ما فى السموت وما فى الارض والله على كل شىء قدير"},{"id":323,"verse_key":"3:30","text_uthmani_simple":"يوم تجد كل نفس ما عملت من خير محضرا وما عملت من سوء تود لو ان بينها وبينه امدۢا بعيدا ويحذركم الله نفسه والله رءوفۢ بالعباد"},{"id":324,"verse_key":"3:31","text_uthmani_simple":"قل ان كنتم تحبون الله فاتبعونى يحببكم الله ويغفر لكم ذنوبكم والله غفور رحيم"},{"id":325,"verse_key":"3:32","text_uthmani_simple":"قل اطيعوا۟ الله والرسول فان تولوا۟ فان الله لا يحب الكفرين"},{"id":326,"verse_key":"3:33","text_uthmani_simple":"ان الله اصطفى ءادم ونوحا وءال ابرهيم وءال عمرن على العلمين"},{"id":327,"verse_key":"3:34","text_uthmani_simple":"ذريةۢ بعضها منۢ بعض والله سميع عليم"},{"id":328,"verse_key":"3:35","text_uthmani_simple":"اذ قالت امرات عمرن رب انى نذرت لك ما فى بطنى محررا فتقبل منى انك انت السميع العليم"},{"id":329,"verse_key":"3:36","text_uthmani_simple":"فلما وضعتها قالت رب انى وضعتها انثى والله اعلم بما وضعت وليس الذكر كالانثى وانى سميتها مريم وانى اعيذها بك وذريتها من الشيطن الرجيم"},{"id":330,"verse_key":"3:37","text_uthmani_simple":"فتقبلها ربها بقبول حسن وانۢبتها نباتا حسنا وكفلها زكريا كلما دخل عليها زكريا المحراب وجد عندها رزقا قال يمريم انى لك هذا قالت هو من عند الله ان الله يرزق من يشاء بغير حساب"},{"id":331,"verse_key":"3:38","text_uthmani_simple":"هنالك دعا زكريا ربه قال رب هب لى من لدنك ذرية طيبة انك سميع الدعاء"},{"id":332,"verse_key":"3:39","text_uthmani_simple":"فنادته الملئكة وهو قائم يصلى فى المحراب ان الله يبشرك بيحيى مصدقۢا بكلمة من الله وسيدا وحصورا ونبيا من الصلحين"},{"id":333,"verse_key":"3:40","text_uthmani_simple":"قال رب انى يكون لى غلم وقد بلغنى الكبر وامراتى عاقر قال كذلك الله يفعل ما يشاء"},{"id":334,"verse_key":"3:41","text_uthmani_simple":"قال رب اجعل لى ءاية قال ءايتك الا تكلم الناس ثلثة ايام الا رمزا واذكر ربك كثيرا وسبح بالعشى والابكر"},{"id":335,"verse_key":"3:42","text_uthmani_simple":"واذ قالت الملئكة يمريم ان الله اصطفىك وطهرك واصطفىك على نساء العلمين"},{"id":336,"verse_key":"3:43","text_uthmani_simple":"يمريم اقنتى لربك واسجدى واركعى مع الركعين"},{"id":337,"verse_key":"3:44","text_uthmani_simple":"ذلك من انۢباء الغيب نوحيه اليك وما كنت لديهم اذ يلقون اقلمهم ايهم يكفل مريم وما كنت لديهم اذ يختصمون"},{"id":338,"verse_key":"3:45","text_uthmani_simple":"اذ قالت الملئكة يمريم ان الله يبشرك بكلمة منه اسمه المسيح عيسى ابن مريم وجيها فى الدنيا والءاخرة ومن المقربين"},{"id":339,"verse_key":"3:46","text_uthmani_simple":"ويكلم الناس فى المهد وكهلا ومن الصلحين"},{"id":340,"verse_key":"3:47","text_uthmani_simple":"قالت رب انى يكون لى ولد ولم يمسسنى بشر قال كذلك الله يخلق ما يشاء اذا قضى امرا فانما يقول له كن فيكون"},{"id":341,"verse_key":"3:48","text_uthmani_simple":"ويعلمه الكتب والحكمة والتورىة والانجيل"},{"id":342,"verse_key":"3:49","text_uthmani_simple":"ورسولا الى بنى اسرءيل انى قد جئتكم بـاية من ربكم انى اخلق لكم من الطين كهيـة الطير فانفخ فيه فيكون طيرۢا باذن الله وابرئ الاكمه والابرص واحى الموتى باذن الله وانبئكم بما تاكلون وما تدخرون فى بيوتكم ان فى ذلك لءاية لكم ان كنتم مؤمنين"},{"id":343,"verse_key":"3:50","text_uthmani_simple":"ومصدقا لما بين يدى من التورىة ولاحل لكم بعض الذى حرم عليكم وجئتكم بـاية من ربكم فاتقوا۟ الله واطيعون"},{"id":344,"verse_key":"3:51","text_uthmani_simple":"ان الله ربى وربكم فاعبدوه هذا صرط مستقيم"},{"id":345,"verse_key":"3:52","text_uthmani_simple":"فلما احس عيسى منهم الكفر قال من انصارى الى الله قال الحواريون نحن انصار الله ءامنا بالله واشهد بانا مسلمون"},{"id":346,"verse_key":"3:53","text_uthmani_simple":"ربنا ءامنا بما انزلت واتبعنا الرسول فاكتبنا مع الشهدين"},{"id":347,"verse_key":"3:54","text_uthmani_simple":"ومكروا۟ ومكر الله والله خير المكرين"},{"id":348,"verse_key":"3:55","text_uthmani_simple":"اذ قال الله يعيسى انى متوفيك ورافعك الى ومطهرك من الذين كفروا۟ وجاعل الذين اتبعوك فوق الذين كفروا۟ الى يوم القيمة ثم الى مرجعكم فاحكم بينكم فيما كنتم فيه تختلفون"},{"id":349,"verse_key":"3:56","text_uthmani_simple":"فاما الذين كفروا۟ فاعذبهم عذابا شديدا فى الدنيا والءاخرة وما لهم من نصرين"},{"id":350,"verse_key":"3:57","text_uthmani_simple":"واما الذين ءامنوا۟ وعملوا۟ الصلحت فيوفيهم اجورهم والله لا يحب الظلمين"},{"id":351,"verse_key":"3:58","text_uthmani_simple":"ذلك نتلوه عليك من الءايت والذكر الحكيم"},{"id":352,"verse_key":"3:59","text_uthmani_simple":"ان مثل عيسى عند الله كمثل ءادم خلقه من تراب ثم قال له كن فيكون"},{"id":353,"verse_key":"3:60","text_uthmani_simple":"الحق من ربك فلا تكن من الممترين"},{"id":354,"verse_key":"3:61","text_uthmani_simple":"فمن حاجك فيه منۢ بعد ما جاءك من العلم فقل تعالوا۟ ندع ابناءنا وابناءكم ونساءنا ونساءكم وانفسنا وانفسكم ثم نبتهل فنجعل لعنت الله على الكذبين"},{"id":355,"verse_key":"3:62","text_uthmani_simple":"ان هذا لهو القصص الحق وما من اله الا الله وان الله لهو العزيز الحكيم"},{"id":356,"verse_key":"3:63","text_uthmani_simple":"فان تولوا۟ فان الله عليمۢ بالمفسدين"},{"id":357,"verse_key":"3:64","text_uthmani_simple":"قل ياهل الكتب تعالوا۟ الى كلمة سواءۭ بيننا وبينكم الا نعبد الا الله ولا نشرك به شيـا ولا يتخذ بعضنا بعضا اربابا من دون الله فان تولوا۟ فقولوا۟ اشهدوا۟ بانا مسلمون"},{"id":358,"verse_key":"3:65","text_uthmani_simple":"ياهل الكتب لم تحاجون فى ابرهيم وما انزلت التورىة والانجيل الا منۢ بعده افلا تعقلون"},{"id":359,"verse_key":"3:66","text_uthmani_simple":"هانتم هؤلاء حججتم فيما لكم به علم فلم تحاجون فيما ليس لكم به علم والله يعلم وانتم لا تعلمون"},{"id":360,"verse_key":"3:67","text_uthmani_simple":"ما كان ابرهيم يهوديا ولا نصرانيا ولكن كان حنيفا مسلما وما كان من المشركين"},{"id":361,"verse_key":"3:68","text_uthmani_simple":"ان اولى الناس بابرهيم للذين اتبعوه وهذا النبى والذين ءامنوا۟ والله ولى المؤمنين"},{"id":362,"verse_key":"3:69","text_uthmani_simple":"ودت طائفة من اهل الكتب لو يضلونكم وما يضلون الا انفسهم وما يشعرون"},{"id":363,"verse_key":"3:70","text_uthmani_simple":"ياهل الكتب لم تكفرون بـايت الله وانتم تشهدون"},{"id":364,"verse_key":"3:71","text_uthmani_simple":"ياهل الكتب لم تلبسون الحق بالبطل وتكتمون الحق وانتم تعلمون"},{"id":365,"verse_key":"3:72","text_uthmani_simple":"وقالت طائفة من اهل الكتب ءامنوا۟ بالذى انزل على الذين ءامنوا۟ وجه النهار واكفروا۟ ءاخره لعلهم يرجعون"},{"id":366,"verse_key":"3:73","text_uthmani_simple":"ولا تؤمنوا۟ الا لمن تبع دينكم قل ان الهدى هدى الله ان يؤتى احد مثل ما اوتيتم او يحاجوكم عند ربكم قل ان الفضل بيد الله يؤتيه من يشاء والله وسع عليم"},{"id":367,"verse_key":"3:74","text_uthmani_simple":"يختص برحمته من يشاء والله ذو الفضل العظيم"},{"id":368,"verse_key":"3:75","text_uthmani_simple":"ومن اهل الكتب من ان تامنه بقنطار يؤده اليك ومنهم من ان تامنه بدينار لا يؤده اليك الا ما دمت عليه قائما ذلك بانهم قالوا۟ ليس علينا فى الامين سبيل ويقولون على الله الكذب وهم يعلمون"},{"id":369,"verse_key":"3:76","text_uthmani_simple":"بلى من اوفى بعهده واتقى فان الله يحب المتقين"},{"id":370,"verse_key":"3:77","text_uthmani_simple":"ان الذين يشترون بعهد الله وايمنهم ثمنا قليلا او۟لئك لا خلق لهم فى الءاخرة ولا يكلمهم الله ولا ينظر اليهم يوم القيمة ولا يزكيهم ولهم عذاب اليم"},{"id":371,"verse_key":"3:78","text_uthmani_simple":"وان منهم لفريقا يلون السنتهم بالكتب لتحسبوه من الكتب وما هو من الكتب ويقولون هو من عند الله وما هو من عند الله ويقولون على الله الكذب وهم يعلمون"},{"id":372,"verse_key":"3:79","text_uthmani_simple":"ما كان لبشر ان يؤتيه الله الكتب والحكم والنبوة ثم يقول للناس كونوا۟ عبادا لى من دون الله ولكن كونوا۟ ربنين بما كنتم تعلمون الكتب وبما كنتم تدرسون"},{"id":373,"verse_key":"3:80","text_uthmani_simple":"ولا يامركم ان تتخذوا۟ الملئكة والنبين اربابا ايامركم بالكفر بعد اذ انتم مسلمون"},{"id":374,"verse_key":"3:81","text_uthmani_simple":"واذ اخذ الله ميثق النبين لما ءاتيتكم من كتب وحكمة ثم جاءكم رسول مصدق لما معكم لتؤمنن به ولتنصرنه قال ءاقررتم واخذتم على ذلكم اصرى قالوا۟ اقررنا قال فاشهدوا۟ وانا۠ معكم من الشهدين"},{"id":375,"verse_key":"3:82","text_uthmani_simple":"فمن تولى بعد ذلك فاو۟لئك هم الفسقون"},{"id":376,"verse_key":"3:83","text_uthmani_simple":"افغير دين الله يبغون وله اسلم من فى السموت والارض طوعا وكرها واليه يرجعون"},{"id":377,"verse_key":"3:84","text_uthmani_simple":"قل ءامنا بالله وما انزل علينا وما انزل على ابرهيم واسمعيل واسحق ويعقوب والاسباط وما اوتى موسى وعيسى والنبيون من ربهم لا نفرق بين احد منهم ونحن له مسلمون"},{"id":378,"verse_key":"3:85","text_uthmani_simple":"ومن يبتغ غير الاسلم دينا فلن يقبل منه وهو فى الءاخرة من الخسرين"},{"id":379,"verse_key":"3:86","text_uthmani_simple":"كيف يهدى الله قوما كفروا۟ بعد ايمنهم وشهدوا۟ ان الرسول حق وجاءهم البينت والله لا يهدى القوم الظلمين"},{"id":380,"verse_key":"3:87","text_uthmani_simple":"او۟لئك جزاؤهم ان عليهم لعنة الله والملئكة والناس اجمعين"},{"id":381,"verse_key":"3:88","text_uthmani_simple":"خلدين فيها لا يخفف عنهم العذاب ولا هم ينظرون"},{"id":382,"verse_key":"3:89","text_uthmani_simple":"الا الذين تابوا۟ منۢ بعد ذلك واصلحوا۟ فان الله غفور رحيم"},{"id":383,"verse_key":"3:90","text_uthmani_simple":"ان الذين كفروا۟ بعد ايمنهم ثم ازدادوا۟ كفرا لن تقبل توبتهم واو۟لئك هم الضالون"},{"id":384,"verse_key":"3:91","text_uthmani_simple":"ان الذين كفروا۟ وماتوا۟ وهم كفار فلن يقبل من احدهم ملء الارض ذهبا ولو افتدى به او۟لئك لهم عذاب اليم وما لهم من نصرين"},{"id":385,"verse_key":"3:92","text_uthmani_simple":"لن تنالوا۟ البر حتى تنفقوا۟ مما تحبون وما تنفقوا۟ من شىء فان الله به عليم"}],"meta":{"filters":{"juz_number":"3"}}}
