{"verses":[{"id":3564,"verse_key":"33:31","text_uthmani_simple":"ومن يقنت منكن لله ورسوله وتعمل صلحا نؤتها اجرها مرتين واعتدنا لها رزقا كريما"},{"id":3565,"verse_key":"33:32","text_uthmani_simple":"ينساء النبى لستن كاحد من النساء ان اتقيتن فلا تخضعن بالقول فيطمع الذى فى قلبه مرض وقلن قولا معروفا"},{"id":3566,"verse_key":"33:33","text_uthmani_simple":"وقرن فى بيوتكن ولا تبرجن تبرج الجهلية الاولى واقمن الصلوة وءاتين الزكوة واطعن الله ورسوله انما يريد الله ليذهب عنكم الرجس اهل البيت ويطهركم تطهيرا"},{"id":3567,"verse_key":"33:34","text_uthmani_simple":"واذكرن ما يتلى فى بيوتكن من ءايت الله والحكمة ان الله كان لطيفا خبيرا"},{"id":3568,"verse_key":"33:35","text_uthmani_simple":"ان المسلمين والمسلمت والمؤمنين والمؤمنت والقنتين والقنتت والصدقين والصدقت والصبرين والصبرت والخشعين والخشعت والمتصدقين والمتصدقت والصئمين والصئمت والحفظين فروجهم والحفظت والذكرين الله كثيرا والذكرت اعد الله لهم مغفرة واجرا عظيما"},{"id":3569,"verse_key":"33:36","text_uthmani_simple":"وما كان لمؤمن ولا مؤمنة اذا قضى الله ورسوله امرا ان يكون لهم الخيرة من امرهم ومن يعص الله ورسوله فقد ضل ضللا مبينا"},{"id":3570,"verse_key":"33:37","text_uthmani_simple":"واذ تقول للذى انعم الله عليه وانعمت عليه امسك عليك زوجك واتق الله وتخفى فى نفسك ما الله مبديه وتخشى الناس والله احق ان تخشىه فلما قضى زيد منها وطرا زوجنكها لكى لا يكون على المؤمنين حرج فى ازوج ادعيائهم اذا قضوا۟ منهن وطرا وكان امر الله مفعولا"},{"id":3571,"verse_key":"33:38","text_uthmani_simple":"ما كان على النبى من حرج فيما فرض الله له سنة الله فى الذين خلوا۟ من قبل وكان امر الله قدرا مقدورا"},{"id":3572,"verse_key":"33:39","text_uthmani_simple":"الذين يبلغون رسلت الله ويخشونه ولا يخشون احدا الا الله وكفى بالله حسيبا"},{"id":3573,"verse_key":"33:40","text_uthmani_simple":"ما كان محمد ابا احد من رجالكم ولكن رسول الله وخاتم النبين وكان الله بكل شىء عليما"},{"id":3574,"verse_key":"33:41","text_uthmani_simple":"يايها الذين ءامنوا۟ اذكروا۟ الله ذكرا كثيرا"},{"id":3575,"verse_key":"33:42","text_uthmani_simple":"وسبحوه بكرة واصيلا"},{"id":3576,"verse_key":"33:43","text_uthmani_simple":"هو الذى يصلى عليكم وملئكته ليخرجكم من الظلمت الى النور وكان بالمؤمنين رحيما"},{"id":3577,"verse_key":"33:44","text_uthmani_simple":"تحيتهم يوم يلقونه سلم واعد لهم اجرا كريما"},{"id":3578,"verse_key":"33:45","text_uthmani_simple":"يايها النبى انا ارسلنك شهدا ومبشرا ونذيرا"},{"id":3579,"verse_key":"33:46","text_uthmani_simple":"وداعيا الى الله باذنه وسراجا منيرا"},{"id":3580,"verse_key":"33:47","text_uthmani_simple":"وبشر المؤمنين بان لهم من الله فضلا كبيرا"},{"id":3581,"verse_key":"33:48","text_uthmani_simple":"ولا تطع الكفرين والمنفقين ودع اذىهم وتوكل على الله وكفى بالله وكيلا"},{"id":3582,"verse_key":"33:49","text_uthmani_simple":"يايها الذين ءامنوا۟ اذا نكحتم المؤمنت ثم طلقتموهن من قبل ان تمسوهن فما لكم عليهن من عدة تعتدونها فمتعوهن وسرحوهن سراحا جميلا"},{"id":3583,"verse_key":"33:50","text_uthmani_simple":"يايها النبى انا احللنا لك ازوجك التى ءاتيت اجورهن وما ملكت يمينك مما افاء الله عليك وبنات عمك وبنات عمتك وبنات خالك وبنات خلتك التى هاجرن معك وامراة مؤمنة ان وهبت نفسها للنبى ان اراد النبى ان يستنكحها خالصة لك من دون المؤمنين قد علمنا ما فرضنا عليهم فى ازوجهم وما ملكت ايمنهم لكيلا يكون عليك حرج وكان الله غفورا رحيما"},{"id":3584,"verse_key":"33:51","text_uthmani_simple":"ترجى من تشاء منهن وتـوى اليك من تشاء ومن ابتغيت ممن عزلت فلا جناح عليك ذلك ادنى ان تقر اعينهن ولا يحزن ويرضين بما ءاتيتهن كلهن والله يعلم ما فى قلوبكم وكان الله عليما حليما"},{"id":3585,"verse_key":"33:52","text_uthmani_simple":"لا يحل لك النساء منۢ بعد ولا ان تبدل بهن من ازوج ولو اعجبك حسنهن الا ما ملكت يمينك وكان الله على كل شىء رقيبا"},{"id":3586,"verse_key":"33:53","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تدخلوا۟ بيوت النبى الا ان يؤذن لكم الى طعام غير نظرين انىه ولكن اذا دعيتم فادخلوا۟ فاذا طعمتم فانتشروا۟ ولا مستـنسين لحديث ان ذلكم كان يؤذى النبى فيستحى منكم والله لا يستحى من الحق واذا سالتموهن متعا فسـلوهن من وراء حجاب ذلكم اطهر لقلوبكم وقلوبهن وما كان لكم ان تؤذوا۟ رسول الله ولا ان تنكحوا۟ ازوجه منۢ بعده ابدا ان ذلكم كان عند الله عظيما"},{"id":3587,"verse_key":"33:54","text_uthmani_simple":"ان تبدوا۟ شيـا او تخفوه فان الله كان بكل شىء عليما"},{"id":3588,"verse_key":"33:55","text_uthmani_simple":"لا جناح عليهن فى ءابائهن ولا ابنائهن ولا اخونهن ولا ابناء اخونهن ولا ابناء اخوتهن ولا نسائهن ولا ما ملكت ايمنهن واتقين الله ان الله كان على كل شىء شهيدا"},{"id":3589,"verse_key":"33:56","text_uthmani_simple":"ان الله وملئكته يصلون على النبى يايها الذين ءامنوا۟ صلوا۟ عليه وسلموا۟ تسليما"},{"id":3590,"verse_key":"33:57","text_uthmani_simple":"ان الذين يؤذون الله ورسوله لعنهم الله فى الدنيا والءاخرة واعد لهم عذابا مهينا"},{"id":3591,"verse_key":"33:58","text_uthmani_simple":"والذين يؤذون المؤمنين والمؤمنت بغير ما اكتسبوا۟ فقد احتملوا۟ بهتنا واثما مبينا"},{"id":3592,"verse_key":"33:59","text_uthmani_simple":"يايها النبى قل لازوجك وبناتك ونساء المؤمنين يدنين عليهن من جلبيبهن ذلك ادنى ان يعرفن فلا يؤذين وكان الله غفورا رحيما"},{"id":3593,"verse_key":"33:60","text_uthmani_simple":"لئن لم ينته المنفقون والذين فى قلوبهم مرض والمرجفون فى المدينة لنغرينك بهم ثم لا يجاورونك فيها الا قليلا"},{"id":3594,"verse_key":"33:61","text_uthmani_simple":"ملعونين اينما ثقفوا۟ اخذوا۟ وقتلوا۟ تقتيلا"},{"id":3595,"verse_key":"33:62","text_uthmani_simple":"سنة الله فى الذين خلوا۟ من قبل ولن تجد لسنة الله تبديلا"},{"id":3596,"verse_key":"33:63","text_uthmani_simple":"يسـلك الناس عن الساعة قل انما علمها عند الله وما يدريك لعل الساعة تكون قريبا"},{"id":3597,"verse_key":"33:64","text_uthmani_simple":"ان الله لعن الكفرين واعد لهم سعيرا"},{"id":3598,"verse_key":"33:65","text_uthmani_simple":"خلدين فيها ابدا لا يجدون وليا ولا نصيرا"},{"id":3599,"verse_key":"33:66","text_uthmani_simple":"يوم تقلب وجوههم فى النار يقولون يليتنا اطعنا الله واطعنا الرسولا۠"},{"id":3600,"verse_key":"33:67","text_uthmani_simple":"وقالوا۟ ربنا انا اطعنا سادتنا وكبراءنا فاضلونا السبيلا۠"},{"id":3601,"verse_key":"33:68","text_uthmani_simple":"ربنا ءاتهم ضعفين من العذاب والعنهم لعنا كبيرا"},{"id":3602,"verse_key":"33:69","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تكونوا۟ كالذين ءاذوا۟ موسى فبراه الله مما قالوا۟ وكان عند الله وجيها"},{"id":3603,"verse_key":"33:70","text_uthmani_simple":"يايها الذين ءامنوا۟ اتقوا۟ الله وقولوا۟ قولا سديدا"},{"id":3604,"verse_key":"33:71","text_uthmani_simple":"يصلح لكم اعملكم ويغفر لكم ذنوبكم ومن يطع الله ورسوله فقد فاز فوزا عظيما"},{"id":3605,"verse_key":"33:72","text_uthmani_simple":"انا عرضنا الامانة على السموت والارض والجبال فابين ان يحملنها واشفقن منها وحملها الانسن انه كان ظلوما جهولا"},{"id":3606,"verse_key":"33:73","text_uthmani_simple":"ليعذب الله المنفقين والمنفقت والمشركين والمشركت ويتوب الله على المؤمنين والمؤمنت وكان الله غفورا رحيمۢا"},{"id":3607,"verse_key":"34:1","text_uthmani_simple":"الحمد لله الذى له ما فى السموت وما فى الارض وله الحمد فى الءاخرة وهو الحكيم الخبير"},{"id":3608,"verse_key":"34:2","text_uthmani_simple":"يعلم ما يلج فى الارض وما يخرج منها وما ينزل من السماء وما يعرج فيها وهو الرحيم الغفور"},{"id":3609,"verse_key":"34:3","text_uthmani_simple":"وقال الذين كفروا۟ لا تاتينا الساعة قل بلى وربى لتاتينكم علم الغيب لا يعزب عنه مثقال ذرة فى السموت ولا فى الارض ولا اصغر من ذلك ولا اكبر الا فى كتب مبين"},{"id":3610,"verse_key":"34:4","text_uthmani_simple":"ليجزى الذين ءامنوا۟ وعملوا۟ الصلحت او۟لئك لهم مغفرة ورزق كريم"},{"id":3611,"verse_key":"34:5","text_uthmani_simple":"والذين سعو فى ءايتنا معجزين او۟لئك لهم عذاب من رجز اليم"},{"id":3612,"verse_key":"34:6","text_uthmani_simple":"ويرى الذين اوتوا۟ العلم الذى انزل اليك من ربك هو الحق ويهدى الى صرط العزيز الحميد"},{"id":3613,"verse_key":"34:7","text_uthmani_simple":"وقال الذين كفروا۟ هل ندلكم على رجل ينبئكم اذا مزقتم كل ممزق انكم لفى خلق جديد"},{"id":3614,"verse_key":"34:8","text_uthmani_simple":"افترى على الله كذبا ام به جنةۢ بل الذين لا يؤمنون بالءاخرة فى العذاب والضلل البعيد"},{"id":3615,"verse_key":"34:9","text_uthmani_simple":"افلم يروا۟ الى ما بين ايديهم وما خلفهم من السماء والارض ان نشا نخسف بهم الارض او نسقط عليهم كسفا من السماء ان فى ذلك لءاية لكل عبد منيب"},{"id":3616,"verse_key":"34:10","text_uthmani_simple":"ولقد ءاتينا داود منا فضلا يجبال اوبى معه والطير والنا له الحديد"},{"id":3617,"verse_key":"34:11","text_uthmani_simple":"ان اعمل سبغت وقدر فى السرد واعملوا۟ صلحا انى بما تعملون بصير"},{"id":3618,"verse_key":"34:12","text_uthmani_simple":"ولسليمن الريح غدوها شهر ورواحها شهر واسلنا له عين القطر ومن الجن من يعمل بين يديه باذن ربه ومن يزغ منهم عن امرنا نذقه من عذاب السعير"},{"id":3619,"verse_key":"34:13","text_uthmani_simple":"يعملون له ما يشاء من محريب وتمثيل وجفان كالجواب وقدور راسيت اعملوا۟ ءال داود شكرا وقليل من عبادى الشكور"},{"id":3620,"verse_key":"34:14","text_uthmani_simple":"فلما قضينا عليه الموت ما دلهم على موته الا دابة الارض تاكل منساته فلما خر تبينت الجن ان لو كانوا۟ يعلمون الغيب ما لبثوا۟ فى العذاب المهين"},{"id":3621,"verse_key":"34:15","text_uthmani_simple":"لقد كان لسبا فى مسكنهم ءاية جنتان عن يمين وشمال كلوا۟ من رزق ربكم واشكروا۟ له بلدة طيبة ورب غفور"},{"id":3622,"verse_key":"34:16","text_uthmani_simple":"فاعرضوا۟ فارسلنا عليهم سيل العرم وبدلنهم بجنتيهم جنتين ذواتى اكل خمط واثل وشىء من سدر قليل"},{"id":3623,"verse_key":"34:17","text_uthmani_simple":"ذلك جزينهم بما كفروا۟ وهل نجزى الا الكفور"},{"id":3624,"verse_key":"34:18","text_uthmani_simple":"وجعلنا بينهم وبين القرى التى بركنا فيها قرى ظهرة وقدرنا فيها السير سيروا۟ فيها ليالى واياما ءامنين"},{"id":3625,"verse_key":"34:19","text_uthmani_simple":"فقالوا۟ ربنا بعد بين اسفارنا وظلموا۟ انفسهم فجعلنهم احاديث ومزقنهم كل ممزق ان فى ذلك لءايت لكل صبار شكور"},{"id":3626,"verse_key":"34:20","text_uthmani_simple":"ولقد صدق عليهم ابليس ظنه فاتبعوه الا فريقا من المؤمنين"},{"id":3627,"verse_key":"34:21","text_uthmani_simple":"وما كان له عليهم من سلطن الا لنعلم من يؤمن بالءاخرة ممن هو منها فى شك وربك على كل شىء حفيظ"},{"id":3628,"verse_key":"34:22","text_uthmani_simple":"قل ادعوا۟ الذين زعمتم من دون الله لا يملكون مثقال ذرة فى السموت ولا فى الارض وما لهم فيهما من شرك وما له منهم من ظهير"},{"id":3629,"verse_key":"34:23","text_uthmani_simple":"ولا تنفع الشفعة عنده الا لمن اذن له حتى اذا فزع عن قلوبهم قالوا۟ ماذا قال ربكم قالوا۟ الحق وهو العلى الكبير"},{"id":3630,"verse_key":"34:24","text_uthmani_simple":"قل من يرزقكم من السموت والارض قل الله وانا او اياكم لعلى هدى او فى ضلل مبين"},{"id":3631,"verse_key":"34:25","text_uthmani_simple":"قل لا تسـلون عما اجرمنا ولا نسـل عما تعملون"},{"id":3632,"verse_key":"34:26","text_uthmani_simple":"قل يجمع بيننا ربنا ثم يفتح بيننا بالحق وهو الفتاح العليم"},{"id":3633,"verse_key":"34:27","text_uthmani_simple":"قل ارونى الذين الحقتم به شركاء كلا بل هو الله العزيز الحكيم"},{"id":3634,"verse_key":"34:28","text_uthmani_simple":"وما ارسلنك الا كافة للناس بشيرا ونذيرا ولكن اكثر الناس لا يعلمون"},{"id":3635,"verse_key":"34:29","text_uthmani_simple":"ويقولون متى هذا الوعد ان كنتم صدقين"},{"id":3636,"verse_key":"34:30","text_uthmani_simple":"قل لكم ميعاد يوم لا تستـخرون عنه ساعة ولا تستقدمون"},{"id":3637,"verse_key":"34:31","text_uthmani_simple":"وقال الذين كفروا۟ لن نؤمن بهذا القرءان ولا بالذى بين يديه ولو ترى اذ الظلمون موقوفون عند ربهم يرجع بعضهم الى بعض القول يقول الذين استضعفوا۟ للذين استكبروا۟ لولا انتم لكنا مؤمنين"},{"id":3638,"verse_key":"34:32","text_uthmani_simple":"قال الذين استكبروا۟ للذين استضعفوا۟ انحن صددنكم عن الهدى بعد اذ جاءكم بل كنتم مجرمين"},{"id":3639,"verse_key":"34:33","text_uthmani_simple":"وقال الذين استضعفوا۟ للذين استكبروا۟ بل مكر اليل والنهار اذ تامروننا ان نكفر بالله ونجعل له اندادا واسروا۟ الندامة لما راوا۟ العذاب وجعلنا الاغلل فى اعناق الذين كفروا۟ هل يجزون الا ما كانوا۟ يعملون"},{"id":3640,"verse_key":"34:34","text_uthmani_simple":"وما ارسلنا فى قرية من نذير الا قال مترفوها انا بما ارسلتم به كفرون"},{"id":3641,"verse_key":"34:35","text_uthmani_simple":"وقالوا۟ نحن اكثر امولا واولدا وما نحن بمعذبين"},{"id":3642,"verse_key":"34:36","text_uthmani_simple":"قل ان ربى يبسط الرزق لمن يشاء ويقدر ولكن اكثر الناس لا يعلمون"},{"id":3643,"verse_key":"34:37","text_uthmani_simple":"وما امولكم ولا اولدكم بالتى تقربكم عندنا زلفى الا من ءامن وعمل صلحا فاو۟لئك لهم جزاء الضعف بما عملوا۟ وهم فى الغرفت ءامنون"},{"id":3644,"verse_key":"34:38","text_uthmani_simple":"والذين يسعون فى ءايتنا معجزين او۟لئك فى العذاب محضرون"},{"id":3645,"verse_key":"34:39","text_uthmani_simple":"قل ان ربى يبسط الرزق لمن يشاء من عباده ويقدر له وما انفقتم من شىء فهو يخلفه وهو خير الرزقين"},{"id":3646,"verse_key":"34:40","text_uthmani_simple":"ويوم يحشرهم جميعا ثم يقول للملئكة اهؤلاء اياكم كانوا۟ يعبدون"},{"id":3647,"verse_key":"34:41","text_uthmani_simple":"قالوا۟ سبحنك انت ولينا من دونهم بل كانوا۟ يعبدون الجن اكثرهم بهم مؤمنون"},{"id":3648,"verse_key":"34:42","text_uthmani_simple":"فاليوم لا يملك بعضكم لبعض نفعا ولا ضرا ونقول للذين ظلموا۟ ذوقوا۟ عذاب النار التى كنتم بها تكذبون"},{"id":3649,"verse_key":"34:43","text_uthmani_simple":"واذا تتلى عليهم ءايتنا بينت قالوا۟ ما هذا الا رجل يريد ان يصدكم عما كان يعبد ءاباؤكم وقالوا۟ ما هذا الا افك مفترى وقال الذين كفروا۟ للحق لما جاءهم ان هذا الا سحر مبين"},{"id":3650,"verse_key":"34:44","text_uthmani_simple":"وما ءاتينهم من كتب يدرسونها وما ارسلنا اليهم قبلك من نذير"},{"id":3651,"verse_key":"34:45","text_uthmani_simple":"وكذب الذين من قبلهم وما بلغوا۟ معشار ما ءاتينهم فكذبوا۟ رسلى فكيف كان نكير"},{"id":3652,"verse_key":"34:46","text_uthmani_simple":"قل انما اعظكم بوحدة ان تقوموا۟ لله مثنى وفردى ثم تتفكروا۟ ما بصاحبكم من جنة ان هو الا نذير لكم بين يدى عذاب شديد"},{"id":3653,"verse_key":"34:47","text_uthmani_simple":"قل ما سالتكم من اجر فهو لكم ان اجرى الا على الله وهو على كل شىء شهيد"},{"id":3654,"verse_key":"34:48","text_uthmani_simple":"قل ان ربى يقذف بالحق علم الغيوب"},{"id":3655,"verse_key":"34:49","text_uthmani_simple":"قل جاء الحق وما يبدئ البطل وما يعيد"},{"id":3656,"verse_key":"34:50","text_uthmani_simple":"قل ان ضللت فانما اضل على نفسى وان اهتديت فبما يوحى الى ربى انه سميع قريب"},{"id":3657,"verse_key":"34:51","text_uthmani_simple":"ولو ترى اذ فزعوا۟ فلا فوت واخذوا۟ من مكان قريب"},{"id":3658,"verse_key":"34:52","text_uthmani_simple":"وقالوا۟ ءامنا به وانى لهم التناوش من مكانۭ بعيد"},{"id":3659,"verse_key":"34:53","text_uthmani_simple":"وقد كفروا۟ به من قبل ويقذفون بالغيب من مكانۭ بعيد"},{"id":3660,"verse_key":"34:54","text_uthmani_simple":"وحيل بينهم وبين ما يشتهون كما فعل باشياعهم من قبل انهم كانوا۟ فى شك مريبۭ"},{"id":3661,"verse_key":"35:1","text_uthmani_simple":"الحمد لله فاطر السموت والارض جاعل الملئكة رسلا او۟لى اجنحة مثنى وثلث وربع يزيد فى الخلق ما يشاء ان الله على كل شىء قدير"},{"id":3662,"verse_key":"35:2","text_uthmani_simple":"ما يفتح الله للناس من رحمة فلا ممسك لها وما يمسك فلا مرسل له منۢ بعده وهو العزيز الحكيم"},{"id":3663,"verse_key":"35:3","text_uthmani_simple":"يايها الناس اذكروا۟ نعمت الله عليكم هل من خلق غير الله يرزقكم من السماء والارض لا اله الا هو فانى تؤفكون"},{"id":3664,"verse_key":"35:4","text_uthmani_simple":"وان يكذبوك فقد كذبت رسل من قبلك والى الله ترجع الامور"},{"id":3665,"verse_key":"35:5","text_uthmani_simple":"يايها الناس ان وعد الله حق فلا تغرنكم الحيوة الدنيا ولا يغرنكم بالله الغرور"},{"id":3666,"verse_key":"35:6","text_uthmani_simple":"ان الشيطن لكم عدو فاتخذوه عدوا انما يدعوا۟ حزبه ليكونوا۟ من اصحب السعير"},{"id":3667,"verse_key":"35:7","text_uthmani_simple":"الذين كفروا۟ لهم عذاب شديد والذين ءامنوا۟ وعملوا۟ الصلحت لهم مغفرة واجر كبير"},{"id":3668,"verse_key":"35:8","text_uthmani_simple":"افمن زين له سوء عمله فرءاه حسنا فان الله يضل من يشاء ويهدى من يشاء فلا تذهب نفسك عليهم حسرت ان الله عليمۢ بما يصنعون"},{"id":3669,"verse_key":"35:9","text_uthmani_simple":"والله الذى ارسل الريح فتثير سحابا فسقنه الى بلد ميت فاحيينا به الارض بعد موتها كذلك النشور"},{"id":3670,"verse_key":"35:10","text_uthmani_simple":"من كان يريد العزة فلله العزة جميعا اليه يصعد الكلم الطيب والعمل الصلح يرفعه والذين يمكرون السيـات لهم عذاب شديد ومكر او۟لئك هو يبور"},{"id":3671,"verse_key":"35:11","text_uthmani_simple":"والله خلقكم من تراب ثم من نطفة ثم جعلكم ازوجا وما تحمل من انثى ولا تضع الا بعلمه وما يعمر من معمر ولا ينقص من عمره الا فى كتب ان ذلك على الله يسير"},{"id":3672,"verse_key":"35:12","text_uthmani_simple":"وما يستوى البحران هذا عذب فرات سائغ شرابه وهذا ملح اجاج ومن كل تاكلون لحما طريا وتستخرجون حلية تلبسونها وترى الفلك فيه مواخر لتبتغوا۟ من فضله ولعلكم تشكرون"},{"id":3673,"verse_key":"35:13","text_uthmani_simple":"يولج اليل فى النهار ويولج النهار فى اليل وسخر الشمس والقمر كل يجرى لاجل مسمى ذلكم الله ربكم له الملك والذين تدعون من دونه ما يملكون من قطمير"},{"id":3674,"verse_key":"35:14","text_uthmani_simple":"ان تدعوهم لا يسمعوا۟ دعاءكم ولو سمعوا۟ ما استجابوا۟ لكم ويوم القيمة يكفرون بشرككم ولا ينبئك مثل خبير"},{"id":3675,"verse_key":"35:15","text_uthmani_simple":"يايها الناس انتم الفقراء الى الله والله هو الغنى الحميد"},{"id":3676,"verse_key":"35:16","text_uthmani_simple":"ان يشا يذهبكم ويات بخلق جديد"},{"id":3677,"verse_key":"35:17","text_uthmani_simple":"وما ذلك على الله بعزيز"},{"id":3678,"verse_key":"35:18","text_uthmani_simple":"ولا تزر وازرة وزر اخرى وان تدع مثقلة الى حملها لا يحمل منه شىء ولو كان ذا قربى انما تنذر الذين يخشون ربهم بالغيب واقاموا۟ الصلوة ومن تزكى فانما يتزكى لنفسه والى الله المصير"},{"id":3679,"verse_key":"35:19","text_uthmani_simple":"وما يستوى الاعمى والبصير"},{"id":3680,"verse_key":"35:20","text_uthmani_simple":"ولا الظلمت ولا النور"},{"id":3681,"verse_key":"35:21","text_uthmani_simple":"ولا الظل ولا الحرور"},{"id":3682,"verse_key":"35:22","text_uthmani_simple":"وما يستوى الاحياء ولا الاموت ان الله يسمع من يشاء وما انت بمسمع من فى القبور"},{"id":3683,"verse_key":"35:23","text_uthmani_simple":"ان انت الا نذير"},{"id":3684,"verse_key":"35:24","text_uthmani_simple":"انا ارسلنك بالحق بشيرا ونذيرا وان من امة الا خلا فيها نذير"},{"id":3685,"verse_key":"35:25","text_uthmani_simple":"وان يكذبوك فقد كذب الذين من قبلهم جاءتهم رسلهم بالبينت وبالزبر وبالكتب المنير"},{"id":3686,"verse_key":"35:26","text_uthmani_simple":"ثم اخذت الذين كفروا۟ فكيف كان نكير"},{"id":3687,"verse_key":"35:27","text_uthmani_simple":"الم تر ان الله انزل من السماء ماء فاخرجنا به ثمرت مختلفا الونها ومن الجبال جددۢ بيض وحمر مختلف الونها وغرابيب سود"},{"id":3688,"verse_key":"35:28","text_uthmani_simple":"ومن الناس والدواب والانعم مختلف الونه كذلك انما يخشى الله من عباده العلمؤا۟ ان الله عزيز غفور"},{"id":3689,"verse_key":"35:29","text_uthmani_simple":"ان الذين يتلون كتب الله واقاموا۟ الصلوة وانفقوا۟ مما رزقنهم سرا وعلانية يرجون تجرة لن تبور"},{"id":3690,"verse_key":"35:30","text_uthmani_simple":"ليوفيهم اجورهم ويزيدهم من فضله انه غفور شكور"},{"id":3691,"verse_key":"35:31","text_uthmani_simple":"والذى اوحينا اليك من الكتب هو الحق مصدقا لما بين يديه ان الله بعباده لخبيرۢ بصير"},{"id":3692,"verse_key":"35:32","text_uthmani_simple":"ثم اورثنا الكتب الذين اصطفينا من عبادنا فمنهم ظالم لنفسه ومنهم مقتصد ومنهم سابقۢ بالخيرت باذن الله ذلك هو الفضل الكبير"},{"id":3693,"verse_key":"35:33","text_uthmani_simple":"جنت عدن يدخلونها يحلون فيها من اساور من ذهب ولؤلؤا ولباسهم فيها حرير"},{"id":3694,"verse_key":"35:34","text_uthmani_simple":"وقالوا۟ الحمد لله الذى اذهب عنا الحزن ان ربنا لغفور شكور"},{"id":3695,"verse_key":"35:35","text_uthmani_simple":"الذى احلنا دار المقامة من فضله لا يمسنا فيها نصب ولا يمسنا فيها لغوب"},{"id":3696,"verse_key":"35:36","text_uthmani_simple":"والذين كفروا۟ لهم نار جهنم لا يقضى عليهم فيموتوا۟ ولا يخفف عنهم من عذابها كذلك نجزى كل كفور"},{"id":3697,"verse_key":"35:37","text_uthmani_simple":"وهم يصطرخون فيها ربنا اخرجنا نعمل صلحا غير الذى كنا نعمل اولم نعمركم ما يتذكر فيه من تذكر وجاءكم النذير فذوقوا۟ فما للظلمين من نصير"},{"id":3698,"verse_key":"35:38","text_uthmani_simple":"ان الله علم غيب السموت والارض انه عليمۢ بذات الصدور"},{"id":3699,"verse_key":"35:39","text_uthmani_simple":"هو الذى جعلكم خلئف فى الارض فمن كفر فعليه كفره ولا يزيد الكفرين كفرهم عند ربهم الا مقتا ولا يزيد الكفرين كفرهم الا خسارا"},{"id":3700,"verse_key":"35:40","text_uthmani_simple":"قل ارءيتم شركاءكم الذين تدعون من دون الله ارونى ماذا خلقوا۟ من الارض ام لهم شرك فى السموت ام ءاتينهم كتبا فهم على بينت منه بل ان يعد الظلمون بعضهم بعضا الا غرورا"},{"id":3701,"verse_key":"35:41","text_uthmani_simple":"ان الله يمسك السموت والارض ان تزولا ولئن زالتا ان امسكهما من احد منۢ بعده انه كان حليما غفورا"},{"id":3702,"verse_key":"35:42","text_uthmani_simple":"واقسموا۟ بالله جهد ايمنهم لئن جاءهم نذير ليكونن اهدى من احدى الامم فلما جاءهم نذير ما زادهم الا نفورا"},{"id":3703,"verse_key":"35:43","text_uthmani_simple":"استكبارا فى الارض ومكر السيئ ولا يحيق المكر السيئ الا باهله فهل ينظرون الا سنت الاولين فلن تجد لسنت الله تبديلا ولن تجد لسنت الله تحويلا"},{"id":3704,"verse_key":"35:44","text_uthmani_simple":"اولم يسيروا۟ فى الارض فينظروا۟ كيف كان عقبة الذين من قبلهم وكانوا۟ اشد منهم قوة وما كان الله ليعجزه من شىء فى السموت ولا فى الارض انه كان عليما قديرا"},{"id":3705,"verse_key":"35:45","text_uthmani_simple":"ولو يؤاخذ الله الناس بما كسبوا۟ ما ترك على ظهرها من دابة ولكن يؤخرهم الى اجل مسمى فاذا جاء اجلهم فان الله كان بعباده بصيرۢا"},{"id":3706,"verse_key":"36:1","text_uthmani_simple":"يس"},{"id":3707,"verse_key":"36:2","text_uthmani_simple":"والقرءان الحكيم"},{"id":3708,"verse_key":"36:3","text_uthmani_simple":"انك لمن المرسلين"},{"id":3709,"verse_key":"36:4","text_uthmani_simple":"على صرط مستقيم"},{"id":3710,"verse_key":"36:5","text_uthmani_simple":"تنزيل العزيز الرحيم"},{"id":3711,"verse_key":"36:6","text_uthmani_simple":"لتنذر قوما ما انذر ءاباؤهم فهم غفلون"},{"id":3712,"verse_key":"36:7","text_uthmani_simple":"لقد حق القول على اكثرهم فهم لا يؤمنون"},{"id":3713,"verse_key":"36:8","text_uthmani_simple":"انا جعلنا فى اعنقهم اغللا فهى الى الاذقان فهم مقمحون"},{"id":3714,"verse_key":"36:9","text_uthmani_simple":"وجعلنا منۢ بين ايديهم سدا ومن خلفهم سدا فاغشينهم فهم لا يبصرون"},{"id":3715,"verse_key":"36:10","text_uthmani_simple":"وسواء عليهم ءانذرتهم ام لم تنذرهم لا يؤمنون"},{"id":3716,"verse_key":"36:11","text_uthmani_simple":"انما تنذر من اتبع الذكر وخشى الرحمن بالغيب فبشره بمغفرة واجر كريم"},{"id":3717,"verse_key":"36:12","text_uthmani_simple":"انا نحن نحى الموتى ونكتب ما قدموا۟ وءاثرهم وكل شىء احصينه فى امام مبين"},{"id":3718,"verse_key":"36:13","text_uthmani_simple":"واضرب لهم مثلا اصحب القرية اذ جاءها المرسلون"},{"id":3719,"verse_key":"36:14","text_uthmani_simple":"اذ ارسلنا اليهم اثنين فكذبوهما فعززنا بثالث فقالوا۟ انا اليكم مرسلون"},{"id":3720,"verse_key":"36:15","text_uthmani_simple":"قالوا۟ ما انتم الا بشر مثلنا وما انزل الرحمن من شىء ان انتم الا تكذبون"},{"id":3721,"verse_key":"36:16","text_uthmani_simple":"قالوا۟ ربنا يعلم انا اليكم لمرسلون"},{"id":3722,"verse_key":"36:17","text_uthmani_simple":"وما علينا الا البلغ المبين"},{"id":3723,"verse_key":"36:18","text_uthmani_simple":"قالوا۟ انا تطيرنا بكم لئن لم تنتهوا۟ لنرجمنكم وليمسنكم منا عذاب اليم"},{"id":3724,"verse_key":"36:19","text_uthmani_simple":"قالوا۟ طئركم معكم ائن ذكرتم بل انتم قوم مسرفون"},{"id":3725,"verse_key":"36:20","text_uthmani_simple":"وجاء من اقصا المدينة رجل يسعى قال يقوم اتبعوا۟ المرسلين"},{"id":3726,"verse_key":"36:21","text_uthmani_simple":"اتبعوا۟ من لا يسـلكم اجرا وهم مهتدون"},{"id":3727,"verse_key":"36:22","text_uthmani_simple":"وما لى لا اعبد الذى فطرنى واليه ترجعون"},{"id":3728,"verse_key":"36:23","text_uthmani_simple":"ءاتخذ من دونه ءالهة ان يردن الرحمن بضر لا تغن عنى شفعتهم شيـا ولا ينقذون"},{"id":3729,"verse_key":"36:24","text_uthmani_simple":"انى اذا لفى ضلل مبين"},{"id":3730,"verse_key":"36:25","text_uthmani_simple":"انى ءامنت بربكم فاسمعون"},{"id":3731,"verse_key":"36:26","text_uthmani_simple":"قيل ادخل الجنة قال يليت قومى يعلمون"},{"id":3732,"verse_key":"36:27","text_uthmani_simple":"بما غفر لى ربى وجعلنى من المكرمين"}],"meta":{"filters":{"juz_number":"22"}}}
