{"verses":[{"id":149,"verse_key":"2:142","text_uthmani_simple":"سيقول السفهاء من الناس ما ولىهم عن قبلتهم التى كانوا۟ عليها قل لله المشرق والمغرب يهدى من يشاء الى صرط مستقيم"},{"id":150,"verse_key":"2:143","text_uthmani_simple":"وكذلك جعلنكم امة وسطا لتكونوا۟ شهداء على الناس ويكون الرسول عليكم شهيدا وما جعلنا القبلة التى كنت عليها الا لنعلم من يتبع الرسول ممن ينقلب على عقبيه وان كانت لكبيرة الا على الذين هدى الله وما كان الله ليضيع ايمنكم ان الله بالناس لرءوف رحيم"},{"id":151,"verse_key":"2:144","text_uthmani_simple":"قد نرى تقلب وجهك فى السماء فلنولينك قبلة ترضىها فول وجهك شطر المسجد الحرام وحيث ما كنتم فولوا۟ وجوهكم شطره وان الذين اوتوا۟ الكتب ليعلمون انه الحق من ربهم وما الله بغفل عما يعملون"},{"id":152,"verse_key":"2:145","text_uthmani_simple":"ولئن اتيت الذين اوتوا۟ الكتب بكل ءاية ما تبعوا۟ قبلتك وما انت بتابع قبلتهم وما بعضهم بتابع قبلة بعض ولئن اتبعت اهواءهم منۢ بعد ما جاءك من العلم انك اذا لمن الظلمين"},{"id":153,"verse_key":"2:146","text_uthmani_simple":"الذين ءاتينهم الكتب يعرفونه كما يعرفون ابناءهم وان فريقا منهم ليكتمون الحق وهم يعلمون"},{"id":154,"verse_key":"2:147","text_uthmani_simple":"الحق من ربك فلا تكونن من الممترين"},{"id":155,"verse_key":"2:148","text_uthmani_simple":"ولكل وجهة هو موليها فاستبقوا۟ الخيرت اين ما تكونوا۟ يات بكم الله جميعا ان الله على كل شىء قدير"},{"id":156,"verse_key":"2:149","text_uthmani_simple":"ومن حيث خرجت فول وجهك شطر المسجد الحرام وانه للحق من ربك وما الله بغفل عما تعملون"},{"id":157,"verse_key":"2:150","text_uthmani_simple":"ومن حيث خرجت فول وجهك شطر المسجد الحرام وحيث ما كنتم فولوا۟ وجوهكم شطره لئلا يكون للناس عليكم حجة الا الذين ظلموا۟ منهم فلا تخشوهم واخشونى ولاتم نعمتى عليكم ولعلكم تهتدون"},{"id":158,"verse_key":"2:151","text_uthmani_simple":"كما ارسلنا فيكم رسولا منكم يتلوا۟ عليكم ءايتنا ويزكيكم ويعلمكم الكتب والحكمة ويعلمكم ما لم تكونوا۟ تعلمون"},{"id":159,"verse_key":"2:152","text_uthmani_simple":"فاذكرونى اذكركم واشكروا۟ لى ولا تكفرون"},{"id":160,"verse_key":"2:153","text_uthmani_simple":"يايها الذين ءامنوا۟ استعينوا۟ بالصبر والصلوة ان الله مع الصبرين"},{"id":161,"verse_key":"2:154","text_uthmani_simple":"ولا تقولوا۟ لمن يقتل فى سبيل الله اموتۢ بل احياء ولكن لا تشعرون"},{"id":162,"verse_key":"2:155","text_uthmani_simple":"ولنبلونكم بشىء من الخوف والجوع ونقص من الامول والانفس والثمرت وبشر الصبرين"},{"id":163,"verse_key":"2:156","text_uthmani_simple":"الذين اذا اصبتهم مصيبة قالوا۟ انا لله وانا اليه رجعون"},{"id":164,"verse_key":"2:157","text_uthmani_simple":"او۟لئك عليهم صلوت من ربهم ورحمة واو۟لئك هم المهتدون"},{"id":165,"verse_key":"2:158","text_uthmani_simple":"ان الصفا والمروة من شعائر الله فمن حج البيت او اعتمر فلا جناح عليه ان يطوف بهما ومن تطوع خيرا فان الله شاكر عليم"},{"id":166,"verse_key":"2:159","text_uthmani_simple":"ان الذين يكتمون ما انزلنا من البينت والهدى منۢ بعد ما بينه للناس فى الكتب او۟لئك يلعنهم الله ويلعنهم اللعنون"},{"id":167,"verse_key":"2:160","text_uthmani_simple":"الا الذين تابوا۟ واصلحوا۟ وبينوا۟ فاو۟لئك اتوب عليهم وانا التواب الرحيم"},{"id":168,"verse_key":"2:161","text_uthmani_simple":"ان الذين كفروا۟ وماتوا۟ وهم كفار او۟لئك عليهم لعنة الله والملئكة والناس اجمعين"},{"id":169,"verse_key":"2:162","text_uthmani_simple":"خلدين فيها لا يخفف عنهم العذاب ولا هم ينظرون"},{"id":170,"verse_key":"2:163","text_uthmani_simple":"والهكم اله وحد لا اله الا هو الرحمن الرحيم"},{"id":171,"verse_key":"2:164","text_uthmani_simple":"ان فى خلق السموت والارض واختلف اليل والنهار والفلك التى تجرى فى البحر بما ينفع الناس وما انزل الله من السماء من ماء فاحيا به الارض بعد موتها وبث فيها من كل دابة وتصريف الريح والسحاب المسخر بين السماء والارض لءايت لقوم يعقلون"},{"id":172,"verse_key":"2:165","text_uthmani_simple":"ومن الناس من يتخذ من دون الله اندادا يحبونهم كحب الله والذين ءامنوا۟ اشد حبا لله ولو يرى الذين ظلموا۟ اذ يرون العذاب ان القوة لله جميعا وان الله شديد العذاب"},{"id":173,"verse_key":"2:166","text_uthmani_simple":"اذ تبرا الذين اتبعوا۟ من الذين اتبعوا۟ وراوا۟ العذاب وتقطعت بهم الاسباب"},{"id":174,"verse_key":"2:167","text_uthmani_simple":"وقال الذين اتبعوا۟ لو ان لنا كرة فنتبرا منهم كما تبرءوا۟ منا كذلك يريهم الله اعملهم حسرت عليهم وما هم بخرجين من النار"},{"id":175,"verse_key":"2:168","text_uthmani_simple":"يايها الناس كلوا۟ مما فى الارض حللا طيبا ولا تتبعوا۟ خطوت الشيطن انه لكم عدو مبين"},{"id":176,"verse_key":"2:169","text_uthmani_simple":"انما يامركم بالسوء والفحشاء وان تقولوا۟ على الله ما لا تعلمون"},{"id":177,"verse_key":"2:170","text_uthmani_simple":"واذا قيل لهم اتبعوا۟ ما انزل الله قالوا۟ بل نتبع ما الفينا عليه ءاباءنا اولو كان ءاباؤهم لا يعقلون شيـا ولا يهتدون"},{"id":178,"verse_key":"2:171","text_uthmani_simple":"ومثل الذين كفروا۟ كمثل الذى ينعق بما لا يسمع الا دعاء ونداء صمۢ بكم عمى فهم لا يعقلون"},{"id":179,"verse_key":"2:172","text_uthmani_simple":"يايها الذين ءامنوا۟ كلوا۟ من طيبت ما رزقنكم واشكروا۟ لله ان كنتم اياه تعبدون"},{"id":180,"verse_key":"2:173","text_uthmani_simple":"انما حرم عليكم الميتة والدم ولحم الخنزير وما اهل به لغير الله فمن اضطر غير باغ ولا عاد فلا اثم عليه ان الله غفور رحيم"},{"id":181,"verse_key":"2:174","text_uthmani_simple":"ان الذين يكتمون ما انزل الله من الكتب ويشترون به ثمنا قليلا او۟لئك ما ياكلون فى بطونهم الا النار ولا يكلمهم الله يوم القيمة ولا يزكيهم ولهم عذاب اليم"},{"id":182,"verse_key":"2:175","text_uthmani_simple":"او۟لئك الذين اشتروا۟ الضللة بالهدى والعذاب بالمغفرة فما اصبرهم على النار"},{"id":183,"verse_key":"2:176","text_uthmani_simple":"ذلك بان الله نزل الكتب بالحق وان الذين اختلفوا۟ فى الكتب لفى شقاقۭ بعيد"},{"id":184,"verse_key":"2:177","text_uthmani_simple":"ليس البر ان تولوا۟ وجوهكم قبل المشرق والمغرب ولكن البر من ءامن بالله واليوم الءاخر والملئكة والكتب والنبين وءاتى المال على حبه ذوى القربى واليتمى والمسكين وابن السبيل والسائلين وفى الرقاب واقام الصلوة وءاتى الزكوة والموفون بعهدهم اذا عهدوا۟ والصبرين فى الباساء والضراء وحين الباس او۟لئك الذين صدقوا۟ واو۟لئك هم المتقون"},{"id":185,"verse_key":"2:178","text_uthmani_simple":"يايها الذين ءامنوا۟ كتب عليكم القصاص فى القتلى الحر بالحر والعبد بالعبد والانثى بالانثى فمن عفى له من اخيه شىء فاتباعۢ بالمعروف واداء اليه باحسن ذلك تخفيف من ربكم ورحمة فمن اعتدى بعد ذلك فله عذاب اليم"},{"id":186,"verse_key":"2:179","text_uthmani_simple":"ولكم فى القصاص حيوة ياو۟لى الالبب لعلكم تتقون"},{"id":187,"verse_key":"2:180","text_uthmani_simple":"كتب عليكم اذا حضر احدكم الموت ان ترك خيرا الوصية للولدين والاقربين بالمعروف حقا على المتقين"},{"id":188,"verse_key":"2:181","text_uthmani_simple":"فمنۢ بدله بعدما سمعه فانما اثمه على الذين يبدلونه ان الله سميع عليم"},{"id":189,"verse_key":"2:182","text_uthmani_simple":"فمن خاف من موص جنفا او اثما فاصلح بينهم فلا اثم عليه ان الله غفور رحيم"},{"id":190,"verse_key":"2:183","text_uthmani_simple":"يايها الذين ءامنوا۟ كتب عليكم الصيام كما كتب على الذين من قبلكم لعلكم تتقون"},{"id":191,"verse_key":"2:184","text_uthmani_simple":"اياما معدودت فمن كان منكم مريضا او على سفر فعدة من ايام اخر وعلى الذين يطيقونه فدية طعام مسكين فمن تطوع خيرا فهو خير له وان تصوموا۟ خير لكم ان كنتم تعلمون"},{"id":192,"verse_key":"2:185","text_uthmani_simple":"شهر رمضان الذى انزل فيه القرءان هدى للناس وبينت من الهدى والفرقان فمن شهد منكم الشهر فليصمه ومن كان مريضا او على سفر فعدة من ايام اخر يريد الله بكم اليسر ولا يريد بكم العسر ولتكملوا۟ العدة ولتكبروا۟ الله على ما هدىكم ولعلكم تشكرون"},{"id":193,"verse_key":"2:186","text_uthmani_simple":"واذا سالك عبادى عنى فانى قريب اجيب دعوة الداع اذا دعان فليستجيبوا۟ لى وليؤمنوا۟ بى لعلهم يرشدون"},{"id":194,"verse_key":"2:187","text_uthmani_simple":"احل لكم ليلة الصيام الرفث الى نسائكم هن لباس لكم وانتم لباس لهن علم الله انكم كنتم تختانون انفسكم فتاب عليكم وعفا عنكم فالـن بشروهن وابتغوا۟ ما كتب الله لكم وكلوا۟ واشربوا۟ حتى يتبين لكم الخيط الابيض من الخيط الاسود من الفجر ثم اتموا۟ الصيام الى اليل ولا تبشروهن وانتم عكفون فى المسجد تلك حدود الله فلا تقربوها كذلك يبين الله ءايته للناس لعلهم يتقون"},{"id":195,"verse_key":"2:188","text_uthmani_simple":"ولا تاكلوا۟ امولكم بينكم بالبطل وتدلوا۟ بها الى الحكام لتاكلوا۟ فريقا من امول الناس بالاثم وانتم تعلمون"},{"id":196,"verse_key":"2:189","text_uthmani_simple":"يسـلونك عن الاهلة قل هى موقيت للناس والحج وليس البر بان تاتوا۟ البيوت من ظهورها ولكن البر من اتقى واتوا۟ البيوت من ابوبها واتقوا۟ الله لعلكم تفلحون"},{"id":197,"verse_key":"2:190","text_uthmani_simple":"وقتلوا۟ فى سبيل الله الذين يقتلونكم ولا تعتدوا۟ ان الله لا يحب المعتدين"},{"id":198,"verse_key":"2:191","text_uthmani_simple":"واقتلوهم حيث ثقفتموهم واخرجوهم من حيث اخرجوكم والفتنة اشد من القتل ولا تقتلوهم عند المسجد الحرام حتى يقتلوكم فيه فان قتلوكم فاقتلوهم كذلك جزاء الكفرين"},{"id":199,"verse_key":"2:192","text_uthmani_simple":"فان انتهوا۟ فان الله غفور رحيم"},{"id":200,"verse_key":"2:193","text_uthmani_simple":"وقتلوهم حتى لا تكون فتنة ويكون الدين لله فان انتهوا۟ فلا عدون الا على الظلمين"},{"id":201,"verse_key":"2:194","text_uthmani_simple":"الشهر الحرام بالشهر الحرام والحرمت قصاص فمن اعتدى عليكم فاعتدوا۟ عليه بمثل ما اعتدى عليكم واتقوا۟ الله واعلموا۟ ان الله مع المتقين"},{"id":202,"verse_key":"2:195","text_uthmani_simple":"وانفقوا۟ فى سبيل الله ولا تلقوا۟ بايديكم الى التهلكة واحسنوا۟ ان الله يحب المحسنين"},{"id":203,"verse_key":"2:196","text_uthmani_simple":"واتموا۟ الحج والعمرة لله فان احصرتم فما استيسر من الهدى ولا تحلقوا۟ رءوسكم حتى يبلغ الهدى محله فمن كان منكم مريضا او به اذى من راسه ففدية من صيام او صدقة او نسك فاذا امنتم فمن تمتع بالعمرة الى الحج فما استيسر من الهدى فمن لم يجد فصيام ثلثة ايام فى الحج وسبعة اذا رجعتم تلك عشرة كاملة ذلك لمن لم يكن اهله حاضرى المسجد الحرام واتقوا۟ الله واعلموا۟ ان الله شديد العقاب"},{"id":204,"verse_key":"2:197","text_uthmani_simple":"الحج اشهر معلومت فمن فرض فيهن الحج فلا رفث ولا فسوق ولا جدال فى الحج وما تفعلوا۟ من خير يعلمه الله وتزودوا۟ فان خير الزاد التقوى واتقون ياو۟لى الالبب"},{"id":205,"verse_key":"2:198","text_uthmani_simple":"ليس عليكم جناح ان تبتغوا۟ فضلا من ربكم فاذا افضتم من عرفت فاذكروا۟ الله عند المشعر الحرام واذكروه كما هدىكم وان كنتم من قبله لمن الضالين"},{"id":206,"verse_key":"2:199","text_uthmani_simple":"ثم افيضوا۟ من حيث افاض الناس واستغفروا۟ الله ان الله غفور رحيم"},{"id":207,"verse_key":"2:200","text_uthmani_simple":"فاذا قضيتم منسككم فاذكروا۟ الله كذكركم ءاباءكم او اشد ذكرا فمن الناس من يقول ربنا ءاتنا فى الدنيا وما له فى الءاخرة من خلق"},{"id":208,"verse_key":"2:201","text_uthmani_simple":"ومنهم من يقول ربنا ءاتنا فى الدنيا حسنة وفى الءاخرة حسنة وقنا عذاب النار"},{"id":209,"verse_key":"2:202","text_uthmani_simple":"او۟لئك لهم نصيب مما كسبوا۟ والله سريع الحساب"},{"id":210,"verse_key":"2:203","text_uthmani_simple":"واذكروا۟ الله فى ايام معدودت فمن تعجل فى يومين فلا اثم عليه ومن تاخر فلا اثم عليه لمن اتقى واتقوا۟ الله واعلموا۟ انكم اليه تحشرون"},{"id":211,"verse_key":"2:204","text_uthmani_simple":"ومن الناس من يعجبك قوله فى الحيوة الدنيا ويشهد الله على ما فى قلبه وهو الد الخصام"},{"id":212,"verse_key":"2:205","text_uthmani_simple":"واذا تولى سعى فى الارض ليفسد فيها ويهلك الحرث والنسل والله لا يحب الفساد"},{"id":213,"verse_key":"2:206","text_uthmani_simple":"واذا قيل له اتق الله اخذته العزة بالاثم فحسبه جهنم ولبئس المهاد"},{"id":214,"verse_key":"2:207","text_uthmani_simple":"ومن الناس من يشرى نفسه ابتغاء مرضات الله والله رءوفۢ بالعباد"},{"id":215,"verse_key":"2:208","text_uthmani_simple":"يايها الذين ءامنوا۟ ادخلوا۟ فى السلم كافة ولا تتبعوا۟ خطوت الشيطن انه لكم عدو مبين"},{"id":216,"verse_key":"2:209","text_uthmani_simple":"فان زللتم منۢ بعد ما جاءتكم البينت فاعلموا۟ ان الله عزيز حكيم"},{"id":217,"verse_key":"2:210","text_uthmani_simple":"هل ينظرون الا ان ياتيهم الله فى ظلل من الغمام والملئكة وقضى الامر والى الله ترجع الامور"},{"id":218,"verse_key":"2:211","text_uthmani_simple":"سل بنى اسرءيل كم ءاتينهم من ءايةۭ بينة ومن يبدل نعمة الله منۢ بعد ما جاءته فان الله شديد العقاب"},{"id":219,"verse_key":"2:212","text_uthmani_simple":"زين للذين كفروا۟ الحيوة الدنيا ويسخرون من الذين ءامنوا۟ والذين اتقوا۟ فوقهم يوم القيمة والله يرزق من يشاء بغير حساب"},{"id":220,"verse_key":"2:213","text_uthmani_simple":"كان الناس امة وحدة فبعث الله النبين مبشرين ومنذرين وانزل معهم الكتب بالحق ليحكم بين الناس فيما اختلفوا۟ فيه وما اختلف فيه الا الذين اوتوه منۢ بعد ما جاءتهم البينت بغيۢا بينهم فهدى الله الذين ءامنوا۟ لما اختلفوا۟ فيه من الحق باذنه والله يهدى من يشاء الى صرط مستقيم"},{"id":221,"verse_key":"2:214","text_uthmani_simple":"ام حسبتم ان تدخلوا۟ الجنة ولما ياتكم مثل الذين خلوا۟ من قبلكم مستهم الباساء والضراء وزلزلوا۟ حتى يقول الرسول والذين ءامنوا۟ معه متى نصر الله الا ان نصر الله قريب"},{"id":222,"verse_key":"2:215","text_uthmani_simple":"يسـلونك ماذا ينفقون قل ما انفقتم من خير فللولدين والاقربين واليتمى والمسكين وابن السبيل وما تفعلوا۟ من خير فان الله به عليم"},{"id":223,"verse_key":"2:216","text_uthmani_simple":"كتب عليكم القتال وهو كره لكم وعسى ان تكرهوا۟ شيـا وهو خير لكم وعسى ان تحبوا۟ شيـا وهو شر لكم والله يعلم وانتم لا تعلمون"},{"id":224,"verse_key":"2:217","text_uthmani_simple":"يسـلونك عن الشهر الحرام قتال فيه قل قتال فيه كبير وصد عن سبيل الله وكفرۢ به والمسجد الحرام واخراج اهله منه اكبر عند الله والفتنة اكبر من القتل ولا يزالون يقتلونكم حتى يردوكم عن دينكم ان استطعوا۟ ومن يرتدد منكم عن دينه فيمت وهو كافر فاو۟لئك حبطت اعملهم فى الدنيا والءاخرة واو۟لئك اصحب النار هم فيها خلدون"},{"id":225,"verse_key":"2:218","text_uthmani_simple":"ان الذين ءامنوا۟ والذين هاجروا۟ وجهدوا۟ فى سبيل الله او۟لئك يرجون رحمت الله والله غفور رحيم"},{"id":226,"verse_key":"2:219","text_uthmani_simple":"يسـلونك عن الخمر والميسر قل فيهما اثم كبير ومنفع للناس واثمهما اكبر من نفعهما ويسـلونك ماذا ينفقون قل العفو كذلك يبين الله لكم الءايت لعلكم تتفكرون"},{"id":227,"verse_key":"2:220","text_uthmani_simple":"فى الدنيا والءاخرة ويسـلونك عن اليتمى قل اصلاح لهم خير وان تخالطوهم فاخونكم والله يعلم المفسد من المصلح ولو شاء الله لاعنتكم ان الله عزيز حكيم"},{"id":228,"verse_key":"2:221","text_uthmani_simple":"ولا تنكحوا۟ المشركت حتى يؤمن ولامة مؤمنة خير من مشركة ولو اعجبتكم ولا تنكحوا۟ المشركين حتى يؤمنوا۟ ولعبد مؤمن خير من مشرك ولو اعجبكم او۟لئك يدعون الى النار والله يدعوا۟ الى الجنة والمغفرة باذنه ويبين ءايته للناس لعلهم يتذكرون"},{"id":229,"verse_key":"2:222","text_uthmani_simple":"ويسـلونك عن المحيض قل هو اذى فاعتزلوا۟ النساء فى المحيض ولا تقربوهن حتى يطهرن فاذا تطهرن فاتوهن من حيث امركم الله ان الله يحب التوبين ويحب المتطهرين"},{"id":230,"verse_key":"2:223","text_uthmani_simple":"نساؤكم حرث لكم فاتوا۟ حرثكم انى شئتم وقدموا۟ لانفسكم واتقوا۟ الله واعلموا۟ انكم ملقوه وبشر المؤمنين"},{"id":231,"verse_key":"2:224","text_uthmani_simple":"ولا تجعلوا۟ الله عرضة لايمنكم ان تبروا۟ وتتقوا۟ وتصلحوا۟ بين الناس والله سميع عليم"},{"id":232,"verse_key":"2:225","text_uthmani_simple":"لا يؤاخذكم الله باللغو فى ايمنكم ولكن يؤاخذكم بما كسبت قلوبكم والله غفور حليم"},{"id":233,"verse_key":"2:226","text_uthmani_simple":"للذين يؤلون من نسائهم تربص اربعة اشهر فان فاءو فان الله غفور رحيم"},{"id":234,"verse_key":"2:227","text_uthmani_simple":"وان عزموا۟ الطلق فان الله سميع عليم"},{"id":235,"verse_key":"2:228","text_uthmani_simple":"والمطلقت يتربصن بانفسهن ثلثة قروء ولا يحل لهن ان يكتمن ما خلق الله فى ارحامهن ان كن يؤمن بالله واليوم الءاخر وبعولتهن احق بردهن فى ذلك ان ارادوا۟ اصلحا ولهن مثل الذى عليهن بالمعروف وللرجال عليهن درجة والله عزيز حكيم"},{"id":236,"verse_key":"2:229","text_uthmani_simple":"الطلق مرتان فامساكۢ بمعروف او تسريحۢ باحسن ولا يحل لكم ان تاخذوا۟ مما ءاتيتموهن شيـا الا ان يخافا الا يقيما حدود الله فان خفتم الا يقيما حدود الله فلا جناح عليهما فيما افتدت به تلك حدود الله فلا تعتدوها ومن يتعد حدود الله فاو۟لئك هم الظلمون"},{"id":237,"verse_key":"2:230","text_uthmani_simple":"فان طلقها فلا تحل له منۢ بعد حتى تنكح زوجا غيره فان طلقها فلا جناح عليهما ان يتراجعا ان ظنا ان يقيما حدود الله وتلك حدود الله يبينها لقوم يعلمون"},{"id":238,"verse_key":"2:231","text_uthmani_simple":"واذا طلقتم النساء فبلغن اجلهن فامسكوهن بمعروف او سرحوهن بمعروف ولا تمسكوهن ضرارا لتعتدوا۟ ومن يفعل ذلك فقد ظلم نفسه ولا تتخذوا۟ ءايت الله هزوا واذكروا۟ نعمت الله عليكم وما انزل عليكم من الكتب والحكمة يعظكم به واتقوا۟ الله واعلموا۟ ان الله بكل شىء عليم"},{"id":239,"verse_key":"2:232","text_uthmani_simple":"واذا طلقتم النساء فبلغن اجلهن فلا تعضلوهن ان ينكحن ازوجهن اذا ترضوا۟ بينهم بالمعروف ذلك يوعظ به من كان منكم يؤمن بالله واليوم الءاخر ذلكم ازكى لكم واطهر والله يعلم وانتم لا تعلمون"},{"id":240,"verse_key":"2:233","text_uthmani_simple":"والولدت يرضعن اولدهن حولين كاملين لمن اراد ان يتم الرضاعة وعلى المولود له رزقهن وكسوتهن بالمعروف لا تكلف نفس الا وسعها لا تضار ولدةۢ بولدها ولا مولود له بولده وعلى الوارث مثل ذلك فان ارادا فصالا عن تراض منهما وتشاور فلا جناح عليهما وان اردتم ان تسترضعوا۟ اولدكم فلا جناح عليكم اذا سلمتم ما ءاتيتم بالمعروف واتقوا۟ الله واعلموا۟ ان الله بما تعملون بصير"},{"id":241,"verse_key":"2:234","text_uthmani_simple":"والذين يتوفون منكم ويذرون ازوجا يتربصن بانفسهن اربعة اشهر وعشرا فاذا بلغن اجلهن فلا جناح عليكم فيما فعلن فى انفسهن بالمعروف والله بما تعملون خبير"},{"id":242,"verse_key":"2:235","text_uthmani_simple":"ولا جناح عليكم فيما عرضتم به من خطبة النساء او اكننتم فى انفسكم علم الله انكم ستذكرونهن ولكن لا تواعدوهن سرا الا ان تقولوا۟ قولا معروفا ولا تعزموا۟ عقدة النكاح حتى يبلغ الكتب اجله واعلموا۟ ان الله يعلم ما فى انفسكم فاحذروه واعلموا۟ ان الله غفور حليم"},{"id":243,"verse_key":"2:236","text_uthmani_simple":"لا جناح عليكم ان طلقتم النساء ما لم تمسوهن او تفرضوا۟ لهن فريضة ومتعوهن على الموسع قدره وعلى المقتر قدره متعۢا بالمعروف حقا على المحسنين"},{"id":244,"verse_key":"2:237","text_uthmani_simple":"وان طلقتموهن من قبل ان تمسوهن وقد فرضتم لهن فريضة فنصف ما فرضتم الا ان يعفون او يعفوا۟ الذى بيده عقدة النكاح وان تعفوا۟ اقرب للتقوى ولا تنسوا۟ الفضل بينكم ان الله بما تعملون بصير"},{"id":245,"verse_key":"2:238","text_uthmani_simple":"حفظوا۟ على الصلوت والصلوة الوسطى وقوموا۟ لله قنتين"},{"id":246,"verse_key":"2:239","text_uthmani_simple":"فان خفتم فرجالا او ركبانا فاذا امنتم فاذكروا۟ الله كما علمكم ما لم تكونوا۟ تعلمون"},{"id":247,"verse_key":"2:240","text_uthmani_simple":"والذين يتوفون منكم ويذرون ازوجا وصية لازوجهم متعا الى الحول غير اخراج فان خرجن فلا جناح عليكم فى ما فعلن فى انفسهن من معروف والله عزيز حكيم"},{"id":248,"verse_key":"2:241","text_uthmani_simple":"وللمطلقت متعۢ بالمعروف حقا على المتقين"},{"id":249,"verse_key":"2:242","text_uthmani_simple":"كذلك يبين الله لكم ءايته لعلكم تعقلون"},{"id":250,"verse_key":"2:243","text_uthmani_simple":"الم تر الى الذين خرجوا۟ من ديرهم وهم الوف حذر الموت فقال لهم الله موتوا۟ ثم احيهم ان الله لذو فضل على الناس ولكن اكثر الناس لا يشكرون"},{"id":251,"verse_key":"2:244","text_uthmani_simple":"وقتلوا۟ فى سبيل الله واعلموا۟ ان الله سميع عليم"},{"id":252,"verse_key":"2:245","text_uthmani_simple":"من ذا الذى يقرض الله قرضا حسنا فيضعفه له اضعافا كثيرة والله يقبض ويبصۜط واليه ترجعون"},{"id":253,"verse_key":"2:246","text_uthmani_simple":"الم تر الى الملا منۢ بنى اسرءيل منۢ بعد موسى اذ قالوا۟ لنبى لهم ابعث لنا ملكا نقتل فى سبيل الله قال هل عسيتم ان كتب عليكم القتال الا تقتلوا۟ قالوا۟ وما لنا الا نقتل فى سبيل الله وقد اخرجنا من ديرنا وابنائنا فلما كتب عليهم القتال تولوا۟ الا قليلا منهم والله عليمۢ بالظلمين"},{"id":254,"verse_key":"2:247","text_uthmani_simple":"وقال لهم نبيهم ان الله قد بعث لكم طالوت ملكا قالوا۟ انى يكون له الملك علينا ونحن احق بالملك منه ولم يؤت سعة من المال قال ان الله اصطفىه عليكم وزاده بسطة فى العلم والجسم والله يؤتى ملكه من يشاء والله وسع عليم"},{"id":255,"verse_key":"2:248","text_uthmani_simple":"وقال لهم نبيهم ان ءاية ملكه ان ياتيكم التابوت فيه سكينة من ربكم وبقية مما ترك ءال موسى وءال هرون تحمله الملئكة ان فى ذلك لءاية لكم ان كنتم مؤمنين"},{"id":256,"verse_key":"2:249","text_uthmani_simple":"فلما فصل طالوت بالجنود قال ان الله مبتليكم بنهر فمن شرب منه فليس منى ومن لم يطعمه فانه منى الا من اغترف غرفةۢ بيده فشربوا۟ منه الا قليلا منهم فلما جاوزه هو والذين ءامنوا۟ معه قالوا۟ لا طاقة لنا اليوم بجالوت وجنوده قال الذين يظنون انهم ملقوا۟ الله كم من فئة قليلة غلبت فئة كثيرةۢ باذن الله والله مع الصبرين"},{"id":257,"verse_key":"2:250","text_uthmani_simple":"ولما برزوا۟ لجالوت وجنوده قالوا۟ ربنا افرغ علينا صبرا وثبت اقدامنا وانصرنا على القوم الكفرين"},{"id":258,"verse_key":"2:251","text_uthmani_simple":"فهزموهم باذن الله وقتل داود جالوت وءاتىه الله الملك والحكمة وعلمه مما يشاء ولولا دفع الله الناس بعضهم ببعض لفسدت الارض ولكن الله ذو فضل على العلمين"},{"id":259,"verse_key":"2:252","text_uthmani_simple":"تلك ءايت الله نتلوها عليك بالحق وانك لمن المرسلين"}],"meta":{"filters":{"juz_number":"2"}}}
