{"verses":[{"id":5105,"verse_key":"58:1","text_uthmani_simple":"قد سمع الله قول التى تجدلك فى زوجها وتشتكى الى الله والله يسمع تحاوركما ان الله سميعۢ بصير"},{"id":5106,"verse_key":"58:2","text_uthmani_simple":"الذين يظهرون منكم من نسائهم ما هن امهتهم ان امهتهم الا الـى ولدنهم وانهم ليقولون منكرا من القول وزورا وان الله لعفو غفور"},{"id":5107,"verse_key":"58:3","text_uthmani_simple":"والذين يظهرون من نسائهم ثم يعودون لما قالوا۟ فتحرير رقبة من قبل ان يتماسا ذلكم توعظون به والله بما تعملون خبير"},{"id":5108,"verse_key":"58:4","text_uthmani_simple":"فمن لم يجد فصيام شهرين متتابعين من قبل ان يتماسا فمن لم يستطع فاطعام ستين مسكينا ذلك لتؤمنوا۟ بالله ورسوله وتلك حدود الله وللكفرين عذاب اليم"},{"id":5109,"verse_key":"58:5","text_uthmani_simple":"ان الذين يحادون الله ورسوله كبتوا۟ كما كبت الذين من قبلهم وقد انزلنا ءايتۭ بينت وللكفرين عذاب مهين"},{"id":5110,"verse_key":"58:6","text_uthmani_simple":"يوم يبعثهم الله جميعا فينبئهم بما عملوا۟ احصىه الله ونسوه والله على كل شىء شهيد"},{"id":5111,"verse_key":"58:7","text_uthmani_simple":"الم تر ان الله يعلم ما فى السموت وما فى الارض ما يكون من نجوى ثلثة الا هو رابعهم ولا خمسة الا هو سادسهم ولا ادنى من ذلك ولا اكثر الا هو معهم اين ما كانوا۟ ثم ينبئهم بما عملوا۟ يوم القيمة ان الله بكل شىء عليم"},{"id":5112,"verse_key":"58:8","text_uthmani_simple":"الم تر الى الذين نهوا۟ عن النجوى ثم يعودون لما نهوا۟ عنه ويتنجون بالاثم والعدون ومعصيت الرسول واذا جاءوك حيوك بما لم يحيك به الله ويقولون فى انفسهم لولا يعذبنا الله بما نقول حسبهم جهنم يصلونها فبئس المصير"},{"id":5113,"verse_key":"58:9","text_uthmani_simple":"يايها الذين ءامنوا۟ اذا تنجيتم فلا تتنجوا۟ بالاثم والعدون ومعصيت الرسول وتنجوا۟ بالبر والتقوى واتقوا۟ الله الذى اليه تحشرون"},{"id":5114,"verse_key":"58:10","text_uthmani_simple":"انما النجوى من الشيطن ليحزن الذين ءامنوا۟ وليس بضارهم شيـا الا باذن الله وعلى الله فليتوكل المؤمنون"},{"id":5115,"verse_key":"58:11","text_uthmani_simple":"يايها الذين ءامنوا۟ اذا قيل لكم تفسحوا۟ فى المجلس فافسحوا۟ يفسح الله لكم واذا قيل انشزوا۟ فانشزوا۟ يرفع الله الذين ءامنوا۟ منكم والذين اوتوا۟ العلم درجت والله بما تعملون خبير"},{"id":5116,"verse_key":"58:12","text_uthmani_simple":"يايها الذين ءامنوا۟ اذا نجيتم الرسول فقدموا۟ بين يدى نجوىكم صدقة ذلك خير لكم واطهر فان لم تجدوا۟ فان الله غفور رحيم"},{"id":5117,"verse_key":"58:13","text_uthmani_simple":"ءاشفقتم ان تقدموا۟ بين يدى نجوىكم صدقت فاذ لم تفعلوا۟ وتاب الله عليكم فاقيموا۟ الصلوة وءاتوا۟ الزكوة واطيعوا۟ الله ورسوله والله خبيرۢ بما تعملون"},{"id":5118,"verse_key":"58:14","text_uthmani_simple":"الم تر الى الذين تولوا۟ قوما غضب الله عليهم ما هم منكم ولا منهم ويحلفون على الكذب وهم يعلمون"},{"id":5119,"verse_key":"58:15","text_uthmani_simple":"اعد الله لهم عذابا شديدا انهم ساء ما كانوا۟ يعملون"},{"id":5120,"verse_key":"58:16","text_uthmani_simple":"اتخذوا۟ ايمنهم جنة فصدوا۟ عن سبيل الله فلهم عذاب مهين"},{"id":5121,"verse_key":"58:17","text_uthmani_simple":"لن تغنى عنهم امولهم ولا اولدهم من الله شيـا او۟لئك اصحب النار هم فيها خلدون"},{"id":5122,"verse_key":"58:18","text_uthmani_simple":"يوم يبعثهم الله جميعا فيحلفون له كما يحلفون لكم ويحسبون انهم على شىء الا انهم هم الكذبون"},{"id":5123,"verse_key":"58:19","text_uthmani_simple":"استحوذ عليهم الشيطن فانسىهم ذكر الله او۟لئك حزب الشيطن الا ان حزب الشيطن هم الخسرون"},{"id":5124,"verse_key":"58:20","text_uthmani_simple":"ان الذين يحادون الله ورسوله او۟لئك فى الاذلين"},{"id":5125,"verse_key":"58:21","text_uthmani_simple":"كتب الله لاغلبن انا۠ ورسلى ان الله قوى عزيز"},{"id":5126,"verse_key":"58:22","text_uthmani_simple":"لا تجد قوما يؤمنون بالله واليوم الءاخر يوادون من حاد الله ورسوله ولو كانوا۟ ءاباءهم او ابناءهم او اخونهم او عشيرتهم او۟لئك كتب فى قلوبهم الايمن وايدهم بروح منه ويدخلهم جنت تجرى من تحتها الانهر خلدين فيها رضى الله عنهم ورضوا۟ عنه او۟لئك حزب الله الا ان حزب الله هم المفلحون"},{"id":5127,"verse_key":"59:1","text_uthmani_simple":"سبح لله ما فى السموت وما فى الارض وهو العزيز الحكيم"},{"id":5128,"verse_key":"59:2","text_uthmani_simple":"هو الذى اخرج الذين كفروا۟ من اهل الكتب من ديرهم لاول الحشر ما ظننتم ان يخرجوا۟ وظنوا۟ انهم مانعتهم حصونهم من الله فاتىهم الله من حيث لم يحتسبوا۟ وقذف فى قلوبهم الرعب يخربون بيوتهم بايديهم وايدى المؤمنين فاعتبروا۟ ياو۟لى الابصر"},{"id":5129,"verse_key":"59:3","text_uthmani_simple":"ولولا ان كتب الله عليهم الجلاء لعذبهم فى الدنيا ولهم فى الءاخرة عذاب النار"},{"id":5130,"verse_key":"59:4","text_uthmani_simple":"ذلك بانهم شاقوا۟ الله ورسوله ومن يشاق الله فان الله شديد العقاب"},{"id":5131,"verse_key":"59:5","text_uthmani_simple":"ما قطعتم من لينة او تركتموها قائمة على اصولها فباذن الله وليخزى الفسقين"},{"id":5132,"verse_key":"59:6","text_uthmani_simple":"وما افاء الله على رسوله منهم فما اوجفتم عليه من خيل ولا ركاب ولكن الله يسلط رسله على من يشاء والله على كل شىء قدير"},{"id":5133,"verse_key":"59:7","text_uthmani_simple":"ما افاء الله على رسوله من اهل القرى فلله وللرسول ولذى القربى واليتمى والمسكين وابن السبيل كى لا يكون دولةۢ بين الاغنياء منكم وما ءاتىكم الرسول فخذوه وما نهىكم عنه فانتهوا۟ واتقوا۟ الله ان الله شديد العقاب"},{"id":5134,"verse_key":"59:8","text_uthmani_simple":"للفقراء المهجرين الذين اخرجوا۟ من ديرهم وامولهم يبتغون فضلا من الله ورضونا وينصرون الله ورسوله او۟لئك هم الصدقون"},{"id":5135,"verse_key":"59:9","text_uthmani_simple":"والذين تبوءو الدار والايمن من قبلهم يحبون من هاجر اليهم ولا يجدون فى صدورهم حاجة مما اوتوا۟ ويؤثرون على انفسهم ولو كان بهم خصاصة ومن يوق شح نفسه فاو۟لئك هم المفلحون"},{"id":5136,"verse_key":"59:10","text_uthmani_simple":"والذين جاءو منۢ بعدهم يقولون ربنا اغفر لنا ولاخوننا الذين سبقونا بالايمن ولا تجعل فى قلوبنا غلا للذين ءامنوا۟ ربنا انك رءوف رحيم"},{"id":5137,"verse_key":"59:11","text_uthmani_simple":"الم تر الى الذين نافقوا۟ يقولون لاخونهم الذين كفروا۟ من اهل الكتب لئن اخرجتم لنخرجن معكم ولا نطيع فيكم احدا ابدا وان قوتلتم لننصرنكم والله يشهد انهم لكذبون"},{"id":5138,"verse_key":"59:12","text_uthmani_simple":"لئن اخرجوا۟ لا يخرجون معهم ولئن قوتلوا۟ لا ينصرونهم ولئن نصروهم ليولن الادبر ثم لا ينصرون"},{"id":5139,"verse_key":"59:13","text_uthmani_simple":"لانتم اشد رهبة فى صدورهم من الله ذلك بانهم قوم لا يفقهون"},{"id":5140,"verse_key":"59:14","text_uthmani_simple":"لا يقتلونكم جميعا الا فى قرى محصنة او من وراء جدرۭ باسهم بينهم شديد تحسبهم جميعا وقلوبهم شتى ذلك بانهم قوم لا يعقلون"},{"id":5141,"verse_key":"59:15","text_uthmani_simple":"كمثل الذين من قبلهم قريبا ذاقوا۟ وبال امرهم ولهم عذاب اليم"},{"id":5142,"verse_key":"59:16","text_uthmani_simple":"كمثل الشيطن اذ قال للانسن اكفر فلما كفر قال انى برىء منك انى اخاف الله رب العلمين"},{"id":5143,"verse_key":"59:17","text_uthmani_simple":"فكان عقبتهما انهما فى النار خلدين فيها وذلك جزؤا۟ الظلمين"},{"id":5144,"verse_key":"59:18","text_uthmani_simple":"يايها الذين ءامنوا۟ اتقوا۟ الله ولتنظر نفس ما قدمت لغد واتقوا۟ الله ان الله خبيرۢ بما تعملون"},{"id":5145,"verse_key":"59:19","text_uthmani_simple":"ولا تكونوا۟ كالذين نسوا۟ الله فانسىهم انفسهم او۟لئك هم الفسقون"},{"id":5146,"verse_key":"59:20","text_uthmani_simple":"لا يستوى اصحب النار واصحب الجنة اصحب الجنة هم الفائزون"},{"id":5147,"verse_key":"59:21","text_uthmani_simple":"لو انزلنا هذا القرءان على جبل لرايته خشعا متصدعا من خشية الله وتلك الامثل نضربها للناس لعلهم يتفكرون"},{"id":5148,"verse_key":"59:22","text_uthmani_simple":"هو الله الذى لا اله الا هو علم الغيب والشهدة هو الرحمن الرحيم"},{"id":5149,"verse_key":"59:23","text_uthmani_simple":"هو الله الذى لا اله الا هو الملك القدوس السلم المؤمن المهيمن العزيز الجبار المتكبر سبحن الله عما يشركون"},{"id":5150,"verse_key":"59:24","text_uthmani_simple":"هو الله الخلق البارئ المصور له الاسماء الحسنى يسبح له ما فى السموت والارض وهو العزيز الحكيم"},{"id":5151,"verse_key":"60:1","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تتخذوا۟ عدوى وعدوكم اولياء تلقون اليهم بالمودة وقد كفروا۟ بما جاءكم من الحق يخرجون الرسول واياكم ان تؤمنوا۟ بالله ربكم ان كنتم خرجتم جهدا فى سبيلى وابتغاء مرضاتى تسرون اليهم بالمودة وانا۠ اعلم بما اخفيتم وما اعلنتم ومن يفعله منكم فقد ضل سواء السبيل"},{"id":5152,"verse_key":"60:2","text_uthmani_simple":"ان يثقفوكم يكونوا۟ لكم اعداء ويبسطوا۟ اليكم ايديهم والسنتهم بالسوء وودوا۟ لو تكفرون"},{"id":5153,"verse_key":"60:3","text_uthmani_simple":"لن تنفعكم ارحامكم ولا اولدكم يوم القيمة يفصل بينكم والله بما تعملون بصير"},{"id":5154,"verse_key":"60:4","text_uthmani_simple":"قد كانت لكم اسوة حسنة فى ابرهيم والذين معه اذ قالوا۟ لقومهم انا برءؤا۟ منكم ومما تعبدون من دون الله كفرنا بكم وبدا بيننا وبينكم العدوة والبغضاء ابدا حتى تؤمنوا۟ بالله وحده الا قول ابرهيم لابيه لاستغفرن لك وما املك لك من الله من شىء ربنا عليك توكلنا واليك انبنا واليك المصير"},{"id":5155,"verse_key":"60:5","text_uthmani_simple":"ربنا لا تجعلنا فتنة للذين كفروا۟ واغفر لنا ربنا انك انت العزيز الحكيم"},{"id":5156,"verse_key":"60:6","text_uthmani_simple":"لقد كان لكم فيهم اسوة حسنة لمن كان يرجوا۟ الله واليوم الءاخر ومن يتول فان الله هو الغنى الحميد"},{"id":5157,"verse_key":"60:7","text_uthmani_simple":"۞ عسى الله ان يجعل بينكم وبين الذين عاديتم منهم مودة والله قدير والله غفور رحيم"},{"id":5158,"verse_key":"60:8","text_uthmani_simple":"لا ينهىكم الله عن الذين لم يقتلوكم فى الدين ولم يخرجوكم من ديركم ان تبروهم وتقسطوا۟ اليهم ان الله يحب المقسطين"},{"id":5159,"verse_key":"60:9","text_uthmani_simple":"انما ينهىكم الله عن الذين قتلوكم فى الدين واخرجوكم من ديركم وظهروا۟ على اخراجكم ان تولوهم ومن يتولهم فاو۟لئك هم الظلمون"},{"id":5160,"verse_key":"60:10","text_uthmani_simple":"يايها الذين ءامنوا۟ اذا جاءكم المؤمنت مهجرت فامتحنوهن الله اعلم بايمنهن فان علمتموهن مؤمنت فلا ترجعوهن الى الكفار لا هن حل لهم ولا هم يحلون لهن وءاتوهم ما انفقوا۟ ولا جناح عليكم ان تنكحوهن اذا ءاتيتموهن اجورهن ولا تمسكوا۟ بعصم الكوافر وسـلوا۟ ما انفقتم وليسـلوا۟ ما انفقوا۟ ذلكم حكم الله يحكم بينكم والله عليم حكيم"},{"id":5161,"verse_key":"60:11","text_uthmani_simple":"وان فاتكم شىء من ازوجكم الى الكفار فعاقبتم فـاتوا۟ الذين ذهبت ازوجهم مثل ما انفقوا۟ واتقوا۟ الله الذى انتم به مؤمنون"},{"id":5162,"verse_key":"60:12","text_uthmani_simple":"يايها النبى اذا جاءك المؤمنت يبايعنك على ان لا يشركن بالله شيـا ولا يسرقن ولا يزنين ولا يقتلن اولدهن ولا ياتين ببهتن يفترينه بين ايديهن وارجلهن ولا يعصينك فى معروف فبايعهن واستغفر لهن الله ان الله غفور رحيم"},{"id":5163,"verse_key":"60:13","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تتولوا۟ قوما غضب الله عليهم قد يئسوا۟ من الءاخرة كما يئس الكفار من اصحب القبور"},{"id":5164,"verse_key":"61:1","text_uthmani_simple":"سبح لله ما فى السموت وما فى الارض وهو العزيز الحكيم"},{"id":5165,"verse_key":"61:2","text_uthmani_simple":"يايها الذين ءامنوا۟ لم تقولون ما لا تفعلون"},{"id":5166,"verse_key":"61:3","text_uthmani_simple":"كبر مقتا عند الله ان تقولوا۟ ما لا تفعلون"},{"id":5167,"verse_key":"61:4","text_uthmani_simple":"ان الله يحب الذين يقتلون فى سبيله صفا كانهم بنين مرصوص"},{"id":5168,"verse_key":"61:5","text_uthmani_simple":"واذ قال موسى لقومه يقوم لم تؤذوننى وقد تعلمون انى رسول الله اليكم فلما زاغوا۟ ازاغ الله قلوبهم والله لا يهدى القوم الفسقين"},{"id":5169,"verse_key":"61:6","text_uthmani_simple":"واذ قال عيسى ابن مريم يبنى اسرءيل انى رسول الله اليكم مصدقا لما بين يدى من التورىة ومبشرۢا برسول ياتى منۢ بعدى اسمه احمد فلما جاءهم بالبينت قالوا۟ هذا سحر مبين"},{"id":5170,"verse_key":"61:7","text_uthmani_simple":"ومن اظلم ممن افترى على الله الكذب وهو يدعى الى الاسلم والله لا يهدى القوم الظلمين"},{"id":5171,"verse_key":"61:8","text_uthmani_simple":"يريدون ليطفـوا۟ نور الله بافوههم والله متم نوره ولو كره الكفرون"},{"id":5172,"verse_key":"61:9","text_uthmani_simple":"هو الذى ارسل رسوله بالهدى ودين الحق ليظهره على الدين كله ولو كره المشركون"},{"id":5173,"verse_key":"61:10","text_uthmani_simple":"يايها الذين ءامنوا۟ هل ادلكم على تجرة تنجيكم من عذاب اليم"},{"id":5174,"verse_key":"61:11","text_uthmani_simple":"تؤمنون بالله ورسوله وتجهدون فى سبيل الله بامولكم وانفسكم ذلكم خير لكم ان كنتم تعلمون"},{"id":5175,"verse_key":"61:12","text_uthmani_simple":"يغفر لكم ذنوبكم ويدخلكم جنت تجرى من تحتها الانهر ومسكن طيبة فى جنت عدن ذلك الفوز العظيم"},{"id":5176,"verse_key":"61:13","text_uthmani_simple":"واخرى تحبونها نصر من الله وفتح قريب وبشر المؤمنين"},{"id":5177,"verse_key":"61:14","text_uthmani_simple":"يايها الذين ءامنوا۟ كونوا۟ انصار الله كما قال عيسى ابن مريم للحوارين من انصارى الى الله قال الحواريون نحن انصار الله فـامنت طائفة منۢ بنى اسرءيل وكفرت طائفة فايدنا الذين ءامنوا۟ على عدوهم فاصبحوا۟ ظهرين"},{"id":5178,"verse_key":"62:1","text_uthmani_simple":"يسبح لله ما فى السموت وما فى الارض الملك القدوس العزيز الحكيم"},{"id":5179,"verse_key":"62:2","text_uthmani_simple":"هو الذى بعث فى الامين رسولا منهم يتلوا۟ عليهم ءايته ويزكيهم ويعلمهم الكتب والحكمة وان كانوا۟ من قبل لفى ضلل مبين"},{"id":5180,"verse_key":"62:3","text_uthmani_simple":"وءاخرين منهم لما يلحقوا۟ بهم وهو العزيز الحكيم"},{"id":5181,"verse_key":"62:4","text_uthmani_simple":"ذلك فضل الله يؤتيه من يشاء والله ذو الفضل العظيم"},{"id":5182,"verse_key":"62:5","text_uthmani_simple":"مثل الذين حملوا۟ التورىة ثم لم يحملوها كمثل الحمار يحمل اسفارۢا بئس مثل القوم الذين كذبوا۟ بـايت الله والله لا يهدى القوم الظلمين"},{"id":5183,"verse_key":"62:6","text_uthmani_simple":"قل يايها الذين هادوا۟ ان زعمتم انكم اولياء لله من دون الناس فتمنوا۟ الموت ان كنتم صدقين"},{"id":5184,"verse_key":"62:7","text_uthmani_simple":"ولا يتمنونه ابدۢا بما قدمت ايديهم والله عليمۢ بالظلمين"},{"id":5185,"verse_key":"62:8","text_uthmani_simple":"قل ان الموت الذى تفرون منه فانه ملقيكم ثم تردون الى علم الغيب والشهدة فينبئكم بما كنتم تعملون"},{"id":5186,"verse_key":"62:9","text_uthmani_simple":"يايها الذين ءامنوا۟ اذا نودى للصلوة من يوم الجمعة فاسعوا۟ الى ذكر الله وذروا۟ البيع ذلكم خير لكم ان كنتم تعلمون"},{"id":5187,"verse_key":"62:10","text_uthmani_simple":"فاذا قضيت الصلوة فانتشروا۟ فى الارض وابتغوا۟ من فضل الله واذكروا۟ الله كثيرا لعلكم تفلحون"},{"id":5188,"verse_key":"62:11","text_uthmani_simple":"واذا راوا۟ تجرة او لهوا انفضوا۟ اليها وتركوك قائما قل ما عند الله خير من اللهو ومن التجرة والله خير الرزقين"},{"id":5189,"verse_key":"63:1","text_uthmani_simple":"اذا جاءك المنفقون قالوا۟ نشهد انك لرسول الله والله يعلم انك لرسوله والله يشهد ان المنفقين لكذبون"},{"id":5190,"verse_key":"63:2","text_uthmani_simple":"اتخذوا۟ ايمنهم جنة فصدوا۟ عن سبيل الله انهم ساء ما كانوا۟ يعملون"},{"id":5191,"verse_key":"63:3","text_uthmani_simple":"ذلك بانهم ءامنوا۟ ثم كفروا۟ فطبع على قلوبهم فهم لا يفقهون"},{"id":5192,"verse_key":"63:4","text_uthmani_simple":"واذا رايتهم تعجبك اجسامهم وان يقولوا۟ تسمع لقولهم كانهم خشب مسندة يحسبون كل صيحة عليهم هم العدو فاحذرهم قتلهم الله انى يؤفكون"},{"id":5193,"verse_key":"63:5","text_uthmani_simple":"واذا قيل لهم تعالوا۟ يستغفر لكم رسول الله لووا۟ رءوسهم ورايتهم يصدون وهم مستكبرون"},{"id":5194,"verse_key":"63:6","text_uthmani_simple":"سواء عليهم استغفرت لهم ام لم تستغفر لهم لن يغفر الله لهم ان الله لا يهدى القوم الفسقين"},{"id":5195,"verse_key":"63:7","text_uthmani_simple":"هم الذين يقولون لا تنفقوا۟ على من عند رسول الله حتى ينفضوا۟ ولله خزائن السموت والارض ولكن المنفقين لا يفقهون"},{"id":5196,"verse_key":"63:8","text_uthmani_simple":"يقولون لئن رجعنا الى المدينة ليخرجن الاعز منها الاذل ولله العزة ولرسوله وللمؤمنين ولكن المنفقين لا يعلمون"},{"id":5197,"verse_key":"63:9","text_uthmani_simple":"يايها الذين ءامنوا۟ لا تلهكم امولكم ولا اولدكم عن ذكر الله ومن يفعل ذلك فاو۟لئك هم الخسرون"},{"id":5198,"verse_key":"63:10","text_uthmani_simple":"وانفقوا۟ من ما رزقنكم من قبل ان ياتى احدكم الموت فيقول رب لولا اخرتنى الى اجل قريب فاصدق واكن من الصلحين"},{"id":5199,"verse_key":"63:11","text_uthmani_simple":"ولن يؤخر الله نفسا اذا جاء اجلها والله خبيرۢ بما تعملون"},{"id":5200,"verse_key":"64:1","text_uthmani_simple":"يسبح لله ما فى السموت وما فى الارض له الملك وله الحمد وهو على كل شىء قدير"},{"id":5201,"verse_key":"64:2","text_uthmani_simple":"هو الذى خلقكم فمنكم كافر ومنكم مؤمن والله بما تعملون بصير"},{"id":5202,"verse_key":"64:3","text_uthmani_simple":"خلق السموت والارض بالحق وصوركم فاحسن صوركم واليه المصير"},{"id":5203,"verse_key":"64:4","text_uthmani_simple":"يعلم ما فى السموت والارض ويعلم ما تسرون وما تعلنون والله عليمۢ بذات الصدور"},{"id":5204,"verse_key":"64:5","text_uthmani_simple":"الم ياتكم نبؤا۟ الذين كفروا۟ من قبل فذاقوا۟ وبال امرهم ولهم عذاب اليم"},{"id":5205,"verse_key":"64:6","text_uthmani_simple":"ذلك بانه كانت تاتيهم رسلهم بالبينت فقالوا۟ ابشر يهدوننا فكفروا۟ وتولوا۟ واستغنى الله والله غنى حميد"},{"id":5206,"verse_key":"64:7","text_uthmani_simple":"زعم الذين كفروا۟ ان لن يبعثوا۟ قل بلى وربى لتبعثن ثم لتنبؤن بما عملتم وذلك على الله يسير"},{"id":5207,"verse_key":"64:8","text_uthmani_simple":"فـامنوا۟ بالله ورسوله والنور الذى انزلنا والله بما تعملون خبير"},{"id":5208,"verse_key":"64:9","text_uthmani_simple":"يوم يجمعكم ليوم الجمع ذلك يوم التغابن ومن يؤمنۢ بالله ويعمل صلحا يكفر عنه سيـاته ويدخله جنت تجرى من تحتها الانهر خلدين فيها ابدا ذلك الفوز العظيم"},{"id":5209,"verse_key":"64:10","text_uthmani_simple":"والذين كفروا۟ وكذبوا۟ بـايتنا او۟لئك اصحب النار خلدين فيها وبئس المصير"},{"id":5210,"verse_key":"64:11","text_uthmani_simple":"ما اصاب من مصيبة الا باذن الله ومن يؤمنۢ بالله يهد قلبه والله بكل شىء عليم"},{"id":5211,"verse_key":"64:12","text_uthmani_simple":"واطيعوا۟ الله واطيعوا۟ الرسول فان توليتم فانما على رسولنا البلغ المبين"},{"id":5212,"verse_key":"64:13","text_uthmani_simple":"الله لا اله الا هو وعلى الله فليتوكل المؤمنون"},{"id":5213,"verse_key":"64:14","text_uthmani_simple":"يايها الذين ءامنوا۟ ان من ازوجكم واولدكم عدوا لكم فاحذروهم وان تعفوا۟ وتصفحوا۟ وتغفروا۟ فان الله غفور رحيم"},{"id":5214,"verse_key":"64:15","text_uthmani_simple":"انما امولكم واولدكم فتنة والله عنده اجر عظيم"},{"id":5215,"verse_key":"64:16","text_uthmani_simple":"فاتقوا۟ الله ما استطعتم واسمعوا۟ واطيعوا۟ وانفقوا۟ خيرا لانفسكم ومن يوق شح نفسه فاو۟لئك هم المفلحون"},{"id":5216,"verse_key":"64:17","text_uthmani_simple":"ان تقرضوا۟ الله قرضا حسنا يضعفه لكم ويغفر لكم والله شكور حليم"},{"id":5217,"verse_key":"64:18","text_uthmani_simple":"علم الغيب والشهدة العزيز الحكيم"},{"id":5218,"verse_key":"65:1","text_uthmani_simple":"يايها النبى اذا طلقتم النساء فطلقوهن لعدتهن واحصوا۟ العدة واتقوا۟ الله ربكم لا تخرجوهن منۢ بيوتهن ولا يخرجن الا ان ياتين بفحشة مبينة وتلك حدود الله ومن يتعد حدود الله فقد ظلم نفسه لا تدرى لعل الله يحدث بعد ذلك امرا"},{"id":5219,"verse_key":"65:2","text_uthmani_simple":"فاذا بلغن اجلهن فامسكوهن بمعروف او فارقوهن بمعروف واشهدوا۟ ذوى عدل منكم واقيموا۟ الشهدة لله ذلكم يوعظ به من كان يؤمن بالله واليوم الءاخر ومن يتق الله يجعل له مخرجا"},{"id":5220,"verse_key":"65:3","text_uthmani_simple":"ويرزقه من حيث لا يحتسب ومن يتوكل على الله فهو حسبه ان الله بلغ امره قد جعل الله لكل شىء قدرا"},{"id":5221,"verse_key":"65:4","text_uthmani_simple":"والـى يئسن من المحيض من نسائكم ان ارتبتم فعدتهن ثلثة اشهر والـى لم يحضن واو۟لت الاحمال اجلهن ان يضعن حملهن ومن يتق الله يجعل له من امره يسرا"},{"id":5222,"verse_key":"65:5","text_uthmani_simple":"ذلك امر الله انزله اليكم ومن يتق الله يكفر عنه سيـاته ويعظم له اجرا"},{"id":5223,"verse_key":"65:6","text_uthmani_simple":"اسكنوهن من حيث سكنتم من وجدكم ولا تضاروهن لتضيقوا۟ عليهن وان كن او۟لت حمل فانفقوا۟ عليهن حتى يضعن حملهن فان ارضعن لكم فـاتوهن اجورهن واتمروا۟ بينكم بمعروف وان تعاسرتم فسترضع له اخرى"},{"id":5224,"verse_key":"65:7","text_uthmani_simple":"لينفق ذو سعة من سعته ومن قدر عليه رزقه فلينفق مما ءاتىه الله لا يكلف الله نفسا الا ما ءاتىها سيجعل الله بعد عسر يسرا"},{"id":5225,"verse_key":"65:8","text_uthmani_simple":"وكاين من قرية عتت عن امر ربها ورسله فحاسبنها حسابا شديدا وعذبنها عذابا نكرا"},{"id":5226,"verse_key":"65:9","text_uthmani_simple":"فذاقت وبال امرها وكان عقبة امرها خسرا"},{"id":5227,"verse_key":"65:10","text_uthmani_simple":"اعد الله لهم عذابا شديدا فاتقوا۟ الله ياو۟لى الالبب الذين ءامنوا۟ قد انزل الله اليكم ذكرا"},{"id":5228,"verse_key":"65:11","text_uthmani_simple":"رسولا يتلوا۟ عليكم ءايت الله مبينت ليخرج الذين ءامنوا۟ وعملوا۟ الصلحت من الظلمت الى النور ومن يؤمنۢ بالله ويعمل صلحا يدخله جنت تجرى من تحتها الانهر خلدين فيها ابدا قد احسن الله له رزقا"},{"id":5229,"verse_key":"65:12","text_uthmani_simple":"الله الذى خلق سبع سموت ومن الارض مثلهن يتنزل الامر بينهن لتعلموا۟ ان الله على كل شىء قدير وان الله قد احاط بكل شىء علمۢا"},{"id":5230,"verse_key":"66:1","text_uthmani_simple":"يايها النبى لم تحرم ما احل الله لك تبتغى مرضات ازوجك والله غفور رحيم"},{"id":5231,"verse_key":"66:2","text_uthmani_simple":"قد فرض الله لكم تحلة ايمنكم والله مولىكم وهو العليم الحكيم"},{"id":5232,"verse_key":"66:3","text_uthmani_simple":"واذ اسر النبى الى بعض ازوجه حديثا فلما نبات به واظهره الله عليه عرف بعضه واعرض عنۢ بعض فلما نباها به قالت من انۢباك هذا قال نبانى العليم الخبير"},{"id":5233,"verse_key":"66:4","text_uthmani_simple":"ان تتوبا الى الله فقد صغت قلوبكما وان تظهرا عليه فان الله هو مولىه وجبريل وصلح المؤمنين والملئكة بعد ذلك ظهير"},{"id":5234,"verse_key":"66:5","text_uthmani_simple":"عسى ربه ان طلقكن ان يبدله ازوجا خيرا منكن مسلمت مؤمنت قنتت تئبت عبدت سئحت ثيبت وابكارا"},{"id":5235,"verse_key":"66:6","text_uthmani_simple":"يايها الذين ءامنوا۟ قوا۟ انفسكم واهليكم نارا وقودها الناس والحجارة عليها ملئكة غلاظ شداد لا يعصون الله ما امرهم ويفعلون ما يؤمرون"},{"id":5236,"verse_key":"66:7","text_uthmani_simple":"يايها الذين كفروا۟ لا تعتذروا۟ اليوم انما تجزون ما كنتم تعملون"},{"id":5237,"verse_key":"66:8","text_uthmani_simple":"يايها الذين ءامنوا۟ توبوا۟ الى الله توبة نصوحا عسى ربكم ان يكفر عنكم سيـاتكم ويدخلكم جنت تجرى من تحتها الانهر يوم لا يخزى الله النبى والذين ءامنوا۟ معه نورهم يسعى بين ايديهم وبايمنهم يقولون ربنا اتمم لنا نورنا واغفر لنا انك على كل شىء قدير"},{"id":5238,"verse_key":"66:9","text_uthmani_simple":"يايها النبى جهد الكفار والمنفقين واغلظ عليهم وماوىهم جهنم وبئس المصير"},{"id":5239,"verse_key":"66:10","text_uthmani_simple":"ضرب الله مثلا للذين كفروا۟ امرات نوح وامرات لوط كانتا تحت عبدين من عبادنا صلحين فخانتاهما فلم يغنيا عنهما من الله شيـا وقيل ادخلا النار مع الدخلين"},{"id":5240,"verse_key":"66:11","text_uthmani_simple":"وضرب الله مثلا للذين ءامنوا۟ امرات فرعون اذ قالت رب ابن لى عندك بيتا فى الجنة ونجنى من فرعون وعمله ونجنى من القوم الظلمين"},{"id":5241,"verse_key":"66:12","text_uthmani_simple":"ومريم ابنت عمرن التى احصنت فرجها فنفخنا فيه من روحنا وصدقت بكلمت ربها وكتبه وكانت من القنتين"}],"meta":{"filters":{"juz_number":"28"}}}
