{"verses":[{"id":3386,"verse_key":"29:46","text_uthmani_simple":"ولا تجدلوا۟ اهل الكتب الا بالتى هى احسن الا الذين ظلموا۟ منهم وقولوا۟ ءامنا بالذى انزل الينا وانزل اليكم والهنا والهكم وحد ونحن له مسلمون"},{"id":3387,"verse_key":"29:47","text_uthmani_simple":"وكذلك انزلنا اليك الكتب فالذين ءاتينهم الكتب يؤمنون به ومن هؤلاء من يؤمن به وما يجحد بـايتنا الا الكفرون"},{"id":3388,"verse_key":"29:48","text_uthmani_simple":"وما كنت تتلوا۟ من قبله من كتب ولا تخطه بيمينك اذا لارتاب المبطلون"},{"id":3389,"verse_key":"29:49","text_uthmani_simple":"بل هو ءايتۢ بينت فى صدور الذين اوتوا۟ العلم وما يجحد بـايتنا الا الظلمون"},{"id":3390,"verse_key":"29:50","text_uthmani_simple":"وقالوا۟ لولا انزل عليه ءايت من ربه قل انما الءايت عند الله وانما انا۠ نذير مبين"},{"id":3391,"verse_key":"29:51","text_uthmani_simple":"اولم يكفهم انا انزلنا عليك الكتب يتلى عليهم ان فى ذلك لرحمة وذكرى لقوم يؤمنون"},{"id":3392,"verse_key":"29:52","text_uthmani_simple":"قل كفى بالله بينى وبينكم شهيدا يعلم ما فى السموت والارض والذين ءامنوا۟ بالبطل وكفروا۟ بالله او۟لئك هم الخسرون"},{"id":3393,"verse_key":"29:53","text_uthmani_simple":"ويستعجلونك بالعذاب ولولا اجل مسمى لجاءهم العذاب ولياتينهم بغتة وهم لا يشعرون"},{"id":3394,"verse_key":"29:54","text_uthmani_simple":"يستعجلونك بالعذاب وان جهنم لمحيطةۢ بالكفرين"},{"id":3395,"verse_key":"29:55","text_uthmani_simple":"يوم يغشىهم العذاب من فوقهم ومن تحت ارجلهم ويقول ذوقوا۟ ما كنتم تعملون"},{"id":3396,"verse_key":"29:56","text_uthmani_simple":"يعبادى الذين ءامنوا۟ ان ارضى وسعة فايى فاعبدون"},{"id":3397,"verse_key":"29:57","text_uthmani_simple":"كل نفس ذائقة الموت ثم الينا ترجعون"},{"id":3398,"verse_key":"29:58","text_uthmani_simple":"والذين ءامنوا۟ وعملوا۟ الصلحت لنبوئنهم من الجنة غرفا تجرى من تحتها الانهر خلدين فيها نعم اجر العملين"},{"id":3399,"verse_key":"29:59","text_uthmani_simple":"الذين صبروا۟ وعلى ربهم يتوكلون"},{"id":3400,"verse_key":"29:60","text_uthmani_simple":"وكاين من دابة لا تحمل رزقها الله يرزقها واياكم وهو السميع العليم"},{"id":3401,"verse_key":"29:61","text_uthmani_simple":"ولئن سالتهم من خلق السموت والارض وسخر الشمس والقمر ليقولن الله فانى يؤفكون"},{"id":3402,"verse_key":"29:62","text_uthmani_simple":"الله يبسط الرزق لمن يشاء من عباده ويقدر له ان الله بكل شىء عليم"},{"id":3403,"verse_key":"29:63","text_uthmani_simple":"ولئن سالتهم من نزل من السماء ماء فاحيا به الارض منۢ بعد موتها ليقولن الله قل الحمد لله بل اكثرهم لا يعقلون"},{"id":3404,"verse_key":"29:64","text_uthmani_simple":"وما هذه الحيوة الدنيا الا لهو ولعب وان الدار الءاخرة لهى الحيوان لو كانوا۟ يعلمون"},{"id":3405,"verse_key":"29:65","text_uthmani_simple":"فاذا ركبوا۟ فى الفلك دعوا۟ الله مخلصين له الدين فلما نجىهم الى البر اذا هم يشركون"},{"id":3406,"verse_key":"29:66","text_uthmani_simple":"ليكفروا۟ بما ءاتينهم وليتمتعوا۟ فسوف يعلمون"},{"id":3407,"verse_key":"29:67","text_uthmani_simple":"اولم يروا۟ انا جعلنا حرما ءامنا ويتخطف الناس من حولهم افبالبطل يؤمنون وبنعمة الله يكفرون"},{"id":3408,"verse_key":"29:68","text_uthmani_simple":"ومن اظلم ممن افترى على الله كذبا او كذب بالحق لما جاءه اليس فى جهنم مثوى للكفرين"},{"id":3409,"verse_key":"29:69","text_uthmani_simple":"والذين جهدوا۟ فينا لنهدينهم سبلنا وان الله لمع المحسنين"},{"id":3410,"verse_key":"30:1","text_uthmani_simple":"الم"},{"id":3411,"verse_key":"30:2","text_uthmani_simple":"غلبت الروم"},{"id":3412,"verse_key":"30:3","text_uthmani_simple":"فى ادنى الارض وهم منۢ بعد غلبهم سيغلبون"},{"id":3413,"verse_key":"30:4","text_uthmani_simple":"فى بضع سنين لله الامر من قبل ومنۢ بعد ويومئذ يفرح المؤمنون"},{"id":3414,"verse_key":"30:5","text_uthmani_simple":"بنصر الله ينصر من يشاء وهو العزيز الرحيم"},{"id":3415,"verse_key":"30:6","text_uthmani_simple":"وعد الله لا يخلف الله وعده ولكن اكثر الناس لا يعلمون"},{"id":3416,"verse_key":"30:7","text_uthmani_simple":"يعلمون ظهرا من الحيوة الدنيا وهم عن الءاخرة هم غفلون"},{"id":3417,"verse_key":"30:8","text_uthmani_simple":"اولم يتفكروا۟ فى انفسهم ما خلق الله السموت والارض وما بينهما الا بالحق واجل مسمى وان كثيرا من الناس بلقائ ربهم لكفرون"},{"id":3418,"verse_key":"30:9","text_uthmani_simple":"اولم يسيروا۟ فى الارض فينظروا۟ كيف كان عقبة الذين من قبلهم كانوا۟ اشد منهم قوة واثاروا۟ الارض وعمروها اكثر مما عمروها وجاءتهم رسلهم بالبينت فما كان الله ليظلمهم ولكن كانوا۟ انفسهم يظلمون"},{"id":3419,"verse_key":"30:10","text_uthmani_simple":"ثم كان عقبة الذين اسـوا۟ السواى ان كذبوا۟ بـايت الله وكانوا۟ بها يستهزءون"},{"id":3420,"verse_key":"30:11","text_uthmani_simple":"الله يبدؤا۟ الخلق ثم يعيده ثم اليه ترجعون"},{"id":3421,"verse_key":"30:12","text_uthmani_simple":"ويوم تقوم الساعة يبلس المجرمون"},{"id":3422,"verse_key":"30:13","text_uthmani_simple":"ولم يكن لهم من شركائهم شفعؤا۟ وكانوا۟ بشركائهم كفرين"},{"id":3423,"verse_key":"30:14","text_uthmani_simple":"ويوم تقوم الساعة يومئذ يتفرقون"},{"id":3424,"verse_key":"30:15","text_uthmani_simple":"فاما الذين ءامنوا۟ وعملوا۟ الصلحت فهم فى روضة يحبرون"},{"id":3425,"verse_key":"30:16","text_uthmani_simple":"واما الذين كفروا۟ وكذبوا۟ بـايتنا ولقائ الءاخرة فاو۟لئك فى العذاب محضرون"},{"id":3426,"verse_key":"30:17","text_uthmani_simple":"فسبحن الله حين تمسون وحين تصبحون"},{"id":3427,"verse_key":"30:18","text_uthmani_simple":"وله الحمد فى السموت والارض وعشيا وحين تظهرون"},{"id":3428,"verse_key":"30:19","text_uthmani_simple":"يخرج الحى من الميت ويخرج الميت من الحى ويحى الارض بعد موتها وكذلك تخرجون"},{"id":3429,"verse_key":"30:20","text_uthmani_simple":"ومن ءايته ان خلقكم من تراب ثم اذا انتم بشر تنتشرون"},{"id":3430,"verse_key":"30:21","text_uthmani_simple":"ومن ءايته ان خلق لكم من انفسكم ازوجا لتسكنوا۟ اليها وجعل بينكم مودة ورحمة ان فى ذلك لءايت لقوم يتفكرون"},{"id":3431,"verse_key":"30:22","text_uthmani_simple":"ومن ءايته خلق السموت والارض واختلف السنتكم والونكم ان فى ذلك لءايت للعلمين"},{"id":3432,"verse_key":"30:23","text_uthmani_simple":"ومن ءايته منامكم باليل والنهار وابتغاؤكم من فضله ان فى ذلك لءايت لقوم يسمعون"},{"id":3433,"verse_key":"30:24","text_uthmani_simple":"ومن ءايته يريكم البرق خوفا وطمعا وينزل من السماء ماء فيحى به الارض بعد موتها ان فى ذلك لءايت لقوم يعقلون"},{"id":3434,"verse_key":"30:25","text_uthmani_simple":"ومن ءايته ان تقوم السماء والارض بامره ثم اذا دعاكم دعوة من الارض اذا انتم تخرجون"},{"id":3435,"verse_key":"30:26","text_uthmani_simple":"وله من فى السموت والارض كل له قنتون"},{"id":3436,"verse_key":"30:27","text_uthmani_simple":"وهو الذى يبدؤا۟ الخلق ثم يعيده وهو اهون عليه وله المثل الاعلى فى السموت والارض وهو العزيز الحكيم"},{"id":3437,"verse_key":"30:28","text_uthmani_simple":"ضرب لكم مثلا من انفسكم هل لكم من ما ملكت ايمنكم من شركاء فى ما رزقنكم فانتم فيه سواء تخافونهم كخيفتكم انفسكم كذلك نفصل الءايت لقوم يعقلون"},{"id":3438,"verse_key":"30:29","text_uthmani_simple":"بل اتبع الذين ظلموا۟ اهواءهم بغير علم فمن يهدى من اضل الله وما لهم من نصرين"},{"id":3439,"verse_key":"30:30","text_uthmani_simple":"فاقم وجهك للدين حنيفا فطرت الله التى فطر الناس عليها لا تبديل لخلق الله ذلك الدين القيم ولكن اكثر الناس لا يعلمون"},{"id":3440,"verse_key":"30:31","text_uthmani_simple":"منيبين اليه واتقوه واقيموا۟ الصلوة ولا تكونوا۟ من المشركين"},{"id":3441,"verse_key":"30:32","text_uthmani_simple":"من الذين فرقوا۟ دينهم وكانوا۟ شيعا كل حزبۭ بما لديهم فرحون"},{"id":3442,"verse_key":"30:33","text_uthmani_simple":"واذا مس الناس ضر دعوا۟ ربهم منيبين اليه ثم اذا اذاقهم منه رحمة اذا فريق منهم بربهم يشركون"},{"id":3443,"verse_key":"30:34","text_uthmani_simple":"ليكفروا۟ بما ءاتينهم فتمتعوا۟ فسوف تعلمون"},{"id":3444,"verse_key":"30:35","text_uthmani_simple":"ام انزلنا عليهم سلطنا فهو يتكلم بما كانوا۟ به يشركون"},{"id":3445,"verse_key":"30:36","text_uthmani_simple":"واذا اذقنا الناس رحمة فرحوا۟ بها وان تصبهم سيئةۢ بما قدمت ايديهم اذا هم يقنطون"},{"id":3446,"verse_key":"30:37","text_uthmani_simple":"اولم يروا۟ ان الله يبسط الرزق لمن يشاء ويقدر ان فى ذلك لءايت لقوم يؤمنون"},{"id":3447,"verse_key":"30:38","text_uthmani_simple":"فـات ذا القربى حقه والمسكين وابن السبيل ذلك خير للذين يريدون وجه الله واو۟لئك هم المفلحون"},{"id":3448,"verse_key":"30:39","text_uthmani_simple":"وما ءاتيتم من ربا ليربوا۟ فى امول الناس فلا يربوا۟ عند الله وما ءاتيتم من زكوة تريدون وجه الله فاو۟لئك هم المضعفون"},{"id":3449,"verse_key":"30:40","text_uthmani_simple":"الله الذى خلقكم ثم رزقكم ثم يميتكم ثم يحييكم هل من شركائكم من يفعل من ذلكم من شىء سبحنه وتعلى عما يشركون"},{"id":3450,"verse_key":"30:41","text_uthmani_simple":"ظهر الفساد فى البر والبحر بما كسبت ايدى الناس ليذيقهم بعض الذى عملوا۟ لعلهم يرجعون"},{"id":3451,"verse_key":"30:42","text_uthmani_simple":"قل سيروا۟ فى الارض فانظروا۟ كيف كان عقبة الذين من قبل كان اكثرهم مشركين"},{"id":3452,"verse_key":"30:43","text_uthmani_simple":"فاقم وجهك للدين القيم من قبل ان ياتى يوم لا مرد له من الله يومئذ يصدعون"},{"id":3453,"verse_key":"30:44","text_uthmani_simple":"من كفر فعليه كفره ومن عمل صلحا فلانفسهم يمهدون"},{"id":3454,"verse_key":"30:45","text_uthmani_simple":"ليجزى الذين ءامنوا۟ وعملوا۟ الصلحت من فضله انه لا يحب الكفرين"},{"id":3455,"verse_key":"30:46","text_uthmani_simple":"ومن ءايته ان يرسل الرياح مبشرت وليذيقكم من رحمته ولتجرى الفلك بامره ولتبتغوا۟ من فضله ولعلكم تشكرون"},{"id":3456,"verse_key":"30:47","text_uthmani_simple":"ولقد ارسلنا من قبلك رسلا الى قومهم فجاءوهم بالبينت فانتقمنا من الذين اجرموا۟ وكان حقا علينا نصر المؤمنين"},{"id":3457,"verse_key":"30:48","text_uthmani_simple":"الله الذى يرسل الريح فتثير سحابا فيبسطه فى السماء كيف يشاء ويجعله كسفا فترى الودق يخرج من خلله فاذا اصاب به من يشاء من عباده اذا هم يستبشرون"},{"id":3458,"verse_key":"30:49","text_uthmani_simple":"وان كانوا۟ من قبل ان ينزل عليهم من قبله لمبلسين"},{"id":3459,"verse_key":"30:50","text_uthmani_simple":"فانظر الى ءاثر رحمت الله كيف يحى الارض بعد موتها ان ذلك لمحى الموتى وهو على كل شىء قدير"},{"id":3460,"verse_key":"30:51","text_uthmani_simple":"ولئن ارسلنا ريحا فراوه مصفرا لظلوا۟ منۢ بعده يكفرون"},{"id":3461,"verse_key":"30:52","text_uthmani_simple":"فانك لا تسمع الموتى ولا تسمع الصم الدعاء اذا ولوا۟ مدبرين"},{"id":3462,"verse_key":"30:53","text_uthmani_simple":"وما انت بهد العمى عن ضللتهم ان تسمع الا من يؤمن بـايتنا فهم مسلمون"},{"id":3463,"verse_key":"30:54","text_uthmani_simple":"الله الذى خلقكم من ضعف ثم جعل منۢ بعد ضعف قوة ثم جعل منۢ بعد قوة ضعفا وشيبة يخلق ما يشاء وهو العليم القدير"},{"id":3464,"verse_key":"30:55","text_uthmani_simple":"ويوم تقوم الساعة يقسم المجرمون ما لبثوا۟ غير ساعة كذلك كانوا۟ يؤفكون"},{"id":3465,"verse_key":"30:56","text_uthmani_simple":"وقال الذين اوتوا۟ العلم والايمن لقد لبثتم فى كتب الله الى يوم البعث فهذا يوم البعث ولكنكم كنتم لا تعلمون"},{"id":3466,"verse_key":"30:57","text_uthmani_simple":"فيومئذ لا ينفع الذين ظلموا۟ معذرتهم ولا هم يستعتبون"},{"id":3467,"verse_key":"30:58","text_uthmani_simple":"ولقد ضربنا للناس فى هذا القرءان من كل مثل ولئن جئتهم بـاية ليقولن الذين كفروا۟ ان انتم الا مبطلون"},{"id":3468,"verse_key":"30:59","text_uthmani_simple":"كذلك يطبع الله على قلوب الذين لا يعلمون"},{"id":3469,"verse_key":"30:60","text_uthmani_simple":"فاصبر ان وعد الله حق ولا يستخفنك الذين لا يوقنون"},{"id":3470,"verse_key":"31:1","text_uthmani_simple":"الم"},{"id":3471,"verse_key":"31:2","text_uthmani_simple":"تلك ءايت الكتب الحكيم"},{"id":3472,"verse_key":"31:3","text_uthmani_simple":"هدى ورحمة للمحسنين"},{"id":3473,"verse_key":"31:4","text_uthmani_simple":"الذين يقيمون الصلوة ويؤتون الزكوة وهم بالءاخرة هم يوقنون"},{"id":3474,"verse_key":"31:5","text_uthmani_simple":"او۟لئك على هدى من ربهم واو۟لئك هم المفلحون"},{"id":3475,"verse_key":"31:6","text_uthmani_simple":"ومن الناس من يشترى لهو الحديث ليضل عن سبيل الله بغير علم ويتخذها هزوا او۟لئك لهم عذاب مهين"},{"id":3476,"verse_key":"31:7","text_uthmani_simple":"واذا تتلى عليه ءايتنا ولى مستكبرا كان لم يسمعها كان فى اذنيه وقرا فبشره بعذاب اليم"},{"id":3477,"verse_key":"31:8","text_uthmani_simple":"ان الذين ءامنوا۟ وعملوا۟ الصلحت لهم جنت النعيم"},{"id":3478,"verse_key":"31:9","text_uthmani_simple":"خلدين فيها وعد الله حقا وهو العزيز الحكيم"},{"id":3479,"verse_key":"31:10","text_uthmani_simple":"خلق السموت بغير عمد ترونها والقى فى الارض روسى ان تميد بكم وبث فيها من كل دابة وانزلنا من السماء ماء فانۢبتنا فيها من كل زوج كريم"},{"id":3480,"verse_key":"31:11","text_uthmani_simple":"هذا خلق الله فارونى ماذا خلق الذين من دونه بل الظلمون فى ضلل مبين"},{"id":3481,"verse_key":"31:12","text_uthmani_simple":"ولقد ءاتينا لقمن الحكمة ان اشكر لله ومن يشكر فانما يشكر لنفسه ومن كفر فان الله غنى حميد"},{"id":3482,"verse_key":"31:13","text_uthmani_simple":"واذ قال لقمن لابنه وهو يعظه يبنى لا تشرك بالله ان الشرك لظلم عظيم"},{"id":3483,"verse_key":"31:14","text_uthmani_simple":"ووصينا الانسن بولديه حملته امه وهنا على وهن وفصله فى عامين ان اشكر لى ولولديك الى المصير"},{"id":3484,"verse_key":"31:15","text_uthmani_simple":"وان جهداك على ان تشرك بى ما ليس لك به علم فلا تطعهما وصاحبهما فى الدنيا معروفا واتبع سبيل من اناب الى ثم الى مرجعكم فانبئكم بما كنتم تعملون"},{"id":3485,"verse_key":"31:16","text_uthmani_simple":"يبنى انها ان تك مثقال حبة من خردل فتكن فى صخرة او فى السموت او فى الارض يات بها الله ان الله لطيف خبير"},{"id":3486,"verse_key":"31:17","text_uthmani_simple":"يبنى اقم الصلوة وامر بالمعروف وانه عن المنكر واصبر على ما اصابك ان ذلك من عزم الامور"},{"id":3487,"verse_key":"31:18","text_uthmani_simple":"ولا تصعر خدك للناس ولا تمش فى الارض مرحا ان الله لا يحب كل مختال فخور"},{"id":3488,"verse_key":"31:19","text_uthmani_simple":"واقصد فى مشيك واغضض من صوتك ان انكر الاصوت لصوت الحمير"},{"id":3489,"verse_key":"31:20","text_uthmani_simple":"الم تروا۟ ان الله سخر لكم ما فى السموت وما فى الارض واسبغ عليكم نعمه ظهرة وباطنة ومن الناس من يجدل فى الله بغير علم ولا هدى ولا كتب منير"},{"id":3490,"verse_key":"31:21","text_uthmani_simple":"واذا قيل لهم اتبعوا۟ ما انزل الله قالوا۟ بل نتبع ما وجدنا عليه ءاباءنا اولو كان الشيطن يدعوهم الى عذاب السعير"},{"id":3491,"verse_key":"31:22","text_uthmani_simple":"ومن يسلم وجهه الى الله وهو محسن فقد استمسك بالعروة الوثقى والى الله عقبة الامور"},{"id":3492,"verse_key":"31:23","text_uthmani_simple":"ومن كفر فلا يحزنك كفره الينا مرجعهم فننبئهم بما عملوا۟ ان الله عليمۢ بذات الصدور"},{"id":3493,"verse_key":"31:24","text_uthmani_simple":"نمتعهم قليلا ثم نضطرهم الى عذاب غليظ"},{"id":3494,"verse_key":"31:25","text_uthmani_simple":"ولئن سالتهم من خلق السموت والارض ليقولن الله قل الحمد لله بل اكثرهم لا يعلمون"},{"id":3495,"verse_key":"31:26","text_uthmani_simple":"لله ما فى السموت والارض ان الله هو الغنى الحميد"},{"id":3496,"verse_key":"31:27","text_uthmani_simple":"ولو انما فى الارض من شجرة اقلم والبحر يمده منۢ بعده سبعة ابحر ما نفدت كلمت الله ان الله عزيز حكيم"},{"id":3497,"verse_key":"31:28","text_uthmani_simple":"ما خلقكم ولا بعثكم الا كنفس وحدة ان الله سميعۢ بصير"},{"id":3498,"verse_key":"31:29","text_uthmani_simple":"الم تر ان الله يولج اليل فى النهار ويولج النهار فى اليل وسخر الشمس والقمر كل يجرى الى اجل مسمى وان الله بما تعملون خبير"},{"id":3499,"verse_key":"31:30","text_uthmani_simple":"ذلك بان الله هو الحق وان ما يدعون من دونه البطل وان الله هو العلى الكبير"},{"id":3500,"verse_key":"31:31","text_uthmani_simple":"الم تر ان الفلك تجرى فى البحر بنعمت الله ليريكم من ءايته ان فى ذلك لءايت لكل صبار شكور"},{"id":3501,"verse_key":"31:32","text_uthmani_simple":"واذا غشيهم موج كالظلل دعوا۟ الله مخلصين له الدين فلما نجىهم الى البر فمنهم مقتصد وما يجحد بـايتنا الا كل ختار كفور"},{"id":3502,"verse_key":"31:33","text_uthmani_simple":"يايها الناس اتقوا۟ ربكم واخشوا۟ يوما لا يجزى والد عن ولده ولا مولود هو جاز عن والده شيـا ان وعد الله حق فلا تغرنكم الحيوة الدنيا ولا يغرنكم بالله الغرور"},{"id":3503,"verse_key":"31:34","text_uthmani_simple":"ان الله عنده علم الساعة وينزل الغيث ويعلم ما فى الارحام وما تدرى نفس ماذا تكسب غدا وما تدرى نفسۢ باى ارض تموت ان الله عليم خبيرۢ"},{"id":3504,"verse_key":"32:1","text_uthmani_simple":"الم"},{"id":3505,"verse_key":"32:2","text_uthmani_simple":"تنزيل الكتب لا ريب فيه من رب العلمين"},{"id":3506,"verse_key":"32:3","text_uthmani_simple":"ام يقولون افترىه بل هو الحق من ربك لتنذر قوما ما اتىهم من نذير من قبلك لعلهم يهتدون"},{"id":3507,"verse_key":"32:4","text_uthmani_simple":"الله الذى خلق السموت والارض وما بينهما فى ستة ايام ثم استوى على العرش ما لكم من دونه من ولى ولا شفيع افلا تتذكرون"},{"id":3508,"verse_key":"32:5","text_uthmani_simple":"يدبر الامر من السماء الى الارض ثم يعرج اليه فى يوم كان مقداره الف سنة مما تعدون"},{"id":3509,"verse_key":"32:6","text_uthmani_simple":"ذلك علم الغيب والشهدة العزيز الرحيم"},{"id":3510,"verse_key":"32:7","text_uthmani_simple":"الذى احسن كل شىء خلقه وبدا خلق الانسن من طين"},{"id":3511,"verse_key":"32:8","text_uthmani_simple":"ثم جعل نسله من سللة من ماء مهين"},{"id":3512,"verse_key":"32:9","text_uthmani_simple":"ثم سوىه ونفخ فيه من روحه وجعل لكم السمع والابصر والافـدة قليلا ما تشكرون"},{"id":3513,"verse_key":"32:10","text_uthmani_simple":"وقالوا۟ اءذا ضللنا فى الارض اءنا لفى خلق جديدۭ بل هم بلقاء ربهم كفرون"},{"id":3514,"verse_key":"32:11","text_uthmani_simple":"قل يتوفىكم ملك الموت الذى وكل بكم ثم الى ربكم ترجعون"},{"id":3515,"verse_key":"32:12","text_uthmani_simple":"ولو ترى اذ المجرمون ناكسوا۟ رءوسهم عند ربهم ربنا ابصرنا وسمعنا فارجعنا نعمل صلحا انا موقنون"},{"id":3516,"verse_key":"32:13","text_uthmani_simple":"ولو شئنا لءاتينا كل نفس هدىها ولكن حق القول منى لاملان جهنم من الجنة والناس اجمعين"},{"id":3517,"verse_key":"32:14","text_uthmani_simple":"فذوقوا۟ بما نسيتم لقاء يومكم هذا انا نسينكم وذوقوا۟ عذاب الخلد بما كنتم تعملون"},{"id":3518,"verse_key":"32:15","text_uthmani_simple":"انما يؤمن بـايتنا الذين اذا ذكروا۟ بها خروا۟ سجدا وسبحوا۟ بحمد ربهم وهم لا يستكبرون"},{"id":3519,"verse_key":"32:16","text_uthmani_simple":"تتجافى جنوبهم عن المضاجع يدعون ربهم خوفا وطمعا ومما رزقنهم ينفقون"},{"id":3520,"verse_key":"32:17","text_uthmani_simple":"فلا تعلم نفس ما اخفى لهم من قرة اعين جزاءۢ بما كانوا۟ يعملون"},{"id":3521,"verse_key":"32:18","text_uthmani_simple":"افمن كان مؤمنا كمن كان فاسقا لا يستون"},{"id":3522,"verse_key":"32:19","text_uthmani_simple":"اما الذين ءامنوا۟ وعملوا۟ الصلحت فلهم جنت الماوى نزلۢا بما كانوا۟ يعملون"},{"id":3523,"verse_key":"32:20","text_uthmani_simple":"واما الذين فسقوا۟ فماوىهم النار كلما ارادوا۟ ان يخرجوا۟ منها اعيدوا۟ فيها وقيل لهم ذوقوا۟ عذاب النار الذى كنتم به تكذبون"},{"id":3524,"verse_key":"32:21","text_uthmani_simple":"ولنذيقنهم من العذاب الادنى دون العذاب الاكبر لعلهم يرجعون"},{"id":3525,"verse_key":"32:22","text_uthmani_simple":"ومن اظلم ممن ذكر بـايت ربه ثم اعرض عنها انا من المجرمين منتقمون"},{"id":3526,"verse_key":"32:23","text_uthmani_simple":"ولقد ءاتينا موسى الكتب فلا تكن فى مرية من لقائه وجعلنه هدى لبنى اسرءيل"},{"id":3527,"verse_key":"32:24","text_uthmani_simple":"وجعلنا منهم ائمة يهدون بامرنا لما صبروا۟ وكانوا۟ بـايتنا يوقنون"},{"id":3528,"verse_key":"32:25","text_uthmani_simple":"ان ربك هو يفصل بينهم يوم القيمة فيما كانوا۟ فيه يختلفون"},{"id":3529,"verse_key":"32:26","text_uthmani_simple":"اولم يهد لهم كم اهلكنا من قبلهم من القرون يمشون فى مسكنهم ان فى ذلك لءايت افلا يسمعون"},{"id":3530,"verse_key":"32:27","text_uthmani_simple":"اولم يروا۟ انا نسوق الماء الى الارض الجرز فنخرج به زرعا تاكل منه انعمهم وانفسهم افلا يبصرون"},{"id":3531,"verse_key":"32:28","text_uthmani_simple":"ويقولون متى هذا الفتح ان كنتم صدقين"},{"id":3532,"verse_key":"32:29","text_uthmani_simple":"قل يوم الفتح لا ينفع الذين كفروا۟ ايمنهم ولا هم ينظرون"},{"id":3533,"verse_key":"32:30","text_uthmani_simple":"فاعرض عنهم وانتظر انهم منتظرون"},{"id":3534,"verse_key":"33:1","text_uthmani_simple":"يايها النبى اتق الله ولا تطع الكفرين والمنفقين ان الله كان عليما حكيما"},{"id":3535,"verse_key":"33:2","text_uthmani_simple":"واتبع ما يوحى اليك من ربك ان الله كان بما تعملون خبيرا"},{"id":3536,"verse_key":"33:3","text_uthmani_simple":"وتوكل على الله وكفى بالله وكيلا"},{"id":3537,"verse_key":"33:4","text_uthmani_simple":"ما جعل الله لرجل من قلبين فى جوفه وما جعل ازوجكم الـى تظهرون منهن امهتكم وما جعل ادعياءكم ابناءكم ذلكم قولكم بافوهكم والله يقول الحق وهو يهدى السبيل"},{"id":3538,"verse_key":"33:5","text_uthmani_simple":"ادعوهم لءابائهم هو اقسط عند الله فان لم تعلموا۟ ءاباءهم فاخونكم فى الدين وموليكم وليس عليكم جناح فيما اخطاتم به ولكن ما تعمدت قلوبكم وكان الله غفورا رحيما"},{"id":3539,"verse_key":"33:6","text_uthmani_simple":"النبى اولى بالمؤمنين من انفسهم وازوجه امهتهم واو۟لوا۟ الارحام بعضهم اولى ببعض فى كتب الله من المؤمنين والمهجرين الا ان تفعلوا۟ الى اوليائكم معروفا كان ذلك فى الكتب مسطورا"},{"id":3540,"verse_key":"33:7","text_uthmani_simple":"واذ اخذنا من النبين ميثقهم ومنك ومن نوح وابرهيم وموسى وعيسى ابن مريم واخذنا منهم ميثقا غليظا"},{"id":3541,"verse_key":"33:8","text_uthmani_simple":"ليسـل الصدقين عن صدقهم واعد للكفرين عذابا اليما"},{"id":3542,"verse_key":"33:9","text_uthmani_simple":"يايها الذين ءامنوا۟ اذكروا۟ نعمة الله عليكم اذ جاءتكم جنود فارسلنا عليهم ريحا وجنودا لم تروها وكان الله بما تعملون بصيرا"},{"id":3543,"verse_key":"33:10","text_uthmani_simple":"اذ جاءوكم من فوقكم ومن اسفل منكم واذ زاغت الابصر وبلغت القلوب الحناجر وتظنون بالله الظنونا۠"},{"id":3544,"verse_key":"33:11","text_uthmani_simple":"هنالك ابتلى المؤمنون وزلزلوا۟ زلزالا شديدا"},{"id":3545,"verse_key":"33:12","text_uthmani_simple":"واذ يقول المنفقون والذين فى قلوبهم مرض ما وعدنا الله ورسوله الا غرورا"},{"id":3546,"verse_key":"33:13","text_uthmani_simple":"واذ قالت طائفة منهم ياهل يثرب لا مقام لكم فارجعوا۟ ويستـذن فريق منهم النبى يقولون ان بيوتنا عورة وما هى بعورة ان يريدون الا فرارا"},{"id":3547,"verse_key":"33:14","text_uthmani_simple":"ولو دخلت عليهم من اقطارها ثم سئلوا۟ الفتنة لءاتوها وما تلبثوا۟ بها الا يسيرا"},{"id":3548,"verse_key":"33:15","text_uthmani_simple":"ولقد كانوا۟ عهدوا۟ الله من قبل لا يولون الادبر وكان عهد الله مسـولا"},{"id":3549,"verse_key":"33:16","text_uthmani_simple":"قل لن ينفعكم الفرار ان فررتم من الموت او القتل واذا لا تمتعون الا قليلا"},{"id":3550,"verse_key":"33:17","text_uthmani_simple":"قل من ذا الذى يعصمكم من الله ان اراد بكم سوءا او اراد بكم رحمة ولا يجدون لهم من دون الله وليا ولا نصيرا"},{"id":3551,"verse_key":"33:18","text_uthmani_simple":"قد يعلم الله المعوقين منكم والقائلين لاخونهم هلم الينا ولا ياتون الباس الا قليلا"},{"id":3552,"verse_key":"33:19","text_uthmani_simple":"اشحة عليكم فاذا جاء الخوف رايتهم ينظرون اليك تدور اعينهم كالذى يغشى عليه من الموت فاذا ذهب الخوف سلقوكم بالسنة حداد اشحة على الخير او۟لئك لم يؤمنوا۟ فاحبط الله اعملهم وكان ذلك على الله يسيرا"},{"id":3553,"verse_key":"33:20","text_uthmani_simple":"يحسبون الاحزاب لم يذهبوا۟ وان يات الاحزاب يودوا۟ لو انهم بادون فى الاعراب يسـلون عن انۢبائكم ولو كانوا۟ فيكم ما قتلوا۟ الا قليلا"},{"id":3554,"verse_key":"33:21","text_uthmani_simple":"لقد كان لكم فى رسول الله اسوة حسنة لمن كان يرجوا۟ الله واليوم الءاخر وذكر الله كثيرا"},{"id":3555,"verse_key":"33:22","text_uthmani_simple":"ولما رءا المؤمنون الاحزاب قالوا۟ هذا ما وعدنا الله ورسوله وصدق الله ورسوله وما زادهم الا ايمنا وتسليما"},{"id":3556,"verse_key":"33:23","text_uthmani_simple":"من المؤمنين رجال صدقوا۟ ما عهدوا۟ الله عليه فمنهم من قضى نحبه ومنهم من ينتظر وما بدلوا۟ تبديلا"},{"id":3557,"verse_key":"33:24","text_uthmani_simple":"ليجزى الله الصدقين بصدقهم ويعذب المنفقين ان شاء او يتوب عليهم ان الله كان غفورا رحيما"},{"id":3558,"verse_key":"33:25","text_uthmani_simple":"ورد الله الذين كفروا۟ بغيظهم لم ينالوا۟ خيرا وكفى الله المؤمنين القتال وكان الله قويا عزيزا"},{"id":3559,"verse_key":"33:26","text_uthmani_simple":"وانزل الذين ظهروهم من اهل الكتب من صياصيهم وقذف فى قلوبهم الرعب فريقا تقتلون وتاسرون فريقا"},{"id":3560,"verse_key":"33:27","text_uthmani_simple":"واورثكم ارضهم وديرهم وامولهم وارضا لم تطـوها وكان الله على كل شىء قديرا"},{"id":3561,"verse_key":"33:28","text_uthmani_simple":"يايها النبى قل لازوجك ان كنتن تردن الحيوة الدنيا وزينتها فتعالين امتعكن واسرحكن سراحا جميلا"},{"id":3562,"verse_key":"33:29","text_uthmani_simple":"وان كنتن تردن الله ورسوله والدار الءاخرة فان الله اعد للمحسنت منكن اجرا عظيما"},{"id":3563,"verse_key":"33:30","text_uthmani_simple":"ينساء النبى من يات منكن بفحشة مبينة يضعف لها العذاب ضعفين وكان ذلك على الله يسيرا"}],"meta":{"filters":{"juz_number":"21"}}}
