{"code":200,"status":"OK","data":[{"number":66,"name":"سورة التحريم","englishName":"At-Tahrim","englishNameTranslation":"The Prohibition","revelationType":"Medinan","numberOfAyahs":12,"ayahs":[{"number":5230,"audio":"http://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5230","text":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ۖ تَبْتَغِي مَرْضَاتَ أَزْوَاجِكَ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ","numberInSurah":1,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5231,"audio":"http://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5231","text":"قَدْ فَرَضَ اللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ ۚ وَاللَّهُ مَوْلَاكُمْ ۖ وَهُوَ الْعَلِيمُ الْحَكِيمُ","numberInSurah":2,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5232,"audio":"http://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5232","text":"وَإِذْ أَسَرَّ النَّبِيُّ إِلَىٰ بَعْضِ أَزْوَاجِهِ حَدِيثًا فَلَمَّا نَبَّأَتْ بِهِ وَأَظْهَرَهُ اللَّهُ عَلَيْهِ عَرَّفَ بَعْضَهُ وَأَعْرَضَ عَنْ بَعْضٍ ۖ فَلَمَّا نَبَّأَهَا بِهِ قَالَتْ مَنْ أَنْبَأَكَ هَٰذَا ۖ قَالَ نَبَّأَنِيَ الْعَلِيمُ الْخَبِيرُ","numberInSurah":3,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5233,"audio":"http://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5233","text":"إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا ۖ وَإِنْ تَظَاهَرَا عَلَيْهِ فَإِنَّ اللَّهَ هُوَ مَوْلَاهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ ۖ وَالْمَلَائِكَةُ بَعْدَ ذَٰلِكَ ظَهِيرٌ","numberInSurah":4,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5234,"audio":"http://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5234","text":"عَسَىٰ رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ مُسْلِمَاتٍ مُؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ سَائِحَاتٍ ثَيِّبَاتٍ وَأَبْكَارًا","numberInSurah":5,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5235,"audio":"http://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5235","text":"يَا أَيُّهَا الَّذِينَ آمَنُوا قُوا أَنْفُسَكُمْ وَأَهْلِيكُمْ نَارًا وَقُودُهَا النَّاسُ وَالْحِجَارَةُ عَلَيْهَا مَلَائِكَةٌ غِلَاظٌ شِدَادٌ لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ","numberInSurah":6,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5236,"audio":"http://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5236","text":"يَا أَيُّهَا الَّذِينَ كَفَرُوا لَا تَعْتَذِرُوا الْيَوْمَ ۖ إِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُونَ","numberInSurah":7,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5237,"audio":"http://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5237","text":"يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَصُوحًا عَسَىٰ رَبُّكُمْ أَنْ يُكَفِّرَ عَنْكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ يَوْمَ لَا يُخْزِي اللَّهُ النَّبِيَّ وَالَّذِينَ آمَنُوا مَعَهُ ۖ نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ يَقُولُونَ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","numberInSurah":8,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5238,"audio":"http://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5238","text":"يَا أَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ ۚ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمَصِيرُ","numberInSurah":9,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5239,"audio":"http://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5239","text":"ضَرَبَ اللَّهُ مَثَلًا لِلَّذِينَ كَفَرُوا امْرَأَتَ نُوحٍ وَامْرَأَتَ لُوطٍ ۖ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللَّهِ شَيْئًا وَقِيلَ ادْخُلَا النَّارَ مَعَ الدَّاخِلِينَ","numberInSurah":10,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5240,"audio":"http://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5240","text":"وَضَرَبَ اللَّهُ مَثَلًا لِلَّذِينَ آمَنُوا امْرَأَتَ فِرْعَوْنَ إِذْ قَالَتْ رَبِّ ابْنِ لِي عِنْدَكَ بَيْتًا فِي الْجَنَّةِ وَنَجِّنِي مِنْ فِرْعَوْنَ وَعَمَلِهِ وَنَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ","numberInSurah":11,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5241,"audio":"http://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5241","text":"وَمَرْيَمَ ابْنَتَ عِمْرَانَ الَّتِي أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهِ مِنْ رُوحِنَا وَصَدَّقَتْ بِكَلِمَاتِ رَبِّهَا وَكُتُبِهِ وَكَانَتْ مِنَ الْقَانِتِينَ","numberInSurah":12,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false}],"edition":{"identifier":"ar.alafasy","language":"ar","name":"Alafasy","englishName":"Alafasy","format":"audio","type":"versebyverse"}},{"number":66,"name":"سورة التحريم","englishName":"At-Tahrim","englishNameTranslation":"The Prohibition","revelationType":"Medinan","numberOfAyahs":12,"ayahs":[{"number":5230,"text":"بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ يَٰٓأَيُّهَا ٱلنَّبِىُّ لِمَ تُحَرِّمُ مَآ أَحَلَّ ٱللَّهُ لَكَ ۖ تَبْتَغِى مَرْضَاتَ أَزْوَٰجِكَ ۚ وَٱللَّهُ غَفُورٌۭ رَّحِيمٌۭ","numberInSurah":1,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5231,"text":"قَدْ فَرَضَ ٱللَّهُ لَكُمْ تَحِلَّةَ أَيْمَٰنِكُمْ ۚ وَٱللَّهُ مَوْلَىٰكُمْ ۖ وَهُوَ ٱلْعَلِيمُ ٱلْحَكِيمُ","numberInSurah":2,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5232,"text":"وَإِذْ أَسَرَّ ٱلنَّبِىُّ إِلَىٰ بَعْضِ أَزْوَٰجِهِۦ حَدِيثًۭا فَلَمَّا نَبَّأَتْ بِهِۦ وَأَظْهَرَهُ ٱللَّهُ عَلَيْهِ عَرَّفَ بَعْضَهُۥ وَأَعْرَضَ عَنۢ بَعْضٍۢ ۖ فَلَمَّا نَبَّأَهَا بِهِۦ قَالَتْ مَنْ أَنۢبَأَكَ هَٰذَا ۖ قَالَ نَبَّأَنِىَ ٱلْعَلِيمُ ٱلْخَبِيرُ","numberInSurah":3,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5233,"text":"إِن تَتُوبَآ إِلَى ٱللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا ۖ وَإِن تَظَٰهَرَا عَلَيْهِ فَإِنَّ ٱللَّهَ هُوَ مَوْلَىٰهُ وَجِبْرِيلُ وَصَٰلِحُ ٱلْمُؤْمِنِينَ ۖ وَٱلْمَلَٰٓئِكَةُ بَعْدَ ذَٰلِكَ ظَهِيرٌ","numberInSurah":4,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5234,"text":"عَسَىٰ رَبُّهُۥٓ إِن طَلَّقَكُنَّ أَن يُبْدِلَهُۥٓ أَزْوَٰجًا خَيْرًۭا مِّنكُنَّ مُسْلِمَٰتٍۢ مُّؤْمِنَٰتٍۢ قَٰنِتَٰتٍۢ تَٰٓئِبَٰتٍ عَٰبِدَٰتٍۢ سَٰٓئِحَٰتٍۢ ثَيِّبَٰتٍۢ وَأَبْكَارًۭا","numberInSurah":5,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5235,"text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ قُوٓا۟ أَنفُسَكُمْ وَأَهْلِيكُمْ نَارًۭا وَقُودُهَا ٱلنَّاسُ وَٱلْحِجَارَةُ عَلَيْهَا مَلَٰٓئِكَةٌ غِلَاظٌۭ شِدَادٌۭ لَّا يَعْصُونَ ٱللَّهَ مَآ أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ","numberInSurah":6,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5236,"text":"يَٰٓأَيُّهَا ٱلَّذِينَ كَفَرُوا۟ لَا تَعْتَذِرُوا۟ ٱلْيَوْمَ ۖ إِنَّمَا تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ","numberInSurah":7,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5237,"text":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ تُوبُوٓا۟ إِلَى ٱللَّهِ تَوْبَةًۭ نَّصُوحًا عَسَىٰ رَبُّكُمْ أَن يُكَفِّرَ عَنكُمْ سَيِّـَٔاتِكُمْ وَيُدْخِلَكُمْ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ يَوْمَ لَا يُخْزِى ٱللَّهُ ٱلنَّبِىَّ وَٱلَّذِينَ ءَامَنُوا۟ مَعَهُۥ ۖ نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَٰنِهِمْ يَقُولُونَ رَبَّنَآ أَتْمِمْ لَنَا نُورَنَا وَٱغْفِرْ لَنَآ ۖ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ","numberInSurah":8,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5238,"text":"يَٰٓأَيُّهَا ٱلنَّبِىُّ جَٰهِدِ ٱلْكُفَّارَ وَٱلْمُنَٰفِقِينَ وَٱغْلُظْ عَلَيْهِمْ ۚ وَمَأْوَىٰهُمْ جَهَنَّمُ ۖ وَبِئْسَ ٱلْمَصِيرُ","numberInSurah":9,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5239,"text":"ضَرَبَ ٱللَّهُ مَثَلًۭا لِّلَّذِينَ كَفَرُوا۟ ٱمْرَأَتَ نُوحٍۢ وَٱمْرَأَتَ لُوطٍۢ ۖ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَٰلِحَيْنِ فَخَانَتَاهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ ٱللَّهِ شَيْـًۭٔا وَقِيلَ ٱدْخُلَا ٱلنَّارَ مَعَ ٱلدَّٰخِلِينَ","numberInSurah":10,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5240,"text":"وَضَرَبَ ٱللَّهُ مَثَلًۭا لِّلَّذِينَ ءَامَنُوا۟ ٱمْرَأَتَ فِرْعَوْنَ إِذْ قَالَتْ رَبِّ ٱبْنِ لِى عِندَكَ بَيْتًۭا فِى ٱلْجَنَّةِ وَنَجِّنِى مِن فِرْعَوْنَ وَعَمَلِهِۦ وَنَجِّنِى مِنَ ٱلْقَوْمِ ٱلظَّٰلِمِينَ","numberInSurah":11,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5241,"text":"وَمَرْيَمَ ٱبْنَتَ عِمْرَٰنَ ٱلَّتِىٓ أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهِ مِن رُّوحِنَا وَصَدَّقَتْ بِكَلِمَٰتِ رَبِّهَا وَكُتُبِهِۦ وَكَانَتْ مِنَ ٱلْقَٰنِتِينَ","numberInSurah":12,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false}],"edition":{"identifier":"quran-uthmani","language":"ar","name":"Uthamani","englishName":"Uthamani","format":"text","type":"quran"}},{"number":66,"name":"سورة التحريم","englishName":"At-Tahrim","englishNameTranslation":"The Prohibition","revelationType":"Medinan","numberOfAyahs":12,"ayahs":[{"number":5230,"text":"Hai Nabi, mengapa kamu mengharamkan apa yang Allah halalkan bagimu; kamu mencari kesenangan hati isteri-isterimu? Dan Allah Maha Pengampun lagi Maha Penyayang","numberInSurah":1,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5231,"text":"Sesungguhnya Allah telah mewajibkan kepadamu sekalian membebaskan diri dari sumpahmu dan Allah adalah Pelindungmu dan Dia Maha Mengetahui lagi Maha Bijaksana.","numberInSurah":2,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5232,"text":"Dan ingatlah ketika Nabi membicarakan secara rahasia kepada salah seorang isterinya (Hafsah) suatu peristiwa. Maka tatkala (Hafsah) menceritakan peristiwa itu (kepada Aisyah) dan Allah memberitahukan hal itu (pembicaraan Hafsah dan Aisyah) kepada Muhammad lalu Muhammad memberitahukan sebagian (yang diberitakan Allah kepadanya) dan menyembunyikan sebagian yang lain (kepada Hafsah). Maka tatkala (Muhammad) memberitahukan pembicaraan (antara Hafsah dan Aisyah) lalu (Hafsah) bertanya: \"Siapakah yang telah memberitahukan hal ini kepadamu?\" Nabi menjawab: \"Telah diberitahukan kepadaku oleh Allah yang Maha Mengetahui lagi Maha Mengenal\".","numberInSurah":3,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5233,"text":"Jika kamu berdua bertaubat kepada Allah, maka sesungguhnya hati kamu berdua telah condong (untuk menerima kebaikan); dan jika kamu berdua bantu-membantu menyusahkan Nabi, maka sesungguhnya Allah adalah Pelindungnya dan (begitu pula) Jibril dan orang-orang mukmin yang baik; dan selain dari itu malaikat-malaikat adalah penolongnya pula.","numberInSurah":4,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5234,"text":"Jika Nabi menceraikan kamu, boleh jadi Tuhannya akan memberi ganti kepadanya dengan isteri yang lebih baik daripada kamu, yang patuh, yang beriman, yang taat, yang bertaubat, yang mengerjakan ibadat, yang berpuasa, yang janda dan yang perawan.","numberInSurah":5,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5235,"text":"Hai orang-orang yang beriman, peliharalah dirimu dan keluargamu dari api neraka yang bahan bakarnya adalah manusia dan batu; penjaganya malaikat-malaikat yang kasar, keras, dan tidak mendurhakai Allah terhadap apa yang diperintahkan-Nya kepada mereka dan selalu mengerjakan apa yang diperintahkan.","numberInSurah":6,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5236,"text":"Hai orang-orang kafir, janganlah kamu mengemukakan uzur pada hari ini. Sesungguhnya kamu hanya diberi balasan menurut apa yang kamu kerjakan.","numberInSurah":7,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5237,"text":"Hai orang-orang yang beriman, bertaubatlah kepada Allah dengan taubatan nasuhaa (taubat yang semurni-murninya). Mudah-mudahan Rabbmu akan menutupi kesalahan-kesalahanmu dan memasukkanmu ke dalam jannah yang mengalir di bawahnya sungai-sungai, pada hari ketika Allah tidak menghinakan Nabi dan orang-orang mukmin yang bersama dia; sedang cahaya mereka memancar di hadapan dan di sebelah kanan mereka, sambil mereka mengatakan: \"Ya Rabb kami, sempurnakanlah bagi kami cahaya kami dan ampunilah kami; Sesungguhnya Engkau Maha Kuasa atas segala sesuatu\".","numberInSurah":8,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5238,"text":"Hai Nabi, perangilah orang-orang kafir dan orang-orang munafik dan bersikap keraslah terhadap mereka. Tempat mereka adalah jahannam dan itu adalah seburuk-buruknya tempat kembali.","numberInSurah":9,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5239,"text":"Allah membuat isteri Nuh dan isteri Luth sebagai perumpamaan bagi orang-orang kafir. Keduanya berada di bawah pengawasan dua orang hamba yang saleh di antara hamba-hamba Kami; lalu kedua isteri itu berkhianat kepada suaminya (masing-masing), maka suaminya itu tiada dapat membantu mereka sedikitpun dari (siksa) Allah; dan dikatakan (kepada keduanya): \"Masuklah ke dalam jahannam bersama orang-orang yang masuk (jahannam)\".","numberInSurah":10,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5240,"text":"Dan Allah membuat isteri Fir'aun perumpamaan bagi orang-orang yang beriman, ketika ia berkata: \"Ya Rabbku, bangunkanlah untukku sebuah rumah di sisi-Mu dalam firdaus, dan selamatkanlah aku dari Fir'aun dan perbuatannya, dan selamatkanlah aku dari kaum yang zhalim.","numberInSurah":11,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5241,"text":"dan (ingatlah) Maryam binti Imran yang memelihara kehormatannya, maka Kami tiupkan ke dalam rahimnya sebagian dari ruh (ciptaan) Kami, dan dia membenarkan kalimat Rabbnya dan Kitab-Kitab-Nya, dan dia adalah termasuk orang-orang yang taat.","numberInSurah":12,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false}],"edition":{"identifier":"id.indonesian","language":"id","name":"Bahasa Indonesia","englishName":"Unknown","format":"text","type":"translation"}},{"number":66,"name":"سورة التحريم","englishName":"At-Tahrim","englishNameTranslation":"The Prohibition","revelationType":"Medinan","numberOfAyahs":12,"ayahs":[{"number":5230,"text":"O Prophet, why do you prohibit [yourself from] what Allah has made lawful for you, seeking the approval of your wives? And Allah is Forgiving and Merciful.","numberInSurah":1,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5231,"text":"Allah has already ordained for you [Muslims] the dissolution of your oaths. And Allah is your protector, and He is the Knowing, the Wise.","numberInSurah":2,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5232,"text":"And [remember] when the Prophet confided to one of his wives a statement; and when she informed [another] of it and Allah showed it to him, he made known part of it and ignored a part. And when he informed her about it, she said, \"Who told you this?\" He said, \"I was informed by the Knowing, the Acquainted.\"","numberInSurah":3,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5233,"text":"If you two [wives] repent to Allah, [it is best], for your hearts have deviated. But if you cooperate against him - then indeed Allah is his protector, and Gabriel and the righteous of the believers and the angels, moreover, are [his] assistants.","numberInSurah":4,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5234,"text":"Perhaps his Lord, if he divorced you [all], would substitute for him wives better than you - submitting [to Allah], believing, devoutly obedient, repentant, worshipping, and traveling - [ones] previously married and virgins.","numberInSurah":5,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5235,"text":"O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones, over which are [appointed] angels, harsh and severe; they do not disobey Allah in what He commands them but do what they are commanded.","numberInSurah":6,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5236,"text":"O you who have disbelieved, make no excuses that Day. You will only be recompensed for what you used to do.","numberInSurah":7,"juz":28,"manzil":7,"page":560,"ruku":494,"hizbQuarter":224,"sajda":false},{"number":5237,"text":"O you who have believed, repent to Allah with sincere repentance. Perhaps your Lord will remove from you your misdeeds and admit you into gardens beneath which rivers flow [on] the Day when Allah will not disgrace the Prophet and those who believed with him. Their light will proceed before them and on their right; they will say, \"Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.\"","numberInSurah":8,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5238,"text":"O Prophet, strive against the disbelievers and the hypocrites and be harsh upon them. And their refuge is Hell, and wretched is the destination.","numberInSurah":9,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5239,"text":"Allah presents an example of those who disbelieved: the wife of Noah and the wife of Lot. They were under two of Our righteous servants but betrayed them, so those prophets did not avail them from Allah at all, and it was said, \"Enter the Fire with those who enter.\"","numberInSurah":10,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5240,"text":"And Allah presents an example of those who believed: the wife of Pharaoh, when she said, \"My Lord, build for me near You a house in Paradise and save me from Pharaoh and his deeds and save me from the wrongdoing people.\"","numberInSurah":11,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false},{"number":5241,"text":"And [the example of] Mary, the daughter of 'Imran, who guarded her chastity, so We blew into [her garment] through Our angel, and she believed in the words of her Lord and His scriptures and was of the devoutly obedient.","numberInSurah":12,"juz":28,"manzil":7,"page":561,"ruku":495,"hizbQuarter":224,"sajda":false}],"edition":{"identifier":"en.sahih","language":"en","name":"Saheeh International","englishName":"Saheeh International","format":"text","type":"translation"}}]}