{"chapter_number":42,"name_simple":"Ash-Shuraa","name_meaning":{"text":"The Consultation","en":"The Consultation","id":"Musyawarah"},"verses_count":53,"hasanah":35220,"verses":[{"text_madani":"حم","text_tajweed":"ح[m[مٓ]","translation_en":"Ha Mim.","translation_id":"Haa Mim","hasanah_per_verse":20},{"text_madani":"عسق","text_tajweed":"[m[عٓ][m[سٓ][m[قٓ]","translation_en":"Ain Sin Qaf.","translation_id":"'Ain Sin Qaf","hasanah_per_verse":30},{"text_madani":"كَذَٰلِكَ يُوحِي إِلَيْكَ وَإِلَى الَّذِينَ مِن قَبْلِكَ اللَّهُ الْعَزِيزُ الْحَكِيمُ","text_tajweed":"كَذ[n[َٲ]لِكَ يُوح[o[ِىٓ] إِلَيْكَ وَإِلَى [h:11747[ٱ]لَّذِينَ مِ[f:18[ن ق]َ[q:19[بْ]لِكَ [h:12069[ٱ]للَّهُ [h:9894[ٱ]لْعَزِيزُ [h:681[ٱ]لْحَك[p[ِي]مُ","translation_en":"Thus does Allah, the Mighty, the Wise, reveal to you, and (thus He revealed) to those before you.","translation_id":"Demikianlah Allah Yang Mahaperkasa, Mahabijaksana mewahyukan kepadamu (Muhammad) dan kepada orang-orang yang sebelummu.","hasanah_per_verse":430},{"text_madani":"لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَلِيُّ الْعَظِيمُ","text_tajweed":"لَهُ[n[ۥ] مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَا فِى [h:44[ٱ]لْأَرْضِ‌ۖ وَهُوَ [h:1475[ٱ]لْعَلِىُّ [h:1476[ٱ]لْعَظ[p[ِي]مُ","translation_en":"His is what is in the heavens and what is in the earth, and He is the High, the Great.","translation_id":"Milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Dan Dialah Yang Mahaagung, Mahabesar.","hasanah_per_verse":380},{"text_madani":"تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِن فَوْقِهِنَّ ۚ وَالْمَلَائِكَةُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيَسْتَغْفِرُونَ لِمَن فِي الْأَرْضِ ۗ أَلَا إِنَّ اللَّهَ هُوَ الْغَفُورُ الرَّحِيمُ","text_tajweed":"تَكَادُ [h:8420[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تُ يَتَفَطَّرْنَ مِ[f:12070[ن ف]َوْقِهِ[g[نّ]َ‌ۚ وَ[h:1146[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيَسْتَغْفِرُونَ لِمَ[f:5428[ن ف]ِى [h:44[ٱ]لْأَرْضِ‌ۗ أَل[o[َآ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ هُوَ [h:6822[ٱ]لْغَفُورُ [h:6228[ٱ][l[ل]رَّح[p[ِي]مُ","translation_en":"The heavens may almost rend asunder from above them and the angels sing the praise of their Lord and ask forgiveness for those on earth; now surely Allah is the Forgiving, the Merciful.","translation_id":"Hampir saja langit itu pecah dari sebelah atasnya (karena kebesaran Allah) dan malaikat-malaikat bertasbih memuji Tuhannya dan memohonkan ampunan untuk orang yang ada di bumi. Ingatlah, sesungguhnya Allah Dialah Yang Maha Pengampun, Maha Penyayang.","hasanah_per_verse":900},{"text_madani":"وَالَّذِينَ اتَّخَذُوا مِن دُونِهِ أَوْلِيَاءَ اللَّهُ حَفِيظٌ عَلَيْهِمْ وَمَا أَنتَ عَلَيْهِم بِوَكِيلٍ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ [h:5828[ٱ]تَّخَذُو[s[اْ] مِ[f:3136[ن د]ُونِه[o[ِۦٓ] أَوْلِي[o[َا]ٓءَ [h:12071[ٱ]للَّهُ حَفِيظٌ عَلَيْهِمْ وَم[o[َآ] أَ[f:169[نت]َ عَلَيْه[c:4316[ِم ب]ِوَك[p[ِي]لٍ","translation_en":"And (as for) those who take guardians besides Him, Allah watches over them, and you have not charge over them.","translation_id":"Dan orang-orang yang mengambil pelindung-pelindung selain Allah, Allah mengawasi (perbuatan) mereka; adapun engkau (Muhammad) bukanlah orang yang diserahi mengawasi mereka.","hasanah_per_verse":530},{"text_madani":"وَكَذَٰلِكَ أَوْحَيْنَا إِلَيْكَ قُرْآنًا عَرَبِيًّا لِّتُنذِرَ أُمَّ الْقُرَىٰ وَمَنْ حَوْلَهَا وَتُنذِرَ يَوْمَ الْجَمْعِ لَا رَيْبَ فِيهِ ۚ فَرِيقٌ فِي الْجَنَّةِ وَفَرِيقٌ فِي السَّعِيرِ","text_tajweed":"وَكَذ[n[َٲ]لِكَ أَوْحَيْن[o[َآ] إِلَيْكَ قُرْءَانًا عَرَبِي[u:12072[ًّا ل]ِّتُ[f:4582[نذ]ِرَ أُ[g[مّ]َ [h:4240[ٱ]لْقُرَىٰ وَمَنْ حَوْلَهَا وَتُ[f:8431[نذ]ِرَ يَوْمَ [h:12073[ٱ]لْجَمْعِ لَا رَيْبَ فِيهِ‌ۚ فَرِي[f:12074[قٌ ف]ِى [h:12075[ٱ]لْجَ[g[نّ]َةِ وَفَرِي[f:12076[قٌ ف]ِى [h:12077[ٱ][l[ل]سَّع[p[ِي]رِ","translation_en":"And thus have We revealed to you an Arabic Quran, that you may warn the mother city and those around it, and that you may give warning of the day of gathering together wherein is no doubt; a party shall be in the garden and (another) party in the burning fire.","translation_id":"Dan demikianlah Kami wahyukan Al-Qur'an kepadamu dalam bahasa Arab, agar engkau memberi peringatan kepada penduduk ibukota (Mekah) dan penduduk (negeri-negeri) di sekelilingnya serta memberi peringatan tentang hari berkumpul (Kiamat) yang tidak diragukan adanya. Segolongan masuk surga dan segolongan masuk neraka.","hasanah_per_verse":900},{"text_madani":"وَلَوْ شَاءَ اللَّهُ لَجَعَلَهُمْ أُمَّةً وَاحِدَةً وَلَٰكِن يُدْخِلُ مَن يَشَاءُ فِي رَحْمَتِهِ ۚ وَالظَّالِمُونَ مَا لَهُم مِّن وَلِيٍّ وَلَا نَصِيرٍ","text_tajweed":"وَلَوْ ش[o[َا]ٓءَ [h:78[ٱ]للَّهُ لَجَعَلَهُمْ أُ[g[مّ]َ[a:1159[ةً و][n[َٲ]حِدَ[a:3601[ةً و]َلَ[n[ـٰ]ك[a:12078[ِن ي]ُ[q:8947[دْ]خِلُ م[a:476[َن ي]َش[o[َا]ٓءُ فِى رَحْمَتِه[n[ِۦ]‌ۚ وَ[h:12079[ٱ][l[ل]ظَّ[n[ـٰ]لِمُونَ مَا لَه[w:1812[ُم م]ّ[a:557[ِن و]َلِ[a:558[ىٍّ و]َلَا نَص[p[ِي]رٍ","translation_en":"And if Allah had pleased He would surely have made them a single community, but He makes whom He pleases enter into His mercy, and the unjust it is that shall have no guardian or helper.","translation_id":"Dan sekiranya Allah menghendaki niscaya Dia jadikan mereka satu umat, tetapi Dia memasukkan orang-orang yang Dia kehendaki ke dalam rahmat-Nya. Dan orang-orang yang zhalim tidak ada bagi mereka pelindung dan penolong.","hasanah_per_verse":710},{"text_madani":"أَمِ اتَّخَذُوا مِن دُونِهِ أَوْلِيَاءَ ۖ فَاللَّهُ هُوَ الْوَلِيُّ وَهُوَ يُحْيِي الْمَوْتَىٰ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","text_tajweed":"أَمِ [h:8702[ٱ]تَّخَذُو[s[اْ] مِ[f:3136[ن د]ُونِه[o[ِۦٓ] أَوْلِي[o[َا]ٓءَ‌ۖ فَ[h:591[ٱ]للَّهُ هُوَ [h:12080[ٱ]لْوَلِىُّ وَهُوَ يُحْىِ [h:8924[ٱ]لْمَوْتَىٰ وَهُوَ عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َد[p[ِي]رٌ","translation_en":"Or have they taken guardians besides Him? But Allah is the Guardian, and He gives life to the dead, and He has power over all things.","translation_id":"Atau mereka mengambil pelindung-pelindung selain Dia? Padahal Allah, Dialah pelindung (yang sebenarnya). Dan Dia menghidupkan orang yang mati, dan Dia Mahakuasa atas segala sesuatu.","hasanah_per_verse":600},{"text_madani":"وَمَا اخْتَلَفْتُمْ فِيهِ مِن شَيْءٍ فَحُكْمُهُ إِلَى اللَّهِ ۚ ذَٰلِكُمُ اللَّهُ رَبِّي عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ","text_tajweed":"وَمَا [h:12081[ٱ]خْتَلَفْتُمْ فِيهِ مِ[f:2103[ن ش][f:12082[َىْءٍ ف]َحُكْمُهُ[o[ۥٓ] إِلَى [h:1637[ٱ]للَّهِ‌ۚ ذ[n[َٲ]لِكُمُ [h:4260[ٱ]للَّهُ رَبِّى عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُن[p[ِي][q[ب]ُ","translation_en":"And in whatever thing you disagree, the judgment thereof is (in) Allah's (hand); that is Allah, my Lord, on Him do I rely and to Him do I turn time after time.","translation_id":"Dan apa pun yang kamu perselisihkan padanya tentang sesuatu, keputusannya (terserah) kepada Allah. (Yang memiliki sifat-sifat demikian) itulah Allah Tuhanku. Kepada-Nya aku bertawakal dan kepada-Nya aku kembali.","hasanah_per_verse":590},{"text_madani":"فَاطِرُ السَّمَاوَاتِ وَالْأَرْضِ ۚ جَعَلَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَاجًا وَمِنَ الْأَنْعَامِ أَزْوَاجًا ۖ يَذْرَؤُكُمْ فِيهِ ۚ لَيْسَ كَمِثْلِهِ شَيْءٌ ۖ وَهُوَ السَّمِيعُ الْبَصِيرُ","text_tajweed":"فَاطِرُ [h:12083[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۚ جَعَلَ لَك[w:556[ُم م]ِّنْ أَ[f:1329[نف]ُسِكُمْ أَزْو[n[َٲ][a:12084[جًا و]َمِنَ [h:4470[ٱ]لْأَنْعَ[n[ـٰ]مِ أَزْو[n[َٲ][a:12085[جًا‌ۖ ي]َذْرَؤُكُمْ فِيهِ‌ۚ لَيْسَ كَمِثْلِه[n[ِۦ] ش[a:12086[َىْءٌ‌ۖ و]َهُوَ [h:709[ٱ][l[ل]سَّمِيعُ [h:7657[ٱ]لْبَص[p[ِي]رُ","translation_en":"The Originator of the heavens and the earth; He made mates for you from among yourselves, and mates of the cattle too, multiplying you thereby; nothing like a likeness of Him; and He is the Hearing, the Seeing.","translation_id":"(Allah) Pencipta langit dan bumi. Dia menjadikan bagi kamu pasangan-pasangan dari jenis kamu sendiri, dan dari jenis hewan ternak pasangan-pasangan (juga). Dijadikan-Nya kamu berkembang biak dengan jalan itu. Tidak ada sesuatu pun yang serupa dengan Dia. Dan Dia Yang Maha Mendengar, Maha Melihat.","hasanah_per_verse":890},{"text_madani":"لَهُ مَقَالِيدُ السَّمَاوَاتِ وَالْأَرْضِ ۖ يَبْسُطُ الرِّزْقَ لِمَن يَشَاءُ وَيَقْدِرُ ۚ إِنَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ","text_tajweed":"لَهُ[n[ۥ] مَقَالِيدُ [h:11745[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۖ يَ[q:6968[بْ]سُطُ [h:6969[ٱ][l[ل]رِّزْقَ لِم[a:1537[َن ي]َش[o[َا]ٓءُ وَيَ[q:6970[قْ]دِرُ‌ۚ إِ[g[نّ]َهُ[n[ۥ] بِكُلِّ شَىْءٍ عَل[p[ِي]مٌ","translation_en":"His are the treasures of the heavens and the earth; He makes ample and straitens the means of subsistence for whom He pleases; surely He is Cognizant of all things.","translation_id":"Milik-Nyalah perbendaharaan langit dan bumi; Dia melapangkan rezeki dan membatasinya bagi siapa yang Dia kehendaki. Sungguh, Dia Maha Mengetahui segala sesuatu.","hasanah_per_verse":560},{"text_madani":"شَرَعَ لَكُم مِّنَ الدِّينِ مَا وَصَّىٰ بِهِ نُوحًا وَالَّذِي أَوْحَيْنَا إِلَيْكَ وَمَا وَصَّيْنَا بِهِ إِبْرَاهِيمَ وَمُوسَىٰ وَعِيسَىٰ ۖ أَنْ أَقِيمُوا الدِّينَ وَلَا تَتَفَرَّقُوا فِيهِ ۚ كَبُرَ عَلَى الْمُشْرِكِينَ مَا تَدْعُوهُمْ إِلَيْهِ ۚ اللَّهُ يَجْتَبِي إِلَيْهِ مَن يَشَاءُ وَيَهْدِي إِلَيْهِ مَن يُنِيبُ","text_tajweed":"۞ شَرَعَ لَك[w:1578[ُم م]ِّنَ [h:12087[ٱ][l[ل]دِّينِ مَا وَصَّىٰ بِه[n[ِۦ] نُو[a:12088[حًا و]َ[h:4765[ٱ]لَّذ[o[ِىٓ] أَوْحَيْن[o[َآ] إِلَيْكَ وَمَا وَصَّيْنَا بِه[o[ِۦٓ] إِ[q:1860[بْ]ر[n[َٲ]هِيمَ وَمُوسَىٰ وَعِيسَ[o[ىٰٓ‌ۖ] أَنْ أَقِيمُو[s[اْ] [h:12089[ٱ][l[ل]دِّينَ وَلَا تَتَفَرَّقُو[s[اْ] فِيهِ‌ۚ كَبُرَ عَلَى [h:12090[ٱ]لْمُشْرِكِينَ مَا تَ[q:5192[دْ]عُوهُمْ إِلَيْهِ‌ۚ [h:12091[ٱ]للَّهُ يَ[q:2454[جْ]تَب[o[ِىٓ] إِلَيْهِ م[a:476[َن ي]َش[o[َا]ٓءُ وَيَهْد[o[ِىٓ] إِلَيْهِ م[a:11803[َن ي]ُن[p[ِي][q[ب]ُ","translation_en":"He has made plain to you of the religion what He enjoined upon Nuh and that which We have revealed to you and that which We enjoined upon Ibrahim and Musa and Isa that keep to obedience and be not divided therein; hard to the unbelievers is that which you call them to; Allah chooses for Himself whom He pleases, and guides to Himself him who turns (to Him), frequently.","translation_id":"Dia (Allah) telah mensyariatkan kepadamu agama yang telah diwasiatkan-Nya kepada Nuh dan apa yang telah Kami wahyukan kepadamu (Muhammad) dan apa yang telah Kami wasiatkan kepada Ibrahim, Musa dan Isa yaitu tegakkanlah agama (keimanan dan ketakwaan) dan janganlah kamu berpecah belah di dalamnya. Sangat berat bagi orang-orang musyrik (untuk mengikuti) agama yang kamu serukan kepada mereka. Allah memilih orang yang Dia kehendaki kepada agama tauhid dan memberi petunjuk kepada (agama)-Nya bagi orang yang kembali (kepada-Nya).","hasanah_per_verse":1520},{"text_madani":"وَمَا تَفَرَّقُوا إِلَّا مِن بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ ۚ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ إِلَىٰ أَجَلٍ مُّسَمًّى لَّقُضِيَ بَيْنَهُمْ ۚ وَإِنَّ الَّذِينَ أُورِثُوا الْكِتَابَ مِن بَعْدِهِمْ لَفِي شَكٍّ مِّنْهُ مُرِيبٍ","text_tajweed":"وَمَا تَفَرَّق[o[ُوٓ][s[اْ] إِلَّا م[i:146[ِنۢ ب]َعْدِ مَا ج[o[َا]ٓءَهُمُ [h:1804[ٱ]لْعِلْمُ بَغْي[i:1169[َۢا ب]َيْنَهُمْ‌ۚ وَلَوْلَا كَلِمَ[f:5989[ةٌ س]َبَقَتْ م[u:770[ِن ر]َّبِّكَ إِلَ[o[ىٰٓ] أَجَ[a:1657[لٍ م]ُّسَم[u:12092[ًّى ل]َّقُضِىَ بَيْنَهُمْ‌ۚ وَإِ[g[نّ]َ [h:754[ٱ]لَّذِينَ أُورِثُو[s[اْ] [h:12093[ٱ]لْكِتَ[n[ـٰ]بَ م[i:1453[ِنۢ ب]َعْدِهِمْ لَفِى شَ[a:3275[كٍّ م]ِّنْهُ مُر[p[ِي][q[ب]ٍ","translation_en":"And they did not become divided until after knowledge had come to them out of envy among themselves; and had not a word gone forth from your Lord till an appointed term, certainly judgment would have been given between them; and those who were made to inherit the Book after them are most surely in disquieting doubt concerning it.","translation_id":"Dan mereka (Ahli Kitab) tidak berpecah belah kecuali setelah datang kepada mereka ilmu (kebenaran yang disampaikan oleh para nabi) karena kedengkian antara sesama mereka. Jika tidaklah karena suatu ketetapan yang telah ada dahulunya dari Tuhanmu (untuk menangguhkan azab) sampai batas waktu yang ditentukan, pastilah hukuman bagi mereka telah dilaksanakan. Dan sesungguhnya orang-orang yang mewarisi Kitab (Taurat dan Injil) setelah mereka (pada zaman Muhammad), benar-benar berada dalam keraguan yang mendalam tentang Kitab (Al-Qur'an) itu.","hasanah_per_verse":1140},{"text_madani":"فَلِذَٰلِكَ فَادْعُ ۖ وَاسْتَقِمْ كَمَا أُمِرْتَ ۖ وَلَا تَتَّبِعْ أَهْوَاءَهُمْ ۖ وَقُلْ آمَنتُ بِمَا أَنزَلَ اللَّهُ مِن كِتَابٍ ۖ وَأُمِرْتُ لِأَعْدِلَ بَيْنَكُمُ ۖ اللَّهُ رَبُّنَا وَرَبُّكُمْ ۖ لَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ ۖ لَا حُجَّةَ بَيْنَنَا وَبَيْنَكُمُ ۖ اللَّهُ يَجْمَعُ بَيْنَنَا ۖ وَإِلَيْهِ الْمَصِيرُ","text_tajweed":"فَلِذ[n[َٲ]لِكَ فَ[h:306[ٱ][q:306[دْ]عُ‌ۖ وَ[h:12094[ٱ]سْتَقِمْ كَم[o[َآ] أُمِرْتَ‌ۖ وَلَا تَتَّبِعْ أَهْو[o[َا]ٓءَهُمْ‌ۖ وَقُلْ ءَامَ[f:6185[نت]ُ بِم[o[َآ] أَ[f:471[نز]َلَ [h:472[ٱ]للَّهُ مِ[f:2060[ن ك]ِتَ[n[ـٰ][a:12095[بٍ‌ۖ و]َأُمِرْتُ لِأَعْدِلَ بَيْنَكُمُ‌ۖ [h:12096[ٱ]للَّهُ رَبُّنَا وَرَبُّكُمْ‌ۖ لَن[o[َآ] أَعْمَ[n[ـٰ]لُنَا وَلَكُمْ أَعْمَ[n[ـٰ]لُكُمْ‌ۖ لَا حُجَّةَ بَيْنَنَا وَبَيْنَكُمُ‌ۖ [h:12097[ٱ]للَّهُ يَ[q:3861[جْ]مَعُ بَيْنَنَا‌ۖ وَإِلَيْهِ [h:3461[ٱ]لْمَص[p[ِي]رُ","translation_en":"To this then go on inviting, and go on steadfastly on the right way as you are commanded, and do not follow their low desires, and say: I believe in what Allah has revealed of the Book, and I am commanded to do justice between you: Allah is our Lord and your Lord; we shall have our deeds and you shall have your deeds; no plea need there be (now) between us and you: Allah will gather us together, and to Him is the return.","translation_id":"Karena itu, serulah (mereka beriman) dan tetaplah (beriman dan berdakwah) sebagaimana diperintahkan kepadamu (Muhammad) dan janganlah mengikuti keinginan mereka dan katakanlah, “Aku beriman kepada Kitab yang diturunkan Allah dan aku diperintahkan agar berlaku adil di antara kamu. Allah Tuhan kami dan Tuhan kamu. Bagi kami perbuatan kami dan bagi kamu perbuatan kamu. Tidak (perlu) ada pertengkaran antara kami dan kamu, Allah mengumpulkan antara kita dan kepada-Nyalah (kita) kembali.”","hasanah_per_verse":1490},{"text_madani":"وَالَّذِينَ يُحَاجُّونَ فِي اللَّهِ مِن بَعْدِ مَا اسْتُجِيبَ لَهُ حُجَّتُهُمْ دَاحِضَةٌ عِندَ رَبِّهِمْ وَعَلَيْهِمْ غَضَبٌ وَلَهُمْ عَذَابٌ شَدِيدٌ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ يُح[m[َا]ٓجُّونَ فِى [h:714[ٱ]للَّهِ م[i:146[ِنۢ ب]َعْدِ مَا [h:12098[ٱ]سْتُجِيبَ لَهُ[n[ۥ] حُجَّتُهُمْ دَاحِضَةٌ عِ[f:264[ند]َ رَبِّهِمْ وَعَلَيْهِمْ غَضَ[a:12099[بٌ و]َلَهُمْ عَذَا[f:1727[بٌ ش]َد[p[ِي][q[د]ٌ","translation_en":"And (as for) those who dispute about Allah after that obedience has been rendered to Him, their plea is null with their Lord, and upon them is wrath, and for them is severe punishment.","translation_id":"Dan orang-orang yang berbantah-bantah tentang (agama) Allah setelah (agama itu) diterima, perbantahan mereka itu sia-sia di sisi Tuhan mereka. Mereka mendapat kemurkaan (Allah) dan mereka mendapat azab yang sangat keras.","hasanah_per_verse":710},{"text_madani":"اللَّهُ الَّذِي أَنزَلَ الْكِتَابَ بِالْحَقِّ وَالْمِيزَانَ ۗ وَمَا يُدْرِيكَ لَعَلَّ السَّاعَةَ قَرِيبٌ","text_tajweed":"ٱللَّهُ [h:4738[ٱ]لَّذ[o[ِىٓ] أَ[f:471[نز]َلَ [h:4228[ٱ]لْكِتَ[n[ـٰ]بَ بِ[h:370[ٱ]لْحَقِّ وَ[h:4528[ٱ]لْمِيزَانَ‌ۗ وَمَا يُ[q:10898[دْ]رِيكَ لَعَلَّ [h:10899[ٱ][l[ل]سَّاعَةَ قَر[p[ِي][q[ب]ٌ","translation_en":"Allah it is Who revealed the Book with truth, and the balance, and what shall make you know that haply the hour be nigh?","translation_id":"Allah yang menurunkan Kitab (Al-Qur'an) dengan (membawa) kebenaran dan neraca (keadilan). Dan tahukah kamu, boleh jadi hari Kiamat itu sudah dekat?","hasanah_per_verse":520},{"text_madani":"يَسْتَعْجِلُ بِهَا الَّذِينَ لَا يُؤْمِنُونَ بِهَا ۖ وَالَّذِينَ آمَنُوا مُشْفِقُونَ مِنْهَا وَيَعْلَمُونَ أَنَّهَا الْحَقُّ ۗ أَلَا إِنَّ الَّذِينَ يُمَارُونَ فِي السَّاعَةِ لَفِي ضَلَالٍ بَعِيدٍ","text_tajweed":"يَسْتَعْجِلُ بِهَا [h:12100[ٱ]لَّذِينَ لَا يُؤْمِنُونَ بِهَا‌ۖ وَ[h:37[ٱ]لَّذِينَ ءَامَنُو[s[اْ] مُشْفِقُونَ مِنْهَا وَيَعْلَمُونَ أَ[g[نّ]َهَا [h:12101[ٱ]لْحَقُّ‌ۗ أَل[o[َآ] إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ يُمَارُونَ فِى [h:12102[ٱ][l[ل]سَّاعَةِ لَفِى ضَلَ[n[ـٰ][i:7043[لِۭ ب]َع[p[ِي][q[د]ٍ","translation_en":"Those who do not believe in it would hasten it on, and those who believe are in fear from it, and they know that it is the truth. Now most surely those who dispute obstinately concerning the hour are in a great error.","translation_id":"Orang-orang yang tidak percaya adanya hari Kiamat meminta agar hari itu segera terjadi, dan orang-orang yang beriman merasa takut kepadanya dan mereka yakin bahwa Kiamat itu adalah benar (akan terjadi). Ketahuilah bahwa sesungguhnya orang-orang yang membantah tentang terjadinya Kiamat itu benar-benar telah tersesat jauh.","hasanah_per_verse":960},{"text_madani":"اللَّهُ لَطِيفٌ بِعِبَادِهِ يَرْزُقُ مَن يَشَاءُ ۖ وَهُوَ الْقَوِيُّ الْعَزِيزُ","text_tajweed":"ٱللَّهُ لَطِي[i:12103[فُۢ ب]ِعِبَادِه[n[ِۦ] يَرْزُقُ م[a:476[َن ي]َش[o[َا]ٓءُ‌ۖ وَهُوَ [h:12104[ٱ]لْقَوِىُّ [h:6410[ٱ]لْعَز[p[ِي]زُ","translation_en":"Allah is Benignant to His servants; He gives sustenance to whom He pleases, and He is the Strong, the Mighty.","translation_id":"Allah Mahalembut terhadap hamba-hamba-Nya; Dia memberi rezeki kepada siapa yang Dia kehendaki dan Dia Mahakuat, Mahaperkasa.","hasanah_per_verse":380},{"text_madani":"مَن كَانَ يُرِيدُ حَرْثَ الْآخِرَةِ نَزِدْ لَهُ فِي حَرْثِهِ ۖ وَمَن كَانَ يُرِيدُ حَرْثَ الدُّنْيَا نُؤْتِهِ مِنْهَا وَمَا لَهُ فِي الْآخِرَةِ مِن نَّصِيبٍ","text_tajweed":"مَ[f:506[ن ك]َانَ يُرِيدُ حَرْثَ [h:12105[ٱ]لْأَخِرَةِ نَزِ[q:12106[دْ] لَهُ[n[ۥ] فِى حَرْثِه[n[ِۦ]‌ۖ وَمَ[f:975[ن ك]َانَ يُرِيدُ حَرْثَ [h:12107[ٱ][l[ل]دُّنْيَا نُؤْتِه[n[ِۦ] مِنْهَا وَمَا لَهُ[n[ۥ] فِى [h:536[ٱ]لْأَخِرَةِ م[a:12108[ِن ن]َّص[p[ِي][q[ب]ٍ","translation_en":"Whoever desires the gain of the hereafter, We will give him more of that gain; and whoever desires the gain of this world, We give him of it, and in the hereafter he has no portion.","translation_id":"Barangsiapa menghendaki keuntungan di akhirat akan Kami tambahkan keuntungan itu baginya dan barangsiapa menghendaki keuntungan di dunia Kami berikan kepadanya sebagian darinya (keuntungan dunia), tetapi dia tidak akan mendapat bagian di akhirat.","hasanah_per_verse":750},{"text_madani":"أَمْ لَهُمْ شُرَكَاءُ شَرَعُوا لَهُم مِّنَ الدِّينِ مَا لَمْ يَأْذَن بِهِ اللَّهُ ۚ وَلَوْلَا كَلِمَةُ الْفَصْلِ لَقُضِيَ بَيْنَهُمْ ۗ وَإِنَّ الظَّالِمِينَ لَهُمْ عَذَابٌ أَلِيمٌ","text_tajweed":"أَمْ لَهُمْ شُرَكَ[o[ـٰٓ]ؤُ[s[اْ] شَرَعُو[s[اْ] لَه[w:6026[ُم م]ِّنَ [h:12087[ٱ][l[ل]دِّينِ مَا لَمْ يَأْذ[i:12109[َنۢ ب]ِهِ [h:1707[ٱ]للَّهُ‌ۚ وَلَوْلَا كَلِمَةُ [h:12110[ٱ]لْفَصْلِ لَقُضِىَ بَيْنَهُمْ‌ۗ وَإِ[g[نّ]َ [h:9074[ٱ][l[ل]ظَّ[n[ـٰ]لِمِينَ لَهُمْ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"Or have they associates who have prescribed for them any religion that Allah does not sanction? And were it not for the word of judgment, decision would have certainly been given between them; and surely the unjust shall have a painful punishment.","translation_id":"Apakah mereka mempunyai sesembahan selain Allah yang menetapkan aturan agama bagi mereka yang tidak diizinkan (diridhai) Allah? Dan sekiranya tidak ada ketetapan yang menunda (hukuman dari Allah) tentulah hukuman di antara mereka telah dilaksanakan. Dan sungguh, orang-orang zhalim itu akan mendapat azab yang sangat pedih.","hasanah_per_verse":840},{"text_madani":"تَرَى الظَّالِمِينَ مُشْفِقِينَ مِمَّا كَسَبُوا وَهُوَ وَاقِعٌ بِهِمْ ۗ وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فِي رَوْضَاتِ الْجَنَّاتِ ۖ لَهُم مَّا يَشَاءُونَ عِندَ رَبِّهِمْ ۚ ذَٰلِكَ هُوَ الْفَضْلُ الْكَبِيرُ","text_tajweed":"تَرَى [h:12111[ٱ][l[ل]ظَّ[n[ـٰ]لِمِينَ مُشْفِقِينَ مِ[g[مّ]َا كَسَبُو[s[اْ] وَهُوَ وَاقِ[i:5127[عُۢ ب]ِهِمْ‌ۗ وَ[h:37[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ فِى رَوْضَاتِ [h:12112[ٱ]لْجَ[g[نّ]َاتِ‌ۖ لَه[w:3531[ُم م]َّا يَش[o[َا]ٓءُونَ عِ[f:264[ند]َ رَبِّهِمْ‌ۚ ذ[n[َٲ]لِكَ هُوَ [h:11140[ٱ]لْفَضْلُ [h:11141[ٱ]لْكَب[p[ِي]رُ","translation_en":"You will see the unjust fearing on account of what they have earned, and it must befall them; and those who believe and do good shall be in the meadows of the gardens; they shall have what they please with their Lord: that is the great grace.","translation_id":"Kamu akan melihat orang-orang zhalim itu sangat ketakutan karena (kejahatan-kejahatan) yang telah mereka lakukan, dan (azab) menimpa mereka. Dan orang-orang yang beriman dan mengerjakan kebajikan (berada) di dalam taman-taman surga, mereka memperoleh apa yang mereka kehendaki di sisi Tuhan. Yang demikian itu adalah karunia yang besar.","hasanah_per_verse":1070},{"text_madani":"ذَٰلِكَ الَّذِي يُبَشِّرُ اللَّهُ عِبَادَهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ ۗ قُل لَّا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا إِلَّا الْمَوَدَّةَ فِي الْقُرْبَىٰ ۗ وَمَن يَقْتَرِفْ حَسَنَةً نَّزِدْ لَهُ فِيهَا حُسْنًا ۚ إِنَّ اللَّهَ غَفُورٌ شَكُورٌ","text_tajweed":"ذ[n[َٲ]لِكَ [h:12113[ٱ]لَّذِى يُبَشِّرُ [h:12114[ٱ]للَّهُ عِبَادَهُ [h:12115[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ‌ۗ قُل لّ[o[َآ] أَسْــَٔلُكُمْ عَلَيْهِ أَ[q:2795[جْ]رًا إِلَّا [h:12116[ٱ]لْمَوَدَّةَ فِى [h:12117[ٱ]لْقُرْبَىٰ‌ۗ وَم[a:12118[َن ي]َ[q:12119[قْ]تَرِفْ حَسَنَ[a:12120[ةً ن]َّزِ[q:12106[دْ] لَهُ[n[ۥ] فِيهَا حُسْنًا‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ غَفُو[f:11131[رٌ ش]َك[p[ُو]رٌ","translation_en":"That is of which Allah gives the good news to His servants, (to) those who believe and do good deeds. Say: I do not ask of you any reward for it but love for my near relatives; and whoever earns good, We give him more of good therein; surely Allah is Forgiving, Grateful.","translation_id":"Itulah (karunia) yang diberitahukan Allah untuk menggembirakan hamba-hamba-Nya yang beriman dan mengerjakan kebajikan. Katakanlah (Muhammad), “Aku tidak meminta kepadamu sesuatu imbalan pun atas seruanku kecuali kasih sayang dalam kekeluargaan.” Dan barangsiapa mengerjakan kebaikan akan Kami tambahkan kebaikan baginya. Sungguh, Allah Maha Pengampun, Maha Mensyukuri.","hasanah_per_verse":1180},{"text_madani":"أَمْ يَقُولُونَ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا ۖ فَإِن يَشَإِ اللَّهُ يَخْتِمْ عَلَىٰ قَلْبِكَ ۗ وَيَمْحُ اللَّهُ الْبَاطِلَ وَيُحِقُّ الْحَقَّ بِكَلِمَاتِهِ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","text_tajweed":"أَمْ يَقُولُونَ [h:12121[ٱ]فْتَرَىٰ عَلَى [h:412[ٱ]للَّهِ كَذِ[f:12122[بًا‌ۖ ف]َإ[a:12123[ِن ي]َشَإِ [h:4035[ٱ]للَّهُ يَخْتِمْ عَلَىٰ قَلْبِكَ‌ۗ وَيَمْحُ [h:12124[ٱ]للَّهُ [h:12125[ٱ]لْبَ[n[ـٰ]طِلَ وَيُحِقُّ [h:12126[ٱ]لْحَقَّ بِكَلِمَ[n[ـٰ]تِه[o[ِۦٓ‌ۚ] إِ[g[نّ]َهُ[n[ۥ] عَلِي[i:2196[مُۢ ب]ِذَاتِ [h:2197[ٱ][l[ل]صُّد[p[ُو]رِ","translation_en":"Or do they say: He has forged a lie against Allah? But if Allah pleased, He would seal your heart; and Allah will blot out the falsehood and confirm the truth with His words; surely He is Cognizant of what is in the breasts.","translation_id":"Ataukah mereka mengatakan, “Dia (Muhammad) telah mengada-adakan kebohongan tentang Allah.” Sekiranya Allah menghendaki niscaya Dia kunci hatimu. Dan Allah menghapus yang batil dan membenarkan yang benar dengan firman-Nya (Al-Qur'an). Sungguh, Dia Maha Mengetahui segala isi hati.","hasanah_per_verse":910},{"text_madani":"وَهُوَ الَّذِي يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَعْفُو عَنِ السَّيِّئَاتِ وَيَعْلَمُ مَا تَفْعَلُونَ","text_tajweed":"وَهُوَ [h:4114[ٱ]لَّذِى يَ[q:5822[قْ]بَلُ [h:5823[ٱ][l[ل]تَّوْبَةَ عَنْ عِبَادِه[n[ِۦ] وَيَعْفُو[s[اْ] عَنِ [h:12127[ٱ][l[ل]سَّيِّـَٔـاتِ وَيَعْلَمُ مَا تَفْعَل[p[ُو]نَ","translation_en":"And He it is Who accepts repentance from His servants and pardons the evil deeds and He knows what you do;","translation_id":"Dan Dialah yang menerima tobat dari hamba-hamba-Nya dan memaafkan kesalahan-kesalahan dan mengetahui apa yang kamu kerjakan,","hasanah_per_verse":510},{"text_madani":"وَيَسْتَجِيبُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَيَزِيدُهُم مِّن فَضْلِهِ ۚ وَالْكَافِرُونَ لَهُمْ عَذَابٌ شَدِيدٌ","text_tajweed":"وَيَسْتَجِيبُ [h:12128[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ وَيَزِيدُه[w:3323[ُم م]ِّ[f:475[ن ف]َضْلِه[n[ِۦ]‌ۚ وَ[h:1467[ٱ]لْكَ[n[ـٰ]فِرُونَ لَهُمْ عَذَا[f:1727[بٌ ش]َد[p[ِي][q[د]ٌ","translation_en":"And He answers those who believe and do good deeds, and gives them more out of His grace; and (as for) the unbelievers, they shall have a severe punishment.","translation_id":"dan Dia memperkenankan (doa) orang-orang yang beriman dan mengerjakan kebajikan serta menambah (pahala) kepada mereka dari karunia-Nya. Orang-orang yang ingkar akan mendapat azab yang sangat keras.","hasanah_per_verse":640},{"text_madani":"وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ وَلَٰكِن يُنَزِّلُ بِقَدَرٍ مَّا يَشَاءُ ۚ إِنَّهُ بِعِبَادِهِ خَبِيرٌ بَصِيرٌ","text_tajweed":"۞ وَلَوْ بَسَطَ [h:12129[ٱ]للَّهُ [h:12130[ٱ][l[ل]رِّزْقَ لِعِبَادِه[n[ِۦ] لَبَغَوْ[s[اْ] فِى [h:44[ٱ]لْأَرْضِ وَلَ[n[ـٰ]ك[a:12131[ِن ي]ُنَزِّلُ بِقَدَ[a:12132[رٍ م]َّا يَش[o[َا]ٓءُ‌ۚ إِ[g[نّ]َهُ[n[ۥ] بِعِبَادِه[n[ِۦ] خَبِي[i:12133[رُۢ ب]َص[p[ِي]رٌ","translation_en":"And if Allah should amplify the provision for His servants they would certainly revolt in the earth; but He sends it down according to a measure as He pleases; surely He is Aware of, Seeing, His servants.","translation_id":"Dan sekiranya Allah melapangkan rezeki kepada hamba-hamba-Nya niscaya mereka akan berbuat melampaui batas di bumi, tetapi Dia menurunkan dengan ukuran yang Dia kehendaki. Sungguh, Dia Mahateliti terhadap (keadaan) hamba-hamba-Nya, Maha Melihat.","hasanah_per_verse":680},{"text_madani":"وَهُوَ الَّذِي يُنَزِّلُ الْغَيْثَ مِن بَعْدِ مَا قَنَطُوا وَيَنشُرُ رَحْمَتَهُ ۚ وَهُوَ الْوَلِيُّ الْحَمِيدُ","text_tajweed":"وَهُوَ [h:4114[ٱ]لَّذِى يُنَزِّلُ [h:12134[ٱ]لْغَيْثَ م[i:146[ِنۢ ب]َعْدِ مَا قَنَطُو[s[اْ] وَيَ[f:12135[نش]ُرُ رَحْمَتَهُ[n[ۥ]‌ۚ وَهُوَ [h:12136[ٱ]لْوَلِىُّ [h:12137[ٱ]لْحَم[p[ِي][q[د]ُ","translation_en":"And He it is Who sends down the rain after they have despaired, and He unfolds His mercy; and He is the Guardian, the Praised One.","translation_id":"Dan Dialah yang menurunkan hujan setelah mereka berputus asa dan menyebarkan rahmat-Nya. Dan Dialah Maha Pelindung, Maha Terpuji.","hasanah_per_verse":520},{"text_madani":"وَمِنْ آيَاتِهِ خَلْقُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَثَّ فِيهِمَا مِن دَابَّةٍ ۚ وَهُوَ عَلَىٰ جَمْعِهِمْ إِذَا يَشَاءُ قَدِيرٌ","text_tajweed":"وَمِنْ ءَايَ[n[ـٰ]تِه[n[ِۦ] خَلْقُ [h:10451[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ وَمَا بَثَّ فِيهِمَا مِ[f:4026[ن د][m[َا]ٓبَّ[a:12138[ةٍ‌ۚ و]َهُوَ عَلَىٰ جَمْعِهِمْ إِذَا يَش[o[َا]ٓءُ قَد[p[ِي]رٌ","translation_en":"And one of His signs is the creation of the heavens and the earth and what He has spread forth in both of them of living beings; and when He pleases He is all-powerful to gather them together.","translation_id":"Dan di antara tanda-tanda (kebesaran)-Nya adalah penciptaan langit dan bumi dan makhluk-makhluk yang melata yang Dia sebarkan pada keduanya. Dan Dia Mahakuasa mengumpulkan semuanya apabila Dia kehendaki.","hasanah_per_verse":630},{"text_madani":"وَمَا أَصَابَكُم مِّن مُّصِيبَةٍ فَبِمَا كَسَبَتْ أَيْدِيكُمْ وَيَعْفُو عَن كَثِيرٍ","text_tajweed":"وَم[o[َآ] أَصَ[n[ـٰ]بَك[w:12139[ُم م]ّ[a:12140[ِن م]ُّصِيبَ[f:12141[ةٍ ف]َبِمَا كَسَبَتْ أَيْدِيكُمْ وَيَعْفُو[s[اْ] عَ[f:3438[ن ك]َث[p[ِي]رٍ","translation_en":"And whatever affliction befalls you, it is on account of what your hands have wrought, and (yet) He pardons most (of your faults).","translation_id":"Dan musibah apa pun yang menimpa kamu adalah disebabkan oleh perbuatan tanganmu sendiri, dan Allah memaafkan banyak (dari kesalahan-kesalahanmu).","hasanah_per_verse":410},{"text_madani":"وَمَا أَنتُم بِمُعْجِزِينَ فِي الْأَرْضِ ۖ وَمَا لَكُم مِّن دُونِ اللَّهِ مِن وَلِيٍّ وَلَا نَصِيرٍ","text_tajweed":"وَم[o[َآ] أَ[f:428[نت][c:4435[ُم ب]ِمُعْجِزِينَ فِى [h:44[ٱ]لْأَرْضِ‌ۖ وَمَا لَك[w:556[ُم م]ِّ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ م[a:557[ِن و]َلِ[a:558[ىٍّ و]َلَا نَص[p[ِي]رٍ","translation_en":"And you cannot escape in the earth, and you shall not have a guardian or a helper besides Allah.","translation_id":"Dan kamu tidak dapat melepaskan diri (dari siksaan Allah) di bumi, dan kamu tidak memperoleh pelindung atau penolong selain Allah.","hasanah_per_verse":480},{"text_madani":"وَمِنْ آيَاتِهِ الْجَوَارِ فِي الْبَحْرِ كَالْأَعْلَامِ","text_tajweed":"وَمِنْ ءَايَ[n[ـٰ]تِهِ [h:12142[ٱ]لْجَوَارِ فِى [h:837[ٱ]لْبَحْرِ كَ[h:12143[ٱ]لْأَعْلَ[p[ـٰ]مِ","translation_en":"And among His signs are the ships in the sea like mountains.","translation_id":"Dan di antara tanda-tanda (kebesaran)-Nya ialah kapal-kapal (yang berlayar) di laut seperti gunung-gunung.","hasanah_per_verse":290},{"text_madani":"إِن يَشَأْ يُسْكِنِ الرِّيحَ فَيَظْلَلْنَ رَوَاكِدَ عَلَىٰ ظَهْرِهِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّكُلِّ صَبَّارٍ شَكُورٍ","text_tajweed":"إ[a:3197[ِن ي]َشَأْ يُسْكِنِ [h:12144[ٱ][l[ل]رِّيحَ فَيَظْلَلْنَ رَوَاكِدَ عَلَىٰ ظَهْرِه[o[ِۦٓ‌ۚ] إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:7049[تٍ ل]ِّكُلِّ صَبَّا[f:7050[رٍ ش]َك[p[ُو]رٍ","translation_en":"If He pleases, He causes the wind to become still so that they lie motionless on its back; most surely there are signs in this for every patient, grateful one,","translation_id":"Jika Dia menghendaki, Dia akan menghentikan angin, sehingga jadilah (kapal-kapal) itu terhenti di permukaan laut. Sungguh, pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi orang yang selalu bersabar dan banyak bersyukur,","hasanah_per_verse":550},{"text_madani":"أَوْ يُوبِقْهُنَّ بِمَا كَسَبُوا وَيَعْفُ عَن كَثِيرٍ","text_tajweed":"أَوْ يُوبِ[q:12145[قْ]هُ[g[نّ]َ بِمَا كَسَبُو[s[اْ] وَيَعْفُ عَ[f:3438[ن ك]َث[p[ِي]رٍ","translation_en":"Or He may make them founder for what they have earned, and (even then) pardon most;","translation_id":"atau (Dia akan) menghancurkan kapal-kapal itu karena perbuatan (dosa) mereka, dan Dia memaafkan banyak (dari mereka),","hasanah_per_verse":260},{"text_madani":"وَيَعْلَمَ الَّذِينَ يُجَادِلُونَ فِي آيَاتِنَا مَا لَهُم مِّن مَّحِيصٍ","text_tajweed":"وَيَعْلَمَ [h:12146[ٱ]لَّذِينَ يُجَ[n[ـٰ]دِلُونَ ف[o[ِىٓ] ءَايَ[n[ـٰ]تِنَا مَا لَه[w:1812[ُم م]ّ[a:7093[ِن م]َّح[p[ِي]صٍ","translation_en":"And (that) those who dispute about Our communications may know; there is no place of refuge for them.","translation_id":"dan agar orang-orang yang membantah tanda-tanda (kekuasaan) Kami mengetahui bahwa mereka tidak akan memperoleh jalan keluar (dari siksaan).","hasanah_per_verse":360},{"text_madani":"فَمَا أُوتِيتُم مِّن شَيْءٍ فَمَتَاعُ الْحَيَاةِ الدُّنْيَا ۖ وَمَا عِندَ اللَّهِ خَيْرٌ وَأَبْقَىٰ لِلَّذِينَ آمَنُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ","text_tajweed":"فَم[o[َآ] أُوتِيت[w:10210[ُم م]ِّ[f:2103[ن ش][f:10211[َىْءٍ ف]َمَتَ[n[ـٰ]عُ [h:10212[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا‌ۖ وَمَا عِ[f:264[ند]َ [h:408[ٱ]للَّهِ خَيْ[a:8546[رٌ و]َأَ[q:8540[بْ]قَىٰ لِلَّذِينَ ءَامَنُو[s[اْ] وَعَلَىٰ رَبِّهِمْ يَتَوَكَّل[p[ُو]نَ","translation_en":"So whatever thing you are given, that is only a provision of this world's life, and what is with Allah is better and more lasting for those who believe and rely on their Lord.","translation_id":"Apa pun (kenikmatan) yang diberikan kepadamu, maka itu adalah kesenangan hidup di dunia. Sedangkan apa (kenikmatan) yang ada di sisi Allah lebih baik dan lebih kekal bagi orang-orang yang beriman, dan hanya kepada Tuhan mereka bertawakal,","hasanah_per_verse":740},{"text_madani":"وَالَّذِينَ يَجْتَنِبُونَ كَبَائِرَ الْإِثْمِ وَالْفَوَاحِشَ وَإِذَا مَا غَضِبُوا هُمْ يَغْفِرُونَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ يَ[q:12147[جْ]تَنِبُونَ كَبَ[o[ـٰٓ]ئِرَ [h:12148[ٱ]لْإِثْمِ وَ[h:12149[ٱ]لْفَو[n[َٲ]حِشَ وَإِذَا مَا غَضِبُو[s[اْ] هُمْ يَغْفِر[p[ُو]نَ","translation_en":"And those who. shun the great sins and indecencies, and whenever they are angry they forgive.","translation_id":"dan juga (bagi) orang-orang yang menjauhi dosa-dosa besar dan perbuatan-perbuatan keji, dan apabila mereka marah segera memberi maaf,","hasanah_per_verse":500},{"text_madani":"وَالَّذِينَ اسْتَجَابُوا لِرَبِّهِمْ وَأَقَامُوا الصَّلَاةَ وَأَمْرُهُمْ شُورَىٰ بَيْنَهُمْ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ [h:12150[ٱ]سْتَجَابُو[s[اْ] لِرَبِّهِمْ وَأَقَامُو[s[اْ] [h:1641[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ وَأَمْرُهُمْ شُورَىٰ بَيْنَهُمْ وَمِ[g[مّ]َا رَزَ[q:15[قْ]نَ[n[ـٰ]هُمْ يُ[f:16[نف]ِق[p[ُو]نَ","translation_en":"And those who respond to their Lord and keep up prayer, and their rule is to take counsel among themselves, and who spend out of what We have given them.","translation_id":"dan (bagi) orang-orang yang menerima (mematuhi) seruan Tuhan dan melaksanakan shalat, sedang urusan mereka (diputuskan) dengan musyawarah antara mereka; dan mereka menginfakkan sebagian dari rezeki yang Kami berikan kepada mereka,","hasanah_per_verse":640},{"text_madani":"وَالَّذِينَ إِذَا أَصَابَهُمُ الْبَغْيُ هُمْ يَنتَصِرُونَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ إِذ[o[َآ] أَصَابَهُمُ [h:12151[ٱ]لْبَغْىُ هُمْ يَ[f:9794[نت]َصِر[p[ُو]نَ","translation_en":"And those who, when great wrong afflicts them, defend themselves.","translation_id":"dan (bagi) orang-orang yang apabila mereka diperlakukan dengan zhalim, mereka membela diri.","hasanah_per_verse":290},{"text_madani":"وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِّثْلُهَا ۖ فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ ۚ إِنَّهُ لَا يُحِبُّ الظَّالِمِينَ","text_tajweed":"وَجَز[o[َٲ]ٓؤُ[s[اْ] سَيِّئَ[f:12152[ةٍ س]َيِّئَ[a:12153[ةٌ م]ِّثْلُهَا‌ۖ فَمَنْ عَفَا وَأَصْلَحَ فَأَ[q:12154[جْ]رُهُ[n[ۥ] عَلَى [h:412[ٱ]للَّهِ‌ۚ إِ[g[نّ]َهُ[n[ۥ] لَا يُحِبُّ [h:1968[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And the recompense of evil is punishment like it, but whoever forgives and amends, he shall have his reward from Allah; surely He does not love the unjust.","translation_id":"Dan balasan suatu kejahatan adalah kejahatan yang setimpal, tetapi barangsiapa memaafkan dan berbuat baik (kepada orang yang berbuat jahat) maka pahalanya dari Allah. Sungguh, Dia tidak menyukai orang-orang zhalim.","hasanah_per_verse":570},{"text_madani":"وَلَمَنِ انتَصَرَ بَعْدَ ظُلْمِهِ فَأُولَٰئِكَ مَا عَلَيْهِم مِّن سَبِيلٍ","text_tajweed":"وَلَمَنِ [h:12155[ٱ][f:12156[نت]َصَرَ بَعْدَ ظُلْمِه[n[ِۦ] فَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ مَا عَلَيْه[w:4082[ِم م]ِّ[f:5782[ن س]َب[p[ِي]لٍ","translation_en":"And whoever defends himself after his being oppressed, these it is against whom there is no way (to blame).","translation_id":"Tetapi orang-orang yang membela diri setelah dizhalimi, tidak ada alasan untuk menyalahkan mereka.","hasanah_per_verse":350},{"text_madani":"إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَظْلِمُونَ النَّاسَ وَيَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ ۚ أُولَٰئِكَ لَهُمْ عَذَابٌ أَلِيمٌ","text_tajweed":"إِ[g[نّ]َمَا [h:5784[ٱ][l[ل]سَّبِيلُ عَلَى [h:289[ٱ]لَّذِينَ يَظْلِمُونَ [h:12157[ٱ][l[ل][g[نّ]َاسَ وَيَ[q:12158[بْ]غُونَ فِى [h:44[ٱ]لْأَرْضِ بِغَيْرِ [h:325[ٱ]لْحَقِّ‌ۚ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ لَهُمْ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"The way (to blame) is only against those who oppress men and revolt in the earth unjustly; these shall have a painful punishment.","translation_id":"Sesungguhnya kesalahan hanya ada pada orang-orang yang berbuat zhalim kepada manusia dan melampaui batas di bumi tanpa (mengindahkan) kebenaran. Mereka itu mendapat siksa yang pedih.","hasanah_per_verse":660},{"text_madani":"وَلَمَن صَبَرَ وَغَفَرَ إِنَّ ذَٰلِكَ لَمِنْ عَزْمِ الْأُمُورِ","text_tajweed":"وَلَمَ[f:12159[ن ص]َبَرَ وَغَفَرَ إِ[g[نّ]َ ذ[n[َٲ]لِكَ لَمِنْ عَزْمِ [h:2488[ٱ]لْأُم[p[ُو]رِ","translation_en":"And whoever is patient and forgiving, these most surely are actions due to courage.","translation_id":"Tetapi barangsiapa bersabar dan memaafkan, sungguh yang demikian itu termasuk perbuatan yang mulia.","hasanah_per_verse":280},{"text_madani":"وَمَن يُضْلِلِ اللَّهُ فَمَا لَهُ مِن وَلِيٍّ مِّن بَعْدِهِ ۗ وَتَرَى الظَّالِمِينَ لَمَّا رَأَوُا الْعَذَابَ يَقُولُونَ هَلْ إِلَىٰ مَرَدٍّ مِّن سَبِيلٍ","text_tajweed":"وَم[a:3002[َن ي]ُضْلِلِ [h:3003[ٱ]للَّهُ فَمَا لَهُ[n[ۥ] م[a:557[ِن و]َلِ[a:12160[ىٍّ م]ّ[i:254[ِنۢ ب]َعْدِه[n[ِۦ]‌ۗ وَتَرَى [h:12161[ٱ][l[ل]ظَّ[n[ـٰ]لِمِينَ لَ[g[مّ]َا رَأَوُ[s[اْ] [h:6091[ٱ]لْعَذَابَ يَقُولُونَ هَلْ إِلَىٰ مَرَ[a:12162[دٍّ م]ِّ[f:5782[ن س]َب[p[ِي]لٍ","translation_en":"And whomsoever Allah makes err, he has no guardian after Him; and you shall see the unjust, when they see the punishment, saying: Is there any way to return?","translation_id":"Dan barangsiapa dibiarkan sesat oleh Allah, maka tidak ada baginya pelindung setelah itu. Kamu akan melihat orang-orang zhalim ketika mereka melihat azab berkata, “Adakah kiranya jalan untuk kembali (ke dunia)?”","hasanah_per_verse":720},{"text_madani":"وَتَرَاهُمْ يُعْرَضُونَ عَلَيْهَا خَاشِعِينَ مِنَ الذُّلِّ يَنظُرُونَ مِن طَرْفٍ خَفِيٍّ ۗ وَقَالَ الَّذِينَ آمَنُوا إِنَّ الْخَاسِرِينَ الَّذِينَ خَسِرُوا أَنفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيَامَةِ ۗ أَلَا إِنَّ الظَّالِمِينَ فِي عَذَابٍ مُّقِيمٍ","text_tajweed":"وَتَرَ[n[ٮٰ]هُمْ يُعْرَضُونَ عَلَيْهَا خَ[n[ـٰ]شِعِينَ مِنَ [h:7943[ٱ][l[ل]ذُّلِّ يَ[f:1141[نظ]ُرُونَ مِ[f:12163[ن ط]َرْفٍ خَفِ[a:12164[ىٍّ‌ۗ و]َقَالَ [h:614[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِ[g[نّ]َ [h:11650[ٱ]لْخَ[n[ـٰ]سِرِينَ [h:11651[ٱ]لَّذِينَ خَسِر[o[ُوٓ][s[اْ] أَ[f:38[نف]ُسَهُمْ وَأَهْلِيهِمْ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ‌ۗ أَل[o[َآ] إِ[g[نّ]َ [h:7101[ٱ][l[ل]ظَّ[n[ـٰ]لِمِينَ فِى عَذَا[a:12165[بٍ م]ُّق[p[ِي]مٍ","translation_en":"And you shall see them brought before it humbling themselves because of the abasements, looking with a faint glance. And those who believe shall say: Surely the losers are they who have lost themselves and their followers on the resurrection day. Now surely the iniquitous shall remain in lasting chastisement.","translation_id":"Dan kamu akan melihat mereka dihadapkan ke neraka dalam keadaan tertunduk karena (merasa) hina, mereka melihat dengan pandangan yang lesu. Dan orang-orang yang beriman berkata, “Sesungguhnya orang-orang yang rugi ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya pada hari Kiamat.” Ingatlah, sesungguhnya orang-orang zhalim itu berada dalam azab yang kekal.","hasanah_per_verse":1230},{"text_madani":"وَمَا كَانَ لَهُم مِّنْ أَوْلِيَاءَ يَنصُرُونَهُم مِّن دُونِ اللَّهِ ۗ وَمَن يُضْلِلِ اللَّهُ فَمَا لَهُ مِن سَبِيلٍ","text_tajweed":"وَمَا كَانَ لَه[w:1812[ُم م]ِّنْ أَوْلِي[o[َا]ٓءَ يَ[f:12166[نص]ُرُونَه[w:12167[ُم م]ِّ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ‌ۗ وَم[a:3002[َن ي]ُضْلِلِ [h:3003[ٱ]للَّهُ فَمَا لَهُ[n[ۥ] مِ[f:5782[ن س]َب[p[ِي]لٍ","translation_en":"And they shall have no friends to help them besides Allah; and-- whomsoever Allah makes err, he shall have no way.","translation_id":"Dan mereka tidak akan mempunyai pelindung yang dapat menolong mereka selain Allah. Barangsiapa dibiarkan sesat oleh Allah tidak akan ada jalan keluar baginya (untuk mendapat petunjuk).","hasanah_per_verse":560},{"text_madani":"اسْتَجِيبُوا لِرَبِّكُم مِّن قَبْلِ أَن يَأْتِيَ يَوْمٌ لَّا مَرَدَّ لَهُ مِنَ اللَّهِ ۚ مَا لَكُم مِّن مَّلْجَإٍ يَوْمَئِذٍ وَمَا لَكُم مِّن نَّكِيرٍ","text_tajweed":"ٱسْتَجِيبُو[s[اْ] لِرَبِّك[w:12168[ُم م]ِّ[f:1346[ن ق]َ[q:1347[بْ]لِ أ[a:1462[َن ي]َأْتِىَ يَوْ[u:1463[مٌ ل]َّا مَرَدَّ لَهُ[n[ۥ] مِنَ [h:321[ٱ]للَّهِ‌ۚ مَا لَك[w:556[ُم م]ّ[a:12169[ِن م]َّلْجَ[a:12170[إٍ ي]َوْمَئِ[a:12171[ذٍ و]َمَا لَك[w:556[ُم م]ّ[a:12172[ِن ن]َّك[p[ِي]رٍ","translation_en":"Hearken to your Lord before there comes the day from Allah for which there shall be no averting; you shall have no refuge on that day, nor shall it be yours to make a denial.","translation_id":"Patuhilah seruan Tuhanmu sebelum datang dari Allah suatu hari yang tidak dapat ditolak (atas perintah dari Allah). Pada hari itu kamu tidak memperoleh tempat berlindung dan tidak (pula) dapat mengingkari (dosa-dosamu).","hasanah_per_verse":680},{"text_madani":"فَإِنْ أَعْرَضُوا فَمَا أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظًا ۖ إِنْ عَلَيْكَ إِلَّا الْبَلَاغُ ۗ وَإِنَّا إِذَا أَذَقْنَا الْإِنسَانَ مِنَّا رَحْمَةً فَرِحَ بِهَا ۖ وَإِن تُصِبْهُمْ سَيِّئَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ فَإِنَّ الْإِنسَانَ كَفُورٌ","text_tajweed":"فَإِنْ أَعْرَضُو[s[اْ] فَم[o[َآ] أَرْسَلْنَ[n[ـٰ]كَ عَلَيْهِمْ حَفِيظًا‌ۖ إِنْ عَلَيْكَ إِلَّا [h:3819[ٱ]لْبَلَ[n[ـٰ]غُ‌ۗ وَإِ[g[نّ][o[َآ] إِذ[o[َآ] أَذَ[q:5991[قْ]نَا [h:6253[ٱ]لْإِ[f:5969[نس]َ[n[ـٰ]نَ مِ[g[نّ]َا رَحْمَ[f:12173[ةً ف]َرِحَ بِهَا‌ۖ وَإِ[f:2950[ن ت]ُصِ[q:2951[بْ]هُمْ سَيِّئَ[i:10486[ةُۢ ب]ِمَا قَدَّمَتْ أَيْدِيهِمْ فَإِ[g[نّ]َ [h:12174[ٱ]لْإِ[f:5969[نس]َ[n[ـٰ]نَ كَف[p[ُو]رٌ","translation_en":"But if they turn aside, We have not sent you as a watcher over them; on you is only to deliver (the message); and surely when We make man taste mercy from Us, he rejoices thereat; and if an evil afflicts them on account of what their hands have already done, then-surely man is ungrateful.","translation_id":"Jika mereka berpaling, maka (ingatlah) Kami tidak mengutus engkau sebagai pengawas bagi mereka. Kewajibanmu tidak lain hanyalah menyampaikan (risalah). Dan sungguh, apabila Kami merasakan kepada manusia suatu rahmat dari Kami, dia menyambutnya dengan gembira; tetapi jika mereka ditimpa kesusahan disebabkan perbuatan tangan mereka sendiri (niscaya mereka ingkar), sungguh, manusia itu sangat ingkar (kepada nikmat).","hasanah_per_verse":1150},{"text_madani":"لِّلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ يَخْلُقُ مَا يَشَاءُ ۚ يَهَبُ لِمَن يَشَاءُ إِنَاثًا وَيَهَبُ لِمَن يَشَاءُ الذُّكُورَ","text_tajweed":"لِّلَّهِ مُلْكُ [h:555[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۚ يَخْلُقُ مَا يَش[o[َا]ٓءُ‌ۚ يَهَبُ لِم[a:1537[َن ي]َش[o[َا]ٓءُ إِنَ[n[ـٰ][a:12175[ثًا و]َيَهَبُ لِم[a:1537[َن ي]َش[o[َا]ٓءُ [h:12176[ٱ][l[ل]ذُّك[p[ُو]رَ","translation_en":"Allah's is the kingdom of the heavens and the earth; He creates what He pleases; He grants to whom He pleases daughters and grants to whom He pleases sons.","translation_id":"Milik Allah-lah kerajaan langit dan bumi; Dia menciptakan apa yang Dia kehendaki, memberikan anak perempuan kepada siapa yang Dia kehendaki dan memberikan anak laki-laki kepada siapa yang Dia kehendaki,","hasanah_per_verse":620},{"text_madani":"أَوْ يُزَوِّجُهُمْ ذُكْرَانًا وَإِنَاثًا ۖ وَيَجْعَلُ مَن يَشَاءُ عَقِيمًا ۚ إِنَّهُ عَلِيمٌ قَدِيرٌ","text_tajweed":"أَوْ يُزَوِّجُهُمْ ذُكْرَا[a:12177[نًا و]َإِنَ[n[ـٰ][a:12178[ثًا‌ۖ و]َيَ[q:6204[جْ]عَلُ م[a:476[َن ي]َش[o[َا]ٓءُ عَقِيمًا‌ۚ إِ[g[نّ]َهُ[n[ۥ] عَلِي[f:7488[مٌ ق]َد[p[ِي]رٌ","translation_en":"Or He makes them of both sorts, male and female; and He makes whom He pleases barren; surely He is the Knowing, the Powerful.","translation_id":"atau Dia menganugerahkan jenis laki-laki dan perempuan, dan menjadikan mandul siapa yang Dia kehendaki. Dia Maha Mengetahui, Mahakuasa.","hasanah_per_verse":470},{"text_madani":"وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِن وَرَاءِ حِجَابٍ أَوْ يُرْسِلَ رَسُولًا فَيُوحِيَ بِإِذْنِهِ مَا يَشَاءُ ۚ إِنَّهُ عَلِيٌّ حَكِيمٌ","text_tajweed":"۞ وَمَا كَانَ لِبَشَرٍ أ[a:12179[َن ي]ُكَلِّمَهُ [h:12180[ٱ]للَّهُ إِلَّا وَحْيًا أَوْ م[a:12181[ِن و]َرَآىِٕ حِجَابٍ أَوْ يُرْسِلَ رَسُول[f:12182[اً ف]َيُوحِىَ بِإِذْنِه[n[ِۦ] مَا يَش[o[َا]ٓءُ‌ۚ إِ[g[نّ]َهُ[n[ۥ] عَلِىٌّ حَك[p[ِي]مٌ","translation_en":"And it is not for any mortal that Allah should speak to them, they could not bear to hear and they did not see.","translation_id":"Dan tidaklah patut bagi seorang manusia bahwa Allah akan berbicara kepadanya kecuali dengan perantaraan wahyu atau dari belakang tabir atau dengan mengutus utusan (malaikat) lalu diwahyukan kepadanya dengan izin-Nya apa yang Dia kehendaki. Sungguh, Dia Mahatinggi, Mahabijaksana.","hasanah_per_verse":770},{"text_madani":"وَكَذَٰلِكَ أَوْحَيْنَا إِلَيْكَ رُوحًا مِّنْ أَمْرِنَا ۚ مَا كُنتَ تَدْرِي مَا الْكِتَابُ وَلَا الْإِيمَانُ وَلَٰكِن جَعَلْنَاهُ نُورًا نَّهْدِي بِهِ مَن نَّشَاءُ مِنْ عِبَادِنَا ۚ وَإِنَّكَ لَتَهْدِي إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ","text_tajweed":"وَكَذ[n[َٲ]لِكَ أَوْحَيْن[o[َآ] إِلَيْكَ رُو[a:12183[حًا م]ِّنْ أَمْرِنَا‌ۚ مَا كُ[f:735[نت]َ تَ[q:10618[دْ]رِى مَا [h:12184[ٱ]لْكِتَ[n[ـٰ]بُ وَلَا [h:12185[ٱ]لْإِيمَ[n[ـٰ]نُ وَلَ[n[ـٰ]كِ[f:12186[ن ج]َعَلْنَ[n[ـٰ]هُ نُو[a:12187[رًا ن]َّهْدِى بِه[n[ِۦ] م[a:4211[َن ن]َّش[o[َا]ٓءُ مِنْ عِبَادِنَا‌ۚ وَإِ[g[نّ]َكَ لَتَهْد[o[ِىٓ] إِلَىٰ صِر[n[َٲ][a:726[طٍ م]ُّسْتَق[p[ِي]مٍ","translation_en":"And thus did We reveal to you an inspired book by Our command. You did not know what the Book was, nor (what) the faith (was), but We made it a light, guiding thereby whom We please of Our servants; and most surely you show the way to the right path:","translation_id":"Dan demikianlah Kami wahyukan kepadamu (Muhammad) rµh (Al-Qur'an) dengan perintah Kami. Sebelumnya engkau tidaklah mengetahui apakah Kitab (Al-Qur'an) dan apakah iman itu, tetapi Kami jadikan Al-Qur'an itu cahaya, dengan itu Kami memberi petunjuk siapa yang Kami kehendaki di antara hamba-hamba Kami. Dan sungguh, engkau benar-benar membimbing (manusia) kepada jalan yang lurus,","hasanah_per_verse":1090},{"text_madani":"صِرَاطِ اللَّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ أَلَا إِلَى اللَّهِ تَصِيرُ الْأُمُورُ","text_tajweed":"صِر[n[َٲ]طِ [h:12188[ٱ]للَّهِ [h:9413[ٱ]لَّذِى لَهُ[n[ۥ] مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَا فِى [h:44[ٱ]لْأَرْضِ‌ۗ أَل[o[َآ] إِلَى [h:1637[ٱ]للَّهِ تَصِيرُ [h:12189[ٱ]لْأُم[p[ُو]رُ","translation_en":"The path of Allah, Whose is whatsoever is in the heavens and whatsoever is in the earth; now surely to Allah do all affairs eventually come.","translation_id":"(Yaitu) jalan Allah yang milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Ingatlah, segala urusan kembali kepada Allah.","hasanah_per_verse":560}]}
