{"chapter_number":27,"name_simple":"An-Naml","name_meaning":{"text":"The Ant","en":"The Ant","id":"Semut"},"verses_count":93,"hasanah":47900,"verses":[{"text_madani":"طس ۚ تِلْكَ آيَاتُ الْقُرْآنِ وَكِتَابٍ مُّبِينٍ","text_tajweed":"ط[m[سٓ]‌ۚ تِلْكَ ءَايَ[n[ـٰ]تُ [h:9883[ٱ]لْقُرْءَانِ وَكِتَا[a:9884[بٍ م]ُّب[p[ِي]نٍ","translation_en":"Ta Sin! These are the verses of the Quran and the Book that makes (things) clear","translation_id":"Tha Sin. Inilah ayat-ayat Al-Qur'an, dan Kitab yang jelas,","hasanah_per_verse":240},{"text_madani":"هُدًى وَبُشْرَىٰ لِلْمُؤْمِنِينَ","text_tajweed":"هُ[a:9885[دًى و]َبُشْرَىٰ لِلْمُؤْمِن[p[ِي]نَ","translation_en":"A guidance and good news for the believers,","translation_id":"petunjuk dan berita gembira bagi orang-orang yang beriman,","hasanah_per_verse":160},{"text_madani":"الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَهُم بِالْآخِرَةِ هُمْ يُوقِنُونَ","text_tajweed":"ٱلَّذِينَ يُقِيمُونَ [h:3638[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ وَيُؤْتُونَ [h:3639[ٱ][l[ل]زَّكَ[s[و][n[ٲ]ةَ وَه[c:4710[ُم ب]ِ[h:447[ٱ]لْأَخِرَةِ هُمْ يُوقِن[p[ُو]نَ","translation_en":"Who keep up prayer and pay the poor-rate, and of the hereafter, they are sure.","translation_id":"(yaitu) orang-orang yang melaksanakan shalat dan menunaikan zakat, dan mereka meyakini adanya akhirat.","hasanah_per_verse":470},{"text_madani":"إِنَّ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ زَيَّنَّا لَهُمْ أَعْمَالَهُمْ فَهُمْ يَعْمَهُونَ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ لَا يُؤْمِنُونَ بِ[h:447[ٱ]لْأَخِرَةِ زَيَّ[g[نّ]َا لَهُمْ أَعْمَ[n[ـٰ]لَهُمْ فَهُمْ يَعْمَه[p[ُو]نَ","translation_en":"As to those who do not believe in the hereafter, We have surely made their deeds fair-seeming to them, but they blindly wander on.","translation_id":"Sesungguhnya orang-orang yang tidak beriman kepada akhirat, Kami jadikan terasa indah bagi mereka perbuatan-perbuatan mereka (yang buruk), sehingga mereka bergelimang dalam kesesatan.","hasanah_per_verse":450},{"text_madani":"أُولَٰئِكَ الَّذِينَ لَهُمْ سُوءُ الْعَذَابِ وَهُمْ فِي الْآخِرَةِ هُمُ الْأَخْسَرُونَ","text_tajweed":"أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ [h:51[ٱ]لَّذِينَ لَهُمْ س[o[ُو]ٓءُ [h:9886[ٱ]لْعَذَابِ وَهُمْ فِى [h:536[ٱ]لْأَخِرَةِ هُمُ [h:6285[ٱ]لْأَخْسَر[p[ُو]نَ","translation_en":"These are they who shall have an evil punishment, and in the hereafter they shall be the greatest losers.","translation_id":"Mereka itulah orang-orang yang akan mendapat siksaan buruk (di dunia) dan mereka di akhirat adalah orang-orang yang paling rugi.","hasanah_per_verse":430},{"text_madani":"وَإِنَّكَ لَتُلَقَّى الْقُرْآنَ مِن لَّدُنْ حَكِيمٍ عَلِيمٍ","text_tajweed":"وَإِ[g[نّ]َكَ لَتُلَقَّى [h:9887[ٱ]لْقُرْءَانَ م[u:6233[ِن ل]َّدُنْ حَكِيمٍ عَل[p[ِي]مٍ","translation_en":"And most surely you are made to receive the Quran from the Wise, the Knowing Allah.","translation_id":"Dan sesungguhnya engkau (Muhammad) benar-benar telah diberi Al-Qur'an dari sisi (Allah) Yang Mahabijaksana, Maha Mengetahui.","hasanah_per_verse":280},{"text_madani":"إِذْ قَالَ مُوسَىٰ لِأَهْلِهِ إِنِّي آنَسْتُ نَارًا سَآتِيكُم مِّنْهَا بِخَبَرٍ أَوْ آتِيكُم بِشِهَابٍ قَبَسٍ لَّعَلَّكُمْ تَصْطَلُونَ","text_tajweed":"إِذْ قَالَ مُوسَىٰ لِأَهْلِه[o[ِۦٓ] إِ[g[نّ][o[ِىٓ] ءَانَسْتُ نَا[f:9888[رًا س]َـَٔـاتِيك[w:9889[ُم م]ِّنْهَا بِخَبَرٍ أَوْ ءَاتِيك[c:9890[ُم ب]ِشِهَا[f:9891[بٍ ق]َبَ[u:9892[سٍ ل]َّعَلَّكُمْ تَصْطَل[p[ُو]نَ","translation_en":"When Musa said to his family: Surely I see fire; I will bring to you from it some news, or I will bring to you therefrom a burning firebrand so that you may warm yourselves.","translation_id":"(Ingatlah) ketika Musa berkata kepada keluarganya, “Sungguh, aku melihat api. Aku akan membawa kabar tentang itu kepadamu, atau aku akan membawa suluh api (obor) kepadamu agar kamu dapat berdiang (menghangatkan badan dekat api).”","hasanah_per_verse":650},{"text_madani":"فَلَمَّا جَاءَهَا نُودِيَ أَن بُورِكَ مَن فِي النَّارِ وَمَنْ حَوْلَهَا وَسُبْحَانَ اللَّهِ رَبِّ الْعَالَمِينَ","text_tajweed":"فَلَ[g[مّ]َا ج[o[َا]ٓءَهَا نُودِىَ أ[i:9893[َنۢ ب]ُورِكَ مَ[f:2074[ن ف]ِى [h:4674[ٱ][l[ل][g[نّ]َارِ وَمَنْ حَوْلَهَا وَسُ[q:6849[بْ]حَ[n[ـٰ]نَ [h:6850[ٱ]للَّهِ رَبِّ [h:4[ٱ]لْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"So when he came to it a voice was uttered saying: Blessed is Whoever is in the fire and whatever is about it; and glory be to Allah, the Lord of the worlds;","translation_id":"Maka ketika dia tiba di sana (tempat api itu), dia diseru, “Telah diberkahi orang-orang yang berada di dekat api, dan orang-orang yang berada di sekitarnya. Mahasuci Allah, Tuhan seluruh alam.”","hasanah_per_verse":560},{"text_madani":"يَا مُوسَىٰ إِنَّهُ أَنَا اللَّهُ الْعَزِيزُ الْحَكِيمُ","text_tajweed":"يَ[n[ـٰ]مُوسَ[o[ىٰٓ] إِ[g[نّ]َهُ[o[ۥٓ] أَنَا [h:8455[ٱ]للَّهُ [h:9894[ٱ]لْعَزِيزُ [h:681[ٱ]لْحَك[p[ِي]مُ","translation_en":"O Musa! surely I am Allah, the Mighty, the Wise;","translation_id":"(Allah berfirman), “Wahai Musa! Sesungguhnya Aku adalah Allah, Yang Mahaperkasa, Mahabijaksana.","hasanah_per_verse":280},{"text_madani":"وَأَلْقِ عَصَاكَ ۚ فَلَمَّا رَآهَا تَهْتَزُّ كَأَنَّهَا جَانٌّ وَلَّىٰ مُدْبِرًا وَلَمْ يُعَقِّبْ ۚ يَا مُوسَىٰ لَا تَخَفْ إِنِّي لَا يَخَافُ لَدَيَّ الْمُرْسَلُونَ","text_tajweed":"وَأَلْقِ عَصَاكَ‌ۚ فَلَ[g[مّ]َا رَءَاهَا تَهْتَزُّ كَأَ[g[نّ]َهَا ج[m[َا]ٓ[a:9895[[g[نّ]ٌ و]َلَّىٰ مُ[q:9896[دْ]بِ[a:9897[رًا و]َلَمْ يُعَقِّ[q:9898[بْ]‌ۚ يَ[n[ـٰ]مُوسَىٰ لَا تَخَفْ إِ[g[نّ]ِى لَا يَخَافُ لَدَىَّ [h:9899[ٱ]لْمُرْسَل[p[ُو]نَ","translation_en":"And cast down your staff. So when he saw it in motion as if it were a serpent, he turned back retreating and did not return: O Musa! fear not; surely the messengers shall not fear in My presence;","translation_id":"Dan lemparkanlah tongkatmu!” Maka ketika (tongkat itu menjadi ular dan) Musa melihatnya bergerak-gerak seperti seekor ular yang gesit, larilah dia berbalik ke belakang tanpa menoleh. ”Wahai Musa! Jangan takut! Sesungguhnya di hadapan-Ku, para rasul tidak perlu takut,","hasanah_per_verse":740},{"text_madani":"إِلَّا مَن ظَلَمَ ثُمَّ بَدَّلَ حُسْنًا بَعْدَ سُوءٍ فَإِنِّي غَفُورٌ رَّحِيمٌ","text_tajweed":"إِلَّا مَ[f:8211[ن ظ]َلَمَ ثُ[g[مّ]َ بَدَّلَ حُسْن[i:9900[َۢا ب]َعْدَ س[o[ُو]ٓ[f:9901[ءٍ ف]َإِ[g[نّ]ِى غَفُو[u:890[رٌ ر]َّح[p[ِي]مٌ","translation_en":"Neither he who has been unjust, then he does good instead after evil, for surely I am the Forgiving, the Merciful:","translation_id":"kecuali orang yang berlaku zhalim yang kemudian mengubah (dirinya) dengan kebaikan setelah kejahatan (bertobat); maka sungguh, Aku Maha Pengampun, Maha Penyayang.","hasanah_per_verse":350},{"text_madani":"وَأَدْخِلْ يَدَكَ فِي جَيْبِكَ تَخْرُجْ بَيْضَاءَ مِنْ غَيْرِ سُوءٍ ۖ فِي تِسْعِ آيَاتٍ إِلَىٰ فِرْعَوْنَ وَقَوْمِهِ ۚ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ","text_tajweed":"وَأَ[q:9902[دْ]خِلْ يَدَكَ فِى جَيْبِكَ تَخْرُ[q:8461[جْ] بَيْض[o[َا]ٓءَ مِنْ غَيْرِ س[o[ُو]ٓ[f:9903[ءٍ‌ۖ ف]ِى تِسْعِ ءَايَ[n[ـٰ]تٍ إِلَىٰ فِرْعَوْنَ وَقَوْمِه[o[ِۦٓ‌ۚ] إِ[g[نّ]َهُمْ كَانُو[s[اْ] قَوْ[f:5652[مًا ف]َ[n[ـٰ]سِق[p[ِي]نَ","translation_en":"And enter your hand into the opening of your bosom, it shall come forth white without evil; among nine signs to Firon and his people, surely they are a transgressing people.","translation_id":"Dan masukkanlah tanganmu ke leher bajumu, niscaya ia akan keluar menjadi putih (bersinar) tanpa cacat. (Kedua mukjizat ini) termasuk sembilan macam mukjizat (yang akan dikemukakan) kepada Fir‘aun dan kaumnya. Mereka benar-benar orang-orang yang fasik.”","hasanah_per_verse":720},{"text_madani":"فَلَمَّا جَاءَتْهُمْ آيَاتُنَا مُبْصِرَةً قَالُوا هَٰذَا سِحْرٌ مُّبِينٌ","text_tajweed":"فَلَ[g[مّ]َا ج[o[َا]ٓءَتْهُمْ ءَايَ[n[ـٰ]تُنَا مُ[q:7692[بْ]صِرَ[f:9904[ةً ق]َالُو[s[اْ] هَ[n[ـٰ]ذَا سِحْ[a:3879[رٌ م]ُّب[p[ِي]نٌ","translation_en":"So when Our clear signs came to them, they said: This is clear enchantment.","translation_id":"Maka ketika mukjizat-mukjizat Kami yang terang itu sampai kepada mereka, mereka berkata, “Ini sihir yang nyata.”","hasanah_per_verse":360},{"text_madani":"وَجَحَدُوا بِهَا وَاسْتَيْقَنَتْهَا أَنفُسُهُمْ ظُلْمًا وَعُلُوًّا ۚ فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُفْسِدِينَ","text_tajweed":"وَجَحَدُو[s[اْ] بِهَا وَ[h:9905[ٱ]سْتَيْقَنَتْه[o[َآ] أَ[f:2341[نف]ُسُهُمْ ظُلْ[a:9906[مًا و]َعُلُو[f:9907[ًّا‌ۚ ف]َ[h:1513[ٱ][f:1513[نظ]ُرْ كَيْفَ كَانَ عَ[n[ـٰ]قِبَةُ [h:4852[ٱ]لْمُفْسِد[p[ِي]نَ","translation_en":"And they denied them unjustly and proudly while their soul had been convinced of them; consider, then how was the end of the mischief-makers.","translation_id":"Dan mereka mengingkarinya karena kezhaliman dan kesombongannya, padahal hati mereka meyakini (kebenaran)nya. Maka perhatikanlah bagaimana kesudahan orang-orang yang berbuat kerusakan.","hasanah_per_verse":580},{"text_madani":"وَلَقَدْ آتَيْنَا دَاوُودَ وَسُلَيْمَانَ عِلْمًا ۖ وَقَالَا الْحَمْدُ لِلَّهِ الَّذِي فَضَّلَنَا عَلَىٰ كَثِيرٍ مِّنْ عِبَادِهِ الْمُؤْمِنِينَ","text_tajweed":"وَلَقَ[q:341[دْ] ءَاتَيْنَا دَاوُ[n[ۥ]دَ وَسُلَيْمَ[n[ـٰ]نَ عِلْ[a:9908[مًا‌ۖ و]َقَالَا [h:9909[ٱ]لْحَمْدُ لِلَّهِ [h:3912[ٱ]لَّذِى فَضَّلَنَا عَلَىٰ كَثِي[a:3126[رٍ م]ِّنْ عِبَادِهِ [h:9910[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"And certainly We gave knowledge to Dawood and Sulaiman, and they both said: Praise be to Allah, Who has made us to excel many of His believing servants.","translation_id":"Dan sungguh, Kami telah memberikan ilmu kepada Dawud dan Sulaiman; dan keduanya berkata, “Segala puji bagi Allah yang melebihkan kami dari banyak hamba-hamba-Nya yang beriman.”","hasanah_per_verse":690},{"text_madani":"وَوَرِثَ سُلَيْمَانُ دَاوُودَ ۖ وَقَالَ يَا أَيُّهَا النَّاسُ عُلِّمْنَا مَنطِقَ الطَّيْرِ وَأُوتِينَا مِن كُلِّ شَيْءٍ ۖ إِنَّ هَٰذَا لَهُوَ الْفَضْلُ الْمُبِينُ","text_tajweed":"وَوَرِثَ سُلَيْمَ[n[ـٰ]نُ دَاوُ[n[ۥ]دَ‌ۖ وَقَالَ يَ[o[ـٰٓ]أَيُّهَا [h:82[ٱ][l[ل][g[نّ]َاسُ عُلِّمْنَا مَ[f:9911[نط]ِقَ [h:9912[ٱ][l[ل]طَّيْرِ وَأُوتِينَا مِ[f:843[ن ك]ُلِّ شَىْءٍ‌ۖ إِ[g[نّ]َ هَ[n[ـٰ]ذَا لَهُوَ [h:9913[ٱ]لْفَضْلُ [h:9914[ٱ]لْمُب[p[ِي]نُ","translation_en":"And Sulaiman was Dawood's heir, and he said: O men! we have been taught the language of birds, and we have been given all things; most surely this is manifest grace.","translation_id":"Dan Sulaiman telah mewarisi Dawud, dan dia (Sulaiman) berkata, “Wahai manusia! Kami telah diajari bahasa burung dan kami diberi segala sesuatu. Sungguh, (semua) ini benar-benar karunia yang nyata.”","hasanah_per_verse":770},{"text_madani":"وَحُشِرَ لِسُلَيْمَانَ جُنُودُهُ مِنَ الْجِنِّ وَالْإِنسِ وَالطَّيْرِ فَهُمْ يُوزَعُونَ","text_tajweed":"وَحُشِرَ لِسُلَيْمَ[n[ـٰ]نَ جُنُودُهُ[n[ۥ] مِنَ [h:4673[ٱ]لْجِ[g[نّ]ِ وَ[h:4418[ٱ]لْإِ[f:4418[نس]ِ وَ[h:9915[ٱ][l[ل]طَّيْرِ فَهُمْ يُوزَع[p[ُو]نَ","translation_en":"And his hosts of the jinn and the men and the birds were gathered to him, and they were formed into groups.","translation_id":"Dan untuk Sulaiman dikumpulkan bala tentaranya dari jin, manusia dan burung, lalu mereka berbaris dengan tertib.","hasanah_per_verse":430},{"text_madani":"حَتَّىٰ إِذَا أَتَوْا عَلَىٰ وَادِ النَّمْلِ قَالَتْ نَمْلَةٌ يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ وَهُمْ لَا يَشْعُرُونَ","text_tajweed":"حَتَّ[o[ىٰٓ] إِذ[o[َآ] أَتَوْ[s[اْ] عَلَىٰ وَادِ [h:9916[ٱ][l[ل][g[نّ]َمْلِ قَالَتْ نَمْلَ[a:9917[ةٌ ي]َ[o[ـٰٓ]أَيُّهَا [h:9918[ٱ][l[ل][g[نّ]َمْلُ [h:9919[ٱ][q:278[دْ]خُلُو[s[اْ] مَسَ[n[ـٰ]كِنَكُمْ لَا يَحْطِمَ[g[نّ]َكُمْ سُلَيْمَ[n[ـٰ]نُ وَجُنُودُهُ[n[ۥ] وَهُمْ لَا يَشْعُر[p[ُو]نَ","translation_en":"Until when they came to the valley of the Naml, a Namlite said: O Naml! enter your houses, (that) Sulaiman and his hosts may not crush you while they do not know.","translation_id":"Hingga ketika mereka sampai di lembah semut, berkatalah seekor semut, “Wahai semut-semut! Masuklah ke dalam sarang-sarangmu, agar kamu tidak diinjak oleh Sulaiman dan bala tentaranya, sedangkan mereka tidak menyadari.”","hasanah_per_verse":850},{"text_madani":"فَتَبَسَّمَ ضَاحِكًا مِّن قَوْلِهَا وَقَالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ","text_tajweed":"فَتَبَسَّمَ ضَاحِ[a:9920[كًا م]ِّ[f:9921[ن ق]َوْلِهَا وَقَالَ رَبِّ أَوْزِعْن[o[ِىٓ] أَنْ أَشْكُرَ نِعْمَتَكَ [h:9922[ٱ]لَّت[o[ِىٓ] أَنْعَمْتَ عَلَىَّ وَعَلَىٰ و[n[َٲ]لِدَىَّ وَأَنْ أَعْمَلَ صَ[n[ـٰ]لِ[f:9923[حًا ت]َرْضَ[n[ـٰ]هُ وَأَ[q:9924[دْ]خِلْنِى بِرَحْمَتِكَ فِى عِبَادِكَ [h:9925[ٱ][l[ل]صَّ[n[ـٰ]لِح[p[ِي]نَ","translation_en":"So he smiled, wondering at her word, and said: My Lord! grant me that I should be grateful for Thy favor which Thou hast bestowed on me and on my parents, and that I should do good such as Thou art pleased with, and make me enter, by Thy mercy, into Thy servants, the good ones.","translation_id":"Maka dia (Sulaiman) tersenyum lalu tertawa karena (mendengar) perkataan semut itu. Dan dia berdoa, “Ya Tuhanku, anugerahkanlah aku ilham untuk tetap mensyukuri nikmat-Mu yang telah Engkau anugerahkan kepadaku dan kepada kedua orang tuaku dan agar aku mengerjakan kebajikan yang Engkau ridhai; dan masukkanlah aku dengan rahmat-Mu ke dalam golongan hamba-hamba-Mu yang shalih.”","hasanah_per_verse":1060},{"text_madani":"وَتَفَقَّدَ الطَّيْرَ فَقَالَ مَا لِيَ لَا أَرَى الْهُدْهُدَ أَمْ كَانَ مِنَ الْغَائِبِينَ","text_tajweed":"وَتَفَقَّدَ [h:9926[ٱ][l[ل]طَّيْرَ فَقَالَ مَا لِىَ ل[o[َآ] أَرَى [h:9927[ٱ]لْهُ[q:9928[دْ]هُدَ أَمْ كَانَ مِنَ [h:9929[ٱ]لْغ[o[َا]ٓئِب[p[ِي]نَ","translation_en":"And he reviewed the birds, then said: How is it I see not the hoopoe or is it that he is of the absentees?","translation_id":"Dan dia memeriksa burung-burung lalu berkata, “Mengapa aku tidak melihat Hud-hud, apakah ia termasuk yang tidak hadir?","hasanah_per_verse":440},{"text_madani":"لَأُعَذِّبَنَّهُ عَذَابًا شَدِيدًا أَوْ لَأَذْبَحَنَّهُ أَوْ لَيَأْتِيَنِّي بِسُلْطَانٍ مُّبِينٍ","text_tajweed":"لَأُعَذِّبَ[g[نّ]َهُ[n[ۥ] عَذَا[f:1966[بًا ش]َدِيدًا أَوْ لَأَ[s[اْ]ذْبَحَ[g[نّ]َهُ[o[ۥٓ] أَوْ لَيَأْتِيَ[g[نّ]ِى بِسُلْطَ[n[ـٰ][a:7067[نٍ م]ُّب[p[ِي]نٍ","translation_en":"I will most certainly punish him with a severe punishment, or kill him, or he shall bring to me a clear plea.","translation_id":"Pasti akan kuhukum ia dengan hukuman yang berat atau kusembelih ia, kecuali jika ia datang kepadaku dengan alasan yang jelas.”","hasanah_per_verse":450},{"text_madani":"فَمَكَثَ غَيْرَ بَعِيدٍ فَقَالَ أَحَطتُ بِمَا لَمْ تُحِطْ بِهِ وَجِئْتُكَ مِن سَبَإٍ بِنَبَإٍ يَقِينٍ","text_tajweed":"فَمَكَثَ غَيْرَ بَعِي[f:9930[دٍ ف]َقَالَ أَحَطتُ بِمَا لَمْ تُحِ[q:8160[طْ] بِه[n[ِۦ] وَجِئْتُكَ مِ[f:9931[ن س]َبَ[i:9932[إِۭ ب]ِنَبَ[a:9933[إٍ ي]َق[p[ِي]نٍ","translation_en":"And he tarried not long, then said: I comprehend that which you do not comprehend and I have brought to you a sure information from Sheba.","translation_id":"Maka tidak lama kemudian (datanglah Hud-hud), lalu ia berkata, “Aku telah mengetahui sesuatu yang belum engkau ketahui. Aku datang kepadamu dari negeri Saba' membawa suatu berita yang meyakinkan.","hasanah_per_verse":470},{"text_madani":"إِنِّي وَجَدتُّ امْرَأَةً تَمْلِكُهُمْ وَأُوتِيَتْ مِن كُلِّ شَيْءٍ وَلَهَا عَرْشٌ عَظِيمٌ","text_tajweed":"إِ[g[نّ]ِى وَجَ[d:9934[د]تُّ [h:9935[ٱ]مْرَأَ[f:9936[ةً ت]َمْلِكُهُمْ وَأُوتِيَتْ مِ[f:843[ن ك]ُلِّ ش[a:9937[َىْءٍ و]َلَهَا عَرْشٌ عَظ[p[ِي]مٌ","translation_en":"Surely I found a woman ruling over them, and she has been given abundance and she has a mighty throne:","translation_id":"Sungguh, kudapati ada seorang perempuan yang memerintah mereka, dan dia dianugerahi segala sesuatu serta memiliki singgasana yang besar.","hasanah_per_verse":420},{"text_madani":"وَجَدتُّهَا وَقَوْمَهَا يَسْجُدُونَ لِلشَّمْسِ مِن دُونِ اللَّهِ وَزَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ فَهُمْ لَا يَهْتَدُونَ","text_tajweed":"وَجَ[d:9938[د]تُّهَا وَقَوْمَهَا يَسْجُدُونَ لِلشَّمْسِ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ وَزَيَّنَ لَهُمُ [h:4046[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ أَعْمَ[n[ـٰ]لَهُمْ فَصَدَّهُمْ عَنِ [h:6998[ٱ][l[ل]سَّبِيلِ فَهُمْ لَا يَهْتَد[p[ُو]نَ","translation_en":"I found her and her people adoring the sun instead of Allah, and the Shaitan has made their deeds fair-seeming to them and thus turned them from the way, so they do not go aright","translation_id":"Aku (burung Hud) dapati dia dan kaumnya menyembah matahari, bukan kepada Allah; dan setan telah menjadikan terasa indah bagi mereka perbuatan-perbuatan (buruk) mereka, sehingga menghalangi mereka dari jalan (Allah), maka mereka tidak mendapat petunjuk,","hasanah_per_verse":770},{"text_madani":"أَلَّا يَسْجُدُوا لِلَّهِ الَّذِي يُخْرِجُ الْخَبْءَ فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُخْفُونَ وَمَا تُعْلِنُونَ","text_tajweed":"أَلَّا يَسْجُدُو[s[اْ] لِلَّهِ [h:3912[ٱ]لَّذِى يُخْرِجُ [h:9939[ٱ]لْخَ[q:9940[بْ]ءَ فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ وَيَعْلَمُ مَا تُخْفُونَ وَمَا تُعْلِن[p[ُو]نَ","translation_en":"That they do not make obeisance to Allah, Who brings forth what is hidden in the heavens and the earth and knows what you hide and what you make manifest:","translation_id":"mereka (juga) tidak menyembah Allah yang mengeluarkan apa yang terpendam di langit dan di bumi dan yang mengetahui apa yang kamu sembunyikan dan yang kamu nyatakan.","hasanah_per_verse":620},{"text_madani":"اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ رَبُّ الْعَرْشِ الْعَظِيمِ","text_tajweed":"ٱللَّهُ ل[o[َآ] إِلَ[n[ـٰ]هَ إِلَّا هُوَ رَبُّ [h:5930[ٱ]لْعَرْشِ [h:5931[ٱ]لْعَظِ[p[ي]مِ ۩","translation_en":"Allah, there is no god but He: He is the Lord of mighty power.","translation_id":"Allah, tidak ada tuhan melainkan Dia, Tuhan yang mempunyai ‘Arsy yang agung.”","hasanah_per_verse":270},{"text_madani":"قَالَ سَنَنظُرُ أَصَدَقْتَ أَمْ كُنتَ مِنَ الْكَاذِبِينَ","text_tajweed":"۞ قَالَ سَنَ[f:9941[نظ]ُرُ أَصَدَ[q:9942[قْ]تَ أَمْ كُ[f:735[نت]َ مِنَ [h:4785[ٱ]لْكَ[n[ـٰ]ذِب[p[ِي]نَ","translation_en":"He said: We will see whether you have told the truth or whether you are of the liars:","translation_id":"Dia (Sulaiman) berkata, “Akan kami lihat, apa kamu benar, atau termasuk yang berdusta.","hasanah_per_verse":280},{"text_madani":"اذْهَب بِّكِتَابِي هَٰذَا فَأَلْقِهْ إِلَيْهِمْ ثُمَّ تَوَلَّ عَنْهُمْ فَانظُرْ مَاذَا يَرْجِعُونَ","text_tajweed":"ٱذْهَب بِّكِتَ[n[ـٰ]بِى هَ[n[ـٰ]ذَا فَأَلْقِهْ إِلَيْهِمْ ثُ[g[مّ]َ تَوَلَّ عَنْهُمْ فَ[h:1513[ٱ][f:1513[نظ]ُرْ مَاذَا يَرْجِع[p[ُو]نَ","translation_en":"Take this my letter and hand it over to them, then turn away from them and see what (answer) they return.","translation_id":"Pergilah dengan (membawa) suratku ini, lalu jatuhkanlah kepada mereka, kemudian berpalinglah dari mereka, lalu perhatikanlah apa yang mereka bicarakan.”","hasanah_per_verse":470},{"text_madani":"قَالَتْ يَا أَيُّهَا الْمَلَأُ إِنِّي أُلْقِيَ إِلَيَّ كِتَابٌ كَرِيمٌ","text_tajweed":"قَالَتْ يَ[o[ـٰٓ]أَيُّهَا [h:9943[ٱ]لْمَلَؤُ[s[اْ] إِ[g[نّ][o[ِىٓ] أُلْقِىَ إِلَىَّ كِتَ[n[ـٰ][f:9944[بٌ ك]َر[p[ِي]مٌ","translation_en":"She said: O chief! surely an honorable letter has been delivered to me","translation_id":"Dia (Balqis) berkata, “Wahai para pembesar! Sesungguhnya telah disampaikan kepadaku sebuah surat yang mulia.”","hasanah_per_verse":330},{"text_madani":"إِنَّهُ مِن سُلَيْمَانَ وَإِنَّهُ بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ","text_tajweed":"إِ[g[نّ]َهُ[n[ۥ] مِ[f:9945[ن س]ُلَيْمَ[n[ـٰ]نَ وَإِ[g[نّ]َهُ[n[ۥ] بِسْمِ [h:6335[ٱ]للَّهِ [h:9946[ٱ][l[ل]رَّحْمَ[n[ـٰ]نِ [h:3[ٱ][l[ل]رَّح[p[ِي]مِ","translation_en":"Surely it is from Sulaiman, and surely it is in the name of Allah, the Beneficent, the Merciful;","translation_id":"Sesungguhnya (surat) itu dari Sulaiman yang isinya, “Dengan nama Allah Yang Maha Pengasih, Maha Penyayang,","hasanah_per_verse":340},{"text_madani":"أَلَّا تَعْلُوا عَلَيَّ وَأْتُونِي مُسْلِمِينَ","text_tajweed":"أَلَّا تَعْلُو[s[اْ] عَلَىَّ وَأْتُونِى مُسْلِم[p[ِي]نَ","translation_en":"Saying: exalt not yourselves against me and come to me in submission.","translation_id":"janganlah engkau berlaku sombong terhadapku dan datanglah kepadaku sebagai orang-orang yang berserah diri.”","hasanah_per_verse":230},{"text_madani":"قَالَتْ يَا أَيُّهَا الْمَلَأُ أَفْتُونِي فِي أَمْرِي مَا كُنتُ قَاطِعَةً أَمْرًا حَتَّىٰ تَشْهَدُونِ","text_tajweed":"قَالَتْ يَ[o[ـٰٓ]أَيُّهَا [h:9943[ٱ]لْمَلَؤُ[s[اْ] أَفْتُونِى ف[o[ِىٓ] أَمْرِى مَا كُ[f:2917[نت]ُ قَاطِعَةً أَمْرًا حَتَّىٰ تَشْهَد[p[ُو]نِ","translation_en":"She said: O chiefs! give me advice respecting my affair: I never decide an affair until you are in my presence.","translation_id":"Dia (Balqis) berkata, “Wahai para pembesar! Berilah aku pertimbangan dalam perkaraku (ini). Aku tidak pernah memutuskan suatu perkara sebelum kamu hadir dalam majelis(ku).”","hasanah_per_verse":500},{"text_madani":"قَالُوا نَحْنُ أُولُو قُوَّةٍ وَأُولُو بَأْسٍ شَدِيدٍ وَالْأَمْرُ إِلَيْكِ فَانظُرِي مَاذَا تَأْمُرِينَ","text_tajweed":"قَالُو[s[اْ] نَحْنُ أُ[s[وْ]لُو[s[اْ] قُوَّ[a:9947[ةٍ و]َأُ[s[وْ]لُو[s[اْ] بَأْ[f:7663[سٍ ش]َدِي[a:9948[دٍ و]َ[h:4748[ٱ]لْأَمْرُ إِلَيْكِ فَ[h:9949[ٱ][f:9949[نظ]ُرِى مَاذَا تَأْمُر[p[ِي]نَ","translation_en":"They said: We are possessors of strength and possessors of mighty prowess, and the command is yours, therefore see what you will command.","translation_id":"Mereka menjawab, “Kita memiliki kekuatan dan keberanian yang luar biasa (untuk berperang), tetapi keputusan berada di tanganmu; maka pertimbangkanlah apa yang akan engkau perintahkan.”","hasanah_per_verse":530},{"text_madani":"قَالَتْ إِنَّ الْمُلُوكَ إِذَا دَخَلُوا قَرْيَةً أَفْسَدُوهَا وَجَعَلُوا أَعِزَّةَ أَهْلِهَا أَذِلَّةً ۖ وَكَذَٰلِكَ يَفْعَلُونَ","text_tajweed":"قَالَتْ إِ[g[نّ]َ [h:9950[ٱ]لْمُلُوكَ إِذَا دَخَلُو[s[اْ] قَرْيَةً أَفْسَدُوهَا وَجَعَل[o[ُوٓ][s[اْ] أَعِزَّةَ أَهْلِه[o[َآ] أَذِلَّ[a:9951[ةً‌ۖ و]َكَذ[n[َٲ]لِكَ يَفْعَل[p[ُو]نَ","translation_en":"She said: Surely the kings, when they enter a town, ruin it and make the noblest of its people to be low, and thus they (always) do;","translation_id":"Dia (Balqis) berkata, “Sesungguhnya raja-raja apabila menaklukkan suatu negeri, mereka tentu membinasakannya, dan menjadikan penduduknya yang mulia jadi hina; dan demikian yang akan mereka perbuat.","hasanah_per_verse":610},{"text_madani":"وَإِنِّي مُرْسِلَةٌ إِلَيْهِم بِهَدِيَّةٍ فَنَاظِرَةٌ بِمَ يَرْجِعُ الْمُرْسَلُونَ","text_tajweed":"وَإِ[g[نّ]ِى مُرْسِلَةٌ إِلَيْه[c:9952[ِم ب]ِهَدِيَّ[f:9953[ةٍ ف]َنَاظِرَ[i:9954[ةُۢ ب]ِمَ يَرْجِعُ [h:9955[ٱ]لْمُرْسَل[p[ُو]نَ","translation_en":"And surely I am going to send a present to them, and shall wait to see what (answer) do the messengers bring back.","translation_id":"Dan sungguh, aku akan mengirim utusan kepada mereka dengan (membawa) hadiah, dan (aku) akan menunggu apa yang akan dibawa kembali oleh para utusan itu.”","hasanah_per_verse":390},{"text_madani":"فَلَمَّا جَاءَ سُلَيْمَانَ قَالَ أَتُمِدُّونَنِ بِمَالٍ فَمَا آتَانِيَ اللَّهُ خَيْرٌ مِّمَّا آتَاكُم بَلْ أَنتُم بِهَدِيَّتِكُمْ تَفْرَحُونَ","text_tajweed":"فَلَ[g[مّ]َا ج[o[َا]ٓءَ سُلَيْمَ[n[ـٰ]نَ قَالَ أَتُمِدُّونَنِ بِمَا[f:9956[لٍ ف]َم[o[َآ] ءَاتَ[n[ـٰ]ن[n[ِۦ]َ [h:9957[ٱ]للَّهُ خَيْ[a:2365[رٌ م]ِّ[g[مّ][o[َآ] ءَاتَ[n[ـٰ]ك[c:9958[ُم ب]َلْ أَ[f:428[نت][c:9959[ُم ب]ِهَدِيَّتِكُمْ تَفْرَح[p[ُو]نَ","translation_en":"So when he came to Sulaiman, he said: What! will you help me with wealth? But what Allah has given me is better than what He has given you. Nay, you are exultant because of your present;","translation_id":"Maka ketika para (utusan itu) sampai kepada Sulaiman, dia (Sulaiman) berkata, “Apakah kamu akan memberi harta kepadaku? Apa yang Allah berikan kepadaku lebih baik daripada apa yang Allah berikan kepadamu; tetapi kamu merasa bangga dengan hadiahmu.","hasanah_per_verse":690},{"text_madani":"ارْجِعْ إِلَيْهِمْ فَلَنَأْتِيَنَّهُم بِجُنُودٍ لَّا قِبَلَ لَهُم بِهَا وَلَنُخْرِجَنَّهُم مِّنْهَا أَذِلَّةً وَهُمْ صَاغِرُونَ","text_tajweed":"ٱرْجِعْ إِلَيْهِمْ فَلَنَأْتِيَ[g[نّ]َه[c:9960[ُم ب]ِجُنُو[u:9961[دٍ ل]َّا قِبَلَ لَه[c:9962[ُم ب]ِهَا وَلَنُخْرِجَ[g[نّ]َه[w:9963[ُم م]ِّنْه[o[َآ] أَذِلَّ[a:9964[ةً و]َهُمْ صَ[n[ـٰ]غِر[p[ُو]نَ","translation_en":"Go back to them, so we will most certainly come to them with hosts which they shall have no power to oppose, and we will most certainly expel them therefrom in abasement, and they shall be in a state of ignominy.","translation_id":"Kembalilah kepada mereka! Sungguh, Kami pasti akan mendatangi mereka dengan bala tentara yang mereka tidak mampu melawannya, dan akan kami usir mereka dari negeri itu (Saba') secara terhina dan mereka akan menjadi (tawanan) yang hina dina.”","hasanah_per_verse":600},{"text_madani":"قَالَ يَا أَيُّهَا الْمَلَأُ أَيُّكُمْ يَأْتِينِي بِعَرْشِهَا قَبْلَ أَن يَأْتُونِي مُسْلِمِينَ","text_tajweed":"قَالَ يَ[o[ـٰٓ]أَيُّهَا [h:9943[ٱ]لْمَلَؤُ[s[اْ] أَيُّكُمْ يَأْتِينِى بِعَرْشِهَا قَ[q:3282[بْ]لَ أ[a:9965[َن ي]َأْتُونِى مُسْلِم[p[ِي]نَ","translation_en":"He said: O chiefs! which of you can bring to me her throne before they come to me in submission?","translation_id":"Dia (Sulaiman) berkata, “Wahai para pembesar! Siapakah di antara kamu yang sanggup membawa singgasananya kepadaku sebelum mereka datang kepadaku menyerahkan diri?”","hasanah_per_verse":470},{"text_madani":"قَالَ عِفْرِيتٌ مِّنَ الْجِنِّ أَنَا آتِيكَ بِهِ قَبْلَ أَن تَقُومَ مِن مَّقَامِكَ ۖ وَإِنِّي عَلَيْهِ لَقَوِيٌّ أَمِينٌ","text_tajweed":"قَالَ عِفْرِي[a:9966[تٌ م]ِّنَ [h:4673[ٱ]لْجِ[g[نّ]ِ أَنَا۟ ءَاتِيكَ بِه[n[ِۦ] قَ[q:3282[بْ]لَ أَ[f:5839[ن ت]َقُومَ م[a:9967[ِن م]َّقَامِكَ‌ۖ وَإِ[g[نّ]ِى عَلَيْهِ لَقَوِىٌّ أَم[p[ِي]نٌ","translation_en":"One audacious among the jinn said: I will bring it to you before you rise up from your place; and most surely I am strong (and) trusty for it.","translation_id":"‘Ifrit dari golongan jin berkata, “Akulah yang akan membawanya kepadamu sebelum engkau berdiri dari tempat dudukmu; dan sungguh, aku kuat melakukannya dan dapat dipercaya.”","hasanah_per_verse":550},{"text_madani":"قَالَ الَّذِي عِندَهُ عِلْمٌ مِّنَ الْكِتَابِ أَنَا آتِيكَ بِهِ قَبْلَ أَن يَرْتَدَّ إِلَيْكَ طَرْفُكَ ۚ فَلَمَّا رَآهُ مُسْتَقِرًّا عِندَهُ قَالَ هَٰذَا مِن فَضْلِ رَبِّي لِيَبْلُوَنِي أَأَشْكُرُ أَمْ أَكْفُرُ ۖ وَمَن شَكَرَ فَإِنَّمَا يَشْكُرُ لِنَفْسِهِ ۖ وَمَن كَفَرَ فَإِنَّ رَبِّي غَنِيٌّ كَرِيمٌ","text_tajweed":"قَالَ [h:9968[ٱ]لَّذِى عِ[f:719[ند]َهُ[n[ۥ] عِلْ[a:9969[مٌ م]ِّنَ [h:891[ٱ]لْكِتَ[n[ـٰ]بِ أَنَا۟ ءَاتِيكَ بِه[n[ِۦ] قَ[q:3282[بْ]لَ أ[a:9970[َن ي]َرْتَدَّ إِلَيْكَ طَرْفُكَ‌ۚ فَلَ[g[مّ]َا رَءَاهُ مُسْتَقِرًّا عِ[f:719[ند]َهُ[n[ۥ] قَالَ هَ[n[ـٰ]ذَا مِ[f:6655[ن ف]َضْلِ رَبِّى لِيَ[q:9971[بْ]لُوَن[o[ِىٓ] ءَأَشْكُرُ أَمْ أَكْفُرُ‌ۖ وَمَ[f:9972[ن ش]َكَرَ فَإِ[g[نّ]َمَا يَشْكُرُ لِنَفْسِه[n[ِۦ]‌ۖ وَمَ[f:662[ن ك]َفَرَ فَإِ[g[نّ]َ رَبِّى غَنِ[f:9973[ىٌّ ك]َر[p[ِي]مٌ","translation_en":"One who had the knowledge of the Book said: I will bring it to you in the twinkling of an eye. Then when he saw it settled beside him, he said: This is of the grace of my Lord that He may try me whether I am grateful or ungrateful; and whoever is grateful, he is grateful only for his own soul, and whoever is ungrateful, then surely my Lord is Self-sufficient, Honored.","translation_id":"Seorang yang mempunyai ilmu dari Kitab berkata, “Aku akan membawa singgasana itu kepadamu sebelum matamu berkedip.” Maka ketika dia (Sulaiman) melihat singgasana itu terletak di hadapannya, dia pun berkata, “Ini termasuk karunia Tuhanku untuk mengujiku, apakah aku bersyukur atau mengingkari (nikmat-Nya). Barangsiapa bersyukur, maka sesungguhnya dia bersyukur untuk (kebaikan) dirinya sendiri, dan barangsiapa ingkar, maka sesungguhnya Tuhanku Mahakaya, Mahamulia.”","hasanah_per_verse":1360},{"text_madani":"قَالَ نَكِّرُوا لَهَا عَرْشَهَا نَنظُرْ أَتَهْتَدِي أَمْ تَكُونُ مِنَ الَّذِينَ لَا يَهْتَدُونَ","text_tajweed":"قَالَ نَكِّرُو[s[اْ] لَهَا عَرْشَهَا نَ[f:9974[نظ]ُرْ أَتَهْتَد[o[ِىٓ] أَمْ تَكُونُ مِنَ [h:523[ٱ]لَّذِينَ لَا يَهْتَد[p[ُو]نَ","translation_en":"He said: Alter her throne for her, we will see whether she follows the right way or is of those who do not go aright.","translation_id":"Dia (Sulaiman) berkata, “Ubahlah untuknya singgasananya; kita akan melihat apakah dia (Balqis) mengenal; atau tidak mengenalnya lagi.”","hasanah_per_verse":470},{"text_madani":"فَلَمَّا جَاءَتْ قِيلَ أَهَٰكَذَا عَرْشُكِ ۖ قَالَتْ كَأَنَّهُ هُوَ ۚ وَأُوتِينَا الْعِلْمَ مِن قَبْلِهَا وَكُنَّا مُسْلِمِينَ","text_tajweed":"فَلَ[g[مّ]َا ج[o[َا]ٓءَتْ قِيلَ أَهَ[n[ـٰ]كَذَا عَرْشُكِ‌ۖ قَالَتْ كَأَ[g[نّ]َهُ[n[ۥ] هُوَ‌ۚ وَأُوتِينَا [h:9975[ٱ]لْعِلْمَ مِ[f:6977[ن ق]َ[q:6978[بْ]لِهَا وَكُ[g[نّ]َا مُسْلِم[p[ِي]نَ","translation_en":"So when she came, it was said: Is your throne like this? She said: It is as it were the same, and we were given the knowledge before it, and we were submissive.","translation_id":"Maka ketika dia (Balqis) datang, ditanyakanlah (kepadanya), “Serupa inikah singgasanamu?” Dia (Balqis) menjawab, “Seakan-akan itulah dia.” (Dan dia Balqis berkata), “Kami telah diberi pengetahuan sebelumnya dan kami adalah orang-orang yang berserah diri (kepada Allah).”","hasanah_per_verse":590},{"text_madani":"وَصَدَّهَا مَا كَانَت تَّعْبُدُ مِن دُونِ اللَّهِ ۖ إِنَّهَا كَانَتْ مِن قَوْمٍ كَافِرِينَ","text_tajweed":"وَصَدَّهَا مَا كَانَت تَّعْبُدُ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ‌ۖ إِ[g[نّ]َهَا كَانَتْ مِ[f:3024[ن ق]َوْ[f:4873[مٍ ك]َ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"And what she worshipped besides Allah prevented her, surely she was of an unbelieving people.","translation_id":"Dan kebiasaannya menyembah selain Allah mencegahnya (untuk melahirkan keislamannya), sesungguhnya dia (Balqis) dahulu termasuk orang-orang kafir.","hasanah_per_verse":430},{"text_madani":"قِيلَ لَهَا ادْخُلِي الصَّرْحَ ۖ فَلَمَّا رَأَتْهُ حَسِبَتْهُ لُجَّةً وَكَشَفَتْ عَن سَاقَيْهَا ۚ قَالَ إِنَّهُ صَرْحٌ مُّمَرَّدٌ مِّن قَوَارِيرَ ۗ قَالَتْ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي وَأَسْلَمْتُ مَعَ سُلَيْمَانَ لِلَّهِ رَبِّ الْعَالَمِينَ","text_tajweed":"قِيلَ لَهَا [h:9976[ٱ][q:9977[دْ]خُلِى [h:9978[ٱ][l[ل]صَّرْحَ‌ۖ فَلَ[g[مّ]َا رَأَتْهُ حَسِبَتْهُ لُجَّ[a:9979[ةً و]َكَشَفَتْ عَ[f:9980[ن س]َاقَيْهَا‌ۚ قَالَ إِ[g[نّ]َهُ[n[ۥ] صَرْ[a:9981[حٌ م]ُّمَرَّ[a:9982[دٌ م]ِّ[f:9983[ن ق]َوَارِيرَ‌ۗ قَالَتْ رَبِّ إِ[g[نّ]ِى ظَلَمْتُ نَفْسِى وَأَسْلَمْتُ مَعَ سُلَيْمَ[n[ـٰ]نَ لِلَّهِ رَبِّ [h:4[ٱ]لْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"It was said to her: Enter the palace; but when she saw it she deemed it to be a great expanse of water, and bared her legs. He said: Surely it is a palace made smooth with glass. She said: My Lord! surely I have been unjust to myself, and I submit with Sulaiman to Allah, the Lord of the worlds.","translation_id":"Dikatakan kepadanya (Balqis), “Masuklah ke dalam istana.” Maka ketika dia (Balqis) melihat (lantai istana) itu, dikiranya kolam air yang besar, dan disingkapkannya (penutup) kedua betisnya. Dia (Sulaiman) berkata, “Sesungguhnya ini hanyalah lantai istana yang dilapisi kaca.” Dia (Balqis) berkata, “Ya Tuhanku, sungguh, aku telah berbuat zhalim terhadap diriku. Aku berserah diri bersama Sulaiman kepada Allah, Tuhan seluruh alam.”","hasanah_per_verse":1100},{"text_madani":"وَلَقَدْ أَرْسَلْنَا إِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا أَنِ اعْبُدُوا اللَّهَ فَإِذَا هُمْ فَرِيقَانِ يَخْتَصِمُونَ","text_tajweed":"وَلَقَ[q:341[دْ] أَرْسَلْن[o[َآ] إِلَىٰ ثَمُودَ أَخَاهُمْ صَ[n[ـٰ]لِحًا أَنِ [h:3899[ٱ]عْبُدُو[s[اْ] [h:3704[ٱ]للَّهَ فَإِذَا هُمْ فَرِيقَانِ يَخْتَصِم[p[ُو]نَ","translation_en":"And certainly We sent to Samood their brother Salih, saying: Serve Allah; and lo! they became two sects quarrelling with each other.","translation_id":"Dan sungguh, Kami telah mengutus kepada (kaum) Tsamud saudara mereka yaitu Shalih (yang menyeru), “Sembahlah Allah!” Tetapi tiba-tiba mereka (menjadi) dua golongan yang bermusuhan.","hasanah_per_verse":580},{"text_madani":"قَالَ يَا قَوْمِ لِمَ تَسْتَعْجِلُونَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ ۖ لَوْلَا تَسْتَغْفِرُونَ اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ","text_tajweed":"قَالَ يَ[n[ـٰ]قَوْمِ لِمَ تَسْتَعْجِلُونَ بِ[h:4563[ٱ][l[ل]سَّيِّئَةِ قَ[q:3282[بْ]لَ [h:6889[ٱ]لْحَسَنَةِ‌ۖ لَوْلَا تَسْتَغْفِرُونَ [h:9984[ٱ]للَّهَ لَعَلَّكُمْ تُرْحَم[p[ُو]نَ","translation_en":"He said: O my people! why do you seek to hasten on the evil before the good? Why do you not ask forgiveness of Allah so that you may be dealt with mercifully?","translation_id":"Dia (Shalih) berkata, “Wahai kaumku! Mengapa kamu meminta disegerakan keburukan sebelum (kamu meminta) kebaikan? Mengapa kamu tidak memohon ampunan kepada Allah, agar kamu mendapat rahmat?”","hasanah_per_verse":610},{"text_madani":"قَالُوا اطَّيَّرْنَا بِكَ وَبِمَن مَّعَكَ ۚ قَالَ طَائِرُكُمْ عِندَ اللَّهِ ۖ بَلْ أَنتُمْ قَوْمٌ تُفْتَنُونَ","text_tajweed":"قَالُو[s[اْ] [h:9985[ٱ]طَّيَّرْنَا بِكَ وَبِم[a:9986[َن م]َّعَكَ‌ۚ قَالَ طَ[o[ـٰٓ]ئِرُكُمْ عِ[f:264[ند]َ [h:408[ٱ]للَّهِ‌ۖ بَلْ أَ[f:428[نت]ُمْ قَوْ[f:9987[مٌ ت]ُفْتَن[p[ُو]نَ","translation_en":"They said: We have met with ill luck on account of you and on account of those with you. He said: The cause of your evil fortune is with Allah; nay, you are a people who are tried.","translation_id":"Mereka menjawab, “Kami mendapat nasib yang malang disebabkan oleh kamu dan orang-orang yang bersamamu.” Dia (Shalih) berkata, “Nasibmu ada pada Allah (bukan kami yang menjadi sebab), tetapi kamu adalah kaum yang sedang diuji.”","hasanah_per_verse":510},{"text_madani":"وَكَانَ فِي الْمَدِينَةِ تِسْعَةُ رَهْطٍ يُفْسِدُونَ فِي الْأَرْضِ وَلَا يُصْلِحُونَ","text_tajweed":"وَكَانَ فِى [h:4932[ٱ]لْمَدِينَةِ تِسْعَةُ رَهْ[a:9988[طٍ ي]ُفْسِدُونَ فِى [h:44[ٱ]لْأَرْضِ وَلَا يُصْلِح[p[ُو]نَ","translation_en":"And there were in the city nine persons who made mischief in the land and did not act aright.","translation_id":"Dan di kota itu ada sembilan orang laki-laki yang berbuat kerusakan di bumi, mereka tidak melakukan perbaikan.","hasanah_per_verse":420},{"text_madani":"قَالُوا تَقَاسَمُوا بِاللَّهِ لَنُبَيِّتَنَّهُ وَأَهْلَهُ ثُمَّ لَنَقُولَنَّ لِوَلِيِّهِ مَا شَهِدْنَا مَهْلِكَ أَهْلِهِ وَإِنَّا لَصَادِقُونَ","text_tajweed":"قَالُو[s[اْ] تَقَاسَمُو[s[اْ] بِ[h:32[ٱ]للَّهِ لَنُبَيِّتَ[g[نّ]َهُ[n[ۥ] وَأَهْلَهُ[n[ۥ] ثُ[g[مّ]َ لَنَقُولَ[g[نّ]َ لِوَلِيِّه[n[ِۦ] مَا شَهِ[q:4421[دْ]نَا مَهْلِكَ أَهْلِه[n[ِۦ] وَإِ[g[نّ]َا لَصَ[n[ـٰ]دِق[p[ُو]نَ","translation_en":"They said: Swear to each other by Allah that we will certainly make a sudden attack on him and his family by night, then we will say to his heir: We did not witness the destruction of his family, and we are most surely truthful.","translation_id":"Mereka berkata, “Bersumpahlah kamu dengan (nama) Allah, bahwa kita pasti akan menyerang dia bersama keluarganya pada malam hari, kemudian kita akan mengatakan kepada ahli warisnya (bahwa) kita tidak menyaksikan kebinasaan keluarganya itu, dan sungguh, kita orang yang benar.”","hasanah_per_verse":680},{"text_madani":"وَمَكَرُوا مَكْرًا وَمَكَرْنَا مَكْرًا وَهُمْ لَا يَشْعُرُونَ","text_tajweed":"وَمَكَرُو[s[اْ] مَكْ[a:9989[رًا و]َمَكَرْنَا مَكْ[a:9990[رًا و]َهُمْ لَا يَشْعُر[p[ُو]نَ","translation_en":"And they planned a plan, and We planned a plan while they perceived not.","translation_id":"Dan mereka membuat tipu daya, dan Kami pun menyusun tipu daya, sedang mereka tidak menyadari.","hasanah_per_verse":310},{"text_madani":"فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ مَكْرِهِمْ أَنَّا دَمَّرْنَاهُمْ وَقَوْمَهُمْ أَجْمَعِينَ","text_tajweed":"فَ[h:9999[ٱ][f:1513[نظ]ُرْ كَيْفَ كَانَ عَ[n[ـٰ]قِبَةُ مَكْرِهِمْ أَ[g[نّ]َا دَ[g[مّ]َرْنَ[n[ـٰ]هُمْ وَقَوْمَهُمْ أَ[q:825[جْ]مَع[p[ِي]نَ","translation_en":"See, then, how was the end of their plan that We destroyed them and their people, all (of them).","translation_id":"Maka perhatikanlah bagaimana akibat dari tipu daya mereka, bahwa Kami membinasakan mereka dan kaum mereka semuanya.","hasanah_per_verse":430},{"text_madani":"فَتِلْكَ بُيُوتُهُمْ خَاوِيَةً بِمَا ظَلَمُوا ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِّقَوْمٍ يَعْلَمُونَ","text_tajweed":"فَتِلْكَ بُيُوتُهُمْ خَاوِيَ[i:9991[ةَۢ ب]ِمَا ظَلَم[o[ُوٓ[s[اْ]‌ۗ] إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[u:7345[ةً ل]ِّقَوْ[a:1292[مٍ ي]َعْلَم[p[ُو]نَ","translation_en":"So those are their houses fallen down because they were unjust, most surely there is a sign in this for a people who know.","translation_id":"Maka itulah rumah-rumah mereka yang runtuh karena kezhaliman mereka. Sungguh, pada yang demikian itu benar-benar terdapat tanda (kekuasaan Allah) bagi orang-orang yang mengetahui.","hasanah_per_verse":440},{"text_madani":"وَأَنجَيْنَا الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ","text_tajweed":"وَأَ[f:9771[نج]َيْنَا [h:9992[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَكَانُو[s[اْ] يَتَّق[p[ُو]نَ","translation_en":"And We delivered those who believed and who guarded (against evil).","translation_id":"Dan Kami selamatkan orang-orang yang beriman dan mereka selalu bertakwa.","hasanah_per_verse":280},{"text_madani":"وَلُوطًا إِذْ قَالَ لِقَوْمِهِ أَتَأْتُونَ الْفَاحِشَةَ وَأَنتُمْ تُبْصِرُونَ","text_tajweed":"وَلُوطًا إِذْ قَالَ لِقَوْمِه[o[ِۦٓ] أَتَأْتُونَ [h:4827[ٱ]لْفَ[n[ـٰ]حِشَةَ وَأَ[f:98[نت]ُمْ تُ[q:8674[بْ]صِر[p[ُو]نَ","translation_en":"And (We sent) Lut, when he said to his people: What! do you commit indecency while you see?","translation_id":"Dan (ingatlah kisah) Luth, ketika dia berkata kepada kaumnya, “Mengapa kamu mengerjakan perbuatan fahisyah (keji), padahal kamu melihatnya (kekejian perbuatan maksiat itu)?”","hasanah_per_verse":390},{"text_madani":"أَئِنَّكُمْ لَتَأْتُونَ الرِّجَالَ شَهْوَةً مِّن دُونِ النِّسَاءِ ۚ بَلْ أَنتُمْ قَوْمٌ تَجْهَلُونَ","text_tajweed":"أَئِ[g[نّ]َكُمْ لَتَأْتُونَ [h:4830[ٱ][l[ل]رِّجَالَ شَهْوَ[a:4831[ةً م]ِّ[f:107[ن د]ُونِ [h:4832[ٱ][l[ل][g[نّ]ِس[o[َا]ٓءِ‌ۚ بَلْ أَ[f:428[نت]ُمْ قَوْ[f:4983[مٌ ت]َ[q:4984[جْ]هَل[p[ُو]نَ","translation_en":"What! do you indeed approach men lustfully rather than women? Nay, you are a people who act ignorantly.","translation_id":"Mengapa kamu mendatangi laki-laki untuk (memenuhi) syahwat(mu), bukan (mendatangi) perempuan? Sungguh, kamu adalah kaum yang tidak mengetahui (akibat perbuatanmu).","hasanah_per_verse":470},{"text_madani":"فَمَا كَانَ جَوَابَ قَوْمِهِ إِلَّا أَن قَالُوا أَخْرِجُوا آلَ لُوطٍ مِّن قَرْيَتِكُمْ ۖ إِنَّهُمْ أُنَاسٌ يَتَطَهَّرُونَ","text_tajweed":"۞ فَمَا كَانَ جَوَابَ قَوْمِه[o[ِۦٓ] إِلّ[o[َآ] أَ[f:2304[ن ق]َال[o[ُوٓ][s[اْ] أَخْرِج[o[ُوٓ][s[اْ] ءَالَ لُو[a:9993[طٍ م]ِّ[f:4835[ن ق]َرْيَتِكُمْ‌ۖ إِ[g[نّ]َهُمْ أُنَا[a:4836[سٌ ي]َتَطَهَّر[p[ُو]نَ","translation_en":"But the answer of his people was no other except that they ~s said: Turn out Lut's followers from your town; surely they are a people who would keep pure!","translation_id":"Jawaban kaumnya tidak lain hanya dengan mengatakan, “Usirlah Luth dan keluarganya dari negerimu; sesungguhnya mereka adalah orang-orang yang (menganggap dirinya) suci.”","hasanah_per_verse":580},{"text_madani":"فَأَنجَيْنَاهُ وَأَهْلَهُ إِلَّا امْرَأَتَهُ قَدَّرْنَاهَا مِنَ الْغَابِرِينَ","text_tajweed":"فَأَ[f:4779[نج]َيْنَ[n[ـٰ]هُ وَأَهْلَهُ[o[ۥٓ] إِلَّا [h:4837[ٱ]مْرَأَتَهُ[n[ۥ] قَدَّرْنَ[n[ـٰ]هَا مِنَ [h:4838[ٱ]لْغَ[n[ـٰ]بِر[p[ِي]نَ","translation_en":"But We delivered him and his followers except his wife; We ordained her to be of those who remained behind.","translation_id":"Maka Kami selamatkan dia dan keluarganya, kecuali istrinya. Kami telah menentukan dia termasuk orang-orang yang tertinggal (dibinasakan).","hasanah_per_verse":390},{"text_madani":"وَأَمْطَرْنَا عَلَيْهِم مَّطَرًا ۖ فَسَاءَ مَطَرُ الْمُنذَرِينَ","text_tajweed":"وَأَمْطَرْنَا عَلَيْه[w:4839[ِم م]َّطَ[f:9838[رًا‌ۖ ف]َس[o[َا]ٓءَ مَطَرُ [h:9839[ٱ]لْمُ[f:6137[نذ]َر[p[ِي]نَ","translation_en":"And We rained on them a rain, and evil was the rain of those who had been warned.","translation_id":"Dan Kami hujani mereka dengan hujan (batu), maka sangat buruklah hujan (yang ditimpakan) pada orang-orang yang diberi peringatan itu (tetapi tidak mengindahkan).","hasanah_per_verse":310},{"text_madani":"قُلِ الْحَمْدُ لِلَّهِ وَسَلَامٌ عَلَىٰ عِبَادِهِ الَّذِينَ اصْطَفَىٰ ۗ آللَّهُ خَيْرٌ أَمَّا يُشْرِكُونَ","text_tajweed":"قُلِ [h:9994[ٱ]لْحَمْدُ لِلَّهِ وَسَلَ[n[ـٰ]مٌ عَلَىٰ عِبَادِهِ [h:9995[ٱ]لَّذِينَ [h:9996[ٱ]صْطَفَ[o[ىٰٓ‌ۗ] ءَآللَّهُ خَيْرٌ أَ[g[مّ]َا يُشْرِك[p[ُو]نَ","translation_en":"Say: Praise be to Allah and peace on His servants whom He has chosen: is Allah better, or what they associate (with Him)?","translation_id":"Katakanlah (Muhammad), “Segala puji bagi Allah dan salam sejahtera atas hamba-hamba-Nya yang dipilih-Nya. Apakah Allah yang lebih baik, ataukah apa yang mereka persekutukan (dengan Dia)?”","hasanah_per_verse":490},{"text_madani":"أَمَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَأَنزَلَ لَكُم مِّنَ السَّمَاءِ مَاءً فَأَنبَتْنَا بِهِ حَدَائِقَ ذَاتَ بَهْجَةٍ مَّا كَانَ لَكُمْ أَن تُنبِتُوا شَجَرَهَا ۗ أَإِلَٰهٌ مَّعَ اللَّهِ ۚ بَلْ هُمْ قَوْمٌ يَعْدِلُونَ","text_tajweed":"أَ[g[مّ]َنْ خَلَقَ [h:3913[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ وَأَ[f:91[نز]َلَ لَك[w:1578[ُم م]ِّنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ م[o[َا]ٓ[f:9997[ءً ف]َأَ[i:9998[نۢب]َتْنَا بِه[n[ِۦ] حَد[o[َا]ٓئِقَ ذَاتَ بَهْجَ[a:9999[ةٍ م]َّا كَانَ لَكُمْ أَ[f:10000[ن ت]ُ[i:10001[نۢب]ِتُو[s[اْ] شَجَرَه[o[َآ‌ۗ] أَءِلَ[n[ـٰ][a:10002[هٌ م]َّعَ [h:3975[ٱ]للَّهِ‌ۚ بَلْ هُمْ قَوْ[a:10003[مٌ ي]َعْدِل[p[ُو]نَ","translation_en":"Nay, He Who created the heavens and the earth, and sent down for you water from the cloud; then We cause to grow thereby beautiful gardens; it is not possible for you that you should make the trees thereof to grow. Is there a god with Allah? Nay! they are people who deviate.","translation_id":"Bukankah Dia (Allah) yang menciptakan langit dan bumi dan yang menurunkan air dari langit untukmu, lalu Kami tumbuhkan dengan air itu kebun-kebun yang berpemandangan indah? Kamu tidak akan mampu menumbuhkan pohon-pohonnya. Apakah di samping Allah ada tuhan (yang lain)? Sebenarnya mereka adalah orang-orang yang menyimpang (dari kebenaran).","hasanah_per_verse":1040},{"text_madani":"أَمَّن جَعَلَ الْأَرْضَ قَرَارًا وَجَعَلَ خِلَالَهَا أَنْهَارًا وَجَعَلَ لَهَا رَوَاسِيَ وَجَعَلَ بَيْنَ الْبَحْرَيْنِ حَاجِزًا ۗ أَإِلَٰهٌ مَّعَ اللَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ","text_tajweed":"أَ[g[مّ]َ[f:10004[ن ج]َعَلَ [h:10005[ٱ]لْأَرْضَ قَرَا[a:10006[رًا و]َجَعَلَ خِلَ[n[ـٰ]لَه[o[َآ] أَنْهَ[n[ـٰ][a:10007[رًا و]َجَعَلَ لَهَا رَو[n[َٲ]سِىَ وَجَعَلَ بَيْنَ [h:10008[ٱ]لْبَحْرَيْنِ حَاجِزًا‌ۗ أَءِلَ[n[ـٰ][a:10002[هٌ م]َّعَ [h:3975[ٱ]للَّهِ‌ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَم[p[ُو]نَ","translation_en":"Or, Who made the earth a restingplace, and made in it rivers, and raised on it mountains and placed between the two seas a barrier. Is there a god with Allah? Nay! most of them do not know!","translation_id":"Bukankah Dia (Allah) yang telah menjadikan bumi sebagai tempat berdiam, yang menjadikan sungai-sungai di celah-celahnya, yang menjadikan gunung-gunung untuk (mengokohkan)nya dan yang menjadikan suatu pemisah antara dua laut? Apakah di samping Allah ada tuhan (yang lain)? Sebenarnya kebanyakan mereka tidak mengetahui.","hasanah_per_verse":890},{"text_madani":"أَمَّن يُجِيبُ الْمُضْطَرَّ إِذَا دَعَاهُ وَيَكْشِفُ السُّوءَ وَيَجْعَلُكُمْ خُلَفَاءَ الْأَرْضِ ۗ أَإِلَٰهٌ مَّعَ اللَّهِ ۚ قَلِيلًا مَّا تَذَكَّرُونَ","text_tajweed":"أَ[g[مّ][a:10009[َن ي]ُجِيبُ [h:10010[ٱ]لْمُضْطَرَّ إِذَا دَعَاهُ وَيَكْشِفُ [h:10011[ٱ][l[ل]سّ[o[ُو]ٓءَ وَيَ[q:10012[جْ]عَلُكُمْ خُلَف[o[َا]ٓءَ [h:10013[ٱ]لْأَرْضِ‌ۗ أَءِلَ[n[ـٰ][a:10002[هٌ م]َّعَ [h:3975[ٱ]للَّهِ‌ۚ قَلِيل[a:4583[اً م]َّا تَذَكَّر[p[ُو]نَ","translation_en":"Or, Who answers the distressed one when he calls upon Him and removes the evil, and He will make you successors in the earth. Is there a god with Allah? Little is it that you mind!","translation_id":"Bukankah Dia (Allah) yang memperkenankan (doa) orang yang dalam kesulitan apabila dia berdoa kepada-Nya, dan menghilangkan kesusahan dan menjadikan kamu (manusia) sebagai khalifah (pemimpin) di bumi? Apakah di samping Allah ada tuhan (yang lain)? Sedikit sekali (nikmat Allah) yang kamu ingat.","hasanah_per_verse":700},{"text_madani":"أَمَّن يَهْدِيكُمْ فِي ظُلُمَاتِ الْبَرِّ وَالْبَحْرِ وَمَن يُرْسِلُ الرِّيَاحَ بُشْرًا بَيْنَ يَدَيْ رَحْمَتِهِ ۗ أَإِلَٰهٌ مَّعَ اللَّهِ ۚ تَعَالَى اللَّهُ عَمَّا يُشْرِكُونَ","text_tajweed":"أَ[g[مّ][a:10014[َن ي]َهْدِيكُمْ فِى ظُلُمَ[n[ـٰ]تِ [h:4129[ٱ]لْبَرِّ وَ[h:4107[ٱ]لْبَحْرِ وَم[a:10015[َن ي]ُرْسِلُ [h:4755[ٱ][l[ل]رِّيَ[n[ـٰ]حَ بُشْر[i:4756[َۢا ب]َيْنَ يَدَىْ رَحْمَتِه[o[ِۦٓ‌ۗ] أَءِلَ[n[ـٰ][a:10002[هٌ م]َّعَ [h:3975[ٱ]للَّهِ‌ۚ تَعَ[n[ـٰ]لَى [h:10016[ٱ]للَّهُ عَ[g[مّ]َا يُشْرِك[p[ُو]نَ","translation_en":"Or, Who guides you in utter darkness of the land and the sea, and Who sends the winds as good news before His mercy. Is there a god with Allah? Exalted by Allah above what they associate (with Him).","translation_id":"Bukankah Dia (Allah) yang memberi petunjuk kepada kamu dalam kegelapan di daratan dan lautan dan yang mendatangkan angin sebagai kabar gembira sebelum (kedatangan) rahmat-Nya? Apakah di samping Allah ada tuhan (yang lain)? Mahatinggi Allah terhadap apa yang mereka persekutukan.","hasanah_per_verse":820},{"text_madani":"أَمَّن يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَمَن يَرْزُقُكُم مِّنَ السَّمَاءِ وَالْأَرْضِ ۗ أَإِلَٰهٌ مَّعَ اللَّهِ ۚ قُلْ هَاتُوا بُرْهَانَكُمْ إِن كُنتُمْ صَادِقِينَ","text_tajweed":"أَ[g[مّ][a:10017[َن ي]َ[q:5943[بْ]دَؤُ[s[اْ] [h:5944[ٱ]لْخَلْقَ ثُ[g[مّ]َ يُعِيدُهُ[n[ۥ] وَم[a:10018[َن ي]َرْزُقُك[w:6034[ُم م]ِّنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ وَ[h:177[ٱ]لْأَرْضِ‌ۗ أَءِلَ[n[ـٰ][a:10002[هٌ م]َّعَ [h:3975[ٱ]للَّهِ‌ۚ قُلْ هَاتُو[s[اْ] بُرْهَ[n[ـٰ]نَكُمْ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ صَ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"Or, Who originates the creation, then reproduces it and Who gives you sustenance from the heaven and the earth. Is there a god With Allah? Say: Bring your proof if you are truthful.","translation_id":"Bukankah Dia (Allah) yang menciptakan (makhluk) dari permulaannya, kemudian mengulanginya (lagi) dan yang memberikan rezeki kepadamu dari langit dan bumi? Apakah di samping Allah ada tuhan (yang lain)? Katakanlah, “Kemukakanlah bukti kebenaranmu, jika kamu orang yang benar.”","hasanah_per_verse":780},{"text_madani":"قُل لَّا يَعْلَمُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ الْغَيْبَ إِلَّا اللَّهُ ۚ وَمَا يَشْعُرُونَ أَيَّانَ يُبْعَثُونَ","text_tajweed":"قُل لَّا يَعْلَمُ مَ[f:2074[ن ف]ِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ [h:10019[ٱ]لْغَيْبَ إِلَّا [h:1742[ٱ]للَّهُ‌ۚ وَمَا يَشْعُرُونَ أَيَّانَ يُ[q:4606[بْ]عَث[p[ُو]نَ","translation_en":"Say: No one in the heavens and the earth knows the unseen but Allah; and they do not know when they shall be raised.","translation_id":"Katakanlah (Muhammad), “Tidak ada sesuatu pun di langit dan di bumi yang mengetahui perkara yang gaib, kecuali Allah. Dan mereka tidak mengetahui kapan mereka akan dibangkitkan.”","hasanah_per_verse":570},{"text_madani":"بَلِ ادَّارَكَ عِلْمُهُمْ فِي الْآخِرَةِ ۚ بَلْ هُمْ فِي شَكٍّ مِّنْهَا ۖ بَلْ هُم مِّنْهَا عَمُونَ","text_tajweed":"بَلِ [h:10020[ٱ]دّ[n[َٲ]رَكَ عِلْمُهُمْ فِى [h:536[ٱ]لْأَخِرَةِ‌ۚ بَلْ هُمْ فِى شَ[a:10021[كٍّ م]ِّنْهَا‌ۖ بَلْ ه[w:7261[ُم م]ِّنْهَا عَم[p[ُو]نَ","translation_en":"Nay, their knowledge respecting the hereafter is slight and hasty; nay, they are in doubt about it; nay, they are quite blind to it","translation_id":"Bahkan pengetahuan mereka tentang akhirat tidak sampai (ke sana). Bahkan mereka ragu-ragu tentangnya (akhirat itu). Bahkan mereka buta tentang itu.","hasanah_per_verse":440},{"text_madani":"وَقَالَ الَّذِينَ كَفَرُوا أَإِذَا كُنَّا تُرَابًا وَآبَاؤُنَا أَئِنَّا لَمُخْرَجُونَ","text_tajweed":"وَقَالَ [h:614[ٱ]لَّذِينَ كَفَر[o[ُوٓ][s[اْ] أَءِذَا كُ[g[نّ]َا تُر[n[َٲ][a:10022[بًا و]َءَاب[o[َا]ٓؤُن[o[َآ] أَئِ[g[نّ]َا لَمُخْرَج[p[ُو]نَ","translation_en":"And those who disbelieve say: What! when we have become dust and our fathers (too), shall we certainly be brought forth?","translation_id":"Dan orang-orang yang kafir berkata, “Setelah kita menjadi tanah dan (begitu pula) nenek moyang kita, apakah benar kita akan dikeluarkan (dari kubur)?","hasanah_per_verse":440},{"text_madani":"لَقَدْ وُعِدْنَا هَٰذَا نَحْنُ وَآبَاؤُنَا مِن قَبْلُ إِنْ هَٰذَا إِلَّا أَسَاطِيرُ الْأَوَّلِينَ","text_tajweed":"لَقَ[q:2389[دْ] وُعِ[q:9269[دْ]نَا هَ[n[ـٰ]ذَا نَحْنُ وَءَاب[o[َا]ٓؤُنَا مِ[f:128[ن ق]َ[q:129[بْ]لُ إِنْ هَ[n[ـٰ]ذ[o[َآ] إِلّ[o[َآ] أَسَ[n[ـٰ]طِيرُ [h:3993[ٱ]لْأَوَّل[p[ِي]نَ","translation_en":"We have certainly been promised this, we and our fathers before; these are naught but stories of the ancients","translation_id":"Sejak dahulu kami telah diberi ancaman dengan ini (hari kebangkitan); kami dan nenek moyang kami. Sebenarnya ini hanyalah dongeng orang-orang terdahulu.”","hasanah_per_verse":470},{"text_madani":"قُلْ سِيرُوا فِي الْأَرْضِ فَانظُرُوا كَيْفَ كَانَ عَاقِبَةُ الْمُجْرِمِينَ","text_tajweed":"قُلْ سِيرُو[s[اْ] فِى [h:44[ٱ]لْأَرْضِ فَ[h:2257[ٱ][f:2257[نظ]ُرُو[s[اْ] كَيْفَ كَانَ عَ[n[ـٰ]قِبَةُ [h:4841[ٱ]لْمُ[q:4093[جْ]رِم[p[ِي]نَ","translation_en":"Say: Travel in the earth, then see how was the end of the guilty.","translation_id":"Katakanlah (Muhammad), “Berjalanlah kamu di bumi, lalu perhatikanlah bagaimana kesudahan orang-orang yang berdosa.","hasanah_per_verse":400},{"text_madani":"وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُن فِي ضَيْقٍ مِّمَّا يَمْكُرُونَ","text_tajweed":"وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ[f:10023[ن ف]ِى ضَيْ[a:7646[قٍ م]ِّ[g[مّ]َا يَمْكُر[p[ُو]نَ","translation_en":"And grieve not for them and be not distressed because of what they plan.","translation_id":"Dan janganlah engkau bersedih hati terhadap mereka, dan janganlah (dadamu) merasa sempit terhadap upaya tipu daya mereka.”","hasanah_per_verse":320},{"text_madani":"وَيَقُولُونَ مَتَىٰ هَٰذَا الْوَعْدُ إِن كُنتُمْ صَادِقِينَ","text_tajweed":"وَيَقُولُونَ مَتَىٰ هَ[n[ـٰ]ذَا [h:6081[ٱ]لْوَعْدُ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ صَ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"And they say: When will this threat come to pass, if you are truthful?","translation_id":"Dan mereka (orang kafir) berkata, “Kapankah datangnya janji (azab) itu, jika kamu orang yang benar.”","hasanah_per_verse":300},{"text_madani":"قُلْ عَسَىٰ أَن يَكُونَ رَدِفَ لَكُم بَعْضُ الَّذِي تَسْتَعْجِلُونَ","text_tajweed":"قُلْ عَسَ[o[ىٰٓ] أ[a:3312[َن ي]َكُونَ رَدِفَ لَك[c:10024[ُم ب]َعْضُ [h:10025[ٱ]لَّذِى تَسْتَعْجِل[p[ُو]نَ","translation_en":"Say: Maybe there may have drawn near to you somewhat of that which you seek to hasten on.","translation_id":"Katakanlah (Muhammad), “Boleh jadi sebagian dari (azab) yang kamu minta disegerakan itu telah hampir sampai kepadamu.”","hasanah_per_verse":320},{"text_madani":"وَإِنَّ رَبَّكَ لَذُو فَضْلٍ عَلَى النَّاسِ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَشْكُرُونَ","text_tajweed":"وَإِ[g[نّ]َ رَبَّكَ لَذُو فَضْلٍ عَلَى [h:729[ٱ][l[ل][g[نّ]َاسِ وَلَ[n[ـٰ]كِ[g[نّ]َ أَكْثَرَهُمْ لَا يَشْكُر[p[ُو]نَ","translation_en":"And surely your Lord is the Lord of grace to men, but most of them are not grateful.","translation_id":"Dan sungguh, Tuhanmu benar-benar memiliki karunia (yang diberikan-Nya) kepada manusia, tetapi kebanyakan mereka tidak mensyukuri(nya).","hasanah_per_verse":380},{"text_madani":"وَإِنَّ رَبَّكَ لَيَعْلَمُ مَا تُكِنُّ صُدُورُهُمْ وَمَا يُعْلِنُونَ","text_tajweed":"وَإِ[g[نّ]َ رَبَّكَ لَيَعْلَمُ مَا تُكِ[g[نّ]ُ صُدُورُهُمْ وَمَا يُعْلِن[p[ُو]نَ","translation_en":"And most surely your Lord knows what their breasts conceal and what they manifest.","translation_id":"Dan sungguh, Tuhanmu mengetahui apa yang disembunyikan dalam dada mereka dan apa yang mereka nyatakan.","hasanah_per_verse":310},{"text_madani":"وَمَا مِنْ غَائِبَةٍ فِي السَّمَاءِ وَالْأَرْضِ إِلَّا فِي كِتَابٍ مُّبِينٍ","text_tajweed":"وَمَا مِنْ غ[o[َا]ٓئِبَ[f:10026[ةٍ ف]ِى [h:746[ٱ][l[ل]سَّم[o[َا]ٓءِ وَ[h:177[ٱ]لْأَرْضِ إِلَّا فِى كِتَ[n[ـٰ][a:4113[بٍ م]ُّب[p[ِي]نٍ","translation_en":"And there is nothing concealed in the heaven and the earth but it is in a clear book.","translation_id":"Dan tidak ada sesuatu pun yang tersembunyi di langit dan di bumi, melainkan (tercatat) dalam Kitab yang jelas (Lauh Mahfuzh).","hasanah_per_verse":370},{"text_madani":"إِنَّ هَٰذَا الْقُرْآنَ يَقُصُّ عَلَىٰ بَنِي إِسْرَائِيلَ أَكْثَرَ الَّذِي هُمْ فِيهِ يَخْتَلِفُونَ","text_tajweed":"إِ[g[نّ]َ هَ[n[ـٰ]ذَا [h:6544[ٱ]لْقُرْءَانَ يَقُصُّ عَلَىٰ بَن[o[ِىٓ] إِسْر[o[َٲ]ٓءِيلَ أَكْثَرَ [h:10027[ٱ]لَّذِى هُمْ فِيهِ يَخْتَلِف[p[ُو]نَ","translation_en":"Surely this Quran declares to the children of Israel most of what they differ in.","translation_id":"Sungguh, Al-Qur'an ini menjelaskan kepada Bani Israil sebagian besar dari (perkara) yang mereka perselisihkan.","hasanah_per_verse":470},{"text_madani":"وَإِنَّهُ لَهُدًى وَرَحْمَةٌ لِّلْمُؤْمِنِينَ","text_tajweed":"وَإِ[g[نّ]َهُ[n[ۥ] لَهُ[a:10028[دًى و]َرَحْمَ[u:6096[ةٌ ل]ِّلْمُؤْمِن[p[ِي]نَ","translation_en":"And most surely it is a guidance and a mercy for the believers.","translation_id":"Dan sungguh, (Al-Qur'an) itu benar-benar menjadi petunjuk dan rahmat bagi orang-orang yang beriman.","hasanah_per_verse":210},{"text_madani":"إِنَّ رَبَّكَ يَقْضِي بَيْنَهُم بِحُكْمِهِ ۚ وَهُوَ الْعَزِيزُ الْعَلِيمُ","text_tajweed":"إِ[g[نّ]َ رَبَّكَ يَ[q:6194[قْ]ضِى بَيْنَه[c:10029[ُم ب]ِحُكْمِه[n[ِۦ]‌ۚ وَهُوَ [h:7045[ٱ]لْعَزِيزُ [h:10030[ٱ]لْعَل[p[ِي]مُ","translation_en":"Surely your Lord will judge between them by his judgment, and He is the Mighty, the knowing.","translation_id":"Sungguh, Tuhanmu akan menyelesaikan (perkara) di antara mereka dengan hukum-Nya, dan Dia Mahaperkasa, Maha Mengetahui.","hasanah_per_verse":340},{"text_madani":"فَتَوَكَّلْ عَلَى اللَّهِ ۖ إِنَّكَ عَلَى الْحَقِّ الْمُبِينِ","text_tajweed":"فَتَوَكَّلْ عَلَى [h:412[ٱ]للَّهِ‌ۖ إِ[g[نّ]َكَ عَلَى [h:10031[ٱ]لْحَقِّ [h:10032[ٱ]لْمُب[p[ِي]نِ","translation_en":"Therefore rely on Allah; surely you are on the clear truth.","translation_id":"Maka bertawakallah kepada Allah, sungguh engkau (Muhammad) berada di atas kebenaran yang nyata.","hasanah_per_verse":280},{"text_madani":"إِنَّكَ لَا تُسْمِعُ الْمَوْتَىٰ وَلَا تُسْمِعُ الصُّمَّ الدُّعَاءَ إِذَا وَلَّوْا مُدْبِرِينَ","text_tajweed":"إِ[g[نّ]َكَ لَا تُسْمِعُ [h:10033[ٱ]لْمَوْتَىٰ وَلَا تُسْمِعُ [h:6070[ٱ][l[ل]صُّ[g[مّ]َ [h:10034[ٱ][l[ل]دُّع[o[َا]ٓءَ إِذَا وَلَّوْ[s[اْ] مُ[q:5528[دْ]بِر[p[ِي]نَ","translation_en":"Surely you do not make the dead to hear, and you do not make the deaf to hear the call when they go back retreating.","translation_id":"Sungguh, engkau tidak dapat menjadikan orang yang mati dapat mendengar dan (tidak pula) menjadikan orang yang tuli dapat mendengar seruan, apabila mereka telah berpaling ke belakang.","hasanah_per_verse":450},{"text_madani":"وَمَا أَنتَ بِهَادِي الْعُمْيِ عَن ضَلَالَتِهِمْ ۖ إِن تُسْمِعُ إِلَّا مَن يُؤْمِنُ بِآيَاتِنَا فَهُم مُّسْلِمُونَ","text_tajweed":"وَم[o[َآ] أَ[f:169[نت]َ بِهَ[n[ـٰ]دِى [h:10035[ٱ]لْعُمْىِ عَ[f:10036[ن ض]َلَ[n[ـٰ]لَتِهِمْ‌ۖ إِ[f:10037[ن ت]ُسْمِعُ إِلَّا م[a:5799[َن ي]ُؤْمِنُ بِـَٔـايَ[n[ـٰ]تِنَا فَه[w:10038[ُم م]ُّسْلِم[p[ُو]نَ","translation_en":"Nor can you be a guide to the blind out of their error; you cannot make to bear (any one) except those who believe in Our communications, so they submit.","translation_id":"Dan engkau tidak akan dapat memberi petunjuk orang buta dari kesesatannya. Engkau tidak dapat menjadikan (seorang pun) mendengar, kecuali orang-orang yang beriman kepada ayat-ayat Kami, lalu mereka berserah diri.","hasanah_per_verse":560},{"text_madani":"وَإِذَا وَقَعَ الْقَوْلُ عَلَيْهِمْ أَخْرَجْنَا لَهُمْ دَابَّةً مِّنَ الْأَرْضِ تُكَلِّمُهُمْ أَنَّ النَّاسَ كَانُوا بِآيَاتِنَا لَا يُوقِنُونَ","text_tajweed":"۞ وَإِذَا وَقَعَ [h:10039[ٱ]لْقَوْلُ عَلَيْهِمْ أَخْرَ[q:1577[جْ]نَا لَهُمْ د[m[َا]ٓبَّ[a:10040[ةً م]ِّنَ [h:1579[ٱ]لْأَرْضِ تُكَلِّمُهُمْ أَ[g[نّ]َ [h:10041[ٱ][l[ل][g[نّ]َاسَ كَانُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِنَا لَا يُوقِن[p[ُو]نَ","translation_en":"And when the word shall come to pass against them, We shall bring forth for them a creature from the earth that shall i wound them, because people did not believe in Our communications.","translation_id":"Dan apabila perkataan (ketentuan masa kehancuran alam) telah berlaku atas mereka, Kami keluarkan makhluk bergerak yang bernyawa dari bumi yang akan mengatakan kepada mereka bahwa manusia dahulu tidak yakin kepada ayat-ayat Kami.","hasanah_per_verse":700},{"text_madani":"وَيَوْمَ نَحْشُرُ مِن كُلِّ أُمَّةٍ فَوْجًا مِّمَّن يُكَذِّبُ بِآيَاتِنَا فَهُمْ يُوزَعُونَ","text_tajweed":"وَيَوْمَ نَحْشُرُ مِ[f:843[ن ك]ُلِّ أُ[g[مّ]َ[f:10042[ةٍ ف]َوْ[a:10043[جًا م]ِّ[g[مّ][a:10044[َن ي]ُكَذِّبُ بِـَٔـايَ[n[ـٰ]تِنَا فَهُمْ يُوزَع[p[ُو]نَ","translation_en":"And on the day when We will gather from every nation a party from among those who rejected Our communications, then they shall be formed into groups.","translation_id":"Dan (ingatlah) pada hari (ketika) Kami mengumpulkan dari setiap umat, segolongan orang yang mendustakan ayat-ayat Kami, lalu mereka dibagi-bagi (dalam kelompok-kelompok).","hasanah_per_verse":420},{"text_madani":"حَتَّىٰ إِذَا جَاءُوا قَالَ أَكَذَّبْتُم بِآيَاتِي وَلَمْ تُحِيطُوا بِهَا عِلْمًا أَمَّاذَا كُنتُمْ تَعْمَلُونَ","text_tajweed":"حَتَّ[o[ىٰٓ] إِذَا ج[o[َا]ٓءُو قَالَ أَكَذَّ[q:10045[بْ]ت[c:10046[ُم ب]ِـَٔـايَ[n[ـٰ]تِى وَلَمْ تُحِيطُو[s[اْ] بِهَا عِلْمًا أَ[g[مّ]َاذَا كُ[f:100[نت]ُمْ تَعْمَل[p[ُو]نَ","translation_en":"Until when they come, He will say: Did you reject My communications while you had no comprehensive knowledge of them? Or what was it that you did?","translation_id":"Hingga apabila mereka datang, Dia (Allah) berfirman, “Mengapa kamu telah mendustakan ayat-ayat-Ku, pada-hal kamu tidak mempunyai pengetahuan tentang itu, atau apakah yang telah kamu kerjakan?”","hasanah_per_verse":570},{"text_madani":"وَوَقَعَ الْقَوْلُ عَلَيْهِم بِمَا ظَلَمُوا فَهُمْ لَا يَنطِقُونَ","text_tajweed":"وَوَقَعَ [h:10047[ٱ]لْقَوْلُ عَلَيْه[c:10048[ِم ب]ِمَا ظَلَمُو[s[اْ] فَهُمْ لَا يَ[f:8795[نط]ِق[p[ُو]نَ","translation_en":"And the word shall come to pass against them because they were unjust, so they shall not speak.","translation_id":"Dan berlakulah perkataan (janji azab) atas mereka karena kezhaliman mereka, maka mereka tidak dapat berkata.","hasanah_per_verse":330},{"text_madani":"أَلَمْ يَرَوْا أَنَّا جَعَلْنَا اللَّيْلَ لِيَسْكُنُوا فِيهِ وَالنَّهَارَ مُبْصِرًا ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يُؤْمِنُونَ","text_tajweed":"أَلَمْ يَرَوْ[s[اْ] أَ[g[نّ]َا جَعَلْنَا [h:10049[ٱ]لَّيْلَ لِيَسْكُنُو[s[اْ] فِيهِ وَ[h:6117[ٱ][l[ل][g[نّ]َهَارَ مُ[q:6118[بْ]صِرًا‌ۚ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:849[تٍ ل]ِّقَوْ[a:4294[مٍ ي]ُؤْمِن[p[ُو]نَ","translation_en":"Do they not consider that We have made the night that. they may rest therein, and the day to give light? Most surely there are signs in this for a people who believe.","translation_id":"Apakah mereka tidak memperhatikan bahwa Kami telah menjadikan malam agar mereka beristirahat padanya dan (menjadikan) siang yang menerangi? Sungguh, pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang beriman.","hasanah_per_verse":640},{"text_madani":"وَيَوْمَ يُنفَخُ فِي الصُّورِ فَفَزِعَ مَن فِي السَّمَاوَاتِ وَمَن فِي الْأَرْضِ إِلَّا مَن شَاءَ اللَّهُ ۚ وَكُلٌّ أَتَوْهُ دَاخِرِينَ","text_tajweed":"وَيَوْمَ يُ[f:4184[نف]َخُ فِى [h:4185[ٱ][l[ل]صُّورِ فَفَزِعَ مَ[f:2074[ن ف]ِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَ[f:3453[ن ف]ِى [h:44[ٱ]لْأَرْضِ إِلَّا مَ[f:9680[ن ش][o[َا]ٓءَ [h:78[ٱ]للَّهُ‌ۚ وَكُلٌّ أَتَوْهُ د[n[َٲ]خِر[p[ِي]نَ","translation_en":"And on the day when the trumpet shall be blown, then those who are in the heavens and those who are in the earth shall be terrified except such as Allah please, and all shall come to him abased.","translation_id":"Dan (ingatlah) pada hari (ketika) sangkakala ditiup, maka terkejutlah apa yang ada di langit dan apa yang ada di bumi, kecuali siapa yang dikehendaki Allah. Dan semua mereka datang menghadap-Nya dengan merendahkan diri.","hasanah_per_verse":660},{"text_madani":"وَتَرَى الْجِبَالَ تَحْسَبُهَا جَامِدَةً وَهِيَ تَمُرُّ مَرَّ السَّحَابِ ۚ صُنْعَ اللَّهِ الَّذِي أَتْقَنَ كُلَّ شَيْءٍ ۚ إِنَّهُ خَبِيرٌ بِمَا تَفْعَلُونَ","text_tajweed":"وَتَرَى [h:10050[ٱ]لْجِبَالَ تَحْسَبُهَا جَامِدَ[a:10051[ةً و]َهِىَ تَمُرُّ مَرَّ [h:10052[ٱ][l[ل]سَّحَابِ‌ۚ صُنْعَ [h:10053[ٱ]للَّهِ [h:7038[ٱ]لَّذ[o[ِىٓ] أَتْقَنَ كُلَّ شَىْءٍ‌ۚ إِ[g[نّ]َهُ[n[ۥ] خَبِي[i:2335[رُۢ ب]ِمَا تَفْعَل[p[ُو]نَ","translation_en":"And you see the mountains, you think them to be solid, and they shall pass away as the passing away of the cloud-- the handiwork of Allah Who has made every thing thoroughly; surely He is Aware of what you do.","translation_id":"Dan engkau akan melihat gunung-gunung, yang engkau kira tetap di tempatnya, padahal ia berjalan (seperti) awan berjalan. (Itulah) ciptaan Allah yang mencipta dengan sempurna segala sesuatu. Sungguh, Dia Mahateliti apa yang kamu kerjakan.","hasanah_per_verse":710},{"text_madani":"مَن جَاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِّنْهَا وَهُم مِّن فَزَعٍ يَوْمَئِذٍ آمِنُونَ","text_tajweed":"مَ[f:4560[ن ج][o[َا]ٓءَ بِ[h:4561[ٱ]لْحَسَنَةِ فَلَهُ[n[ۥ] خَيْ[a:10054[رٌ م]ِّنْهَا وَه[w:8717[ُم م]ِّ[f:10055[ن ف]َزَ[a:10056[عٍ ي]َوْمَئِذٍ ءَامِن[p[ُو]نَ","translation_en":"Whoever brings good, he shall have better than it; and they shall be secure from terror on the day.","translation_id":"Barangsiapa membawa kebaikan, maka dia memperoleh (balasan) yang lebih baik daripadanya, sedang mereka merasa aman dari kejutan (yang dahsyat) pada hari itu.","hasanah_per_verse":400},{"text_madani":"وَمَن جَاءَ بِالسَّيِّئَةِ فَكُبَّتْ وُجُوهُهُمْ فِي النَّارِ هَلْ تُجْزَوْنَ إِلَّا مَا كُنتُمْ تَعْمَلُونَ","text_tajweed":"وَمَ[f:4562[ن ج][o[َا]ٓءَ بِ[h:4563[ٱ][l[ل]سَّيِّئَةِ فَكُبَّتْ وُجُوهُهُمْ فِى [h:4674[ٱ][l[ل][g[نّ]َارِ هَلْ تُ[q:4248[جْ]زَوْنَ إِلَّا مَا كُ[f:100[نت]ُمْ تَعْمَل[p[ُو]نَ","translation_en":"And whoever brings evil, these shall be thrown down on their faces into the fire; shall you be rewarded (for) aught except what you did?","translation_id":"Dan barangsiapa membawa kejahatan, maka disungkurkanlah wajah mereka ke dalam neraka. Kamu tidak diberi balasan, melainkan (setimpal) dengan apa yang telah kamu kerjakan.","hasanah_per_verse":520},{"text_madani":"إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ رَبَّ هَٰذِهِ الْبَلْدَةِ الَّذِي حَرَّمَهَا وَلَهُ كُلُّ شَيْءٍ ۖ وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُسْلِمِينَ","text_tajweed":"إِ[g[نّ]َم[o[َآ] أُمِرْتُ أَنْ أَعْبُدَ رَبَّ هَ[n[ـٰ]ذِهِ [h:10057[ٱ]لْبَلْدَةِ [h:10058[ٱ]لَّذِى حَرَّمَهَا وَلَهُ[n[ۥ] كُلُّ ش[a:10059[َىْءٍ‌ۖ و]َأُمِرْتُ أَنْ أَكُونَ مِنَ [h:6135[ٱ]لْمُسْلِم[p[ِي]نَ","translation_en":"I am commanded only that I should serve the Lord of this city, Who has made it sacred, and His are all things; and I am commanded that I should be of these who submit;","translation_id":"Aku (Muhammad) hanya diperintahkan menyembah Tuhan negeri ini (Mekah) yang Dia telah menjadikan suci padanya dan segala sesuatu adalah milik-Nya. Dan aku diperintahkan agar aku termasuk orang Muslim,","hasanah_per_verse":630},{"text_madani":"وَأَنْ أَتْلُوَ الْقُرْآنَ ۖ فَمَنِ اهْتَدَىٰ فَإِنَّمَا يَهْتَدِي لِنَفْسِهِ ۖ وَمَن ضَلَّ فَقُلْ إِنَّمَا أَنَا مِنَ الْمُنذِرِينَ","text_tajweed":"وَأَنْ أَتْلُوَ[s[اْ] [h:10060[ٱ]لْقُرْءَانَ‌ۖ فَمَنِ [h:6230[ٱ]هْتَدَىٰ فَإِ[g[نّ]َمَا يَهْتَدِى لِنَفْسِه[n[ِۦ]‌ۖ وَمَ[f:6231[ن ض]َلَّ فَقُلْ إِ[g[نّ]َم[o[َآ] أَنَا۟ مِنَ [h:9852[ٱ]لْمُ[f:9853[نذ]ِر[p[ِي]نَ","translation_en":"And that I should recite the Quran. Therefore whoever goes aright, he goes aright for his own soul, and whoever goes ' astray, then say: I am only one of the warners.","translation_id":"dan agar aku membacakan Al-Qur'an (kepada manusia). Maka barangsiapa mendapat petunjuk maka sesungguhnya dia mendapat petunjuk untuk (kebaikan) dirinya, dan barangsiapa sesat, maka katakanlah, “Sesungguhnya aku (ini) tidak lain hanyalah salah seorang pemberi peringatan.”","hasanah_per_verse":610},{"text_madani":"وَقُلِ الْحَمْدُ لِلَّهِ سَيُرِيكُمْ آيَاتِهِ فَتَعْرِفُونَهَا ۚ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُونَ","text_tajweed":"وَقُلِ [h:7938[ٱ]لْحَمْدُ لِلَّهِ سَيُرِيكُمْ ءَايَ[n[ـٰ]تِه[n[ِۦ] فَتَعْرِفُونَهَا‌ۚ وَمَا رَبُّكَ بِغَ[n[ـٰ]فِلٍ عَ[g[مّ]َا تَعْمَل[p[ُو]نَ","translation_en":"And say: Praise be to Allah, He will show you His signs so that you shall recognize them; nor is your Lord heedless of what you do.","translation_id":"Dan katakanlah (Muhammad), “Segala puji bagi Allah, Dia akan memperlihatkan kepadamu tanda-tanda (kebesaran)-Nya, maka kamu akan mengetahuinya. Dan Tuhanmu tidak lengah terhadap apa yang kamu kerjakan.”","hasanah_per_verse":510}]}
