{"chapter_number":61,"name_simple":"As-Saf","name_meaning":{"text":"The Ranks","en":"The Ranks","id":"Barisan"},"verses_count":14,"hasanah":9660,"verses":[{"text_madani":"سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ","text_tajweed":"سَبَّحَ لِلَّهِ مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَا فِى [h:44[ٱ]لْأَرْضِ‌ۖ وَهُوَ [h:7045[ٱ]لْعَزِيزُ [h:681[ٱ]لْحَك[p[ِي]مُ","translation_en":"Whatever is in the heavens and whatever is in the earth declares the glory of Allah; and He is the Mighty, the Wise.","translation_id":"Apa yang ada di langit dan apa yang ada di bumi bertasbih kepada Allah; dan Dialah Yang Mahaperkasa, Mahabijaksana.","hasanah_per_verse":430},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] لِمَ تَقُولُونَ مَا لَا تَفْعَل[p[ُو]نَ","translation_en":"O you who believe! why do you say that which you do not do?","translation_id":"Wahai orang-orang yang beriman! Mengapa kamu mengatakan sesuatu yang tidak kamu kerjakan?","hasanah_per_verse":340},{"text_madani":"كَبُرَ مَقْتًا عِندَ اللَّهِ أَن تَقُولُوا مَا لَا تَفْعَلُونَ","text_tajweed":"كَبُرَ مَ[q:11151[قْ]تًا عِ[f:264[ند]َ [h:408[ٱ]للَّهِ أَ[f:1330[ن ت]َقُولُو[s[اْ] مَا لَا تَفْعَل[p[ُو]نَ","translation_en":"It is most hateful to Allah that you should say that which you do not do.","translation_id":"(Itu) sangatlah dibenci di sisi Allah jika kamu mengatakan apa-apa yang tidak kamu kerjakan.","hasanah_per_verse":320},{"text_madani":"إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُم بُنْيَانٌ مَّرْصُوصٌ","text_tajweed":"إِ[g[نّ]َ [h:80[ٱ]للَّهَ يُحِبُّ [h:13562[ٱ]لَّذِينَ يُقَ[n[ـٰ]تِلُونَ فِى سَبِيلِه[n[ِۦ] صَف[f:13563[ًّا ك]َأَ[g[نّ]َه[c:13564[ُم ب]ُنْيَ[n[ـٰ][a:13565[نٌ م]َّرْص[p[ُو]صٌ","translation_en":"Surely Allah loves those who fight in His way in ranks as if they were a firm and compact wall.","translation_id":"Sesungguhnya Allah mencintai orang-orang yang berperang di jalan-Nya dalam barisan yang teratur, mereka seakan-akan seperti suatu bangunan yang tersusun kokoh.","hasanah_per_verse":460},{"text_madani":"وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ لِمَ تُؤْذُونَنِي وَقَد تَّعْلَمُونَ أَنِّي رَسُولُ اللَّهِ إِلَيْكُمْ ۖ فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ","text_tajweed":"وَإِذْ قَالَ مُوسَىٰ لِقَوْمِه[n[ِۦ] يَ[n[ـٰ]قَوْمِ لِمَ تُؤْذُونَنِى وَقَ[d:13566[د] تَّعْلَمُونَ أَ[g[نّ]ِى رَسُولُ [h:3306[ٱ]للَّهِ إِلَيْكُمْ‌ۖ فَلَ[g[مّ]َا زَاغ[o[ُوٓ][s[اْ] أَزَاغَ [h:13567[ٱ]للَّهُ قُلُوبَهُمْ‌ۚ وَ[h:72[ٱ]للَّهُ لَا يَهْدِى [h:1504[ٱ]لْقَوْمَ [h:3860[ٱ]لْفَ[n[ـٰ]سِق[p[ِي]نَ","translation_en":"And when Musa said to his people: O my people! why do you give me trouble? And you know indeed that I am Allah's messenger to you; but when they turned aside, Allah made their hearts turn aside, and Allah does not guide the transgressing people.","translation_id":"Dan (ingatlah) ketika Musa berkata kepada kaumnya, “Wahai kaumku! Mengapa kamu menyakitiku, padahal kamu sungguh mengetahui bahwa sesungguhnya aku utusan Allah kepadamu?” Maka ketika mereka berpaling (dari kebenaran), Allah memalingkan hati mereka. Dan Allah tidak memberi petunjuk kepada kaum yang fasik.","hasanah_per_verse":1010},{"text_madani":"وَإِذْ قَالَ عِيسَى ابْنُ مَرْيَمَ يَا بَنِي إِسْرَائِيلَ إِنِّي رَسُولُ اللَّهِ إِلَيْكُم مُّصَدِّقًا لِّمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَمُبَشِّرًا بِرَسُولٍ يَأْتِي مِن بَعْدِي اسْمُهُ أَحْمَدُ ۖ فَلَمَّا جَاءَهُم بِالْبَيِّنَاتِ قَالُوا هَٰذَا سِحْرٌ مُّبِينٌ","text_tajweed":"وَإِذْ قَالَ عِيسَى [h:1916[ٱ][q:1917[بْ]نُ مَرْيَمَ يَ[n[ـٰ]بَن[o[ِىٓ] إِسْر[o[َٲ]ٓءِيلَ إِ[g[نّ]ِى رَسُولُ [h:3306[ٱ]للَّهِ إِلَيْك[w:13568[ُم م]ُّصَدِّ[u:206[قًا ل]ِّمَا بَيْنَ يَدَىَّ مِنَ [h:1941[ٱ][l[ل]تَّوْرَ[n[ٮٰ]ةِ وَمُبَشِّر[i:13569[َۢا ب]ِرَسُو[a:13570[لٍ ي]َأْتِى م[i:692[ِنۢ ب]َعْدِى [h:13571[ٱ]سْمُهُ[o[ۥٓ] أَحْمَدُ‌ۖ فَلَ[g[مّ]َا ج[o[َا]ٓءَه[c:13572[ُم ب]ِ[h:484[ٱ]لْبَيِّنَ[n[ـٰ]تِ قَالُو[s[اْ] هَ[n[ـٰ]ذَا سِحْ[a:3879[رٌ م]ُّب[p[ِي]نٌ","translation_en":"And when Isa son of Marium said: O children of Israel! surely I am the messenger of Allah to you, verifying that which is before me of the Taurat and giving the good news of an Messenger who will come after me, his name being Ahmad, but when he came to them with clear arguments they said: This is clear magic.","translation_id":"Dan (ingatlah) ketika Isa putra Maryam berkata, “Wahai Bani Israil! Sesungguhnya aku utusan Allah kepadamu, yang membenarkan kitab (yang turun) sebelumku, yaitu Taurat dan memberi kabar gembira dengan seorang Rasul yang akan datang setelahku, yang namanya Ahmad (Muhammad).” Namun ketika Rasul itu datang kepada mereka dengan membawa bukti-bukti yang nyata, mereka berkata, “Ini adalah sihir yang nyata.”","hasanah_per_verse":1290},{"text_madani":"وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ الْكَذِبَ وَهُوَ يُدْعَىٰ إِلَى الْإِسْلَامِ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","text_tajweed":"وَمَنْ أَظْلَمُ مِ[g[مّ]َنِ [h:3980[ٱ]فْتَرَىٰ عَلَى [h:412[ٱ]للَّهِ [h:2035[ٱ]لْكَذِبَ وَهُوَ يُ[q:13573[دْ]عَ[o[ىٰٓ] إِلَى [h:13574[ٱ]لْإِسْلَ[n[ـٰ]مِ‌ۚ وَ[h:72[ٱ]للَّهُ لَا يَهْدِى [h:1504[ٱ]لْقَوْمَ [h:1505[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And who is more unjust than he who forges a lie against Allah and he is invited to Islam, and Allah does not guide the unjust people.","translation_id":"Dan siapakah yang lebih zhalim dari-pada orang yang mengada-adakan kebohongan terhadap Allah padahal dia diajak kepada (agama) Islam? Dan Allah tidak memberi petunjuk kepada orang-orang yang zhalim.","hasanah_per_verse":680},{"text_madani":"يُرِيدُونَ لِيُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَاللَّهُ مُتِمُّ نُورِهِ وَلَوْ كَرِهَ الْكَافِرُونَ","text_tajweed":"يُرِيدُونَ لِيُ[q:13575[طْ]فِــُٔو[s[اْ] نُورَ [h:5554[ٱ]للَّهِ بِأَفْو[n[َٲ]هِهِمْ وَ[h:72[ٱ]للَّهُ مُتِ[g[مّ]ُ نُورِه[n[ِۦ] وَلَوْ كَرِهَ [h:5556[ٱ]لْكَ[n[ـٰ]فِر[p[ُو]نَ","translation_en":"They desire to put out the light of Allah with their mouths but Allah will perfect His light, though the unbelievers may be averse.","translation_id":"Mereka hendak memadamkan cahaya (agama) Allah dengan mulut (ucapan-ucapan) mereka, tetapi Allah tetap menyempurnakan cahaya-Nya meskipun orang-orang kafir membencinya.","hasanah_per_verse":540},{"text_madani":"هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ","text_tajweed":"هُوَ [h:153[ٱ]لَّذ[o[ِىٓ] أَرْسَلَ رَسُولَهُ[n[ۥ] بِ[h:54[ٱ]لْهُدَىٰ وَدِينِ [h:5557[ٱ]لْحَقِّ لِيُظْهِرَهُ[n[ۥ] عَلَى [h:5558[ٱ][l[ل]دِّينِ كُلِّه[n[ِۦ] وَلَوْ كَرِهَ [h:5559[ٱ]لْمُشْرِك[p[ُو]نَ","translation_en":"He it is Who sent His Messenger with the guidance and the true religion, that He may make it overcome the religions, all of them, though the polytheists may be averse.","translation_id":"Dialah yang mengutus Rasul-Nya dengan membawa petunjuk dan agama yang benar, untuk memenangkannya di atas segala agama meskipun orang-orang musyrik membencinya.","hasanah_per_verse":600},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا هَلْ أَدُلُّكُمْ عَلَىٰ تِجَارَةٍ تُنجِيكُم مِّنْ عَذَابٍ أَلِيمٍ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] هَلْ أَدُلُّكُمْ عَلَىٰ تِجَ[n[ـٰ]رَ[f:13576[ةٍ ت]ُ[f:13577[نج]ِيك[w:13578[ُم م]ِّنْ عَذَابٍ أَل[p[ِي]مٍ","translation_en":"O you who believe! shall I lead you to a merchandise which may deliver you from a painful chastisement?","translation_id":"Wahai orang-orang yang beriman! Maukah kamu Aku tunjukkan suatu perdagangan yang dapat menyelamatkan kamu dari azab yang pedih?","hasanah_per_verse":470},{"text_madani":"تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِكُمْ وَأَنفُسِكُمْ ۚ ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ","text_tajweed":"تُؤْمِنُونَ بِ[h:32[ٱ]للَّهِ وَرَسُولِه[n[ِۦ] وَتُجَ[n[ـٰ]هِدُونَ فِى سَبِيلِ [h:788[ٱ]للَّهِ بِأَمْو[n[َٲ]لِكُمْ وَأَ[f:2485[نف]ُسِكُمْ‌ۚ ذ[n[َٲ]لِكُمْ خَيْ[u:263[رٌ ل]َّكُمْ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ تَعْلَم[p[ُو]نَ","translation_en":"You shall believe in Allah and His Messenger, and struggle hard in Allah's way with your property and your lives; that is better for you, did you but know!","translation_id":"(Yaitu) kamu beriman kepada Allah dan Rasul-Nya dan berjihad di jalan Allah dengan harta dan jiwamu. Itulah yang lebih baik bagi kamu jika kamu mengetahui,","hasanah_per_verse":720},{"text_madani":"يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَيُدْخِلْكُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ","text_tajweed":"يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَيُ[q:13579[دْ]خِلْكُمْ جَ[g[نّ]َ[n[ـٰ][f:119[تٍ ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ وَمَسَ[n[ـٰ]كِنَ طَيِّبَ[f:5719[ةً ف]ِى جَ[g[نّ]َ[n[ـٰ]تِ عَ[q:5720[دْ][f:13580[نٍ‌ۚ ذ][n[َٲ]لِكَ [h:3911[ٱ]لْفَوْزُ [h:2633[ٱ]لْعَظ[p[ِي]مُ","translation_en":"He will forgive you your faults and cause you to enter into gardens, beneath which rivers flow, and goodly dwellings in gardens of perpetuity; that is the mighty achievement;","translation_id":"niscaya Allah mengampuni dosa-dosamu dan memasukkan kamu ke dalam surga yang mengalir di bawahnya sungai-sungai, dan ke tempat-tempat tinggal yang baik di dalam surga ‘Adn. Itulah kemenangan yang agung.","hasanah_per_verse":750},{"text_madani":"وَأُخْرَىٰ تُحِبُّونَهَا ۖ نَصْرٌ مِّنَ اللَّهِ وَفَتْحٌ قَرِيبٌ ۗ وَبَشِّرِ الْمُؤْمِنِينَ","text_tajweed":"وَأُخْرَىٰ تُحِبُّونَهَا‌ۖ نَصْ[a:13581[رٌ م]ِّنَ [h:321[ٱ]للَّهِ وَفَتْ[f:13582[حٌ ق]َرِي[a:13583[بٌ‌ۗ و]َبَشِّرِ [h:1257[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"And yet another (blessing) that you love: help from Allah and a victory near at hand; and give good news to the believers.","translation_id":"Dan (ada lagi) karunia yang lain yang kamu sukai (yaitu) pertolongan dari Allah dan kemenangan yang dekat (waktunya). Dan sampaikanlah berita gembira kepada orang-orang mukmin.","hasanah_per_verse":410},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا أَنصَارَ اللَّهِ كَمَا قَالَ عِيسَى ابْنُ مَرْيَمَ لِلْحَوَارِيِّينَ مَنْ أَنصَارِي إِلَى اللَّهِ ۖ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنصَارُ اللَّهِ ۖ فَآمَنَت طَّائِفَةٌ مِّن بَنِي إِسْرَائِيلَ وَكَفَرَت طَّائِفَةٌ ۖ فَأَيَّدْنَا الَّذِينَ آمَنُوا عَلَىٰ عَدُوِّهِمْ فَأَصْبَحُوا ظَاهِرِينَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] كُون[o[ُوٓ][s[اْ] أَ[f:13584[نص]َارَ [h:13585[ٱ]للَّهِ كَمَا قَالَ عِيسَى [h:1916[ٱ][q:1917[بْ]نُ مَرْيَمَ لِلْحَوَارِيِّـ[n[ـۧ]نَ مَنْ أَ[f:1949[نص]َار[o[ِىٓ] إِلَى [h:1637[ٱ]للَّهِ‌ۖ قَالَ [h:1950[ٱ]لْحَوَارِيُّونَ نَحْنُ أَ[f:1951[نص]َارُ [h:1952[ٱ]للَّهِ‌ۖ فَـَٔـامَنَ[d:13586[ت] طّ[o[َا]ٓئِفَ[a:2015[ةٌ م]ّ[i:1385[ِنۢ ب]َن[o[ِىٓ] إِسْر[o[َٲ]ٓءِيلَ وَكَفَرَ[d:13587[ت] طّ[o[َا]ٓئِفَ[f:13588[ةٌ‌ۖ ف]َأَيَّ[q:13589[دْ]نَا [h:13590[ٱ]لَّذِينَ ءَامَنُو[s[اْ] عَلَىٰ عَدُوِّهِمْ فَأَصْبَحُو[s[اْ] ظَ[n[ـٰ]هِر[p[ِي]نَ","translation_en":"O you who believe! be helpers (in the cause) of Allah, as~ Isa son of Marium said to (his) disciples: Who are my helpers in the cause of Allah? The disciples said: We are helpers (in the cause) of Allah. So a party of the children of Israel believed and another party disbelieved; then We aided those who believed against their enemy, and they became uppermost.","translation_id":"Wahai orang-orang yang beriman! Jadilah kamu penolong-penolong (agama) Allah sebagaimana Isa putra Maryam telah berkata kepada pengikut-pengikutnya yang setia, “Siapakah yang akan menjadi penolong-penolongku (untuk menegakkan agama) Allah?” Pengikut-pengikutnya yang setia itu berkata, “Kamilah penolong-penolong (agama) Allah,” lalu segolongan dari Bani Israil beriman dan segolongan (yang lain) kafir; lalu Kami berikan kekuatan ke-pada orang-orang yang beriman terhadap musuh-musuh mereka, sehingga mereka menjadi orang-orang yang menang.","hasanah_per_verse":1640}]}
