{"chapter_number":10,"name_simple":"Yunus","name_meaning":{"text":"Jonah","en":"Jonah","id":"Yunus"},"verses_count":109,"hasanah":75890,"verses":[{"text_madani":"الر ۚ تِلْكَ آيَاتُ الْكِتَابِ الْحَكِيمِ","text_tajweed":"ا[m[لٓ]ر‌ۚ تِلْكَ ءَايَ[n[ـٰ]تُ [h:5932[ٱ]لْكِتَ[n[ـٰ]بِ [h:5933[ٱ]لْحَك[p[ِي]مِ","translation_en":"Alif Lam Ra. These are the verses of the wise Book.","translation_id":"Alif Lam Ra. Inilah ayat-ayat Al-Qur'an yang penuh hikmah.","hasanah_per_verse":220},{"text_madani":"أَكَانَ لِلنَّاسِ عَجَبًا أَنْ أَوْحَيْنَا إِلَىٰ رَجُلٍ مِّنْهُمْ أَنْ أَنذِرِ النَّاسَ وَبَشِّرِ الَّذِينَ آمَنُوا أَنَّ لَهُمْ قَدَمَ صِدْقٍ عِندَ رَبِّهِمْ ۗ قَالَ الْكَافِرُونَ إِنَّ هَٰذَا لَسَاحِرٌ مُّبِينٌ","text_tajweed":"أَكَانَ لِل[g[نّ]َاسِ عَجَبًا أَنْ أَوْحَيْن[o[َآ] إِلَىٰ رَجُ[a:5934[لٍ م]ِّنْهُمْ أَنْ أَ[f:5935[نذ]ِرِ [h:5936[ٱ][l[ل][g[نّ]َاسَ وَبَشِّرِ [h:117[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] أَ[g[نّ]َ لَهُمْ قَدَمَ صِ[q:5937[دْ]قٍ عِ[f:264[ند]َ رَبِّهِمْ‌ۗ قَالَ [h:5938[ٱ]لْكَ[n[ـٰ]فِرُونَ إِ[g[نّ]َ هَ[n[ـٰ]ذَا لَسَ[n[ـٰ]حِ[a:5939[رٌ م]ُّب[p[ِي]نٌ","translation_en":"What! is it a wonder to the people that We revealed to a man from among themselves, saying: Warn the people and give good news to those who believe that theirs is a footing of firmness with their Lord. The unbelievers say: This is most surely a manifest enchanter.","translation_id":"Pantaskah manusia menjadi heran bahwa Kami memberi wahyu kepada seorang laki-laki di antara mereka, “Berilah peringatan kepada manusia dan gembirakanlah orang-orang beriman bahwa mereka mempunyai kedudukan yang tinggi di sisi Tuhan.” Orang-orang kafir berkata, “Orang ini (Muhammad) benar-benar pesihir.”","hasanah_per_verse":990},{"text_madani":"إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۖ يُدَبِّرُ الْأَمْرَ ۖ مَا مِن شَفِيعٍ إِلَّا مِن بَعْدِ إِذْنِهِ ۚ ذَٰلِكُمُ اللَّهُ رَبُّكُمْ فَاعْبُدُوهُ ۚ أَفَلَا تَذَكَّرُونَ","text_tajweed":"إِ[g[نّ]َ رَبَّكُمُ [h:4737[ٱ]للَّهُ [h:4738[ٱ]لَّذِى خَلَقَ [h:3913[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ فِى سِتَّةِ أَيَّا[f:4739[مٍ ث]ُ[g[مّ]َ [h:156[ٱ]سْتَوَىٰ عَلَى [h:4740[ٱ]لْعَرْشِ‌ۖ يُدَبِّرُ [h:5940[ٱ]لْأَمْرَ‌ۖ مَا مِ[f:5941[ن ش]َفِيعٍ إِلَّا م[i:146[ِنۢ ب]َعْدِ إِذْنِه[n[ِۦ]‌ۚ ذ[n[َٲ]لِكُمُ [h:4260[ٱ]للَّهُ رَبُّكُمْ فَ[h:1946[ٱ]عْبُدُوهُ‌ۚ أَفَلَا تَذَكَّر[p[ُو]نَ","translation_en":"Surely your Lord is Allah, Who created the heavens and the earth in six periods, and He is firm in power, regulating the affair, there is no intercessor except aher His permission; this is Allah, your Lord, therefore serve Him; will you not then mind?","translation_id":"Sesungguhnya Tuhan kamu Dialah Allah yang menciptakan langit dan bumi dalam enam masa, kemudian Dia bersemayam di atas ‘Arsy (singgasana) untuk mengatur segala urusan. Tidak ada yang dapat memberi syafaat kecuali setelah ada izin-Nya. Itulah Allah, Tuhanmu, maka sembahlah Dia. Apakah kamu tidak mengambil pelajaran?","hasanah_per_verse":1130},{"text_madani":"إِلَيْهِ مَرْجِعُكُمْ جَمِيعًا ۖ وَعْدَ اللَّهِ حَقًّا ۚ إِنَّهُ يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ لِيَجْزِيَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ بِالْقِسْطِ ۚ وَالَّذِينَ كَفَرُوا لَهُمْ شَرَابٌ مِّنْ حَمِيمٍ وَعَذَابٌ أَلِيمٌ بِمَا كَانُوا يَكْفُرُونَ","text_tajweed":"إِلَيْهِ مَرْجِعُكُمْ جَمِي[a:5942[عًا‌ۖ و]َعْدَ [h:3149[ٱ]للَّهِ حَقًّا‌ۚ إِ[g[نّ]َهُ[n[ۥ] يَ[q:5943[بْ]دَؤُ[s[اْ] [h:5944[ٱ]لْخَلْقَ ثُ[g[مّ]َ يُعِيدُهُ[n[ۥ] لِيَ[q:5945[جْ]زِىَ [h:5946[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ بِ[h:1800[ٱ]لْقِسْطِ‌ۚ وَ[h:37[ٱ]لَّذِينَ كَفَرُو[s[اْ] لَهُمْ شَرَا[a:4169[بٌ م]ِّنْ حَمِي[a:4170[مٍ و]َعَذَابٌ أَلِي[i:43[مُۢ ب]ِمَا كَانُو[s[اْ] يَكْفُر[p[ُو]نَ","translation_en":"To Him is your return, of all (of you); the promise of Allah (made) in truth; surely He begins the creation in the first instance, then He reproduces it, that He may with justice recompense those who believe and do good; and (as for) those who disbelieve, they shall have a drink of hot water and painful punishment because they disbelieved.","translation_id":"Hanya kepada-Nya kamu semua akan kembali. Itu merupakan janji Allah yang benar dan pasti. Sesungguhnya Dialah yang memulai penciptaan makhluk kemudian mengulanginya (menghidupkannya kembali setelah berbangkit), agar Dia memberi balasan kepada orang-orang yang beriman dan mengerjakan kebajikan dengan adil. Sedangkan untuk orang-orang kafir (disediakan) minuman air yang mendidih dan siksaan yang pedih karena kekafiran mereka.","hasanah_per_verse":1260},{"text_madani":"هُوَ الَّذِي جَعَلَ الشَّمْسَ ضِيَاءً وَالْقَمَرَ نُورًا وَقَدَّرَهُ مَنَازِلَ لِتَعْلَمُوا عَدَدَ السِّنِينَ وَالْحِسَابَ ۚ مَا خَلَقَ اللَّهُ ذَٰلِكَ إِلَّا بِالْحَقِّ ۚ يُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ","text_tajweed":"هُوَ [h:153[ٱ]لَّذِى جَعَلَ [h:5947[ٱ][l[ل]شَّمْسَ ضِي[o[َا]ٓ[a:5948[ءً و]َ[h:4265[ٱ]لْقَمَرَ نُو[a:5949[رًا و]َقَدَّرَهُ[n[ۥ] مَنَازِلَ لِتَعْلَمُو[s[اْ] عَدَدَ [h:5950[ٱ][l[ل]سِّنِينَ وَ[h:5951[ٱ]لْحِسَابَ‌ۚ مَا خَلَقَ [h:1272[ٱ]للَّهُ ذ[n[َٲ]لِكَ إِلَّا بِ[h:370[ٱ]لْحَقِّ‌ۚ يُفَصِّلُ [h:5952[ٱ]لْأَيَ[n[ـٰ]تِ لِقَوْ[a:1292[مٍ ي]َعْلَم[p[ُو]نَ","translation_en":"He it is Who made the sun a shining brightness and the moon a light, and ordained for it mansions that you might know the computation of years and the reckoning. Allah did not create it but with truth; He makes the signs manifest for a people who know.","translation_id":"Dialah yang menjadikan matahari bersinar dan bulan bercahaya, dan Dialah yang menetapkan tempat-tempat orbitnya, agar kamu mengetahui bilangan tahun, dan perhitungan (waktu). Allah tidak menciptakan demikian itu melainkan dengan benar. Dia menjelaskan tanda-tanda (kebesaran-Nya) kepada orang-orang yang mengetahui.","hasanah_per_verse":1010},{"text_madani":"إِنَّ فِي اخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَمَا خَلَقَ اللَّهُ فِي السَّمَاوَاتِ وَالْأَرْضِ لَآيَاتٍ لِّقَوْمٍ يَتَّقُونَ","text_tajweed":"إِ[g[نّ]َ فِى [h:5953[ٱ]خْتِلَ[n[ـٰ]فِ [h:5954[ٱ]لَّيْلِ وَ[h:834[ٱ][l[ل][g[نّ]َهَارِ وَمَا خَلَقَ [h:1272[ٱ]للَّهُ فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ لَأَيَ[n[ـٰ][u:849[تٍ ل]ِّقَوْ[a:5955[مٍ ي]َتَّق[p[ُو]نَ","translation_en":"Most surely in the variation of the night and the day, and what Allah has created in the heavens and the earth, there are signs for a people who guard (against evil).","translation_id":"Sesungguhnya pada pergantian malam dan siang dan pada apa yang diciptakan Allah di langit dan di bumi, pasti terdapat tanda-tanda (kebesaran-Nya) bagi orang-orang yang bertakwa.","hasanah_per_verse":620},{"text_madani":"إِنَّ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا وَرَضُوا بِالْحَيَاةِ الدُّنْيَا وَاطْمَأَنُّوا بِهَا وَالَّذِينَ هُمْ عَنْ آيَاتِنَا غَافِلُونَ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ لَا يَرْجُونَ لِق[o[َا]ٓءَنَا وَرَضُو[s[اْ] بِ[h:5581[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:5582[ٱ][l[ل]دُّنْيَا وَ[h:5956[ٱ][q:5956[طْ]مَأَ[g[نّ]ُو[s[اْ] بِهَا وَ[h:37[ٱ]لَّذِينَ هُمْ عَنْ ءَايَ[n[ـٰ]تِنَا غَ[n[ـٰ]فِل[p[ُو]نَ","translation_en":"Surely those who do not hope in Our meeting and are pleased with this world's life and are content with it, and those who are heedless of Our communications:","translation_id":"Sesungguhnya orang-orang yang tidak mengharapkan (tidak percaya akan) pertemuan dengan Kami, dan merasa puas dengan kehidupan dunia serta merasa tenteram dengan (kehidupan) itu, dan orang-orang yang melalaikan ayat-ayat Kami,","hasanah_per_verse":710},{"text_madani":"أُولَٰئِكَ مَأْوَاهُمُ النَّارُ بِمَا كَانُوا يَكْسِبُونَ","text_tajweed":"أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ مَأْوَ[n[ٮٰ]هُمُ [h:5957[ٱ][l[ل][g[نّ]َارُ بِمَا كَانُو[s[اْ] يَكْسِب[p[ُو]نَ","translation_en":"(As for) those, their abode is the fire because of what they earned.","translation_id":"mereka itu tempatnya di neraka, karena apa yang telah mereka lakukan.","hasanah_per_verse":300},{"text_madani":"إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ يَهْدِيهِمْ رَبُّهُم بِإِيمَانِهِمْ ۖ تَجْرِي مِن تَحْتِهِمُ الْأَنْهَارُ فِي جَنَّاتِ النَّعِيمِ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ يَهْدِيهِمْ رَبُّه[c:5958[ُم ب]ِإِيمَ[n[ـٰ]نِهِمْ‌ۖ تَ[q:120[جْ]رِى مِ[f:4696[ن ت]َحْتِهِمُ [h:4697[ٱ]لْأَنْهَ[n[ـٰ]رُ فِى جَ[g[نّ]َ[n[ـٰ]تِ [h:3680[ٱ][l[ل][g[نّ]َع[p[ِي]مِ","translation_en":"Surely (as for) those who believe and do good, their Lord will guide them by their faith; there shall flOw from beneath them rivers in gardens of bliss.","translation_id":"Sesungguhnya orang-orang yang beriman dan mengerjakan kebajikan, niscaya diberi petunjuk oleh Tuhan karena keimanannya. Mereka di dalam surga yang penuh kenikmatan, mengalir di bawahnya sungai-sungai.","hasanah_per_verse":740},{"text_madani":"دَعْوَاهُمْ فِيهَا سُبْحَانَكَ اللَّهُمَّ وَتَحِيَّتُهُمْ فِيهَا سَلَامٌ ۚ وَآخِرُ دَعْوَاهُمْ أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ","text_tajweed":"دَعْوَ[n[ٮٰ]هُمْ فِيهَا سُ[q:168[بْ]حَ[n[ـٰ]نَكَ [h:5959[ٱ][l[ل]لَّهُ[g[مّ]َ وَتَحِيَّتُهُمْ فِيهَا سَلَ[n[ـٰ][a:5960[مٌ‌ۚ و]َءَاخِرُ دَعْوَ[n[ٮٰ]هُمْ أَنِ [h:5961[ٱ]لْحَمْدُ لِلَّهِ رَبِّ [h:4[ٱ]لْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"Their cry in it shall be: Glory to Thee, O Allah! and their greeting in it shall be: Peace; and the last of their cry shall be: Praise be to Allah, the Lord of the worlds.","translation_id":"Doa mereka di dalamnya ialah, “Subhanakallahumma” (Mahasuci Engkau, ya Tuhan kami), dan salam penghormatan mereka ialah, “Salam” (salam sejahtera). Dan penutup doa mereka ialah, “Al-Hamdu lillahi Rabbil ‘alamin” (segala puji bagi Allah Tuhan seluruh alam).","hasanah_per_verse":660},{"text_madani":"وَلَوْ يُعَجِّلُ اللَّهُ لِلنَّاسِ الشَّرَّ اسْتِعْجَالَهُم بِالْخَيْرِ لَقُضِيَ إِلَيْهِمْ أَجَلُهُمْ ۖ فَنَذَرُ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا فِي طُغْيَانِهِمْ يَعْمَهُونَ","text_tajweed":"۞ وَلَوْ يُعَجِّلُ [h:5962[ٱ]للَّهُ لِل[g[نّ]َاسِ [h:5963[ٱ][l[ل]شَّرَّ [h:5964[ٱ]سْتِعْجَالَه[c:5965[ُم ب]ِ[h:5966[ٱ]لْخَيْرِ لَقُضِىَ إِلَيْهِمْ أَجَلُهُمْ‌ۖ فَنَذَرُ [h:5967[ٱ]لَّذِينَ لَا يَرْجُونَ لِق[o[َا]ٓءَنَا فِى طُغْيَ[n[ـٰ]نِهِمْ يَعْمَه[p[ُو]نَ","translation_en":"And if Allah should hasten the evil to men as they desire the hastening on of good, their doom should certainly have been decreed for them; but We leave those alone who hope not for Our meeting in their inordinacy, blindly wandering on.","translation_id":"Dan kalau Allah menyegerakan keburukan bagi manusia seperti permintaan mereka untuk menyegerakan kebaikan, pasti diakhiri umur mereka. Namun Kami biarkan orang-orang yang tidak mengharapkan pertemuan dengan Kami, bingung di dalam kesesatan mereka.","hasanah_per_verse":860},{"text_madani":"وَإِذَا مَسَّ الْإِنسَانَ الضُّرُّ دَعَانَا لِجَنبِهِ أَوْ قَاعِدًا أَوْ قَائِمًا فَلَمَّا كَشَفْنَا عَنْهُ ضُرَّهُ مَرَّ كَأَن لَّمْ يَدْعُنَا إِلَىٰ ضُرٍّ مَّسَّهُ ۚ كَذَٰلِكَ زُيِّنَ لِلْمُسْرِفِينَ مَا كَانُوا يَعْمَلُونَ","text_tajweed":"وَإِذَا مَسَّ [h:5968[ٱ]لْإِ[f:5969[نس]َ[n[ـٰ]نَ [h:5970[ٱ][l[ل]ضُّرُّ دَعَانَا لِجَ[i:5971[نۢب]ِه[o[ِۦٓ] أَوْ قَاعِدًا أَوْ ق[o[َا]ٓئِ[f:5972[مًا ف]َلَ[g[مّ]َا كَشَفْنَا عَنْهُ ضُرَّهُ[n[ۥ] مَرَّ كَأ[u:2914[َن ل]َّمْ يَ[q:5973[دْ]عُن[o[َآ] إِلَىٰ ضُ[a:5974[رٍّ م]َّسَّهُ[n[ۥ]‌ۚ كَذ[n[َٲ]لِكَ زُيِّنَ لِلْمُسْرِفِينَ مَا كَانُو[s[اْ] يَعْمَل[p[ُو]نَ","translation_en":"And when affliction touches a man, he calls on Us, whether lying on his side or sitting or standing; but when We remove his affliction from him, he passes on as though he had never called on Us on account of an affliction that touched him; thus that which they do is made fair-seeming to the extravagant.","translation_id":"Dan apabila manusia ditimpa bahaya dia berdoa kepada Kami dalam keadaan berbaring, duduk atau berdiri, tetapi setelah Kami hilangkan bahaya itu darinya, dia kembali (ke jalan yang sesat), seolah-olah dia tidak pernah berdoa kepada Kami untuk (menghilangkan) bahaya yang telah menimpanya. Demikianlah dijadikan terasa indah bagi orang-orang yang melampaui batas apa yang mereka kerjakan.","hasanah_per_verse":1040},{"text_madani":"وَلَقَدْ أَهْلَكْنَا الْقُرُونَ مِن قَبْلِكُمْ لَمَّا ظَلَمُوا ۙ وَجَاءَتْهُمْ رُسُلُهُم بِالْبَيِّنَاتِ وَمَا كَانُوا لِيُؤْمِنُوا ۚ كَذَٰلِكَ نَجْزِي الْقَوْمَ الْمُجْرِمِينَ","text_tajweed":"وَلَقَ[q:341[دْ] أَهْلَكْنَا [h:5975[ٱ]لْقُرُونَ مِ[f:85[ن ق]َ[q:86[بْ]لِكُمْ لَ[g[مّ]َا ظَلَمُو[s[اْ‌ۙ] وَج[o[َا]ٓءَتْهُمْ رُسُلُه[c:4900[ُم ب]ِ[h:484[ٱ]لْبَيِّنَ[n[ـٰ]تِ وَمَا كَانُو[s[اْ] لِيُؤْمِنُو[s[اْ‌ۚ] كَذ[n[َٲ]لِكَ نَ[q:4214[جْ]زِى [h:5976[ٱ]لْقَوْمَ [h:5977[ٱ]لْمُ[q:4093[جْ]رِم[p[ِي]نَ","translation_en":"And certainly We did destroy generations before you when they were unjust, and their messengers had come to them with clear arguments, and they would not believe; thus do We recompense the guilty people.","translation_id":"Dan sungguh, Kami telah membinasakan umat-umat sebelum kamu, ketika mereka berbuat zhalim, padahal para rasul mereka telah datang membawa keterangan-keterangan (yang nyata), tetapi mereka sama sekali tidak mau beriman. Demikianlah Kami memberi balasan kepada orang-orang yang berbuat dosa.","hasanah_per_verse":870},{"text_madani":"ثُمَّ جَعَلْنَاكُمْ خَلَائِفَ فِي الْأَرْضِ مِن بَعْدِهِمْ لِنَنظُرَ كَيْفَ تَعْمَلُونَ","text_tajweed":"ثُ[g[مّ]َ جَعَلْنَ[n[ـٰ]كُمْ خَلَ[o[ـٰٓ]ئِفَ فِى [h:44[ٱ]لْأَرْضِ م[i:1453[ِنۢ ب]َعْدِهِمْ لِنَ[f:5978[نظ]ُرَ كَيْفَ تَعْمَل[p[ُو]نَ","translation_en":"Then We made you successors in the land after them so that We may see how you act.","translation_id":"Kemudian Kami jadikan kamu sebagai pengganti-pengganti (mereka) di bumi setelah mereka, untuk Kami lihat bagaimana kamu berbuat.","hasanah_per_verse":420},{"text_madani":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ ۙ قَالَ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا ائْتِ بِقُرْآنٍ غَيْرِ هَٰذَا أَوْ بَدِّلْهُ ۚ قُلْ مَا يَكُونُ لِي أَنْ أُبَدِّلَهُ مِن تِلْقَاءِ نَفْسِي ۖ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰ إِلَيَّ ۖ إِنِّي أَخَافُ إِنْ عَصَيْتُ رَبِّي عَذَابَ يَوْمٍ عَظِيمٍ","text_tajweed":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ ءَايَاتُنَا بَيِّنَ[n[ـٰ][f:5979[تٍ‌ۙ ق]َالَ [h:590[ٱ]لَّذِينَ لَا يَرْجُونَ لِق[o[َا]ٓءَنَا [h:5980[ٱ]ئْتِ بِقُرْءَانٍ غَيْرِ هَ[n[ـٰ]ذ[o[َآ] أَوْ بَدِّلْهُ‌ۚ قُلْ مَا يَكُونُ ل[o[ِىٓ] أَنْ أُبَدِّلَهُ[n[ۥ] مِ[f:5981[ن ت]ِلْقَآىِٕ نَفْس[o[ِىٓ‌ۖ] إِنْ أَتَّبِعُ إِلَّا مَا يُوحَ[o[ىٰٓ] إِلَىَّ‌ۖ إِ[g[نّ][o[ِىٓ] أَخَافُ إِنْ عَصَيْتُ رَبِّى عَذَابَ يَوْمٍ عَظ[p[ِي]مٍ","translation_en":"And when Our clear communications are recited to them, those who hope not for Our meeting say: Bring a Quran other than this or change it. Say: It does not beseem me that I should change it of myself; I follow naught but what is revealed to me; surely I fear, if I disobey my Lord, the punishment of a mighty day.","translation_id":"Dan apabila dibacakan kepada mereka ayat-ayat Kami dengan jelas, orang-orang yang tidak mengharapkan pertemuan dengan Kami berkata, “Datangkanlah kitab selain Al-Qur'an ini atau gantilah.” Katakanlah (Muhammad), “Tidaklah pantas bagiku menggantinya atas kemauanku sendiri. Aku hanya mengikuti apa yang diwahyukan kepadaku. Aku benar-benar takut akan azab hari yang besar (Kiamat) jika mendurhakai Tuhanku.”","hasanah_per_verse":1380},{"text_madani":"قُل لَّوْ شَاءَ اللَّهُ مَا تَلَوْتُهُ عَلَيْكُمْ وَلَا أَدْرَاكُم بِهِ ۖ فَقَدْ لَبِثْتُ فِيكُمْ عُمُرًا مِّن قَبْلِهِ ۚ أَفَلَا تَعْقِلُونَ","text_tajweed":"قُل لَّوْ ش[o[َا]ٓءَ [h:78[ٱ]للَّهُ مَا تَلَوْتُهُ[n[ۥ] عَلَيْكُمْ وَل[o[َآ] أَ[q:5982[دْ]رَ[n[ٮٰ]ك[c:5983[ُم ب]ِه[n[ِۦ]‌ۖ فَقَ[q:563[دْ] لَبِثْتُ فِيكُمْ عُمُ[a:5984[رًا م]ِّ[f:1097[ن ق]َ[q:1098[بْ]لِه[o[ِۦٓ‌ۚ] أَفَلَا تَعْقِل[p[ُو]نَ","translation_en":"Say: If Allah had desired (otherwise) I would not have recited it to you, nor would He have taught it to you; indeed I have lived a lifetime among you before it; do you not then understand?","translation_id":"Katakanlah (Muhammad), “Jika Allah menghendaki, niscaya aku tidak membacakannya kepadamu dan Allah tidak (pula) memberitahukannya kepadamu.” Aku telah tinggal bersamamu beberapa lama sebelumnya (sebelum turun Al-Qur'an). Apakah kamu tidak mengerti?","hasanah_per_verse":650},{"text_madani":"فَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا أَوْ كَذَّبَ بِآيَاتِهِ ۚ إِنَّهُ لَا يُفْلِحُ الْمُجْرِمُونَ","text_tajweed":"فَمَنْ أَظْلَمُ مِ[g[مّ]َنِ [h:3980[ٱ]فْتَرَىٰ عَلَى [h:412[ٱ]للَّهِ كَذِبًا أَوْ كَذَّبَ بِـَٔـايَ[n[ـٰ]تِه[o[ِۦٓ‌ۚ] إِ[g[نّ]َهُ[n[ۥ] لَا يُفْلِحُ [h:5985[ٱ]لْمُ[q:5255[جْ]رِم[p[ُو]نَ","translation_en":"Who is then more unjust than who forges a lie against Allah or (who) gives the lie to His communications? Surely the guilty shall not be successful.","translation_id":"Maka siapakah yang lebih zhalim daripada orang yang mengada-adakan kebohongan terhadap Allah atau mendustakan ayat-ayat-Nya? Sesungguhnya orang-orang yang berbuat dosa itu tidak akan beruntung.","hasanah_per_verse":540},{"text_madani":"وَيَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ وَيَقُولُونَ هَٰؤُلَاءِ شُفَعَاؤُنَا عِندَ اللَّهِ ۚ قُلْ أَتُنَبِّئُونَ اللَّهَ بِمَا لَا يَعْلَمُ فِي السَّمَاوَاتِ وَلَا فِي الْأَرْضِ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ","text_tajweed":"وَيَعْبُدُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ مَا لَا يَضُرُّهُمْ وَلَا يَ[f:534[نف]َعُهُمْ وَيَقُولُونَ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ شُفَعَ[o[ـٰٓ]ؤُنَا عِ[f:264[ند]َ [h:408[ٱ]للَّهِ‌ۚ قُلْ أَتُنَبِّــُٔونَ [h:5986[ٱ]للَّهَ بِمَا لَا يَعْلَمُ فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَلَا فِى [h:44[ٱ]لْأَرْضِ‌ۚ سُ[q:608[بْ]حَ[n[ـٰ]نَهُ[n[ۥ] وَتَعَ[n[ـٰ]لَىٰ عَ[g[مّ]َا يُشْرِك[p[ُو]نَ","translation_en":"And they serve beside Allah what can neither harm them nor profit them, and they say: These are our intercessors with Allah. Say: Do you (presume to) inform Allah of what He knows not in the heavens and the earth? Glory be to Him, and supremely exalted is He above what they set up (with Him).","translation_id":"Dan mereka menyembah selain Allah, sesuatu yang tidak dapat mendatangkan bencana kepada mereka dan tidak (pula) memberi manfaat, dan mereka berkata, “Mereka itu adalah pemberi syafaat kami di hadapan Allah.” Katakanlah, “Apakah kamu akan memberitahu kepada Allah sesuatu yang tidak diketahui-Nya apa yang di langit dan tidak (pula) yang di bumi?” Mahasuci Allah dan Mahatinggi dari apa yang mereka persekutukan itu.","hasanah_per_verse":1230},{"text_madani":"وَمَا كَانَ النَّاسُ إِلَّا أُمَّةً وَاحِدَةً فَاخْتَلَفُوا ۚ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ لَقُضِيَ بَيْنَهُمْ فِيمَا فِيهِ يَخْتَلِفُونَ","text_tajweed":"وَمَا كَانَ [h:1158[ٱ][l[ل][g[نّ]َاسُ إِلّ[o[َآ] أُ[g[مّ]َ[a:1159[ةً و][n[َٲ]حِدَ[f:5987[ةً ف]َ[h:5988[ٱ]خْتَلَفُو[s[اْ‌ۚ] وَلَوْلَا كَلِمَ[f:5989[ةٌ س]َبَقَتْ م[u:770[ِن ر]َّبِّكَ لَقُضِىَ بَيْنَهُمْ فِيمَا فِيهِ يَخْتَلِف[p[ُو]نَ","translation_en":"And people are naught but a single nation, so they disagree; and had not a word already gone forth from your Lord, the matter would have certainly been decided between them in respect of that concerning which they disagree.","translation_id":"Dan manusia itu dahulunya hanyalah satu umat, kemudian mereka berselisih. Kalau tidak karena suatu ketetapan yang telah ada dari Tuhanmu, pastilah telah diberi keputusan (di dunia) di antara mereka, tentang apa yang mereka perselisihkan itu.","hasanah_per_verse":710},{"text_madani":"وَيَقُولُونَ لَوْلَا أُنزِلَ عَلَيْهِ آيَةٌ مِّن رَّبِّهِ ۖ فَقُلْ إِنَّمَا الْغَيْبُ لِلَّهِ فَانتَظِرُوا إِنِّي مَعَكُم مِّنَ الْمُنتَظِرِينَ","text_tajweed":"وَيَقُولُونَ لَوْل[o[َآ] أُ[f:17[نز]ِلَ عَلَيْهِ ءَايَ[a:4024[ةٌ م]ّ[u:192[ِن ر]َّبِّه[n[ِۦ]‌ۖ فَقُلْ إِ[g[نّ]َمَا [h:5990[ٱ]لْغَيْبُ لِلَّهِ فَ[h:4800[ٱ][f:4800[نت]َظِر[o[ُوٓ][s[اْ] إِ[g[نّ]ِى مَعَك[w:2068[ُم م]ِّنَ [h:4801[ٱ]لْمُ[f:4802[نت]َظِر[p[ِي]نَ","translation_en":"And they say: Why is not a sign sent to him from his Lord? Say: The unseen is only for Allah; therefore wait-- surely I too, with you am of those who wait.","translation_id":"Dan mereka berkata, “Mengapa tidak diturunkan kepadanya (Muhammad) suatu bukti (mukjizat) dari Tuhannya?” Katakanlah, “Sungguh, segala yang gaib itu hanya milik Allah; sebab itu tunggu (sajalah) olehmu. Ketahuilah aku juga menunggu bersama kamu.”","hasanah_per_verse":680},{"text_madani":"وَإِذَا أَذَقْنَا النَّاسَ رَحْمَةً مِّن بَعْدِ ضَرَّاءَ مَسَّتْهُمْ إِذَا لَهُم مَّكْرٌ فِي آيَاتِنَا ۚ قُلِ اللَّهُ أَسْرَعُ مَكْرًا ۚ إِنَّ رُسُلَنَا يَكْتُبُونَ مَا تَمْكُرُونَ","text_tajweed":"وَإِذ[o[َآ] أَذَ[q:5991[قْ]نَا [h:5992[ٱ][l[ل][g[نّ]َاسَ رَحْمَ[a:5993[ةً م]ّ[i:146[ِنۢ ب]َعْدِ ضَرّ[o[َا]ٓءَ مَسَّتْهُمْ إِذَا لَه[w:5994[ُم م]َّكْ[f:5995[رٌ ف][o[ِىٓ] ءَايَاتِنَا‌ۚ قُلِ [h:3166[ٱ]للَّهُ أَسْرَعُ مَكْرًا‌ۚ إِ[g[نّ]َ رُسُلَنَا يَكْتُبُونَ مَا تَمْكُر[p[ُو]نَ","translation_en":"And when We make people taste of mercy after an affliction touches them, lo! they devise plans against Our communication. Say: Allah is quicker to plan; surely Our messengers write down what you plan.","translation_id":"Dan apabila Kami memberikan suatu rahmat kepada manusia, setelah mereka ditimpa bencana, mereka segera melakukan segala tipu daya (menentang) ayat-ayat Kami. Katakanlah, “Allah lebih cepat pembalasannya (atas tipu daya itu).”","hasanah_per_verse":840},{"text_madani":"هُوَ الَّذِي يُسَيِّرُكُمْ فِي الْبَرِّ وَالْبَحْرِ ۖ حَتَّىٰ إِذَا كُنتُمْ فِي الْفُلْكِ وَجَرَيْنَ بِهِم بِرِيحٍ طَيِّبَةٍ وَفَرِحُوا بِهَا جَاءَتْهَا رِيحٌ عَاصِفٌ وَجَاءَهُمُ الْمَوْجُ مِن كُلِّ مَكَانٍ وَظَنُّوا أَنَّهُمْ أُحِيطَ بِهِمْ ۙ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ لَئِنْ أَنجَيْتَنَا مِنْ هَٰذِهِ لَنَكُونَنَّ مِنَ الشَّاكِرِينَ","text_tajweed":"هُوَ [h:153[ٱ]لَّذِى يُسَيِّرُكُمْ فِى [h:4106[ٱ]لْبَرِّ وَ[h:4107[ٱ]لْبَحْرِ‌ۖ حَتَّ[o[ىٰٓ] إِذَا كُ[f:100[نت]ُمْ فِى [h:4780[ٱ]لْفُلْكِ وَجَرَيْنَ بِه[c:5996[ِم ب]ِرِي[f:5997[حٍ ط]َيِّبَ[a:5998[ةٍ و]َفَرِحُو[s[اْ] بِهَا ج[o[َا]ٓءَتْهَا رِيحٌ عَاصِ[a:5999[فٌ و]َج[o[َا]ٓءَهُمُ [h:6000[ٱ]لْمَوْجُ مِ[f:843[ن ك]ُلِّ مَكَا[a:6001[نٍ و]َظَ[g[نّ][o[ُوٓ][s[اْ] أَ[g[نّ]َهُمْ أُحِيطَ بِهِمْ‌ۙ دَعَوُ[s[اْ] [h:6002[ٱ]للَّهَ مُخْلِصِينَ لَهُ [h:4649[ٱ][l[ل]دِّينَ لَئِنْ أَ[f:6003[نج]َيْتَنَا مِنْ هَ[n[ـٰ]ذِه[n[ِۦ] لَنَكُونَ[g[نّ]َ مِنَ [h:4134[ٱ][l[ل]شَّ[n[ـٰ]كِر[p[ِي]نَ","translation_en":"He it is Who makes you travel by land and sea; until when you are in the ships, and they sail on with them in a pleasant breeze, and they rejoice, a violent wind overtakes them and the billows surge in on them from all sides, and they become certain that they are encompassed about, they pray to Allah, being sincere to Him in obedience: If Thou dost deliver us from this, we will most certainly be of the grateful ones.","translation_id":"Dialah Tuhan yang menjadikan kamu dapat berjalan di daratan, (dan berlayar) di lautan. Sehingga ketika kamu berada di dalam kapal, dan meluncurlah (kapal) itu membawa mereka (orang-orang yang ada di dalamnya) dengan tiupan angin yang baik, dan mereka bergembira karenanya; tiba-tiba datanglah badai dan gelombang menimpanya dari segenap penjuru, dan mereka mengira telah terkepung (bahaya), maka mereka berdoa dengan tulus ikhlas kepada Allah semata. (Seraya berkata), “Sekiranya Engkau menyelamatkan kami dari (bahaya) ini, pasti kami termasuk orang-orang yang bersyukur.”","hasanah_per_verse":1660},{"text_madani":"فَلَمَّا أَنجَاهُمْ إِذَا هُمْ يَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ ۗ يَا أَيُّهَا النَّاسُ إِنَّمَا بَغْيُكُمْ عَلَىٰ أَنفُسِكُم ۖ مَّتَاعَ الْحَيَاةِ الدُّنْيَا ۖ ثُمَّ إِلَيْنَا مَرْجِعُكُمْ فَنُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ","text_tajweed":"فَلَ[g[مّ][o[َآ] أَ[f:6004[نج]َ[n[ـٰ]هُمْ إِذَا هُمْ يَ[q:2073[بْ]غُونَ فِى [h:44[ٱ]لْأَرْضِ بِغَيْرِ [h:325[ٱ]لْحَقِّ‌ۗ يَ[o[ـٰٓ]أَيُّهَا [h:82[ٱ][l[ل][g[نّ]َاسُ إِ[g[نّ]َمَا بَغْيُكُمْ عَلَ[o[ىٰٓ] أَ[f:1329[نف]ُسِك[w:6005[ُم‌ۖ م]َّتَ[n[ـٰ]عَ [h:6006[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا‌ۖ ثُ[g[مّ]َ إِلَيْنَا مَرْجِعُكُمْ فَنُنَبِّئُك[c:6007[ُم ب]ِمَا كُ[f:100[نت]ُمْ تَعْمَل[p[ُو]نَ","translation_en":"But when He delivers them, lo! they are unjustly rebellious in the earth. O men! your rebellion is against your own souls-- provision (only) of this world's life-- then to Us shall be your return, so We will inform you of what you did.","translation_id":"Tetapi ketika Allah menyelamatkan mereka, malah mereka berbuat kezhaliman di bumi tanpa (alasan) yang benar. Wahai manusia! Sesungguhnya kezhalimanmu bahayanya akan menimpa dirimu sendiri; itu hanya kenikmatan hidup duniawi, selanjutnya kepada Kamilah kembalimu, kelak akan Kami kabarkan kepadamu apa yang telah kamu kerjakan.","hasanah_per_verse":1130},{"text_madani":"إِنَّمَا مَثَلُ الْحَيَاةِ الدُّنْيَا كَمَاءٍ أَنزَلْنَاهُ مِنَ السَّمَاءِ فَاخْتَلَطَ بِهِ نَبَاتُ الْأَرْضِ مِمَّا يَأْكُلُ النَّاسُ وَالْأَنْعَامُ حَتَّىٰ إِذَا أَخَذَتِ الْأَرْضُ زُخْرُفَهَا وَازَّيَّنَتْ وَظَنَّ أَهْلُهَا أَنَّهُمْ قَادِرُونَ عَلَيْهَا أَتَاهَا أَمْرُنَا لَيْلًا أَوْ نَهَارًا فَجَعَلْنَاهَا حَصِيدًا كَأَن لَّمْ تَغْنَ بِالْأَمْسِ ۚ كَذَٰلِكَ نُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَتَفَكَّرُونَ","text_tajweed":"إِ[g[نّ]َمَا مَثَلُ [h:6008[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا كَم[o[َا]ٓءٍ أَ[f:4236[نز]َلْنَ[n[ـٰ]هُ مِنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ فَ[h:6009[ٱ]خْتَلَطَ بِه[n[ِۦ] نَبَاتُ [h:6010[ٱ]لْأَرْضِ مِ[g[مّ]َا يَأْكُلُ [h:6011[ٱ][l[ل][g[نّ]َاسُ وَ[h:6012[ٱ]لْأَنْعَ[n[ـٰ]مُ حَتَّ[o[ىٰٓ] إِذ[o[َآ] أَخَذَتِ [h:6013[ٱ]لْأَرْضُ زُخْرُفَهَا وَ[h:6014[ٱ]زَّيَّنَتْ وَظَ[g[نّ]َ أَهْلُه[o[َآ] أَ[g[نّ]َهُمْ قَ[n[ـٰ]دِرُونَ عَلَيْه[o[َآ] أَتَ[n[ـٰ]ه[o[َآ] أَمْرُنَا لَيْلاً أَوْ نَهَا[f:6015[رًا ف]َجَعَلْنَ[n[ـٰ]هَا حَصِي[f:6016[دًا ك]َأ[u:2914[َن ل]َّمْ تَغْنَ بِ[h:6017[ٱ]لْأَمْسِ‌ۚ كَذ[n[َٲ]لِكَ نُفَصِّلُ [h:4091[ٱ]لْأَيَ[n[ـٰ]تِ لِقَوْ[a:6018[مٍ ي]َتَفَكَّر[p[ُو]نَ","translation_en":"The likeness of this world's life is only as water which We send down from the cloud, then the herbage of the earth of which men and cattle eat grows luxuriantly thereby, until when the earth puts on its golden raiment and it becomes garnished, and its people think that they have power over it, Our command comes to it, by night or by day, so We render it as reaped seed; produce, as though it had not been in existence yesterday; thus do We make clear the communications for a people who reflect.","translation_id":"Sesungguhnya perumpamaan kehidupan duniawi itu, hanya seperti air (hujan) yang Kami turunkan dari langit, lalu tumbuhlah tanaman-tanaman bumi dengan subur (karena air itu), di antaranya ada yang dimakan manusia dan hewan ternak. Hingga apabila bumi itu telah sempurna keindahannya, dan berhias, dan pemiliknya mengira bahwa mereka pasti menguasainya (memetik hasilnya), datanglah kepadanya azab Kami pada waktu malam atau siang, lalu Kami jadikan (tanaman)nya seperti tanaman yang sudah disabit, seakan-akan belum pernah tumbuh kemarin. Demikianlah Kami menjelaskan tanda-tanda (kekuasaan Kami) kepada orang yang berpikir.","hasanah_per_verse":1980},{"text_madani":"وَاللَّهُ يَدْعُو إِلَىٰ دَارِ السَّلَامِ وَيَهْدِي مَن يَشَاءُ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ","text_tajweed":"وَ[h:9999[ٱ]للَّهُ يَ[q:1242[دْ]ع[o[ُوٓ][s[اْ] إِلَىٰ دَارِ [h:6019[ٱ][l[ل]سَّلَ[n[ـٰ]مِ وَيَهْدِى م[a:476[َن ي]َش[o[َا]ٓءُ إِلَىٰ صِر[n[َٲ][a:726[طٍ م]ُّسْتَق[p[ِي]مٍ","translation_en":"And Allah invites to the abode of peace and guides whom He pleases into the right path.","translation_id":"Dan Allah menyeru (manusia) ke Darussalam (surga), dan memberikan petunjuk kepada orang yang Dia kehendaki ke jalan yang lurus (Islam).","hasanah_per_verse":450},{"text_madani":"لِّلَّذِينَ أَحْسَنُوا الْحُسْنَىٰ وَزِيَادَةٌ ۖ وَلَا يَرْهَقُ وُجُوهَهُمْ قَتَرٌ وَلَا ذِلَّةٌ ۚ أُولَٰئِكَ أَصْحَابُ الْجَنَّةِ ۖ هُمْ فِيهَا خَالِدُونَ","text_tajweed":"۞ لِّلَّذِينَ أَحْسَنُو[s[اْ] [h:6020[ٱ]لْحُسْنَىٰ وَزِيَادَ[a:6021[ةٌ‌ۖ و]َلَا يَرْهَقُ وُجُوهَهُمْ قَتَ[a:6022[رٌ و]َلَا ذِلَّةٌ‌ۚ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ أَصْحَ[n[ـٰ]بُ [h:415[ٱ]لْجَ[g[نّ]َةِ‌ۖ هُمْ فِيهَا خَ[n[ـٰ]لِد[p[ُو]نَ","translation_en":"For those who do good is good (reward) and more (than this); and blackness or ignominy shall not cover their faces; these are the dwellers of the garden; in it they shall abide.","translation_id":"Bagi orang-orang yang berbuat baik, ada pahala yang terbaik (surga) dan tambahannya (kenikmatan melihat Allah). Dan wajah mereka tidak ditutupi debu hitam dan tidak (pula) dalam kehinaan. Mereka itulah penghuni surga, mereka kekal di dalamnya.","hasanah_per_verse":720},{"text_madani":"وَالَّذِينَ كَسَبُوا السَّيِّئَاتِ جَزَاءُ سَيِّئَةٍ بِمِثْلِهَا وَتَرْهَقُهُمْ ذِلَّةٌ ۖ مَّا لَهُم مِّنَ اللَّهِ مِنْ عَاصِمٍ ۖ كَأَنَّمَا أُغْشِيَتْ وُجُوهُهُمْ قِطَعًا مِّنَ اللَّيْلِ مُظْلِمًا ۚ أُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ كَسَبُو[s[اْ] [h:6023[ٱ][l[ل]سَّيِّـَٔـاتِ جَز[o[َا]ٓءُ سَيِّئَ[i:6024[ةِۭ ب]ِمِثْلِهَا وَتَرْهَقُهُمْ ذِلَّ[a:6025[ةٌ‌ۖ م]َّا لَه[w:6026[ُم م]ِّنَ [h:321[ٱ]للَّهِ مِنْ عَاصِ[f:6027[مٍ‌ۖ ك]َأَ[g[نّ]َم[o[َآ] أُغْشِيَتْ وُجُوهُهُمْ قِطَ[a:6028[عًا م]ِّنَ [h:6029[ٱ]لَّيْلِ مُظْلِمًا‌ۚ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ أَصْحَ[n[ـٰ]بُ [h:201[ٱ][l[ل][g[نّ]َارِ‌ۖ هُمْ فِيهَا خَ[n[ـٰ]لِد[p[ُو]نَ","translation_en":"And (as for) those who have earned evil, the punishment of an evil is the like of it, and abasement shall come upon them-- they shall have none to protect them from Allah-- as if their faces had been covered with slices of the dense darkness of night; these are the inmates of the fire; in it they shall abide.","translation_id":"Adapun orang-orang yang berbuat kejahatan (akan mendapat) balasan kejahatan yang setimpal dan mereka diselubungi kehinaan. Tidak ada bagi mereka seorang pelindung pun dari (azab) Allah, seakan-akan wajah mereka ditutupi dengan kepingan-kepingan malam yang gelap gulita. Mereka itulah penghuni neraka, mereka kekal di dalamnya.","hasanah_per_verse":1180},{"text_madani":"وَيَوْمَ نَحْشُرُهُمْ جَمِيعًا ثُمَّ نَقُولُ لِلَّذِينَ أَشْرَكُوا مَكَانَكُمْ أَنتُمْ وَشُرَكَاؤُكُمْ ۚ فَزَيَّلْنَا بَيْنَهُمْ ۖ وَقَالَ شُرَكَاؤُهُم مَّا كُنتُمْ إِيَّانَا تَعْبُدُونَ","text_tajweed":"وَيَوْمَ نَحْشُرُهُمْ جَمِي[f:155[عًا ث]ُ[g[مّ]َ نَقُولُ لِلَّذِينَ أَشْرَكُو[s[اْ] مَكَانَكُمْ أَ[f:428[نت]ُمْ وَشُرَك[o[َا]ٓؤُكُمْ‌ۚ فَزَيَّلْنَا بَيْنَهُمْ‌ۖ وَقَالَ شُرَك[o[َا]ٓؤُه[w:6030[ُم م]َّا كُ[f:100[نت]ُمْ إِيَّانَا تَعْبُد[p[ُو]نَ","translation_en":"And on the day when We will gather them all together, then We will say to those who associated others (with Allah): Keep where you are, you and your associates; then We shall separate them widely one from another and their associates would say: It was not us that you served:","translation_id":"Dan (ingatlah) pada hari (ketika) itu Kami mengumpulkan mereka semuanya, kemudian Kami berkata kepada orang yang mempersekutukan (Allah), “Tetaplah di tempatmu, kamu dan para sekutumu.” Lalu Kami pisahkan mereka dan berkatalah sekutu-sekutu mereka, “Kamu sekali-kali tidak pernah menyembah kami.","hasanah_per_verse":890},{"text_madani":"فَكَفَىٰ بِاللَّهِ شَهِيدًا بَيْنَنَا وَبَيْنَكُمْ إِن كُنَّا عَنْ عِبَادَتِكُمْ لَغَافِلِينَ","text_tajweed":"فَكَفَىٰ بِ[h:32[ٱ]للَّهِ شَهِيد[i:6031[َۢا ب]َيْنَنَا وَبَيْنَكُمْ إِ[f:4919[ن ك]ُ[g[نّ]َا عَنْ عِبَادَتِكُمْ لَغَ[n[ـٰ]فِل[p[ِي]نَ","translation_en":"Therefore Allah is sufficient as a witness between us and you that we were quite unaware of your serving (us).","translation_id":"Maka cukuplah Allah menjadi saksi antara kami dengan kamu, sebab kami tidak tahu-menahu tentang penyembahan kamu (kepada kami).”","hasanah_per_verse":460},{"text_madani":"هُنَالِكَ تَبْلُو كُلُّ نَفْسٍ مَّا أَسْلَفَتْ ۚ وَرُدُّوا إِلَى اللَّهِ مَوْلَاهُمُ الْحَقِّ ۖ وَضَلَّ عَنْهُم مَّا كَانُوا يَفْتَرُونَ","text_tajweed":"هُنَالِكَ تَ[q:6032[بْ]لُو[s[اْ] كُلُّ نَفْ[a:1654[سٍ م]ّ[o[َآ] أَسْلَفَتْ‌ۚ وَرُدّ[o[ُوٓ][s[اْ] إِلَى [h:1637[ٱ]للَّهِ مَوْلَ[n[ـٰ]هُمُ [h:4123[ٱ]لْحَقِّ‌ۖ وَضَلَّ عَنْه[w:3985[ُم م]َّا كَانُو[s[اْ] يَفْتَر[p[ُو]نَ","translation_en":"There shall every soul become acquainted with what it sent before, and they shall be brought back to Allah, their true Patron, and what they devised shall escape from them.","translation_id":"Di tempat itu (padang Mahsyar), setiap jiwa merasakan pembalasan dari apa yang telah dikerjakannya (dahulu) dan mereka dikembalikan kepada Allah, pelindung mereka yang sebenarnya, dan lenyaplah dari mereka apa (pelindung palsu) yang mereka ada-adakan.","hasanah_per_verse":630},{"text_madani":"قُلْ مَن يَرْزُقُكُم مِّنَ السَّمَاءِ وَالْأَرْضِ أَمَّن يَمْلِكُ السَّمْعَ وَالْأَبْصَارَ وَمَن يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَمَن يُدَبِّرُ الْأَمْرَ ۚ فَسَيَقُولُونَ اللَّهُ ۚ فَقُلْ أَفَلَا تَتَّقُونَ","text_tajweed":"قُلْ م[a:6033[َن ي]َرْزُقُك[w:6034[ُم م]ِّنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ وَ[h:177[ٱ]لْأَرْضِ أَ[g[مّ][a:6035[َن ي]َمْلِكُ [h:6036[ٱ][l[ل]سَّمْعَ وَ[h:6037[ٱ]لْأَ[q:6037[بْ]صَ[n[ـٰ]رَ وَم[a:6038[َن ي]ُخْرِجُ [h:4258[ٱ]لْحَىَّ مِنَ [h:1833[ٱ]لْمَيِّتِ وَيُخْرِجُ [h:6039[ٱ]لْمَيِّتَ مِنَ [h:1835[ٱ]لْحَىِّ وَم[a:6040[َن ي]ُدَبِّرُ [h:5940[ٱ]لْأَمْرَ‌ۚ فَسَيَقُولُونَ [h:6041[ٱ]للَّهُ‌ۚ فَقُلْ أَفَلَا تَتَّق[p[ُو]نَ","translation_en":"Say: Who gives you sustenance from the heaven and the earth? Or Who controls the hearing and the sight? And Who brings forth the living from the dead, and brings forth the dead from the living? And Who regulates the affairs? Then they will say: Allah. Say then: Will you not then guard (against evil)?","translation_id":"Katakanlah (Muhammad), “Siapakah yang memberi rezeki kepadamu dari langit dan bumi, atau siapakah yang kuasa (menciptakan) pendengaran dan penglihatan, dan siapakah yang mengeluarkan yang hidup dari yang mati dan mengeluarkan yang mati dari yang hidup, dan siapakah yang mengatur segala urusan?” Maka mereka akan menjawab, “Allah.” Maka katakanlah, “Mengapa kamu tidak bertakwa (kepada-Nya)?”","hasanah_per_verse":1140},{"text_madani":"فَذَٰلِكُمُ اللَّهُ رَبُّكُمُ الْحَقُّ ۖ فَمَاذَا بَعْدَ الْحَقِّ إِلَّا الضَّلَالُ ۖ فَأَنَّىٰ تُصْرَفُونَ","text_tajweed":"فَذ[n[َٲ]لِكُمُ [h:6042[ٱ]للَّهُ رَبُّكُمُ [h:6043[ٱ]لْحَقُّ‌ۖ فَمَاذَا بَعْدَ [h:6044[ٱ]لْحَقِّ إِلَّا [h:6045[ٱ][l[ل]ضَّلَ[n[ـٰ]لُ‌ۖ فَأَ[g[نّ]َىٰ تُصْرَف[p[ُو]نَ","translation_en":"This then is Allah, your true Lord; and what is there after the truth but error; how are you then turned back?","translation_id":"Maka itulah Allah, Tuhan kamu yang sebenarnya; maka tidak ada setelah kebenaran itu melainkan kesesatan. Maka mengapa kamu berpaling (dari kebenaran)?","hasanah_per_verse":480},{"text_madani":"كَذَٰلِكَ حَقَّتْ كَلِمَتُ رَبِّكَ عَلَى الَّذِينَ فَسَقُوا أَنَّهُمْ لَا يُؤْمِنُونَ","text_tajweed":"كَذ[n[َٲ]لِكَ حَقَّتْ كَلِمَتُ رَبِّكَ عَلَى [h:289[ٱ]لَّذِينَ فَسَق[o[ُوٓ][s[اْ] أَ[g[نّ]َهُمْ لَا يُؤْمِن[p[ُو]نَ","translation_en":"Thus does the word of your Lord prove true against those who transgress that they do not believe.","translation_id":"Demikianlah telah tetap (hukuman) Tuhanmu terhadap orang-orang yang fasik, karena sesungguhnya mereka tidak beriman.","hasanah_per_verse":390},{"text_madani":"قُلْ هَلْ مِن شُرَكَائِكُم مَّن يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ ۚ قُلِ اللَّهُ يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ ۖ فَأَنَّىٰ تُؤْفَكُونَ","text_tajweed":"قُلْ هَلْ مِ[f:6046[ن ش]ُرَك[o[َا]ٓئِك[w:6047[ُم م]ّ[a:6048[َن ي]َ[q:5943[بْ]دَؤُ[s[اْ] [h:5944[ٱ]لْخَلْقَ ثُ[g[مّ]َ يُعِيدُهُ[n[ۥ]‌ۚ قُلِ [h:3166[ٱ]للَّهُ يَ[q:5943[بْ]دَؤُ[s[اْ] [h:5944[ٱ]لْخَلْقَ ثُ[g[مّ]َ يُعِيدُهُ[n[ۥ]‌ۖ فَأَ[g[نّ]َىٰ تُؤْفَك[p[ُو]نَ","translation_en":"Say: Is there any one among your associates who can bring into existence the creation in the first instance, then reproduce it? Say: Allah brings the creation into existence, then He reproduces it; how are you then turned away?","translation_id":"Katakanlah, “Adakah di antara sekutumu yang dapat memulai penciptaan (makhluk), kemudian mengulanginya (menghidupkannya) kembali?” Katakanlah, “Allah memulai (penciptaan) makhluk, kemudian mengulanginya. Maka bagaimana kamu dipalingkan (menyembah selain Allah)?”","hasanah_per_verse":630},{"text_madani":"قُلْ هَلْ مِن شُرَكَائِكُم مَّن يَهْدِي إِلَى الْحَقِّ ۚ قُلِ اللَّهُ يَهْدِي لِلْحَقِّ ۗ أَفَمَن يَهْدِي إِلَى الْحَقِّ أَحَقُّ أَن يُتَّبَعَ أَمَّن لَّا يَهِدِّي إِلَّا أَن يُهْدَىٰ ۖ فَمَا لَكُمْ كَيْفَ تَحْكُمُونَ","text_tajweed":"قُلْ هَلْ مِ[f:6046[ن ش]ُرَك[o[َا]ٓئِك[w:6047[ُم م]ّ[a:6049[َن ي]َهْد[o[ِىٓ] إِلَى [h:6050[ٱ]لْحَقِّ‌ۚ قُلِ [h:3166[ٱ]للَّهُ يَهْدِى لِلْحَقِّ‌ۗ أَفَم[a:6051[َن ي]َهْد[o[ِىٓ] إِلَى [h:6050[ٱ]لْحَقِّ أَحَقُّ أ[a:6052[َن ي]ُتَّبَعَ أَ[g[مّ][u:6053[َن ل]َّا يَهِدّ[o[ِىٓ] إِلّ[o[َآ] أ[a:6054[َن ي]ُهْدَىٰ‌ۖ فَمَا لَكُمْ كَيْفَ تَحْكُم[p[ُو]نَ","translation_en":"Say: Is there any of your associates who guides to the truth? Say: Allah guides to the truth. Is He then Who guides to the truth more worthy to be followed, or he who himself does not go aright unless he is guided? What then is the matter with you; how do you judge?","translation_id":"Katakanlah, “Apakah di antara sekutumu ada yang membimbing kepada kebenaran?” Katakanlah, “Allah-lah yang membimbing kepada kebenaran.” Maka manakah yang lebih berhak diikuti, Tuhan yang membimbing kepada kebenaran itu, ataukah orang yang tidak mampu membimbing bahkan perlu dibimbing? Maka mengapa kamu (berbuat demikian)? Bagaimanakah kamu mengambil keputusan?","hasanah_per_verse":970},{"text_madani":"وَمَا يَتَّبِعُ أَكْثَرُهُمْ إِلَّا ظَنًّا ۚ إِنَّ الظَّنَّ لَا يُغْنِي مِنَ الْحَقِّ شَيْئًا ۚ إِنَّ اللَّهَ عَلِيمٌ بِمَا يَفْعَلُونَ","text_tajweed":"وَمَا يَتَّبِعُ أَكْثَرُهُمْ إِلَّا ظَ[g[نّ]ًا‌ۚ إِ[g[نّ]َ [h:6055[ٱ][l[ل]ظَّ[g[نّ]َ لَا يُغْنِى مِنَ [h:1173[ٱ]لْحَقِّ شَيْــًٔا‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَلِي[i:6056[مُۢ ب]ِمَا يَفْعَل[p[ُو]نَ","translation_en":"And most of them do not follow (anything) but conjecture; surely conjecture will not avail aught against the truth; surely Allah is cognizant of what they do.","translation_id":"Dan kebanyakan mereka hanya mengikuti dugaan. Sesungguhnya dugaan itu tidak sedikit pun berguna untuk melawan kebenaran. Sungguh, Allah Maha Mengetahui apa yang mereka kerjakan.","hasanah_per_verse":600},{"text_madani":"وَمَا كَانَ هَٰذَا الْقُرْآنُ أَن يُفْتَرَىٰ مِن دُونِ اللَّهِ وَلَٰكِن تَصْدِيقَ الَّذِي بَيْنَ يَدَيْهِ وَتَفْصِيلَ الْكِتَابِ لَا رَيْبَ فِيهِ مِن رَّبِّ الْعَالَمِينَ","text_tajweed":"وَمَا كَانَ هَ[n[ـٰ]ذَا [h:3971[ٱ]لْقُرْءَانُ أ[a:6057[َن ي]ُفْتَرَىٰ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ وَلَ[n[ـٰ]كِ[f:6058[ن ت]َصْدِيقَ [h:6059[ٱ]لَّذِى بَيْنَ يَدَيْهِ وَتَفْصِيلَ [h:6060[ٱ]لْكِتَ[n[ـٰ]بِ لَا رَيْبَ فِيهِ م[u:4772[ِن ر]َّبِّ [h:4[ٱ]لْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"And this Quran is not such as could be forged by those besides Allah, but it is a verification of that which is before it and a clear explanation of the book, there is no doubt in it, from the Lord of the worlds.","translation_id":"Dan tidak mungkin Al-Qur'an ini dibuat-buat oleh selain Allah; tetapi (Al-Qur'an) membenarkan (kitab-kitab) yang sebelumnya dan menjelaskan hukum-hukum yang telah ditetapkannya, tidak ada keraguan di dalamnya, (diturunkan) dari Tuhan seluruh alam.","hasanah_per_verse":830},{"text_madani":"أَمْ يَقُولُونَ افْتَرَاهُ ۖ قُلْ فَأْتُوا بِسُورَةٍ مِّثْلِهِ وَادْعُوا مَنِ اسْتَطَعْتُم مِّن دُونِ اللَّهِ إِن كُنتُمْ صَادِقِينَ","text_tajweed":"أَمْ يَقُولُونَ [h:6061[ٱ]فْتَرَ[n[ٮٰ]هُ‌ۖ قُلْ فَأْتُو[s[اْ] بِسُورَ[a:6062[ةٍ م]ِّثْلِه[n[ِۦ] وَ[h:105[ٱ][q:105[دْ]عُو[s[اْ] مَنِ [h:6063[ٱ]سْتَطَعْت[w:5394[ُم م]ِّ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ صَ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"Or do they say: He has forged it? Say: Then bring a chapter like this and invite whom you can besides Allah, if you are truthful.","translation_id":"Apakah pantas mereka mengatakan dia (Muhammad) yang telah membuat-buatnya? Katakanlah, “Buatlah sebuah surah yang semisal dengan surah (Al-Qur'an), dan ajaklah siapa saja di antara kamu orang yang mampu (membuatnya) selain Allah, jika kamu orang-orang yang benar.”","hasanah_per_verse":660},{"text_madani":"بَلْ كَذَّبُوا بِمَا لَمْ يُحِيطُوا بِعِلْمِهِ وَلَمَّا يَأْتِهِمْ تَأْوِيلُهُ ۚ كَذَٰلِكَ كَذَّبَ الَّذِينَ مِن قَبْلِهِمْ ۖ فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ الظَّالِمِينَ","text_tajweed":"بَلْ كَذَّبُو[s[اْ] بِمَا لَمْ يُحِيطُو[s[اْ] بِعِلْمِه[n[ِۦ] وَلَ[g[مّ]َا يَأْتِهِمْ تَأْوِيلُهُ[n[ۥ]‌ۚ كَذ[n[َٲ]لِكَ كَذَّبَ [h:4507[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ‌ۖ فَ[h:1513[ٱ][f:1513[نظ]ُرْ كَيْفَ كَانَ عَ[n[ـٰ]قِبَةُ [h:6064[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"Nay, they reject that of which they have no comprehensive knowledge, and the final sequel of it has not yet come to them; even thus did those before them reject (the truth); see then what was the end of the unjust.","translation_id":"Bahkan (yang sebenarnya), mereka mendustakan apa yang mereka belum mengetahuinya dengan sempurna dan belum mereka peroleh penjelasannya. Demikianlah halnya umat-umat yang ada sebelum mereka telah mendustakan (rasul). Maka perhatikanlah bagaimana akibat orang yang zhalim.","hasanah_per_verse":810},{"text_madani":"وَمِنْهُم مَّن يُؤْمِنُ بِهِ وَمِنْهُم مَّن لَّا يُؤْمِنُ بِهِ ۚ وَرَبُّكَ أَعْلَمُ بِالْمُفْسِدِينَ","text_tajweed":"وَمِنْه[w:1106[ُم م]ّ[a:5799[َن ي]ُؤْمِنُ بِه[n[ِۦ] وَمِنْه[w:1106[ُم م]ّ[u:6065[َن ل]َّا يُؤْمِنُ بِه[n[ِۦ]‌ۚ وَرَبُّكَ أَعْلَمُ بِ[h:1989[ٱ]لْمُفْسِد[p[ِي]نَ","translation_en":"And of them is he who believes in it, and of them is he who does not believe in it, and your Lord best knows the mischief-makers.","translation_id":"Dan di antara mereka ada orang-orang yang beriman kepadanya (Al-Qur'an), dan di antaranya ada (pula) orang-orang yang tidak beriman kepadanya. Sedangkan Tuhanmu lebih mengetahui tentang orang-orang yang berbuat kerusakan.","hasanah_per_verse":450},{"text_madani":"وَإِن كَذَّبُوكَ فَقُل لِّي عَمَلِي وَلَكُمْ عَمَلُكُمْ ۖ أَنتُم بَرِيئُونَ مِمَّا أَعْمَلُ وَأَنَا بَرِيءٌ مِّمَّا تَعْمَلُونَ","text_tajweed":"وَإِ[f:6066[ن ك]َذَّبُوكَ فَقُل لِّى عَمَلِى وَلَكُمْ عَمَلُكُمْ‌ۖ أَ[f:428[نت][c:6067[ُم ب]َرِ[o[يٓ]ــُٔونَ مِ[g[مّ][o[َآ] أَعْمَلُ وَأَنَا۟ بَر[o[ِى]ٓ[a:3977[ءٌ م]ِّ[g[مّ]َا تَعْمَل[p[ُو]نَ","translation_en":"And if they call you a liar, say: My work is for me and your work for you; you are clear of what I do and I am clear of what you do.","translation_id":"Dan jika mereka (tetap) mendustakanmu (Muhammad), maka katakanlah, “Bagiku pekerjaanku dan bagimu pekerjaanmu. Kamu tidak bertanggung jawab terhadap apa yang aku kerjakan dan aku pun tidak bertanggung jawab terhadap apa yang kamu kerjakan.”","hasanah_per_verse":600},{"text_madani":"وَمِنْهُم مَّن يَسْتَمِعُونَ إِلَيْكَ ۚ أَفَأَنتَ تُسْمِعُ الصُّمَّ وَلَوْ كَانُوا لَا يَعْقِلُونَ","text_tajweed":"وَمِنْه[w:1106[ُم م]ّ[a:6068[َن ي]َسْتَمِعُونَ إِلَيْكَ‌ۚ أَفَأَ[f:6069[نت]َ تُسْمِعُ [h:6070[ٱ][l[ل]صُّ[g[مّ]َ وَلَوْ كَانُو[s[اْ] لَا يَعْقِل[p[ُو]نَ","translation_en":"And there are those of them who hear you, but can you make the deaf to hear though they will not understand?","translation_id":"Dan di antara mereka ada yang mendengarkan engkau (Muhammad). Tetapi apakah engkau dapat menjadikan orang yang tuli itu mendengar walaupun mereka tidak mengerti?","hasanah_per_verse":470},{"text_madani":"وَمِنْهُم مَّن يَنظُرُ إِلَيْكَ ۚ أَفَأَنتَ تَهْدِي الْعُمْيَ وَلَوْ كَانُوا لَا يُبْصِرُونَ","text_tajweed":"وَمِنْه[w:1106[ُم م]ّ[a:6071[َن ي]َ[f:2039[نظ]ُرُ إِلَيْكَ‌ۚ أَفَأَ[f:6069[نت]َ تَهْدِى [h:6072[ٱ]لْعُمْىَ وَلَوْ كَانُو[s[اْ] لَا يُ[q:60[بْ]صِر[p[ُو]نَ","translation_en":"And there are those of them who look at you, but can you show the way to the blind though they will not see?","translation_id":"Dan di antara mereka ada yang melihat kepada engkau. Tetapi apakah engkau dapat memberi petunjuk kepada orang yang buta, walaupun mereka tidak memperhatikan?","hasanah_per_verse":450},{"text_madani":"إِنَّ اللَّهَ لَا يَظْلِمُ النَّاسَ شَيْئًا وَلَٰكِنَّ النَّاسَ أَنفُسَهُمْ يَظْلِمُونَ","text_tajweed":"إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَا يَظْلِمُ [h:6073[ٱ][l[ل][g[نّ]َاسَ شَيْـ[a:6074[ـًٔا و]َلَ[n[ـٰ]كِ[g[نّ]َ [h:6075[ٱ][l[ل][g[نّ]َاسَ أَ[f:38[نف]ُسَهُمْ يَظْلِم[p[ُو]نَ","translation_en":"Surely Allah does not do any injustice to men, but men are unjust to themselves.","translation_id":"Sesungguhnya Allah tidak menzhalimi manusia sedikit pun, tetapi manusia itulah yang menzhalimi dirinya sendiri.","hasanah_per_verse":420},{"text_madani":"وَيَوْمَ يَحْشُرُهُمْ كَأَن لَّمْ يَلْبَثُوا إِلَّا سَاعَةً مِّنَ النَّهَارِ يَتَعَارَفُونَ بَيْنَهُمْ ۚ قَدْ خَسِرَ الَّذِينَ كَذَّبُوا بِلِقَاءِ اللَّهِ وَمَا كَانُوا مُهْتَدِينَ","text_tajweed":"وَيَوْمَ يَحْشُرُهُمْ كَأ[u:2914[َن ل]َّمْ يَلْبَث[o[ُوٓ][s[اْ] إِلَّا سَاعَ[a:6076[ةً م]ِّنَ [h:6077[ٱ][l[ل][g[نّ]َهَارِ يَتَعَارَفُونَ بَيْنَهُمْ‌ۚ قَ[q:298[دْ] خَسِرَ [h:3997[ٱ]لَّذِينَ كَذَّبُو[s[اْ] بِلِق[o[َا]ٓءِ [h:3998[ٱ]للَّهِ وَمَا كَانُو[s[اْ] مُهْتَد[p[ِي]نَ","translation_en":"And on the day when He will gather them as though they had not stayed but an hour of the day, they will know each other. They will perish indeed who called the meeting with Allah to be a lie, and they are not followers of the right direction.","translation_id":"Dan (ingatlah) pada hari (ketika) Allah mengumpulkan mereka, (mereka merasa) seakan-akan tidak pernah berdiam (di dunia) kecuali sesaat saja pada siang hari, (pada waktu) mereka saling berkenalan. Sungguh rugi orang yang mendustakan pertemuan mereka dengan Allah dan mereka tidak mendapat petunjuk.","hasanah_per_verse":870},{"text_madani":"وَإِمَّا نُرِيَنَّكَ بَعْضَ الَّذِي نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِلَيْنَا مَرْجِعُهُمْ ثُمَّ اللَّهُ شَهِيدٌ عَلَىٰ مَا يَفْعَلُونَ","text_tajweed":"وَإِ[g[مّ]َا نُرِيَ[g[نّ]َكَ بَعْضَ [h:1943[ٱ]لَّذِى نَعِدُهُمْ أَوْ نَتَوَفَّيَ[g[نّ]َكَ فَإِلَيْنَا مَرْجِعُهُمْ ثُ[g[مّ]َ [h:6078[ٱ]للَّهُ شَهِيدٌ عَلَىٰ مَا يَفْعَل[p[ُو]نَ","translation_en":"And if We show you something of what We threaten them with, or cause you to die, yet to Us is their return, and Allah is the bearer of witness to what they do.","translation_id":"Dan jika Kami perlihatkan kepadamu (Muhammad) sebagian dari (siksaan) yang Kami janjikan kepada mereka, (tentulah engkau akan melihatnya) atau (jika) Kami wafatkan engkau (sebelum itu), maka kepada Kami (jualah) mereka kembali, dan Allah menjadi saksi atas apa yang mereka kerjakan.","hasanah_per_verse":630},{"text_madani":"وَلِكُلِّ أُمَّةٍ رَّسُولٌ ۖ فَإِذَا جَاءَ رَسُولُهُمْ قُضِيَ بَيْنَهُم بِالْقِسْطِ وَهُمْ لَا يُظْلَمُونَ","text_tajweed":"وَلِكُلِّ أُ[g[مّ]َ[u:6079[ةٍ ر]َّسُو[f:6080[لٌ‌ۖ ف]َإِذَا ج[o[َا]ٓءَ رَسُولُهُمْ قُضِىَ بَيْنَه[c:3554[ُم ب]ِ[h:1800[ٱ]لْقِسْطِ وَهُمْ لَا يُظْلَم[p[ُو]نَ","translation_en":"And every nation had a messenger; so when their messenger came, the matter was decided between them with justice and they shall not be dealt with unjustly.","translation_id":"Dan setiap umat (mempunyai) rasul. Maka apabila rasul mereka telah datang, diberlakukanlah hukum bagi mereka dengan adil dan (sedikit pun) tidak dizhalimi.","hasanah_per_verse":490},{"text_madani":"وَيَقُولُونَ مَتَىٰ هَٰذَا الْوَعْدُ إِن كُنتُمْ صَادِقِينَ","text_tajweed":"وَيَقُولُونَ مَتَىٰ هَ[n[ـٰ]ذَا [h:6081[ٱ]لْوَعْدُ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ صَ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"And they say: When will this threat come about, if you are truthful?","translation_id":"Dan mereka mengatakan, ”Bilakah (datangnya) ancaman itu, jika kamu orang-orang yang benar?”","hasanah_per_verse":300},{"text_madani":"قُل لَّا أَمْلِكُ لِنَفْسِي ضَرًّا وَلَا نَفْعًا إِلَّا مَا شَاءَ اللَّهُ ۗ لِكُلِّ أُمَّةٍ أَجَلٌ ۚ إِذَا جَاءَ أَجَلُهُمْ فَلَا يَسْتَأْخِرُونَ سَاعَةً ۖ وَلَا يَسْتَقْدِمُونَ","text_tajweed":"قُل لّ[o[َآ] أَمْلِكُ لِنَفْسِى ضَر[a:3719[ًّا و]َلَا نَفْعًا إِلَّا مَا ش[o[َا]ٓءَ [h:78[ٱ]للَّهُ‌ۗ لِكُلِّ أُ[g[مّ]َةٍ أَجَلٌ‌ۚ إِذَا ج[o[َا]ٓءَ أَجَلُهُمْ فَلَا يَسْتَــْٔخِرُونَ سَاعَ[a:4666[ةً‌ۖ و]َلَا يَسْتَ[q:4667[قْ]دِم[p[ُو]نَ","translation_en":"Say: I do not control for myself any harm, or any benefit except what Allah pleases; every nation has a term; when their term comes, they shall not then remain behind for an hour, nor can they go before (their time).","translation_id":"Katakanlah (Muhammad), “Aku tidak kuasa menolak mudarat maupun mendatangkan manfaat kepada diriku, kecuali apa yang Allah kehendaki.” Bagi setiap umat mempunyai ajal (batas waktu). Apabila ajalnya tiba, mereka tidak dapat meminta penundaan atau percepatan sesaat pun.","hasanah_per_verse":810},{"text_madani":"قُلْ أَرَأَيْتُمْ إِنْ أَتَاكُمْ عَذَابُهُ بَيَاتًا أَوْ نَهَارًا مَّاذَا يَسْتَعْجِلُ مِنْهُ الْمُجْرِمُونَ","text_tajweed":"قُلْ أَرَءَيْتُمْ إِنْ أَتَ[n[ـٰ]كُمْ عَذَابُهُ[n[ۥ] بَيَ[n[ـٰ]تًا أَوْ نَهَا[a:6082[رًا م]َّاذَا يَسْتَعْجِلُ مِنْهُ [h:6083[ٱ]لْمُ[q:5255[جْ]رِم[p[ُو]نَ","translation_en":"Say: Tell me if His punishment overtakes you by night or by day! what then is there of it that the guilty would hasten on?","translation_id":"Katakanlah, “Terangkanlah kepadaku, jika datang kepada kamu siksaan-Nya pada waktu malam atau siang hari, manakah yang diminta untuk disegerakan orang-orang yang berdosa itu?”","hasanah_per_verse":530},{"text_madani":"أَثُمَّ إِذَا مَا وَقَعَ آمَنتُم بِهِ ۚ آلْآنَ وَقَدْ كُنتُم بِهِ تَسْتَعْجِلُونَ","text_tajweed":"أَثُ[g[مّ]َ إِذَا مَا وَقَعَ ءَامَ[f:703[نت][c:704[ُم ب]ِه[o[ِۦٓ‌ۚ] ءَ[m[ا]ٓلْـَٔ[n[ـٰ]نَ وَقَ[q:387[دْ] كُ[f:100[نت][c:6084[ُم ب]ِه[n[ِۦ] تَسْتَعْجِل[p[ُو]نَ","translation_en":"And when it comes to pass, will you believe in it? What! now (you believe), and already you wished to have it hastened on.","translation_id":"Kemudian apakah setelah azab itu terjadi, kamu baru mempercayainya? Apakah (baru) sekarang, padahal sebelumnya kamu selalu meminta agar disegerakan?","hasanah_per_verse":390},{"text_madani":"ثُمَّ قِيلَ لِلَّذِينَ ظَلَمُوا ذُوقُوا عَذَابَ الْخُلْدِ هَلْ تُجْزَوْنَ إِلَّا بِمَا كُنتُمْ تَكْسِبُونَ","text_tajweed":"ثُ[g[مّ]َ قِيلَ لِلَّذِينَ ظَلَمُو[s[اْ] ذُوقُو[s[اْ] عَذَابَ [h:6085[ٱ]لْخُلْدِ هَلْ تُ[q:4248[جْ]زَوْنَ إِلَّا بِمَا كُ[f:100[نت]ُمْ تَكْسِب[p[ُو]نَ","translation_en":"Then it shall be said to those who were unjust: Taste abiding chastisement; you are not requited except for what you earned.","translation_id":"Kemudian dikatakan kepada orang-orang yang zhalim itu, “Rasakanlah olehmu siksaan yang kekal. Kamu tidak diberi balasan, melainkan (sesuai) dengan apa yang telah kamu lakukan.”","hasanah_per_verse":520},{"text_madani":"وَيَسْتَنبِئُونَكَ أَحَقٌّ هُوَ ۖ قُلْ إِي وَرَبِّي إِنَّهُ لَحَقٌّ ۖ وَمَا أَنتُم بِمُعْجِزِينَ","text_tajweed":"۞ وَيَسْتَ[i:6086[نۢب]ِــُٔونَكَ أَحَقٌّ هُوَ‌ۖ قُلْ إِى وَرَبّ[o[ِىٓ] إِ[g[نّ]َهُ[n[ۥ] لَحَ[a:6087[قٌّ‌ۖ و]َم[o[َآ] أَ[f:428[نت][c:4435[ُم ب]ِمُعْجِز[p[ِي]نَ","translation_en":"And they ask you: Is that true? Say: Aye! by my Lord! it is most surely the truth, and you will not escape.","translation_id":"Dan mereka menanyakan kepadamu (Muhammad), “Benarkah (azab yang dijanjikan) itu?” Katakanlah, “Ya, demi Tuhanku, sesungguhnya (azab) itu pasti benar dan kamu sekali-kali tidak dapat menghindar.”","hasanah_per_verse":430},{"text_madani":"وَلَوْ أَنَّ لِكُلِّ نَفْسٍ ظَلَمَتْ مَا فِي الْأَرْضِ لَافْتَدَتْ بِهِ ۗ وَأَسَرُّوا النَّدَامَةَ لَمَّا رَأَوُا الْعَذَابَ ۖ وَقُضِيَ بَيْنَهُم بِالْقِسْطِ ۚ وَهُمْ لَا يُظْلَمُونَ","text_tajweed":"وَلَوْ أَ[g[نّ]َ لِكُلِّ نَفْ[f:6088[سٍ ظ]َلَمَتْ مَا فِى [h:44[ٱ]لْأَرْضِ لَ[h:6089[ٱ]فْتَدَتْ بِه[n[ِۦ]‌ۗ وَأَسَرُّو[s[اْ] [h:6090[ٱ][l[ل][g[نّ]َدَامَةَ لَ[g[مّ]َا رَأَوُ[s[اْ] [h:6091[ٱ]لْعَذَابَ‌ۖ وَقُضِىَ بَيْنَه[c:3554[ُم ب]ِ[h:1800[ٱ]لْقِسْطِ‌ۚ وَهُمْ لَا يُظْلَم[p[ُو]نَ","translation_en":"And if every soul that has done injustice had all that is in the earth, it would offer it for ransom, and they will manifest regret when they see the chastisement and the matter shall be decided between them with justice and they shall not be dealt with unjustly.","translation_id":"Dan kalau setiap orang yang zhalim itu (mempunyai) segala yang ada di bumi, tentu dia menebus dirinya dengan itu, dan mereka menyembunyikan penyesalannya ketika mereka telah menyaksikan azab itu. Kemudian diberi keputusan di antara mereka dengan adil, dan mereka tidak dizhalimi.","hasanah_per_verse":840},{"text_madani":"أَلَا إِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۗ أَلَا إِنَّ وَعْدَ اللَّهِ حَقٌّ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ","text_tajweed":"أَل[o[َآ] إِ[g[نّ]َ لِلَّهِ مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۗ أَل[o[َآ] إِ[g[نّ]َ وَعْدَ [h:3149[ٱ]للَّهِ حَ[a:6092[قٌّ و]َلَ[n[ـٰ]كِ[g[نّ]َ أَكْثَرَهُمْ لَا يَعْلَم[p[ُو]نَ","translation_en":"Now surely Allah's is what is in the heavens and the earth; now surely Allah's promise is true, but most of them do not know.","translation_id":"Ketahuilah sesungguhnya milik Allah-lah apa yang ada di langit dan di bumi. Bukankah janji Allah itu benar? Tetapi kebanyakan mereka tidak mengetahui.","hasanah_per_verse":580},{"text_madani":"هُوَ يُحْيِي وَيُمِيتُ وَإِلَيْهِ تُرْجَعُونَ","text_tajweed":"هُوَ يُحْى[n[ِۦ] وَيُمِيتُ وَإِلَيْهِ تُرْجَع[p[ُو]نَ","translation_en":"He gives life and causes death, and to Him you shall be brought back.","translation_id":"Dialah yang menghidupkan dan mematikan dan hanya kepada-Nyalah kamu dikembalikan.","hasanah_per_verse":220},{"text_madani":"يَا أَيُّهَا النَّاسُ قَدْ جَاءَتْكُم مَّوْعِظَةٌ مِّن رَّبِّكُمْ وَشِفَاءٌ لِّمَا فِي الصُّدُورِ وَهُدًى وَرَحْمَةٌ لِّلْمُؤْمِنِينَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:82[ٱ][l[ل][g[نّ]َاسُ قَ[q:298[دْ] ج[o[َا]ٓءَتْك[w:6093[ُم م]َّوْعِظَ[a:1635[ةٌ م]ّ[u:243[ِن ر]َّبِّكُمْ وَشِف[o[َا]ٓ[u:6094[ءٌ ل]ِّمَا فِى [h:6095[ٱ][l[ل]صُّدُورِ وَهُ[a:4547[دًى و]َرَحْمَ[u:6096[ةٌ ل]ِّلْمُؤْمِن[p[ِي]نَ","translation_en":"O men! there has come to you indeed an admonition from your Lord and a healing for what is in the breasts and a guidance and a mercy for the believers.","translation_id":"Wahai manusia! Sungguh, telah datang kepadamu pelajaran (Al-Qur'an) dari Tuhanmu, penyembuh bagi penyakit yang ada dalam dada dan petunjuk serta rahmat bagi orang yang beriman.","hasanah_per_verse":630},{"text_madani":"قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَٰلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِّمَّا يَجْمَعُونَ","text_tajweed":"قُلْ بِفَضْلِ [h:6097[ٱ]للَّهِ وَبِرَحْمَتِه[n[ِۦ] فَبِذ[n[َٲ]لِكَ فَلْيَفْرَحُو[s[اْ] هُوَ خَيْ[a:2365[رٌ م]ِّ[g[مّ]َا يَ[q:2366[جْ]مَع[p[ُو]نَ","translation_en":"Say: In the grace of Allah and in His mercy-- in that they should rejoice; it is better than that which they gather.","translation_id":"Katakanlah (Muhammad), “Dengan karunia Allah dan rahmat-Nya, hendaklah dengan itu mereka bergembira. Itu lebih baik daripada apa yang mereka kumpulkan.”","hasanah_per_verse":440},{"text_madani":"قُلْ أَرَأَيْتُم مَّا أَنزَلَ اللَّهُ لَكُم مِّن رِّزْقٍ فَجَعَلْتُم مِّنْهُ حَرَامًا وَحَلَالًا قُلْ آللَّهُ أَذِنَ لَكُمْ ۖ أَمْ عَلَى اللَّهِ تَفْتَرُونَ","text_tajweed":"قُلْ أَرَءَيْت[w:6098[ُم م]ّ[o[َآ] أَ[f:471[نز]َلَ [h:472[ٱ]للَّهُ لَك[w:556[ُم م]ّ[u:6099[ِن ر]ِّزْ[f:6100[قٍ ف]َجَعَلْت[w:6101[ُم م]ِّنْهُ حَرَا[a:6102[مًا و]َحَلَ[n[ـٰ]ل[f:6103[اً ق]ُلْ ءَآللَّهُ أَذِنَ لَكُمْ‌ۖ أَمْ عَلَى [h:412[ٱ]للَّهِ تَفْتَر[p[ُو]نَ","translation_en":"Say: Tell me what Allah has sent down for you of sustenance, then you make (a part) of it unlawful and (a part) lawful. Say: Has Allah commanded you, or do you forge a lie against Allah?","translation_id":"Katakanlah (Muhammad), “Terangkanlah kepadaku tentang rezeki yang diturunkan Allah kepadamu, lalu kamu jadikan sebagiannya haram dan sebagiannya halal.” Katakanlah, “Apakah Allah telah memberikan izin kepadamu (ten-tang ini) ataukah kamu mengada-ada atas nama Allah?”","hasanah_per_verse":730},{"text_madani":"وَمَا ظَنُّ الَّذِينَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ يَوْمَ الْقِيَامَةِ ۗ إِنَّ اللَّهَ لَذُو فَضْلٍ عَلَى النَّاسِ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَشْكُرُونَ","text_tajweed":"وَمَا ظَ[g[نّ]ُ [h:6104[ٱ]لَّذِينَ يَفْتَرُونَ عَلَى [h:412[ٱ]للَّهِ [h:2035[ٱ]لْكَذِبَ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ‌ۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَذُو فَضْلٍ عَلَى [h:729[ٱ][l[ل][g[نّ]َاسِ وَلَ[n[ـٰ]كِ[g[نّ]َ أَكْثَرَهُمْ لَا يَشْكُر[p[ُو]نَ","translation_en":"And what will be the thought of those who forge lies against Allah on the day of resurrection? Most surely Allah is the Lord of grace towards men, but most of them do not give thanks.","translation_id":"Dan apakah dugaan orang-orang yang mengada-adakan kebohongan terhadap Allah pada hari Kiamat? Sesungguhnya Allah benar-benar mempunyai karunia (yang dilimpahkan) kepada manusia, tetapi kebanyakan mereka tidak bersyukur.","hasanah_per_verse":760},{"text_madani":"وَمَا تَكُونُ فِي شَأْنٍ وَمَا تَتْلُو مِنْهُ مِن قُرْآنٍ وَلَا تَعْمَلُونَ مِنْ عَمَلٍ إِلَّا كُنَّا عَلَيْكُمْ شُهُودًا إِذْ تُفِيضُونَ فِيهِ ۚ وَمَا يَعْزُبُ عَن رَّبِّكَ مِن مِّثْقَالِ ذَرَّةٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَلَا أَصْغَرَ مِن ذَٰلِكَ وَلَا أَكْبَرَ إِلَّا فِي كِتَابٍ مُّبِينٍ","text_tajweed":"وَمَا تَكُونُ فِى شَأْ[a:6105[نٍ و]َمَا تَتْلُو[s[اْ] مِنْهُ مِ[f:6106[ن ق]ُرْءَا[a:6107[نٍ و]َلَا تَعْمَلُونَ مِنْ عَمَلٍ إِلَّا كُ[g[نّ]َا عَلَيْكُمْ شُهُودًا إِذْ تُفِيضُونَ فِيهِ‌ۚ وَمَا يَعْزُبُ ع[u:6108[َن ر]َّبِّكَ م[a:6109[ِن م]ِّثْقَالِ ذَرَّ[f:6110[ةٍ ف]ِى [h:44[ٱ]لْأَرْضِ وَلَا فِى [h:746[ٱ][l[ل]سَّم[o[َا]ٓءِ وَل[o[َآ] أَصْغَرَ مِ[f:2624[ن ذ][n[َٲ]لِكَ وَل[o[َآ] أَكْبَرَ إِلَّا فِى كِتَ[n[ـٰ][a:4113[بٍ م]ُّب[p[ِي]نٍ","translation_en":"And you are not (engaged) in any affair, nor do you recite concerning it any portion of the Quran, nor do you do any work but We are witnesses over you when you enter into it, and there does not lie concealed from your Lord the weight of an atom in the earth or in the heaven, nor any thing less than that nor greater, but it is in a clear book.","translation_id":"Dan tidakkah engkau (Muhammad) berada dalam suatu urusan, dan tidak membaca suatu ayat Al-Qur'an serta tidak pula kamu melakukan suatu pekerjaan, melainkan Kami menjadi saksi atasmu ketika kamu melakukannya. Tidak lengah sedikit pun dari pengetahuan Tuhanmu biarpun sebesar zarrah, baik di bumi ataupun di langit. Tidak ada sesuatu yang lebih kecil dan yang lebih besar daripada itu, melainkan semua tercatat dalam Kitab yang nyata (Lauh Mahfuzh).","hasanah_per_verse":1410},{"text_madani":"أَلَا إِنَّ أَوْلِيَاءَ اللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ","text_tajweed":"أَل[o[َآ] إِ[g[نّ]َ أَوْلِي[o[َا]ٓءَ [h:6111[ٱ]للَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَن[p[ُو]نَ","translation_en":"Now surely the friends of Allah-- they shall have no fear nor shall they grieve.","translation_id":"Ingatlah wali-wali Allah itu, tidak ada rasa takut pada mereka dan mereka tidak bersedih hati.","hasanah_per_verse":360},{"text_madani":"الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ","text_tajweed":"ٱلَّذِينَ ءَامَنُو[s[اْ] وَكَانُو[s[اْ] يَتَّق[p[ُو]نَ","translation_en":"Those who believe and guarded (against evil):","translation_id":"(Yaitu) orang-orang yang beriman dan senantiasa bertakwa.","hasanah_per_verse":210},{"text_madani":"لَهُمُ الْبُشْرَىٰ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ ۚ لَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ ۚ ذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ","text_tajweed":"لَهُمُ [h:6112[ٱ]لْبُشْرَىٰ فِى [h:441[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا وَفِى [h:1108[ٱ]لْأَخِرَةِ‌ۚ لَا تَ[q:6113[بْ]دِيلَ لِكَلِمَ[n[ـٰ]تِ [h:4009[ٱ]للَّهِ‌ۚ ذ[n[َٲ]لِكَ هُوَ [h:5722[ٱ]لْفَوْزُ [h:2633[ٱ]لْعَظ[p[ِي]مُ","translation_en":"They shall have good news in this world's life and in the hereafter; there is no changing the words of Allah; that is the mighty achievement.","translation_id":"Bagi mereka berita gembira di dalam kehidupan di dunia dan di akhirat. Tidak ada perubahan bagi janji-janji Allah. Demikian itulah kemenangan yang agung.","hasanah_per_verse":650},{"text_madani":"وَلَا يَحْزُنكَ قَوْلُهُمْ ۘ إِنَّ الْعِزَّةَ لِلَّهِ جَمِيعًا ۚ هُوَ السَّمِيعُ الْعَلِيمُ","text_tajweed":"وَلَا يَحْزُ[f:2435[نك]َ قَوْلُهُمْ‌ۘ إِ[g[نّ]َ [h:6114[ٱ]لْعِزَّةَ لِلَّهِ جَمِيعًا‌ۚ هُوَ [h:3721[ٱ][l[ل]سَّمِيعُ [h:669[ٱ]لْعَل[p[ِي]مُ","translation_en":"And let not their speech grieve you; surely might is wholly Allah's; He is the Hearing, the Knowing.","translation_id":"Dan janganlah engkau (Muhammad) sedih oleh perkataan mereka. Sungguh, kekuasaan itu seluruhnya milik Allah. Dia Maha Mendengar, Maha Mengetahui.","hasanah_per_verse":420},{"text_madani":"أَلَا إِنَّ لِلَّهِ مَن فِي السَّمَاوَاتِ وَمَن فِي الْأَرْضِ ۗ وَمَا يَتَّبِعُ الَّذِينَ يَدْعُونَ مِن دُونِ اللَّهِ شُرَكَاءَ ۚ إِن يَتَّبِعُونَ إِلَّا الظَّنَّ وَإِنْ هُمْ إِلَّا يَخْرُصُونَ","text_tajweed":"أَل[o[َآ] إِ[g[نّ]َ لِلَّهِ مَ[f:2074[ن ف]ِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَ[f:3453[ن ف]ِى [h:44[ٱ]لْأَرْضِ‌ۗ وَمَا يَتَّبِعُ [h:6115[ٱ]لَّذِينَ يَ[q:1240[دْ]عُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ شُرَك[o[َا]ٓءَ‌ۚ إ[a:4358[ِن ي]َتَّبِعُونَ إِلَّا [h:4359[ٱ][l[ل]ظَّ[g[نّ]َ وَإِنْ هُمْ إِلَّا يَخْرُص[p[ُو]نَ","translation_en":"Now, surely, whatever is in the heavens and whatever is in the earth is Allah's; and they do not (really) follow any associates, who call on others besides Allah; they do not follow (anything) but conjectures, and they only lie.","translation_id":"Ingatlah, milik Allah meliputi siapa yang ada di langit dan siapa yang ada di bumi. Dan orang-orang yang menyeru sekutu-sekutu selain Allah, tidaklah mengikuti (suatu keyakinan). Mereka hanya mengikuti persangkaan belaka, dan mereka hanyalah menduga-duga.","hasanah_per_verse":900},{"text_madani":"هُوَ الَّذِي جَعَلَ لَكُمُ اللَّيْلَ لِتَسْكُنُوا فِيهِ وَالنَّهَارَ مُبْصِرًا ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَسْمَعُونَ","text_tajweed":"هُوَ [h:153[ٱ]لَّذِى جَعَلَ لَكُمُ [h:6116[ٱ]لَّيْلَ لِتَسْكُنُو[s[اْ] فِيهِ وَ[h:6117[ٱ][l[ل][g[نّ]َهَارَ مُ[q:6118[بْ]صِرًا‌ۚ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:849[تٍ ل]ِّقَوْ[a:6119[مٍ ي]َسْمَع[p[ُو]نَ","translation_en":"He it is Who made for you the night that you might rest in it, and the day giving light; most surely there are signs in it for a people who would hear.","translation_id":"Dialah yang menjadikan malam bagimu agar kamu beristirahat padanya dan menjadikan siang terang benderang. Sungguh, yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi orang-orang yang mendengar.","hasanah_per_verse":610},{"text_madani":"قَالُوا اتَّخَذَ اللَّهُ وَلَدًا ۗ سُبْحَانَهُ ۖ هُوَ الْغَنِيُّ ۖ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ إِنْ عِندَكُم مِّن سُلْطَانٍ بِهَٰذَا ۚ أَتَقُولُونَ عَلَى اللَّهِ مَا لَا تَعْلَمُونَ","text_tajweed":"قَالُو[s[اْ] [h:6120[ٱ]تَّخَذَ [h:606[ٱ]للَّهُ وَلَ[f:607[دًا‌ۗ س]ُ[q:608[بْ]حَ[n[ـٰ]نَهُ[n[ۥ]‌ۖ هُوَ [h:6121[ٱ]لْغَنِىُّ‌ۖ لَهُ[n[ۥ] مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَا فِى [h:44[ٱ]لْأَرْضِ‌ۚ إِنْ عِ[f:4508[ند]َك[w:4509[ُم م]ِّ[f:4798[ن س]ُلْطَ[n[ـٰ][i:6122[نِۭ ب]ِهَ[n[ـٰ]ذ[o[َآ‌ۚ] أَتَقُولُونَ عَلَى [h:412[ٱ]للَّهِ مَا لَا تَعْلَم[p[ُو]نَ","translation_en":"They say: Allah has taken a son (to Himself)! Glory be to Him: He is the Self-sufficient: His is what is in the heavens and what is in the earth; you have no authority for this; do you say against Allah what you do not know?","translation_id":"Mereka (orang-orang Yahudi dan Nasrani) berkata, “Allah mempunyai anak.” Mahasuci Dia, Dialah Yang Mahakaya; milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Kamu tidak mempunyai alasan kuat tentang ini. Pantaskah kamu mengatakan tentang Allah apa yang kamu tidak ketahui?","hasanah_per_verse":960},{"text_madani":"قُلْ إِنَّ الَّذِينَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ لَا يُفْلِحُونَ","text_tajweed":"قُلْ إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ يَفْتَرُونَ عَلَى [h:412[ٱ]للَّهِ [h:2035[ٱ]لْكَذِبَ لَا يُفْلِح[p[ُو]نَ","translation_en":"Say: Those who forge a lie against Allah shall not be successful.","translation_id":"Katakanlah, “Sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah tidak akan beruntung.”","hasanah_per_verse":350},{"text_madani":"مَتَاعٌ فِي الدُّنْيَا ثُمَّ إِلَيْنَا مَرْجِعُهُمْ ثُمَّ نُذِيقُهُمُ الْعَذَابَ الشَّدِيدَ بِمَا كَانُوا يَكْفُرُونَ","text_tajweed":"مَتَ[n[ـٰ][f:6123[عٌ ف]ِى [h:599[ٱ][l[ل]دُّنْيَا ثُ[g[مّ]َ إِلَيْنَا مَرْجِعُهُمْ ثُ[g[مّ]َ نُذِيقُهُمُ [h:6124[ٱ]لْعَذَابَ [h:6125[ٱ][l[ل]شَّدِيدَ بِمَا كَانُو[s[اْ] يَكْفُر[p[ُو]نَ","translation_en":"(It is only) a provision in this world, then to Us shall be their return; then We shall make them taste severe punishment because they disbelieved.","translation_id":"(Bagi mereka) kesenangan (sesaat) ketika di dunia, selanjutnya kepada Kamilah mereka kembali, kemudian Kami rasakan kepada mereka azab yang berat, karena kekafiran mereka.","hasanah_per_verse":590},{"text_madani":"وَاتْلُ عَلَيْهِمْ نَبَأَ نُوحٍ إِذْ قَالَ لِقَوْمِهِ يَا قَوْمِ إِن كَانَ كَبُرَ عَلَيْكُم مَّقَامِي وَتَذْكِيرِي بِآيَاتِ اللَّهِ فَعَلَى اللَّهِ تَوَكَّلْتُ فَأَجْمِعُوا أَمْرَكُمْ وَشُرَكَاءَكُمْ ثُمَّ لَا يَكُنْ أَمْرُكُمْ عَلَيْكُمْ غُمَّةً ثُمَّ اقْضُوا إِلَيَّ وَلَا تُنظِرُونِ","text_tajweed":"۞ وَ[h:9999[ٱ]تْلُ عَلَيْهِمْ نَبَأَ نُوحٍ إِذْ قَالَ لِقَوْمِه[n[ِۦ] يَ[n[ـٰ]قَوْمِ إِ[f:2594[ن ك]َانَ كَبُرَ عَلَيْك[w:6126[ُم م]َّقَامِى وَتَذْكِيرِى بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ فَعَلَى [h:6127[ٱ]للَّهِ تَوَكَّلْتُ فَأَ[q:6128[جْ]مِع[o[ُوٓ][s[اْ] أَمْرَكُمْ وَشُرَك[o[َا]ٓءَكُمْ ثُ[g[مّ]َ لَا يَكُنْ أَمْرُكُمْ عَلَيْكُمْ غُ[g[مّ]َ[f:6129[ةً ث]ُ[g[مّ]َ [h:6130[ٱ][q:6131[قْ]ض[o[ُوٓ][s[اْ] إِلَىَّ وَلَا تُ[f:5200[نظ]ِر[p[ُو]نِ","translation_en":"And recite to them the story of Nuh when he said to his people: O my people! if my stay and my reminding (you) by the communications of Allah is hard on you-- yet on Allah do I rely-- then resolve upon your affair and (gather) your associates, then let not your affair remain dubious to you, then have it executed against me and give me no respite:","translation_id":"Dan bacakanlah kepada mereka berita penting (tentang) Nuh ketika (dia) berkata kepada kaumnya, “Wahai kaumku! Jika terasa berat bagimu aku tinggal (bersamamu) dan peringatanku dengan ayat-ayat Allah, maka kepada Allah aku bertawakal. Karena itu bulatkanlah keputusanmu dan kumpulkanlah sekutu-sekutumu (untuk membinasakanku), dan janganlah keputusanmu itu dirahasiakan. Kemudian bertindaklah terhadap diriku, dan janganlah kamu tunda lagi.","hasanah_per_verse":1360},{"text_madani":"فَإِن تَوَلَّيْتُمْ فَمَا سَأَلْتُكُم مِّنْ أَجْرٍ ۖ إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ ۖ وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُسْلِمِينَ","text_tajweed":"فَإِ[f:3779[ن ت]َوَلَّيْتُمْ فَمَا سَأَلْتُك[w:6132[ُم م]ِّنْ أَ[q:6133[جْ]رٍ‌ۖ إِنْ أَ[q:6134[جْ]رِىَ إِلَّا عَلَى [h:412[ٱ]للَّهِ‌ۖ وَأُمِرْتُ أَنْ أَكُونَ مِنَ [h:6135[ٱ]لْمُسْلِم[p[ِي]نَ","translation_en":"But if you turn back, I did not ask for any reward from you; my reward is only with Allah, and I am commanded that I should be of those who submit.","translation_id":"Maka jika kamu berpaling (dari peringatanku), aku tidak meminta imbalan sedikit pun darimu. Imbalanku tidak lain hanyalah dari Allah, dan aku diperintah agar aku termasuk golongan orang-orang Muslim (berserah diri).”","hasanah_per_verse":600},{"text_madani":"فَكَذَّبُوهُ فَنَجَّيْنَاهُ وَمَن مَّعَهُ فِي الْفُلْكِ وَجَعَلْنَاهُمْ خَلَائِفَ وَأَغْرَقْنَا الَّذِينَ كَذَّبُوا بِآيَاتِنَا ۖ فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُنذَرِينَ","text_tajweed":"فَكَذَّبُوهُ فَنَجَّيْنَ[n[ـٰ]هُ وَم[a:4948[َن م]َّعَهُ[n[ۥ] فِى [h:4780[ٱ]لْفُلْكِ وَجَعَلْنَ[n[ـٰ]هُمْ خَلَ[o[ـٰٓ]ئِفَ وَأَغْرَ[q:247[قْ]نَا [h:4781[ٱ]لَّذِينَ كَذَّبُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِنَا‌ۖ فَ[h:1513[ٱ][f:1513[نظ]ُرْ كَيْفَ كَانَ عَ[n[ـٰ]قِبَةُ [h:6136[ٱ]لْمُ[f:6137[نذ]َر[p[ِي]نَ","translation_en":"But they rejected him, so We delivered him and those with him in the ark, and We made them rulers and drowned those who rejected Our communications; see then what was the end of the (people) warned.","translation_id":"Kemudian mereka mendustakannya (Nuh), lalu Kami selamatkan dia dan orang yang bersamanya di dalam kapal, dan Kami jadikan mereka itu khalifah dan Kami tenggelamkan orang yang mendustakan ayat-ayat Kami. Maka perhatikanlah bagaimana kesudahan orang-orang yang diberi peringatan itu.","hasanah_per_verse":870},{"text_madani":"ثُمَّ بَعَثْنَا مِن بَعْدِهِ رُسُلًا إِلَىٰ قَوْمِهِمْ فَجَاءُوهُم بِالْبَيِّنَاتِ فَمَا كَانُوا لِيُؤْمِنُوا بِمَا كَذَّبُوا بِهِ مِن قَبْلُ ۚ كَذَٰلِكَ نَطْبَعُ عَلَىٰ قُلُوبِ الْمُعْتَدِينَ","text_tajweed":"ثُ[g[مّ]َ بَعَثْنَا م[i:254[ِنۢ ب]َعْدِه[n[ِۦ] رُسُلاً إِلَىٰ قَوْمِهِمْ فَج[o[َا]ٓءُوه[c:6138[ُم ب]ِ[h:484[ٱ]لْبَيِّنَ[n[ـٰ]تِ فَمَا كَانُو[s[اْ] لِيُؤْمِنُو[s[اْ] بِمَا كَذَّبُو[s[اْ] بِه[n[ِۦ] مِ[f:128[ن ق]َ[q:129[بْ]لُ‌ۚ كَذ[n[َٲ]لِكَ نَ[q:6139[طْ]بَعُ عَلَىٰ قُلُوبِ [h:6140[ٱ]لْمُعْتَد[p[ِي]نَ","translation_en":"Then did We raise up after him messengers to their people, so they came to them with clear arguments, but they would not believe in what they had rejected before; thus it is that We set seals upon the hearts of those who exceed the limits.","translation_id":"Kemudian setelahnya (Nuh), Kami utus beberapa rasul kepada kaum mereka (masing-masing), maka rasul-rasul itu datang kepada mereka dengan membawa keterangan yang jelas, tetapi mereka tidak mau beriman karena mereka dahulu telah (biasa) mendustakannya. Demikianlah Kami mengunci hati orang-orang yang melampaui batas.","hasanah_per_verse":930},{"text_madani":"ثُمَّ بَعَثْنَا مِن بَعْدِهِم مُّوسَىٰ وَهَارُونَ إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ بِآيَاتِنَا فَاسْتَكْبَرُوا وَكَانُوا قَوْمًا مُّجْرِمِينَ","text_tajweed":"ثُ[g[مّ]َ بَعَثْنَا م[i:1453[ِنۢ ب]َعْدِه[w:4907[ِم م]ُّوسَىٰ وَهَ[n[ـٰ]رُونَ إِلَىٰ فِرْعَوْنَ وَمَلَإِ[s[يْ]ه[n[ِۦ] بِـَٔـايَ[n[ـٰ]تِنَا فَ[h:4956[ٱ]سْتَكْبَرُو[s[اْ] وَكَانُو[s[اْ] قَوْ[a:4957[مًا م]ُّ[q:4958[جْ]رِم[p[ِي]نَ","translation_en":"Then did We send up after them Musa and Haroun to Firon and his chiefs with Our signs, but they showed pride and they were a guilty people.","translation_id":"Kemudian setelah mereka, Kami utus Musa dan Harun kepada Fir‘aun dan para pemuka kaumnya, dengan membawa tanda-tanda (kekuasaan) Kami. Ternyata mereka menyombongkan diri dan mereka adalah orang-orang yang berdosa.","hasanah_per_verse":690},{"text_madani":"فَلَمَّا جَاءَهُمُ الْحَقُّ مِنْ عِندِنَا قَالُوا إِنَّ هَٰذَا لَسِحْرٌ مُّبِينٌ","text_tajweed":"فَلَ[g[مّ]َا ج[o[َا]ٓءَهُمُ [h:6141[ٱ]لْحَقُّ مِنْ عِ[f:6142[ند]ِنَا قَال[o[ُوٓ][s[اْ] إِ[g[نّ]َ هَ[n[ـٰ]ذَا لَسِحْ[a:6143[رٌ م]ُّب[p[ِي]نٌ","translation_en":"So when the truth came to them from Us they said: This is most surely clear enchantment!","translation_id":"Maka ketika telah datang kepada mereka kebenaran dari sisi Kami, mereka berkata, “Ini benar-benar sihir yang nyata.”","hasanah_per_verse":380},{"text_madani":"قَالَ مُوسَىٰ أَتَقُولُونَ لِلْحَقِّ لَمَّا جَاءَكُمْ ۖ أَسِحْرٌ هَٰذَا وَلَا يُفْلِحُ السَّاحِرُونَ","text_tajweed":"قَالَ مُوسَ[o[ىٰٓ] أَتَقُولُونَ لِلْحَقِّ لَ[g[مّ]َا ج[o[َا]ٓءَكُمْ‌ۖ أَسِحْرٌ هَ[n[ـٰ]ذَا وَلَا يُفْلِحُ [h:6144[ٱ][l[ل]سَّ[n[ـٰ]حِر[p[ُو]نَ","translation_en":"Musa said: Do you say (this) of the truth when it has come to you? Is it magic? And the magicians are not successful.","translation_id":"Musa berkata, “Pantaskah kamu mengatakan terhadap kebenaran ketika ia datang kepadamu, ‘sihirkah ini?’ Padahal para pesihir itu tidaklah mendapat kemenangan.”","hasanah_per_verse":480},{"text_madani":"قَالُوا أَجِئْتَنَا لِتَلْفِتَنَا عَمَّا وَجَدْنَا عَلَيْهِ آبَاءَنَا وَتَكُونَ لَكُمَا الْكِبْرِيَاءُ فِي الْأَرْضِ وَمَا نَحْنُ لَكُمَا بِمُؤْمِنِينَ","text_tajweed":"قَال[o[ُوٓ][s[اْ] أَجِئْتَنَا لِتَلْفِتَنَا عَ[g[مّ]َا وَجَ[q:3834[دْ]نَا عَلَيْهِ ءَاب[o[َا]ٓءَنَا وَتَكُونَ لَكُمَا [h:6145[ٱ]لْكِ[q:6146[بْ]رِي[o[َا]ٓءُ فِى [h:44[ٱ]لْأَرْضِ وَمَا نَحْنُ لَكُمَا بِمُؤْمِن[p[ِي]نَ","translation_en":"They said: Have you come to us to turn us away from what we found our fathers upon, and (that) greatness in the land should be for you two? And we are not going to believe in you.","translation_id":"Mereka berkata, “Apakah engkau datang kepada kami untuk memalingkan kami dari apa (kepercayaan) yang kami dapati nenek moyang kami mengerjakannya (menyembah berhala), dan agar kamu berdua mempunyai kekuasaan di bumi (negeri Mesir)? Kami tidak akan mempercayai kamu berdua.”","hasanah_per_verse":770},{"text_madani":"وَقَالَ فِرْعَوْنُ ائْتُونِي بِكُلِّ سَاحِرٍ عَلِيمٍ","text_tajweed":"وَقَالَ فِرْعَوْنُ [h:6147[ٱ]ئْتُونِى بِكُلِّ سَ[n[ـٰ]حِرٍ عَل[p[ِي]مٍ","translation_en":"And Firon said: Bring to me every skillful magician.","translation_id":"Dan Fir‘aun berkata (kepada pemuka kaumnya), “Datangkanlah kepadaku semua pesihir yang ulung!”","hasanah_per_verse":260},{"text_madani":"فَلَمَّا جَاءَ السَّحَرَةُ قَالَ لَهُم مُّوسَىٰ أَلْقُوا مَا أَنتُم مُّلْقُونَ","text_tajweed":"فَلَ[g[مّ]َا ج[o[َا]ٓءَ [h:6148[ٱ][l[ل]سَّحَرَةُ قَالَ لَه[w:6149[ُم م]ُّوسَ[o[ىٰٓ] أَلْقُو[s[اْ] م[o[َآ] أَ[f:428[نت][w:6150[ُم م]ُّلْق[p[ُو]نَ","translation_en":"And when the magicians came, Musa said to them: Cast down what you have to cast.","translation_id":"Maka ketika para pesihir itu datang, Musa berkata kepada mereka, “Lemparkanlah apa yang hendak kamu lemparkan!”","hasanah_per_verse":390},{"text_madani":"فَلَمَّا أَلْقَوْا قَالَ مُوسَىٰ مَا جِئْتُم بِهِ السِّحْرُ ۖ إِنَّ اللَّهَ سَيُبْطِلُهُ ۖ إِنَّ اللَّهَ لَا يُصْلِحُ عَمَلَ الْمُفْسِدِينَ","text_tajweed":"فَلَ[g[مّ][o[َآ] أَلْقَوْ[s[اْ] قَالَ مُوسَىٰ مَا جِئْت[c:6151[ُم ب]ِهِ [h:6152[ٱ][l[ل]سِّحْرُ‌ۖ إِ[g[نّ]َ [h:80[ٱ]للَّهَ سَيُ[q:6153[بْ]طِلُهُ[o[ۥٓ‌ۖ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَا يُصْلِحُ عَمَلَ [h:6154[ٱ]لْمُفْسِد[p[ِي]نَ","translation_en":"So when they cast down, Musa said to them: What you have brought is deception; surely Allah will make it naught; surely Allah does not make the work of mischief-makers to thrive.","translation_id":"Setelah mereka melemparkan, Musa berkata, “Apa yang kamu lakukan itu, itulah sihir, sesungguhnya Allah akan menampakkan kepalsuan sihir itu. Sungguh, Allah tidak akan membiarkan terus berlangsungnya pekerjaan orang yang berbuat kerusakan.”","hasanah_per_verse":640},{"text_madani":"وَيُحِقُّ اللَّهُ الْحَقَّ بِكَلِمَاتِهِ وَلَوْ كَرِهَ الْمُجْرِمُونَ","text_tajweed":"وَيُحِقُّ [h:6155[ٱ]للَّهُ [h:6156[ٱ]لْحَقَّ بِكَلِمَ[n[ـٰ]تِه[n[ِۦ] وَلَوْ كَرِهَ [h:5254[ٱ]لْمُ[q:5255[جْ]رِم[p[ُو]نَ","translation_en":"And Allah will show the truth to be the truth by His words, though the guilty may be averse (to it).","translation_id":"Dan Allah akan mengukuhkan yang benar dengan ketetapan-Nya, walaupun orang-orang yang berbuat dosa tidak menyukainya.","hasanah_per_verse":330},{"text_madani":"فَمَا آمَنَ لِمُوسَىٰ إِلَّا ذُرِّيَّةٌ مِّن قَوْمِهِ عَلَىٰ خَوْفٍ مِّن فِرْعَوْنَ وَمَلَئِهِمْ أَن يَفْتِنَهُمْ ۚ وَإِنَّ فِرْعَوْنَ لَعَالٍ فِي الْأَرْضِ وَإِنَّهُ لَمِنَ الْمُسْرِفِينَ","text_tajweed":"فَم[o[َآ] ءَامَنَ لِمُوسَ[o[ىٰٓ] إِلَّا ذُرِّيَّ[a:6157[ةٌ م]ِّ[f:4770[ن ق]َوْمِه[n[ِۦ] عَلَىٰ خَوْ[a:6158[فٍ م]ِّ[f:6159[ن ف]ِرْعَوْنَ وَمَلَإِ[s[يْ]هِمْ أ[a:6160[َن ي]َفْتِنَهُمْ‌ۚ وَإِ[g[نّ]َ فِرْعَوْنَ لَعَا[f:6161[لٍ ف]ِى [h:44[ٱ]لْأَرْضِ وَإِ[g[نّ]َهُ[n[ۥ] لَمِنَ [h:6162[ٱ]لْمُسْرِف[p[ِي]نَ","translation_en":"But none believed in Musa except the offspring of his people, on account of the fear of Firon and their chiefs, lest he should persecute them; and most surely Firon was lofty in the land; and most surely he was of the extravagant.","translation_id":"Maka tidak ada yang beriman kepada Musa, selain keturunan dari kaumnya dalam keadaan takut bahwa Fir‘aun dan para pemuka (kaum)nya akan menyiksa mereka. Dan sungguh, Fir‘aun itu benar-benar telah berbuat sewenang-wenang di bumi, dan benar-benar termasuk orang yang melampaui batas.","hasanah_per_verse":850},{"text_madani":"وَقَالَ مُوسَىٰ يَا قَوْمِ إِن كُنتُمْ آمَنتُم بِاللَّهِ فَعَلَيْهِ تَوَكَّلُوا إِن كُنتُم مُّسْلِمِينَ","text_tajweed":"وَقَالَ مُوسَىٰ يَ[n[ـٰ]قَوْمِ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ ءَامَ[f:703[نت][c:5341[ُم ب]ِ[h:32[ٱ]للَّهِ فَعَلَيْهِ تَوَكَّل[o[ُوٓ][s[اْ] إِ[f:109[ن ك]ُ[f:100[نت][w:6163[ُم م]ُّسْلِم[p[ِي]نَ","translation_en":"And Musa said: O my people! if you believe in Allah, then rely on Him (alone) if you submit (to Allah).","translation_id":"Dan Musa berkata, “Wahai kaumku! Apabila kamu beriman kepada Allah, maka bertawakallah kepada-Nya, jika kamu benar-benar orang Muslim (berserah diri).”","hasanah_per_verse":520},{"text_madani":"فَقَالُوا عَلَى اللَّهِ تَوَكَّلْنَا رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ","text_tajweed":"فَقَالُو[s[اْ] عَلَى [h:412[ٱ]للَّهِ تَوَكَّلْنَا رَبَّنَا لَا تَ[q:4719[جْ]عَلْنَا فِتْنَ[u:6164[ةً ل]ِّلْقَوْمِ [h:6165[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"So they said: On Allah we rely: O our Lord! make us not subject to the persecution of the unjust people:","translation_id":"Lalu mereka berkata, “Kepada Allah-lah kami bertawakal. Ya Tuhan kami, janganlah Engkau jadikan kami (sasaran) fitnah bagi kaum yang zhalim,","hasanah_per_verse":480},{"text_madani":"وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ","text_tajweed":"وَنَجِّنَا بِرَحْمَتِكَ مِنَ [h:4196[ٱ]لْقَوْمِ [h:1432[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"And do Thou deliver us by Thy mercy from the unbelieving people.","translation_id":"dan selamatkanlah kami dengan rahmat-Mu dari orang-orang kafir.”","hasanah_per_verse":260},{"text_madani":"وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ وَأَخِيهِ أَن تَبَوَّآ لِقَوْمِكُمَا بِمِصْرَ بُيُوتًا وَاجْعَلُوا بُيُوتَكُمْ قِبْلَةً وَأَقِيمُوا الصَّلَاةَ ۗ وَبَشِّرِ الْمُؤْمِنِينَ","text_tajweed":"وَأَوْحَيْن[o[َآ] إِلَىٰ مُوسَىٰ وَأَخِيهِ أَ[f:6166[ن ت]َبَوَّءَا لِقَوْمِكُمَا بِمِصْرَ بُيُو[a:6167[تًا و]َ[h:6168[ٱ][q:6168[جْ]عَلُو[s[اْ] بُيُوتَكُمْ قِ[q:747[بْ]لَ[a:6169[ةً و]َأَقِيمُو[s[اْ] [h:214[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ‌ۗ وَبَشِّرِ [h:1257[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"And We revealed to Musa and his brother, saying: Take for your people houses to abide in Egypt and make your houses places of worship and keep up prayer and give good news to the believers.","translation_id":"Dan Kami wahyukan kepada Musa dan saudaranya, “Ambillah beberapa rumah di Mesir untuk (tempat tinggal) kaummu dan jadikanlah rumah-rumahmu itu tempat ibadah dan laksanakanlah shalat serta gembirakanlah orang-orang mukmin.”","hasanah_per_verse":830},{"text_madani":"وَقَالَ مُوسَىٰ رَبَّنَا إِنَّكَ آتَيْتَ فِرْعَوْنَ وَمَلَأَهُ زِينَةً وَأَمْوَالًا فِي الْحَيَاةِ الدُّنْيَا رَبَّنَا لِيُضِلُّوا عَن سَبِيلِكَ ۖ رَبَّنَا اطْمِسْ عَلَىٰ أَمْوَالِهِمْ وَاشْدُدْ عَلَىٰ قُلُوبِهِمْ فَلَا يُؤْمِنُوا حَتَّىٰ يَرَوُا الْعَذَابَ الْأَلِيمَ","text_tajweed":"وَقَالَ مُوسَىٰ رَبَّن[o[َآ] إِ[g[نّ]َكَ ءَاتَيْتَ فِرْعَوْنَ وَمَلَأَهُ[n[ۥ] زِينَ[a:6170[ةً و]َأَمْو[n[َٲ]ل[f:6171[اً ف]ِى [h:441[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا رَبَّنَا لِيُضِلُّو[s[اْ] عَ[f:6172[ن س]َبِيلِكَ‌ۖ رَبَّنَا [h:6173[ٱ][q:6174[طْ]مِسْ عَلَ[o[ىٰٓ] أَمْو[n[َٲ]لِهِمْ وَ[h:6175[ٱ]شْدُ[q:6175[دْ] عَلَىٰ قُلُوبِهِمْ فَلَا يُؤْمِنُو[s[اْ] حَتَّىٰ يَرَوُ[s[اْ] [h:6176[ٱ]لْعَذَابَ [h:6177[ٱ]لْأَل[p[ِي]مَ","translation_en":"And Musa said: Our Lord! surely Thou hast given to Firon and his chiefs finery and riches in this world's life, to this end, our Lord, that they lead (people) astray from Thy way: Our Lord! destroy their riches and harden their hearts so that they believe not until they see the painful punishment.","translation_id":"Dan Musa berkata, “Ya Tuhan kami, Engkau telah memberikan kepada Fir‘aun dan para pemuka kaumnya perhiasan dan harta kekayaan dalam kehidupan dunia. Ya Tuhan kami, (akibatnya) mereka menyesatkan (manusia) dari jalan-Mu. Ya Tuhan, binasakanlah harta mereka, dan kuncilah hati mereka, sehingga mereka tidak beriman sampai mereka melihat azab yang pedih.”","hasanah_per_verse":1310},{"text_madani":"قَالَ قَدْ أُجِيبَت دَّعْوَتُكُمَا فَاسْتَقِيمَا وَلَا تَتَّبِعَانِّ سَبِيلَ الَّذِينَ لَا يَعْلَمُونَ","text_tajweed":"قَالَ قَ[q:298[دْ] أُجِيبَ[d:6178[ت] دَّعْوَتُكُمَا فَ[h:6179[ٱ]سْتَقِيمَا وَلَا تَتَّبِع[m[َا]ٓ[g[نّ]ِ سَبِيلَ [h:6180[ٱ]لَّذِينَ لَا يَعْلَم[p[ُو]نَ","translation_en":"He said: The prayer of you both has indeed been accepted, therefore continue in the right way and do not follow the path of those who do not know.","translation_id":"Dia Allah berfirman, “Sungguh, telah diperkenankan permohonan kamu berdua, sebab itu tetaplah kamu berdua pada jalan yang lurus dan jangan sekali-kali kamu mengikuti jalan orang yang tidak mengetahui.”","hasanah_per_verse":510},{"text_madani":"وَجَاوَزْنَا بِبَنِي إِسْرَائِيلَ الْبَحْرَ فَأَتْبَعَهُمْ فِرْعَوْنُ وَجُنُودُهُ بَغْيًا وَعَدْوًا ۖ حَتَّىٰ إِذَا أَدْرَكَهُ الْغَرَقُ قَالَ آمَنتُ أَنَّهُ لَا إِلَٰهَ إِلَّا الَّذِي آمَنَتْ بِهِ بَنُو إِسْرَائِيلَ وَأَنَا مِنَ الْمُسْلِمِينَ","text_tajweed":"۞ وَجَ[n[ـٰ]وَزْنَا بِبَن[o[ِىٓ] إِسْر[o[َٲ]ٓءِيلَ [h:4977[ٱ]لْبَحْرَ فَأَتْبَعَهُمْ فِرْعَوْنُ وَجُنُودُهُ[n[ۥ] بَغْ[a:6181[يًا و]َعَ[q:6182[دْ]وًا‌ۖ حَتَّ[o[ىٰٓ] إِذ[o[َآ] أَ[q:6183[دْ]رَكَهُ [h:6184[ٱ]لْغَرَقُ قَالَ ءَامَ[f:6185[نت]ُ أَ[g[نّ]َهُ[n[ۥ] ل[o[َآ] إِلَ[n[ـٰ]هَ إِلَّا [h:6186[ٱ]لَّذ[o[ِىٓ] ءَامَنَتْ بِه[n[ِۦ] بَن[o[ُوٓ][s[اْ] إِسْر[o[َٲ]ٓءِيلَ وَأَنَا۟ مِنَ [h:6135[ٱ]لْمُسْلِم[p[ِي]نَ","translation_en":"And We made the children of Israel to pass through the sea, then Firon and his hosts followed them for oppression and tyranny; until when drowning overtook him, he said: I believe that there is no god but He in Whom the children of Israel believe and I am of those who submit.","translation_id":"Dan Kami selamatkan Bani Israil melintasi laut, kemudian Fir‘aun dan bala tentaranya mengikuti mereka, untuk menzhalimi dan menindas (mereka). Sehingga ketika Fir‘aun hampir tenggelam dia berkata, “Aku percaya bahwa tidak ada tuhan melainkan Tuhan yang dipercayai oleh Bani Israil, dan aku termasuk orang-orang Muslim (berserah diri).”","hasanah_per_verse":1180},{"text_madani":"آلْآنَ وَقَدْ عَصَيْتَ قَبْلُ وَكُنتَ مِنَ الْمُفْسِدِينَ","text_tajweed":"ءَ[m[آ]لْـَٔ[n[ـٰ]نَ وَقَ[q:387[دْ] عَصَيْتَ قَ[q:129[بْ]لُ وَكُ[f:6187[نت]َ مِنَ [h:6188[ٱ]لْمُفْسِد[p[ِي]نَ","translation_en":"What! now! and indeed you disobeyed before and you were of the mischief-makers.","translation_id":"Mengapa baru sekarang (kamu beriman), padahal sesungguhnya engkau telah durhaka sejak dahulu, dan engkau termasuk orang yang berbuat kerusakan.","hasanah_per_verse":280},{"text_madani":"فَالْيَوْمَ نُنَجِّيكَ بِبَدَنِكَ لِتَكُونَ لِمَنْ خَلْفَكَ آيَةً ۚ وَإِنَّ كَثِيرًا مِّنَ النَّاسِ عَنْ آيَاتِنَا لَغَافِلُونَ","text_tajweed":"فَ[h:9999[ٱ]لْيَوْمَ نُنَجِّيكَ بِبَدَنِكَ لِتَكُونَ لِمَنْ خَلْفَكَ ءَايَ[a:6189[ةً‌ۚ و]َإِ[g[نّ]َ كَثِي[a:3614[رًا م]ِّنَ [h:721[ٱ][l[ل][g[نّ]َاسِ عَنْ ءَايَ[n[ـٰ]تِنَا لَغَ[n[ـٰ]فِل[p[ُو]نَ","translation_en":"But We will this day deliver you with your body that you may be a sign to those after you, and most surely the majority of the people are heedless to Our communications.","translation_id":"Maka pada hari ini Kami selamatkan jasadmu agar engkau dapat menjadi pelajaran bagi orang-orang yang datang setelahmu, tetapi kebanyakan manusia tidak mengindahkan tanda-tanda (kekuasaan) Kami.","hasanah_per_verse":610},{"text_madani":"وَلَقَدْ بَوَّأْنَا بَنِي إِسْرَائِيلَ مُبَوَّأَ صِدْقٍ وَرَزَقْنَاهُم مِّنَ الطَّيِّبَاتِ فَمَا اخْتَلَفُوا حَتَّىٰ جَاءَهُمُ الْعِلْمُ ۚ إِنَّ رَبَّكَ يَقْضِي بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ","text_tajweed":"وَلَقَ[q:341[دْ] بَوَّأْنَا بَن[o[ِىٓ] إِسْر[o[َٲ]ٓءِيلَ مُبَوَّأَ صِ[q:5937[دْ][a:6190[قٍ و]َرَزَ[q:6191[قْ]نَ[n[ـٰ]ه[w:6192[ُم م]ِّنَ [h:5307[ٱ][l[ل]طَّيِّبَ[n[ـٰ]تِ فَمَا [h:6193[ٱ]خْتَلَفُو[s[اْ] حَتَّىٰ ج[o[َا]ٓءَهُمُ [h:1804[ٱ]لْعِلْمُ‌ۚ إِ[g[نّ]َ رَبَّكَ يَ[q:6194[قْ]ضِى بَيْنَهُمْ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ فِيمَا كَانُو[s[اْ] فِيهِ يَخْتَلِف[p[ُو]نَ","translation_en":"And certainly We lodged the children of Israel in a goodly abode and We provided them with good things; but they did not disagree until the knowledge had come to them; surely your Lord will judge between them on the resurrection day concerning that in which they disagreed.","translation_id":"Dan sungguh, Kami telah menempatkan Bani Israil di tempat kediaman yang bagus dan Kami beri mereka rezeki yang baik. Maka mereka tidak berselisih, kecuali setelah datang kepada mereka pengetahuan (yang tersebut dalam Taurat). Sesungguhnya Tuhan kamu akan memberi keputusan antara mereka pada hari Kiamat tentang apa yang mereka perselisihkan itu.","hasanah_per_verse":1090},{"text_madani":"فَإِن كُنتَ فِي شَكٍّ مِّمَّا أَنزَلْنَا إِلَيْكَ فَاسْأَلِ الَّذِينَ يَقْرَءُونَ الْكِتَابَ مِن قَبْلِكَ ۚ لَقَدْ جَاءَكَ الْحَقُّ مِن رَّبِّكَ فَلَا تَكُونَنَّ مِنَ الْمُمْتَرِينَ","text_tajweed":"فَإِ[f:6195[ن ك]ُ[f:735[نت]َ فِى شَ[a:6196[كٍّ م]ِّ[g[مّ][o[َآ] أَ[f:515[نز]َلْن[o[َآ] إِلَيْكَ فَسْــَٔلِ [h:6197[ٱ]لَّذِينَ يَ[q:6198[قْ]رَءُونَ [h:6199[ٱ]لْكِتَ[n[ـٰ]بَ مِ[f:18[ن ق]َ[q:19[بْ]لِكَ‌ۚ لَقَ[q:2389[دْ] ج[o[َا]ٓءَكَ [h:6200[ٱ]لْحَقُّ م[u:770[ِن ر]َّبِّكَ فَلَا تَكُونَ[g[نّ]َ مِنَ [h:771[ٱ]لْمُمْتَر[p[ِي]نَ","translation_en":"But if you are in doubt as to what We have revealed to you, ask those who read the Book before you; certainly the truth has come to you from your Lord, therefore you should not be of the disputers.","translation_id":"Maka jika engkau (Muhammad) berada dalam keragu-raguan tentang apa yang Kami turunkan kepadamu, maka tanyakanlah kepada orang yang membaca kitab sebelummu. Sungguh, telah datang kebenaran kepadamu dari Tuhanmu, maka janganlah sekali-kali engkau termasuk orang yang ragu.","hasanah_per_verse":850},{"text_madani":"وَلَا تَكُونَنَّ مِنَ الَّذِينَ كَذَّبُوا بِآيَاتِ اللَّهِ فَتَكُونَ مِنَ الْخَاسِرِينَ","text_tajweed":"وَلَا تَكُونَ[g[نّ]َ مِنَ [h:523[ٱ]لَّذِينَ كَذَّبُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ فَتَكُونَ مِنَ [h:340[ٱ]لْخَ[n[ـٰ]سِر[p[ِي]نَ","translation_en":"And you should not be of those who reject the communications of Allah, (for) then you should be one of the losers.","translation_id":"Dan janganlah sekali-kali engkau termasuk orang yang mendustakan ayat-ayat Allah, nanti engkau termasuk orang yang rugi.","hasanah_per_verse":440},{"text_madani":"إِنَّ الَّذِينَ حَقَّتْ عَلَيْهِمْ كَلِمَتُ رَبِّكَ لَا يُؤْمِنُونَ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ حَقَّتْ عَلَيْهِمْ كَلِمَتُ رَبِّكَ لَا يُؤْمِن[p[ُو]نَ","translation_en":"Surely those against whom the word of your Lord has proved true will not believe,","translation_id":"Sungguh, orang-orang yang telah dipastikan mendapat ketetapan Tuhanmu, tidaklah akan beriman,","hasanah_per_verse":300},{"text_madani":"وَلَوْ جَاءَتْهُمْ كُلُّ آيَةٍ حَتَّىٰ يَرَوُا الْعَذَابَ الْأَلِيمَ","text_tajweed":"وَلَوْ ج[o[َا]ٓءَتْهُمْ كُلُّ ءَايَةٍ حَتَّىٰ يَرَوُ[s[اْ] [h:6176[ٱ]لْعَذَابَ [h:6177[ٱ]لْأَل[p[ِي]مَ","translation_en":"Though every sign should come to them, until they witness the painful chastisement.","translation_id":"meskipun mereka mendapat tanda-tanda (kebesaran Allah), hingga mereka menyaksikan azab yang pedih.","hasanah_per_verse":330},{"text_madani":"فَلَوْلَا كَانَتْ قَرْيَةٌ آمَنَتْ فَنَفَعَهَا إِيمَانُهَا إِلَّا قَوْمَ يُونُسَ لَمَّا آمَنُوا كَشَفْنَا عَنْهُمْ عَذَابَ الْخِزْيِ فِي الْحَيَاةِ الدُّنْيَا وَمَتَّعْنَاهُمْ إِلَىٰ حِينٍ","text_tajweed":"فَلَوْلَا كَانَتْ قَرْيَةٌ ءَامَنَتْ فَنَفَعَه[o[َآ] إِيمَ[n[ـٰ]نُه[o[َآ] إِلَّا قَوْمَ يُونُسَ لَ[g[مّ][o[َآ] ءَامَنُو[s[اْ] كَشَفْنَا عَنْهُمْ عَذَابَ [h:6201[ٱ]لْخِزْىِ فِى [h:441[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا وَمَتَّعْنَ[n[ـٰ]هُمْ إِلَىٰ ح[p[ِي]نٍ","translation_en":"And wherefore was there not a town which should believe so that their belief should have profited them but the people of Yunus? When they believed, We removed from them the chastisement of disgrace in this world's life and We gave them provision till a time.","translation_id":"Maka mengapa tidak ada (penduduk) suatu negeri pun yang beriman, lalu imannya itu bermanfaat kepadanya selain kaum Yunus? Ketika mereka (kaum Yunus itu) beriman, Kami hilangkan dari mereka azab yang menghinakan dalam kehidupan dunia, dan Kami beri kesenangan kepada mereka sampai waktu tertentu.","hasanah_per_verse":940},{"text_madani":"وَلَوْ شَاءَ رَبُّكَ لَآمَنَ مَن فِي الْأَرْضِ كُلُّهُمْ جَمِيعًا ۚ أَفَأَنتَ تُكْرِهُ النَّاسَ حَتَّىٰ يَكُونُوا مُؤْمِنِينَ","text_tajweed":"وَلَوْ ش[o[َا]ٓءَ رَبُّكَ لَأَمَنَ مَ[f:2074[ن ف]ِى [h:44[ٱ]لْأَرْضِ كُلُّهُمْ جَمِيعًا‌ۚ أَفَأَ[f:6069[نت]َ تُكْرِهُ [h:6202[ٱ][l[ل][g[نّ]َاسَ حَتَّىٰ يَكُونُو[s[اْ] مُؤْمِن[p[ِي]نَ","translation_en":"And if your Lord had pleased, surely all those who are in the earth would have believed, all of them; will you then force men till they become believers?","translation_id":"Dan jika Tuhanmu menghendaki, tentulah beriman semua orang di bumi seluruhnya. Tetapi apakah kamu (hendak) memaksa manusia agar mereka menjadi orang-orang yang beriman?","hasanah_per_verse":600},{"text_madani":"وَمَا كَانَ لِنَفْسٍ أَن تُؤْمِنَ إِلَّا بِإِذْنِ اللَّهِ ۚ وَيَجْعَلُ الرِّجْسَ عَلَى الَّذِينَ لَا يَعْقِلُونَ","text_tajweed":"وَمَا كَانَ لِنَفْسٍ أَ[f:6203[ن ت]ُؤْمِنَ إِلَّا بِإِذْنِ [h:509[ٱ]للَّهِ‌ۚ وَيَ[q:6204[جْ]عَلُ [h:6205[ٱ][l[ل]رِّ[q:4401[جْ]سَ عَلَى [h:289[ٱ]لَّذِينَ لَا يَعْقِل[p[ُو]نَ","translation_en":"And it is not for a soul to believe except by Allah's permission; and He casts uncleanness on those who will not understand.","translation_id":"Dan tidak seorang pun akan beriman kecuali dengan izin Allah, dan Allah menimpakan azab kepada orang yang tidak mengerti.","hasanah_per_verse":530},{"text_madani":"قُلِ انظُرُوا مَاذَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ وَمَا تُغْنِي الْآيَاتُ وَالنُّذُرُ عَن قَوْمٍ لَّا يُؤْمِنُونَ","text_tajweed":"قُلِ [h:6206[ٱ][f:3950[نظ]ُرُو[s[اْ] مَاذَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۚ وَمَا تُغْنِى [h:6207[ٱ]لْأَيَ[n[ـٰ]تُ وَ[h:6208[ٱ][l[ل][g[نّ]ُذُرُ عَ[f:6209[ن ق]َوْ[u:6210[مٍ ل]َّا يُؤْمِن[p[ُو]نَ","translation_en":"Say: Consider what is it that is in the heavens and the earth; and signs and warners do not avail a people who would not believe.","translation_id":"Katakanlah, “Perhatikanlah apa yang ada di langit dan di bumi!” Tidaklah bermanfaat tanda-tanda (kebesaran Allah) dan rasul-rasul yang memberi peringatan bagi orang yang tidak beriman.","hasanah_per_verse":600},{"text_madani":"فَهَلْ يَنتَظِرُونَ إِلَّا مِثْلَ أَيَّامِ الَّذِينَ خَلَوْا مِن قَبْلِهِمْ ۚ قُلْ فَانتَظِرُوا إِنِّي مَعَكُم مِّنَ الْمُنتَظِرِينَ","text_tajweed":"فَهَلْ يَ[f:6211[نت]َظِرُونَ إِلَّا مِثْلَ أَيَّامِ [h:6212[ٱ]لَّذِينَ خَلَوْ[s[اْ] مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ‌ۚ قُلْ فَ[h:4800[ٱ][f:4800[نت]َظِر[o[ُوٓ][s[اْ] إِ[g[نّ]ِى مَعَك[w:2068[ُم م]ِّنَ [h:4801[ٱ]لْمُ[f:4802[نت]َظِر[p[ِي]نَ","translation_en":"What do they wait for then but the like of the days of those who passed away before them? Say: Wait then; surely I too am with you of those who wait.","translation_id":"Maka mereka tidak menunggu-nunggu kecuali (kejadian-kejadian) yang sama dengan kejadian-kejadian (yang menimpa) orang-orang terdahulu sebelum mereka. Katakanlah, “Maka tunggulah, aku pun termasuk orang yang menunggu bersama kamu.”","hasanah_per_verse":640},{"text_madani":"ثُمَّ نُنَجِّي رُسُلَنَا وَالَّذِينَ آمَنُوا ۚ كَذَٰلِكَ حَقًّا عَلَيْنَا نُنجِ الْمُؤْمِنِينَ","text_tajweed":"ثُ[g[مّ]َ نُنَجِّى رُسُلَنَا وَ[h:37[ٱ]لَّذِينَ ءَامَنُو[s[اْ‌ۚ] كَذ[n[َٲ]لِكَ حَقًّا عَلَيْنَا نُ[f:6213[نج]ِ [h:6214[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"Then We deliver Our messengers and those who believe-- even so (now), it is binding on Us (that) We deliver the believers.","translation_id":"Kemudian Kami selamatkan rasul-rasul Kami dan orang-orang yang beri-man, demikianlah menjadi kewajiban Kami menyelamatkan orang yang beriman.","hasanah_per_verse":450},{"text_madani":"قُلْ يَا أَيُّهَا النَّاسُ إِن كُنتُمْ فِي شَكٍّ مِّن دِينِي فَلَا أَعْبُدُ الَّذِينَ تَعْبُدُونَ مِن دُونِ اللَّهِ وَلَٰكِنْ أَعْبُدُ اللَّهَ الَّذِي يَتَوَفَّاكُمْ ۖ وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُؤْمِنِينَ","text_tajweed":"قُلْ يَ[o[ـٰٓ]أَيُّهَا [h:82[ٱ][l[ل][g[نّ]َاسُ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ فِى شَ[a:6215[كٍّ م]ِّ[f:6216[ن د]ِينِى فَل[o[َآ] أَعْبُدُ [h:6217[ٱ]لَّذِينَ تَعْبُدُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ وَلَ[n[ـٰ]كِنْ أَعْبُدُ [h:6218[ٱ]للَّهَ [h:2537[ٱ]لَّذِى يَتَوَفَّ[n[ـٰ]كُمْ‌ۖ وَأُمِرْتُ أَنْ أَكُونَ مِنَ [h:3047[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"Say: O people! if you are in doubt as to my religion, then (know that) I do not serve those whom you serve besides Allah but I do serve Allah, Who will cause you to die, and I am commanded that I should be of the believers.","translation_id":"Katakanlah (Muhammad), “Wahai manusia! Jika kamu masih dalam keragu-raguan tentang agamaku, maka (ketahuilah) aku tidak menyembah yang kamu sembah selain Allah, tetapi aku menyembah Allah yang akan mematikan kamu dan aku telah diperintah agar termasuk orang yang beriman,”","hasanah_per_verse":1000},{"text_madani":"وَأَنْ أَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا وَلَا تَكُونَنَّ مِنَ الْمُشْرِكِينَ","text_tajweed":"وَأَنْ أَقِمْ وَ[q:749[جْ]هَكَ لِلدِّينِ حَنِي[a:6219[فًا و]َلَا تَكُونَ[g[نّ]َ مِنَ [h:699[ٱ]لْمُشْرِك[p[ِي]نَ","translation_en":"And that you should keep your course towards the religion uprightly; and you should not be of the polytheists.","translation_id":"dan (aku telah diperintah), “Hadapkanlah wajahmu kepada agama dengan tulus dan ikhlas dan jangan sekali-kali engkau termasuk orang yang musyrik.","hasanah_per_verse":380},{"text_madani":"وَلَا تَدْعُ مِن دُونِ اللَّهِ مَا لَا يَنفَعُكَ وَلَا يَضُرُّكَ ۖ فَإِن فَعَلْتَ فَإِنَّكَ إِذًا مِّنَ الظَّالِمِينَ","text_tajweed":"وَلَا تَ[q:6220[دْ]عُ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ مَا لَا يَ[f:6221[نف]َعُكَ وَلَا يَضُرُّكَ‌ۖ فَإِ[f:6222[ن ف]َعَلْتَ فَإِ[g[نّ]َكَ إِ[a:6223[ذًا م]ِّنَ [h:187[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And do not call besides Allah on that which can neither benefit you nor harm you, for if you do then surely you will in that case be of the unjust.","translation_id":"Dan jangan engkau menyembah sesuatu yang tidak memberi manfaat dan tidak (pula) memberi bencana kepadamu selain Allah, sebab jika engkau lakukan (yang demikian), maka sesungguhnya engkau termasuk orang-orang zhalim.”","hasanah_per_verse":550},{"text_madani":"وَإِن يَمْسَسْكَ اللَّهُ بِضُرٍّ فَلَا كَاشِفَ لَهُ إِلَّا هُوَ ۖ وَإِن يُرِدْكَ بِخَيْرٍ فَلَا رَادَّ لِفَضْلِهِ ۚ يُصِيبُ بِهِ مَن يَشَاءُ مِنْ عِبَادِهِ ۚ وَهُوَ الْغَفُورُ الرَّحِيمُ","text_tajweed":"وَإ[a:3962[ِن ي]َمْسَسْكَ [h:3963[ٱ]للَّهُ بِضُ[f:3964[رٍّ ف]َلَا كَاشِفَ لَهُ[o[ۥٓ] إِلَّا هُوَ‌ۖ وَإ[a:6224[ِن ي]ُرِ[q:6225[دْ]كَ بِخَيْ[f:6226[رٍ ف]َلَا ر[m[َا]ٓدَّ لِفَضْلِه[n[ِۦ]‌ۚ يُصِيبُ بِه[n[ِۦ] م[a:476[َن ي]َش[o[َا]ٓءُ مِنْ عِبَادِه[n[ِۦ]‌ۚ وَهُوَ [h:6227[ٱ]لْغَفُورُ [h:6228[ٱ][l[ل]رَّح[p[ِي]مُ","translation_en":"And if Allah should afflict you with harm, then there is none to remove it but He; and if He intends good to you there is none to repel His grace; He brings it to whom He pleases of His servants; and He is the Forgiving, the Merciful.","translation_id":"Dan jika Allah menimpakan suatu bencana kepadamu, maka tidak ada yang dapat menghilangkannya kecuali Dia. Dan jika Allah menghendaki kebaikan bagi kamu, maka tidak ada yang dapat menolak karunia-Nya. Dia memberikan kebaikan kepada siapa saja yang Dia kehendaki di antara hamba-hamba-Nya. Dia Maha Pengampun, Maha Penyayang.","hasanah_per_verse":850},{"text_madani":"قُلْ يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُمُ الْحَقُّ مِن رَّبِّكُمْ ۖ فَمَنِ اهْتَدَىٰ فَإِنَّمَا يَهْتَدِي لِنَفْسِهِ ۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۖ وَمَا أَنَا عَلَيْكُم بِوَكِيلٍ","text_tajweed":"قُلْ يَ[o[ـٰٓ]أَيُّهَا [h:82[ٱ][l[ل][g[نّ]َاسُ قَ[q:298[دْ] ج[o[َا]ٓءَكُمُ [h:6229[ٱ]لْحَقُّ م[u:243[ِن ر]َّبِّكُمْ‌ۖ فَمَنِ [h:6230[ٱ]هْتَدَىٰ فَإِ[g[نّ]َمَا يَهْتَدِى لِنَفْسِه[n[ِۦ]‌ۖ وَمَ[f:6231[ن ض]َلَّ فَإِ[g[نّ]َمَا يَضِلُّ عَلَيْهَا‌ۖ وَم[o[َآ] أَنَا۟ عَلَيْك[c:4147[ُم ب]ِوَك[p[ِي]لٍ","translation_en":"Say: O people! indeed there has come to you the truth from your Lord, therefore whoever goes aright, he goes aright only for the good of his own soul, and whoever goes astray, he goes astray only to the detriment of it, and I am not a custodian over you.","translation_id":"Katakanlah (Muhammad), “Wahai manusia! Telah datang kepadamu kebenaran (Al-Qur'an) dari Tuhanmu, sebab itu barang siapa mendapat petunjuk, maka sebenarnya (petunjuk itu) untuk (kebaikan) dirinya sendiri. Dan barang siapa sesat, sesungguhnya kesesatannya itu (mencelakakan) dirinya sendiri. Dan Aku bukanlah pemelihara dirimu.”","hasanah_per_verse":870},{"text_madani":"وَاتَّبِعْ مَا يُوحَىٰ إِلَيْكَ وَاصْبِرْ حَتَّىٰ يَحْكُمَ اللَّهُ ۚ وَهُوَ خَيْرُ الْحَاكِمِينَ","text_tajweed":"وَ[h:9999[ٱ]تَّبِعْ مَا يُوحَ[o[ىٰٓ] إِلَيْكَ وَ[h:6232[ٱ]صْبِرْ حَتَّىٰ يَحْكُمَ [h:4856[ٱ]للَّهُ‌ۚ وَهُوَ خَيْرُ [h:4857[ٱ]لْحَ[n[ـٰ]كِم[p[ِي]نَ","translation_en":"And follow what is revealed to you and be patient till Allah should give judgment, and He is the best of the judges.","translation_id":"Dan ikutilah apa yang diwahyukan kepadamu, dan bersabarlah hingga Allah memberi keputusan. Dialah hakim yang terbaik.","hasanah_per_verse":450}]}
