{"chapter_number":67,"name_simple":"Al-Mulk","name_meaning":{"text":"The Sovereignty","en":"The Sovereignty","id":"Kerajaan"},"verses_count":30,"hasanah":13470,"verses":[{"text_madani":"تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","text_tajweed":"تَبَ[n[ـٰ]رَكَ [h:9556[ٱ]لَّذِى بِيَدِهِ [h:13755[ٱ]لْمُلْكُ وَهُوَ عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َد[p[ِي]رٌ","translation_en":"Blessed is He in Whose hand is the kingdom, and He has power over all things,","translation_id":"Mahasuci Allah yang menguasai (segala) kerajaan, dan Dia Mahakuasa atas segala sesuatu.","hasanah_per_verse":330},{"text_madani":"الَّذِي خَلَقَ الْمَوْتَ وَالْحَيَاةَ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا ۚ وَهُوَ الْعَزِيزُ الْغَفُورُ","text_tajweed":"ٱلَّذِى خَلَقَ [h:13756[ٱ]لْمَوْتَ وَ[h:13757[ٱ]لْحَيَ[s[و][n[ٲ]ةَ لِيَ[q:3603[بْ]لُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَل[a:13758[اً‌ۚ و]َهُوَ [h:7045[ٱ]لْعَزِيزُ [h:13759[ٱ]لْغَف[p[ُو]رُ","translation_en":"Who created death and life that He may try you-- which of you is best in deeds; and He is the Mighty, the Forgiving,","translation_id":"Yang menciptakan mati dan hidup, untuk menguji kamu, siapa di antara kamu yang lebih baik amalnya. Dan Dia Mahaperkasa, Maha Pengampun.","hasanah_per_verse":530},{"text_madani":"الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ طِبَاقًا ۖ مَّا تَرَىٰ فِي خَلْقِ الرَّحْمَٰنِ مِن تَفَاوُتٍ ۖ فَارْجِعِ الْبَصَرَ هَلْ تَرَىٰ مِن فُطُورٍ","text_tajweed":"ٱلَّذِى خَلَقَ سَ[q:158[بْ]عَ سَمَ[n[ـٰ]و[n[َٲ][f:13760[تٍ ط]ِبَا[a:13761[قًا‌ۖ م]َّا تَرَىٰ فِى خَلْقِ [h:13762[ٱ][l[ل]رَّحْمَ[n[ـٰ]نِ مِ[f:13763[ن ت]َفَ[n[ـٰ]وُ[f:13764[تٍ‌ۖ ف]َ[h:13765[ٱ]رْجِعِ [h:13766[ٱ]لْبَصَرَ هَلْ تَرَىٰ مِ[f:13767[ن ف]ُط[p[ُو]رٍ","translation_en":"Who created the seven heavens one above another; you see no incongruity in the creation of the Beneficent Allah; then look again, can you see any disorder?","translation_id":"Yang menciptakan tujuh langit berlapis-lapis. Tidak akan kamu lihat sesuatu yang tidak seimbang pada ciptaan Tuhan Yang Maha Pengasih. Maka lihatlah sekali lagi, adakah kamu lihat sesuatu yang cacat?","hasanah_per_verse":650},{"text_madani":"ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ يَنقَلِبْ إِلَيْكَ الْبَصَرُ خَاسِئًا وَهُوَ حَسِيرٌ","text_tajweed":"ثُ[g[مّ]َ [h:13768[ٱ]رْجِعِ [h:13769[ٱ]لْبَصَرَ كَرَّتَيْنِ يَ[f:2282[نق]َلِ[q:2282[بْ] إِلَيْكَ [h:13770[ٱ]لْبَصَرُ خَاسِ[a:13771[ئًا و]َهُوَ حَس[p[ِي]رٌ","translation_en":"Then turn back the eye again and again; your look shall come back to you confused while it is fatigued.","translation_id":"Kemudian ulangi pandangan(mu) sekali lagi (dan) sekali lagi, niscaya pandanganmu akan kembali kepadamu tanpa menemukan cacat dan ia (pandanganmu) dalam keadaan letih.","hasanah_per_verse":420},{"text_madani":"وَلَقَدْ زَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ وَجَعَلْنَاهَا رُجُومًا لِّلشَّيَاطِينِ ۖ وَأَعْتَدْنَا لَهُمْ عَذَابَ السَّعِيرِ","text_tajweed":"وَلَقَ[q:341[دْ] زَيَّ[g[نّ]َا [h:11314[ٱ][l[ل]سَّم[o[َا]ٓءَ [h:11315[ٱ][l[ل]دُّنْيَا بِمَصَ[n[ـٰ]بِيحَ وَجَعَلْنَ[n[ـٰ]هَا رُجُو[u:13772[مًا ل]ِّلشَّيَ[n[ـٰ]طِينِ‌ۖ وَأَعْتَ[q:2782[دْ]نَا لَهُمْ عَذَابَ [h:13773[ٱ][l[ل]سَّع[p[ِي]رِ","translation_en":"And certainly We have adorned this lower heaven with lamps and We have made these missiles for the Shaitans, and We have prepared for them the chastisement of burning.","translation_id":"Dan sungguh, telah Kami hiasi langit yang dekat, dengan bintang-bintang dan Kami jadikannya (bintang-bintang itu) sebagai alat-alat pelempar setan, dan Kami sediakan bagi mereka azab neraka yang menyala-nyala.","hasanah_per_verse":680},{"text_madani":"وَلِلَّذِينَ كَفَرُوا بِرَبِّهِمْ عَذَابُ جَهَنَّمَ ۖ وَبِئْسَ الْمَصِيرُ","text_tajweed":"وَلِلَّذِينَ كَفَرُو[s[اْ] بِرَبِّهِمْ عَذَابُ جَهَ[g[نّ]َمَ‌ۖ وَبِئْسَ [h:665[ٱ]لْمَص[p[ِي]رُ","translation_en":"And for those who disbelieve in their Lord is the punishment of hell, and evil is the resort.","translation_id":"Dan orang-orang yang ingkar kepada Tuhannya akan mendapat azab Jahanam. Dan itulah seburuk-buruk tempat kembali.","hasanah_per_verse":340},{"text_madani":"إِذَا أُلْقُوا فِيهَا سَمِعُوا لَهَا شَهِيقًا وَهِيَ تَفُورُ","text_tajweed":"إِذ[o[َآ] أُلْقُو[s[اْ] فِيهَا سَمِعُو[s[اْ] لَهَا شَهِي[a:13774[قًا و]َهِىَ تَف[p[ُو]رُ","translation_en":"When they shall be cast therein, they shall hear a loud moaning of it as it heaves,","translation_id":"Apabila mereka dilemparkan ke dalamnya mereka mendengar suara neraka yang mengerikan, sedang neraka itu membara,","hasanah_per_verse":320},{"text_madani":"تَكَادُ تَمَيَّزُ مِنَ الْغَيْظِ ۖ كُلَّمَا أُلْقِيَ فِيهَا فَوْجٌ سَأَلَهُمْ خَزَنَتُهَا أَلَمْ يَأْتِكُمْ نَذِيرٌ","text_tajweed":"تَكَادُ تَمَيَّزُ مِنَ [h:2195[ٱ]لْغَيْظِ‌ۖ كُلَّم[o[َآ] أُلْقِىَ فِيهَا فَوْ[f:13775[جٌ س]َأَلَهُمْ خَزَنَتُه[o[َآ] أَلَمْ يَأْتِكُمْ نَذ[p[ِي]رٌ","translation_en":"Almost bursting for fury. Whenever a group is cast into it, its keeper shall ask them: Did there not come to you a warner?","translation_id":"hampir meledak karena marah. Setiap kali ada sekumpulan (orang-orang kafir) dilemparkan ke dalamnya, penjaga-penjaga (neraka itu) bertanya kepada mereka, “Apakah belum pernah ada orang yang datang memberi peringatan kepadamu (di dunia)?”","hasanah_per_verse":530},{"text_madani":"قَالُوا بَلَىٰ قَدْ جَاءَنَا نَذِيرٌ فَكَذَّبْنَا وَقُلْنَا مَا نَزَّلَ اللَّهُ مِن شَيْءٍ إِنْ أَنتُمْ إِلَّا فِي ضَلَالٍ كَبِيرٍ","text_tajweed":"قَالُو[s[اْ] بَلَىٰ قَ[q:298[دْ] ج[o[َا]ٓءَنَا نَذِي[f:13776[رٌ ف]َكَذَّ[q:13777[بْ]نَا وَقُلْنَا مَا نَزَّلَ [h:4797[ٱ]للَّهُ مِ[f:2103[ن ش]َىْءٍ إِنْ أَ[f:428[نت]ُمْ إِلَّا فِى ضَلَ[n[ـٰ][f:13778[لٍ ك]َب[p[ِي]رٍ","translation_en":"They shall say: Yea! indeed there came to us a warner, but we rejected (him) and said: Allah has not revealed anything, you are only in a great error.","translation_id":"Mereka menjawab, “Benar, sungguh, seorang pemberi peringatan telah datang kepada kami, tetapi kami mendustakan(nya) dan kami katakan, “Allah tidak menurunkan sesuatu apa pun, kamu sebenarnya di dalam kesesatan yang besar.”","hasanah_per_verse":630},{"text_madani":"وَقَالُوا لَوْ كُنَّا نَسْمَعُ أَوْ نَعْقِلُ مَا كُنَّا فِي أَصْحَابِ السَّعِيرِ","text_tajweed":"وَقَالُو[s[اْ] لَوْ كُ[g[نّ]َا نَسْمَعُ أَوْ نَعْقِلُ مَا كُ[g[نّ]َا ف[o[ِىٓ] أَصْحَ[n[ـٰ]بِ [h:11067[ٱ][l[ل]سَّع[p[ِي]رِ","translation_en":"And they shall say: Had we but listened or pondered, we should not have been among the inmates of the burning fire.","translation_id":"Dan mereka berkata, “Sekiranya (dahulu) kami mendengarkan atau memikirkan (peringatan itu) tentulah kami tidak termasuk penghuni neraka yang menyala-nyala.”","hasanah_per_verse":390},{"text_madani":"فَاعْتَرَفُوا بِذَنبِهِمْ فَسُحْقًا لِّأَصْحَابِ السَّعِيرِ","text_tajweed":"فَ[h:9999[ٱ]عْتَرَفُو[s[اْ] بِذَ[i:13779[نۢب]ِهِمْ فَسُحْ[u:13780[قًا ل]ِّأَصْحَ[n[ـٰ]بِ [h:13781[ٱ][l[ل]سَّع[p[ِي]رِ","translation_en":"So they shall acknowledge their sins, but far will be (forgiveness) from the inmates of the burning fire.","translation_id":"Maka mereka mengakui dosanya. Tetapi jauhlah (dari rahmat Allah) bagi penghuni neraka yang menyala-nyala itu.","hasanah_per_verse":310},{"text_madani":"إِنَّ الَّذِينَ يَخْشَوْنَ رَبَّهُم بِالْغَيْبِ لَهُم مَّغْفِرَةٌ وَأَجْرٌ كَبِيرٌ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ يَخْشَوْنَ رَبَّه[c:8779[ُم ب]ِ[h:13[ٱ]لْغَيْبِ لَه[w:3412[ُم م]َّغْفِرَ[a:3413[ةٌ و]َأَ[q:3414[جْ][f:6259[رٌ ك]َب[p[ِي]رٌ","translation_en":"(As for) those who fear their Lord in secret, they shall surely have forgiveness and a great reward.","translation_id":"Sesungguhnya orang-orang yang takut kepada Tuhannya yang tidak terlihat oleh mereka, mereka memperoleh ampunan dan pahala yang besar.","hasanah_per_verse":380},{"text_madani":"وَأَسِرُّوا قَوْلَكُمْ أَوِ اجْهَرُوا بِهِ ۖ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","text_tajweed":"وَأَسِرُّو[s[اْ] قَوْلَكُمْ أَوِ [h:13782[ٱ][q:13783[جْ]هَرُو[s[اْ] بِه[o[ِۦٓ‌ۖ] إِ[g[نّ]َهُ[n[ۥ] عَلِي[i:2196[مُۢ ب]ِذَاتِ [h:2197[ٱ][l[ل]صُّد[p[ُو]رِ","translation_en":"And conceal your word or manifest it; surely He is Cognizant of what is in the hearts.","translation_id":"Dan rahasiakanlah perkataanmu atau nyatakanlah. Sungguh, Dia Maha Mengetahui segala isi hati.","hasanah_per_verse":380},{"text_madani":"أَلَا يَعْلَمُ مَنْ خَلَقَ وَهُوَ اللَّطِيفُ الْخَبِيرُ","text_tajweed":"أَلَا يَعْلَمُ مَنْ خَلَقَ وَهُوَ [h:4309[ٱ][l[ل]لَّطِيفُ [h:4310[ٱ]لْخَب[p[ِي]رُ","translation_en":"Does He not know, Who created? And He is the Knower of the subtleties, the Aware.","translation_id":"Apakah (pantas) Allah yang menciptakan itu tidak mengetahui? Dan Dia Mahahalus, Maha Mengetahui.","hasanah_per_verse":270},{"text_madani":"هُوَ الَّذِي جَعَلَ لَكُمُ الْأَرْضَ ذَلُولًا فَامْشُوا فِي مَنَاكِبِهَا وَكُلُوا مِن رِّزْقِهِ ۖ وَإِلَيْهِ النُّشُورُ","text_tajweed":"هُوَ [h:153[ٱ]لَّذِى جَعَلَ لَكُمُ [h:87[ٱ]لْأَرْضَ ذَلُول[f:13784[اً ف]َ[h:13785[ٱ]مْشُو[s[اْ] فِى مَنَاكِبِهَا وَكُلُو[s[اْ] م[u:13786[ِن ر]ِّزْقِه[n[ِۦ]‌ۖ وَإِلَيْهِ [h:13787[ٱ][l[ل][g[نّ]ُش[p[ُو]رُ","translation_en":"He it is Who made the earth smooth for you, therefore go about in the spacious sides thereof, and eat of His sustenance, and to Him is the return after death.","translation_id":"Dialah yang menjadikan bumi untuk kamu yang mudah dijelajahi, maka jelajahilah di segala penjurunya dan makanlah sebagian dari rezeki-Nya. Dan hanya kepada-Nyalah kamu (kembali setelah) dibangkitkan.","hasanah_per_verse":590},{"text_madani":"أَأَمِنتُم مَّن فِي السَّمَاءِ أَن يَخْسِفَ بِكُمُ الْأَرْضَ فَإِذَا هِيَ تَمُورُ","text_tajweed":"ءَأَمِ[f:13788[نت][w:13789[ُم م]َّ[f:2074[ن ف]ِى [h:746[ٱ][l[ل]سَّم[o[َا]ٓءِ أ[a:7417[َن ي]َخْسِفَ بِكُمُ [h:13790[ٱ]لْأَرْضَ فَإِذَا هِىَ تَم[p[ُو]رُ","translation_en":"Are you secure of those in the heaven that He should not make the earth to swallow you up? Then lo! it shall be in a state of commotion.","translation_id":"Sudah merasa amankah kamu, bahwa Dia yang di langit tidak akan membuat kamu ditelan bumi ketika tiba-tiba ia terguncang?","hasanah_per_verse":400},{"text_madani":"أَمْ أَمِنتُم مَّن فِي السَّمَاءِ أَن يُرْسِلَ عَلَيْكُمْ حَاصِبًا ۖ فَسَتَعْلَمُونَ كَيْفَ نَذِيرِ","text_tajweed":"أَمْ أَمِ[f:1062[نت][w:13791[ُم م]َّ[f:2074[ن ف]ِى [h:746[ٱ][l[ل]سَّم[o[َا]ٓءِ أ[a:10505[َن ي]ُرْسِلَ عَلَيْكُمْ حَاصِ[f:13792[بًا‌ۖ ف]َسَتَعْلَمُونَ كَيْفَ نَذ[p[ِي]رِ","translation_en":"Or are you secure of those in the heaven that He should not send down upon you a punishment? Then shall you know how was My warning.","translation_id":"Atau sudah merasa amankah kamu, bahwa Dia yang di langit tidak akan mengirimkan badai yang berbatu kepadamu? Namun kelak kamu akan mengetahui bagaimana (akibat mendustakan) peringatan-Ku.","hasanah_per_verse":480},{"text_madani":"وَلَقَدْ كَذَّبَ الَّذِينَ مِن قَبْلِهِمْ فَكَيْفَ كَانَ نَكِيرِ","text_tajweed":"وَلَقَ[q:341[دْ] كَذَّبَ [h:4507[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ فَكَيْفَ كَانَ نَك[p[ِي]رِ","translation_en":"And certainly those before them rejected (the truth), then how was My disapproval.","translation_id":"Dan sungguh, orang-orang yang sebelum mereka pun telah mendustakan (rasul-rasul-Nya). Maka betapa hebatnya kemurkaan-Ku!","hasanah_per_verse":300},{"text_madani":"أَوَلَمْ يَرَوْا إِلَى الطَّيْرِ فَوْقَهُمْ صَافَّاتٍ وَيَقْبِضْنَ ۚ مَا يُمْسِكُهُنَّ إِلَّا الرَّحْمَٰنُ ۚ إِنَّهُ بِكُلِّ شَيْءٍ بَصِيرٌ","text_tajweed":"أَوَلَمْ يَرَوْ[s[اْ] إِلَى [h:7520[ٱ][l[ل]طَّيْرِ فَوْقَهُمْ صَ[m[ـٰٓ]فَّ[n[ـٰ][a:13793[تٍ و]َيَ[q:13794[قْ]بِضْنَ‌ۚ مَا يُمْسِكُهُ[g[نّ]َ إِلَّا [h:13795[ٱ][l[ل]رَّحْمَ[n[ـٰ]نُ‌ۚ إِ[g[نّ]َهُ[n[ۥ] بِكُلِّ شَىْ[i:13796[ءِۭ ب]َص[p[ِي]رٌ","translation_en":"Have they not seen the birds above them expanding (their wings) and contracting (them)? What is it that withholds them save the Beneficent Allah? Surely He sees everything.","translation_id":"Tidakkah mereka memperhatikan burung-burung yang mengembangkan dan mengatupkan sayapnya di atas mereka? Tidak ada yang menahannya (di udara) selain Yang Maha Pengasih. Sungguh, Dia Maha Melihat segala sesuatu.","hasanah_per_verse":620},{"text_madani":"أَمَّنْ هَٰذَا الَّذِي هُوَ جُندٌ لَّكُمْ يَنصُرُكُم مِّن دُونِ الرَّحْمَٰنِ ۚ إِنِ الْكَافِرُونَ إِلَّا فِي غُرُورٍ","text_tajweed":"أَ[g[مّ]َنْ هَ[n[ـٰ]ذَا [h:126[ٱ]لَّذِى هُوَ جُن[u:13797[دٌ ل]َّكُمْ يَ[f:2381[نص]ُرُك[w:2382[ُم م]ِّ[f:107[ن د]ُونِ [h:12269[ٱ][l[ل]رَّحْمَ[n[ـٰ]نِ‌ۚ إِنِ [h:13798[ٱ]لْكَ[n[ـٰ]فِرُونَ إِلَّا فِى غُر[p[ُو]رٍ","translation_en":"Or who is it that will be a host for you to assist you besides the Beneficent Allah? The unbelievers are only in deception.","translation_id":"Atau siapakah yang akan menjadi bala tentara bagimu yang dapat membelamu selain (Allah) Yang Maha Pengasih? Orang-orang kafir itu hanyalah dalam (keadaan) tertipu.","hasanah_per_verse":540},{"text_madani":"أَمَّنْ هَٰذَا الَّذِي يَرْزُقُكُمْ إِنْ أَمْسَكَ رِزْقَهُ ۚ بَل لَّجُّوا فِي عُتُوٍّ وَنُفُورٍ","text_tajweed":"أَ[g[مّ]َنْ هَ[n[ـٰ]ذَا [h:126[ٱ]لَّذِى يَرْزُقُكُمْ إِنْ أَمْسَكَ رِزْقَهُ[n[ۥ]‌ۚ بَل لَّجُّو[s[اْ] فِى عُتُ[a:13799[وٍّ و]َنُف[p[ُو]رٍ","translation_en":"Or who is it that will give you sustenance if He should withhold His sustenance? Nay! they persist in disdain and aversion.","translation_id":"Atau siapakah yang dapat memberimu rezeki jika Dia menahan rezeki-Nya? Bahkan mereka terus-menerus dalam kesombongan dan menjauhkan diri (dari kebenaran).","hasanah_per_verse":420},{"text_madani":"أَفَمَن يَمْشِي مُكِبًّا عَلَىٰ وَجْهِهِ أَهْدَىٰ أَمَّن يَمْشِي سَوِيًّا عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ","text_tajweed":"أَفَم[a:13800[َن ي]َمْشِى مُكِبًّا عَلَىٰ وَ[q:6818[جْ]هِه[o[ِۦٓ] أَهْدَ[o[ىٰٓ] أَ[g[مّ][a:13801[َن ي]َمْشِى سَوِيًّا عَلَىٰ صِر[n[َٲ][a:726[طٍ م]ُّسْتَق[p[ِي]مٍ","translation_en":"What! is he who goes prone upon his face better guided or he who walks upright upon a straight path?","translation_id":"Apakah orang yang merangkak dengan wajah tertelungkup yang lebih terpimpin (dalam kebenaran) ataukah orang yang berjalan tegap di atas jalan yang lurus?","hasanah_per_verse":470},{"text_madani":"قُلْ هُوَ الَّذِي أَنشَأَكُمْ وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ ۖ قَلِيلًا مَّا تَشْكُرُونَ","text_tajweed":"قُلْ هُوَ [h:153[ٱ]لَّذ[o[ِىٓ] أَ[f:4272[نش]َأَكُمْ وَجَعَلَ لَكُمُ [h:7518[ٱ][l[ل]سَّمْعَ وَ[h:6037[ٱ]لْأَ[q:6037[بْ]صَ[n[ـٰ]رَ وَ[h:7519[ٱ]لْأَفْــِٔدَةَ‌ۖ قَلِيل[a:4583[اً م]َّا تَشْكُر[p[ُو]نَ","translation_en":"Say: He it is Who brought you into being and made for you the ears and the eyes and the hearts: little is it that you give thanks.","translation_id":"Katakanlah, “Dialah yang menciptakan kamu dan menjadikan pendengaran, penglihatan dan hati nurani bagi kamu. (Tetapi) sedikit sekali kamu bersyukur.”","hasanah_per_verse":550},{"text_madani":"قُلْ هُوَ الَّذِي ذَرَأَكُمْ فِي الْأَرْضِ وَإِلَيْهِ تُحْشَرُونَ","text_tajweed":"قُلْ هُوَ [h:153[ٱ]لَّذِى ذَرَأَكُمْ فِى [h:44[ٱ]لْأَرْضِ وَإِلَيْهِ تُحْشَر[p[ُو]نَ","translation_en":"Say: He it is Who multiplied you in the earth and to Him you shall be gathered.","translation_id":"Katakanlah, “Dialah yang menjadikan kamu berkembang biak di muka bumi, dan hanya kepada-Nya kamu akan dikumpulkan.”","hasanah_per_verse":310},{"text_madani":"وَيَقُولُونَ مَتَىٰ هَٰذَا الْوَعْدُ إِن كُنتُمْ صَادِقِينَ","text_tajweed":"وَيَقُولُونَ مَتَىٰ هَ[n[ـٰ]ذَا [h:6081[ٱ]لْوَعْدُ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ صَ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"And they say: When shall this threat be (executed) if you are truthful?","translation_id":"Dan mereka berkata, “Kapan (datangnya) ancaman itu jika kamu orang yang benar?”","hasanah_per_verse":300},{"text_madani":"قُلْ إِنَّمَا الْعِلْمُ عِندَ اللَّهِ وَإِنَّمَا أَنَا نَذِيرٌ مُّبِينٌ","text_tajweed":"قُلْ إِ[g[نّ]َمَا [h:12490[ٱ]لْعِلْمُ عِ[f:264[ند]َ [h:408[ٱ]للَّهِ وَإِ[g[نّ]َم[o[َآ] أَنَا۟ نَذِي[a:5164[رٌ م]ُّب[p[ِي]نٌ","translation_en":"Say: The knowledge (thereof is only with Allah and I am only a plain warner.","translation_id":"Katakanlah (Muhammad), “Sesungguhnya ilmu (tentang hari Kiamat itu) hanya ada pada Allah. Dan aku hanyalah seorang pemberi peringatan yang menjelaskan.”","hasanah_per_verse":340},{"text_madani":"فَلَمَّا رَأَوْهُ زُلْفَةً سِيئَتْ وُجُوهُ الَّذِينَ كَفَرُوا وَقِيلَ هَٰذَا الَّذِي كُنتُم بِهِ تَدَّعُونَ","text_tajweed":"فَلَ[g[مّ]َا رَأَوْهُ زُلْفَ[f:13802[ةً س]ِ[o[يٓ]ــَٔتْ وُجُوهُ [h:13803[ٱ]لَّذِينَ كَفَرُو[s[اْ] وَقِيلَ هَ[n[ـٰ]ذَا [h:126[ٱ]لَّذِى كُ[f:100[نت][c:6084[ُم ب]ِه[n[ِۦ] تَدَّع[p[ُو]نَ","translation_en":"But when they shall see it nigh, the faces of those who disbelieve shall be sorry, and it shall be said; This is that which you used to call for.","translation_id":"Maka ketika mereka melihat azab (pada hari Kiamat) sudah dekat, wajah orang-orang kafir itu menjadi muram. Dan dikatakan (kepada mereka), “Inilah (azab) yang dahulunya kamu minta.”","hasanah_per_verse":520},{"text_madani":"قُلْ أَرَأَيْتُمْ إِنْ أَهْلَكَنِيَ اللَّهُ وَمَن مَّعِيَ أَوْ رَحِمَنَا فَمَن يُجِيرُ الْكَافِرِينَ مِنْ عَذَابٍ أَلِيمٍ","text_tajweed":"قُلْ أَرَءَيْتُمْ إِنْ أَهْلَكَنِىَ [h:13804[ٱ]للَّهُ وَم[a:9807[َن م]َّعِىَ أَوْ رَحِمَنَا فَم[a:13805[َن ي]ُجِيرُ [h:13806[ٱ]لْكَ[n[ـٰ]فِرِينَ مِنْ عَذَابٍ أَل[p[ِي]مٍ","translation_en":"Say: Have you considered if Allah should destroy me and those with me-- rather He will have mercy on us; yet who will protect the unbelievers from a painful punishment?","translation_id":"Katakanlah (Muhammad), “Tahukah kamu jika Allah mematikan aku dan orang-orang yang bersamaku atau memberi rahmat kepada kami, (maka kami akan masuk surga), lalu siapa yang dapat melindungi orang-orang kafir dari azab yang pedih?”","hasanah_per_verse":580},{"text_madani":"قُلْ هُوَ الرَّحْمَٰنُ آمَنَّا بِهِ وَعَلَيْهِ تَوَكَّلْنَا ۖ فَسَتَعْلَمُونَ مَنْ هُوَ فِي ضَلَالٍ مُّبِينٍ","text_tajweed":"قُلْ هُوَ [h:829[ٱ][l[ل]رَّحْمَ[n[ـٰ]نُ ءَامَ[g[نّ]َا بِه[n[ِۦ] وَعَلَيْهِ تَوَكَّلْنَا‌ۖ فَسَتَعْلَمُونَ مَنْ هُوَ فِى ضَلَ[n[ـٰ][a:2393[لٍ م]ُّب[p[ِي]نٍ","translation_en":"Say: He is the Beneficent Allah, we believe in Him and on Him do we rely, so you shall come to know who it is that is in clear error.","translation_id":"Katakanlah, “Dialah Yang Maha Pengasih, kami beriman kepada-Nya dan kepada-Nya kami bertawakal. Maka kelak kamu akan tahu siapa yang berada dalam kesesatan yang nyata.”","hasanah_per_verse":490},{"text_madani":"قُلْ أَرَأَيْتُمْ إِنْ أَصْبَحَ مَاؤُكُمْ غَوْرًا فَمَن يَأْتِيكُم بِمَاءٍ مَّعِينٍ","text_tajweed":"قُلْ أَرَءَيْتُمْ إِنْ أَصْبَحَ م[o[َا]ٓؤُكُمْ غَوْ[f:13807[رًا ف]َم[a:13808[َن ي]َأْتِيك[c:13809[ُم ب]ِم[o[َا]ٓ[a:13810[ءٍ م]َّع[p[ِي]نِۭ","translation_en":"Say: Have you considered if your water should go down, who is it then that will bring you flowing water?","translation_id":"Katakanlah (Muhammad), “Terangkanlah kepadaku jika sumber air kamu menjadi kering; maka siapa yang akan memberimu air yang mengalir?”","hasanah_per_verse":400}]}
