{"chapter_number":71,"name_simple":"Nuh","name_meaning":{"text":"Noah","en":"Noah","id":"Nuh"},"verses_count":28,"hasanah":9650,"verses":[{"text_madani":"إِنَّا أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ أَنْ أَنذِرْ قَوْمَكَ مِن قَبْلِ أَن يَأْتِيَهُمْ عَذَابٌ أَلِيمٌ","text_tajweed":"إِ[g[نّ][o[َآ] أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِه[o[ِۦٓ] أَنْ أَ[f:13946[نذ]ِرْ قَوْمَكَ مِ[f:1346[ن ق]َ[q:1347[بْ]لِ أ[a:4887[َن ي]َأْتِيَهُمْ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"Surely We sent Nuh to his people, saying: Warn your people before there come upon them a painful chastisement.","translation_id":"Sesungguhnya Kami telah mengutus Nuh kepada kaumnya (dengan perintah), “Berilah kaummu peringatan sebelum datang kepadanya azab yang pedih.”","hasanah_per_verse":510},{"text_madani":"قَالَ يَا قَوْمِ إِنِّي لَكُمْ نَذِيرٌ مُّبِينٌ","text_tajweed":"قَالَ يَ[n[ـٰ]قَوْمِ إِ[g[نّ]ِى لَكُمْ نَذِي[a:5164[رٌ م]ُّب[p[ِي]نٌ","translation_en":"He said: O my people! Surely I am a plain warner to you:","translation_id":"Dia (Nuh) berkata, “Wahai kaumku! Sesungguhnya aku ini seorang pemberi peringatan yang menjelaskan kepada kamu,","hasanah_per_verse":220},{"text_madani":"أَنِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ وَأَطِيعُونِ","text_tajweed":"أَنِ [h:3899[ٱ]عْبُدُو[s[اْ] [h:3704[ٱ]للَّهَ وَ[h:4181[ٱ]تَّقُوهُ وَأَطِيع[p[ُو]نِ","translation_en":"That you should serve Allah and be careful of (your duty to) Him and obey me:","translation_id":"(yaitu) sembahlah Allah, bertakwalah kepada-Nya dan taatlah kepadaku,","hasanah_per_verse":250},{"text_madani":"يَغْفِرْ لَكُم مِّن ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إِلَىٰ أَجَلٍ مُّسَمًّى ۚ إِنَّ أَجَلَ اللَّهِ إِذَا جَاءَ لَا يُؤَخَّرُ ۖ لَوْ كُنتُمْ تَعْلَمُونَ","text_tajweed":"يَغْفِرْ لَك[w:556[ُم م]ِّ[f:7063[ن ذ]ُنُوبِكُمْ وَيُؤَخِّرْكُمْ إِلَ[o[ىٰٓ] أَجَ[a:1657[لٍ م]ُّسَ[g[مّ]ًى‌ۚ إِ[g[نّ]َ أَجَلَ [h:10285[ٱ]للَّهِ إِذَا ج[o[َا]ٓءَ لَا يُؤَخَّرُ‌ۖ لَوْ كُ[f:100[نت]ُمْ تَعْلَم[p[ُو]نَ","translation_en":"He will forgive you some of your faults and grant you a delay to an appointed term; surely the term of Allah when it comes is not postponed; did you but know!","translation_id":"niscaya Dia mengampuni sebagian dosa-dosamu dan menangguhkan kamu (memanjangkan umurmu) sampai pada batas waktu yang ditentukan. Sungguh, ketetapan Allah itu apabila telah datang tidak dapat ditunda, seandainya kamu mengetahui.”","hasanah_per_verse":650},{"text_madani":"قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا","text_tajweed":"قَالَ رَبِّ إِ[g[نّ]ِى دَعَوْتُ قَوْمِى لَيْل[a:13947[اً و]َنَهَارًا","translation_en":"He said: O my Lord! surely I have called my people by night and by day!","translation_id":"Dia (Nuh) berkata, “Ya Tuhanku, sesungguhnya aku telah menyeru kaumku siang dan malam,","hasanah_per_verse":260},{"text_madani":"فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا","text_tajweed":"فَلَمْ يَزِ[q:13948[دْ]هُمْ دُع[o[َا]ٓء[o[ِىٓ] إِلَّا فِرَارًا","translation_en":"But my call has only made them flee the more:","translation_id":"tetapi seruanku itu tidak menambah (iman) mereka, justru mereka lari (dari kebenaran).","hasanah_per_verse":210},{"text_madani":"وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا","text_tajweed":"وَإِ[g[نّ]ِى كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَل[o[ُوٓ][s[اْ] أَصَ[n[ـٰ]بِعَهُمْ ف[o[ِىٓ] ءَاذَانِهِمْ وَ[h:13949[ٱ]سْتَغْشَوْ[s[اْ] ثِيَابَهُمْ وَأَصَرُّو[s[اْ] وَ[h:3326[ٱ]سْتَكْبَرُو[s[اْ] [h:13950[ٱ]سْتِكْبَارًا","translation_en":"And whenever I have called them that Thou mayest forgive them, they put their fingers in their ears, cover themselves with their garments, and persist and are puffed up with pride:","translation_id":"Dan sesungguhnya aku setiap kali menyeru mereka (untuk beriman) agar Engkau mengampuni mereka, mereka memasukkan anak jarinya ke telinganya dan menutupkan bajunya (ke wajahnya) dan mereka tetap (mengingkari) dan sangat menyombongkan diri.","hasanah_per_verse":790},{"text_madani":"ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا","text_tajweed":"ثُ[g[مّ]َ إِ[g[نّ]ِى دَعَوْتُهُمْ جِهَارًا","translation_en":"Then surely I called to them aloud:","translation_id":"Lalu sesungguhnya aku menyeru mereka dengan cara terang-terangan.","hasanah_per_verse":160},{"text_madani":"ثُمَّ إِنِّي أَعْلَنتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا","text_tajweed":"ثُ[g[مّ]َ إِ[g[نّ][o[ِىٓ] أَعْلَ[f:13951[نت]ُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا","translation_en":"Then surely I spoke to them in public and I spoke to them in secret:","translation_id":"Kemudian aku menyeru mereka secara terbuka dan dengan diam-diam,","hasanah_per_verse":280},{"text_madani":"فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا","text_tajweed":"فَقُلْتُ [h:13952[ٱ]سْتَغْفِرُو[s[اْ] رَبَّكُمْ إِ[g[نّ]َهُ[n[ۥ] كَانَ غَفَّارًا","translation_en":"Then I said, Ask forgiveness of your Lord, surely He is the most Forgiving:","translation_id":"maka aku berkata (kepada mereka), “Mohonlah ampunan kepada Tuhanmu, Sungguh, Dia Maha Pengampun,","hasanah_per_verse":270},{"text_madani":"يُرْسِلِ السَّمَاءَ عَلَيْكُم مِّدْرَارًا","text_tajweed":"يُرْسِلِ [h:6377[ٱ][l[ل]سَّم[o[َا]ٓءَ عَلَيْك[w:6378[ُم م]ِّ[q:3932[دْ]رَارًا","translation_en":"He will send down upon you the cloud, pouring down abundance of rain:","translation_id":"niscaya Dia akan menurunkan hujan yang lebat dari langit kepadamu,","hasanah_per_verse":210},{"text_madani":"وَيُمْدِدْكُم بِأَمْوَالٍ وَبَنِينَ وَيَجْعَل لَّكُمْ جَنَّاتٍ وَيَجْعَل لَّكُمْ أَنْهَارًا","text_tajweed":"وَيُمْدِ[q:13953[دْ]ك[c:13954[ُم ب]ِأَمْو[n[َٲ][a:7671[لٍ و]َبَنِينَ وَيَ[q:9574[جْ]عَل لَّكُمْ جَ[g[نّ]َ[n[ـٰ][a:13955[تٍ و]َيَ[q:9574[جْ]عَل لَّكُمْ أَنْهَ[n[ـٰ]رًا","translation_en":"And help you with wealth and sons, and make for you gardens, and make for you rivers.","translation_id":"dan Dia memperbanyak harta dan anak-anakmu, dan mengadakan kebun-kebun untukmu dan mengadakan sungai-sungai untukmu.”","hasanah_per_verse":440},{"text_madani":"مَّا لَكُمْ لَا تَرْجُونَ لِلَّهِ وَقَارًا","text_tajweed":"مَّا لَكُمْ لَا تَرْجُونَ لِلَّهِ وَقَارًا","translation_en":"What is the matter with you that you fear not the greatness of Allah?","translation_id":"Mengapa kamu tidak takut akan kebesaran Allah?","hasanah_per_verse":200},{"text_madani":"وَقَدْ خَلَقَكُمْ أَطْوَارًا","text_tajweed":"وَقَ[q:387[دْ] خَلَقَكُمْ أَ[q:13956[طْ]وَارًا","translation_en":"And indeed He has created you through various grades:","translation_id":"Dan sungguh, Dia telah menciptakan kamu dalam beberapa tingkatan (kejadian).","hasanah_per_verse":140},{"text_madani":"أَلَمْ تَرَوْا كَيْفَ خَلَقَ اللَّهُ سَبْعَ سَمَاوَاتٍ طِبَاقًا","text_tajweed":"أَلَمْ تَرَوْ[s[اْ] كَيْفَ خَلَقَ [h:1272[ٱ]للَّهُ سَ[q:158[بْ]عَ سَمَ[n[ـٰ]و[n[َٲ][f:13760[تٍ ط]ِبَاقًا","translation_en":"Do you not see how Allah has created the seven heavens, one above another,","translation_id":"Tidakkah kamu memperhatikan bagai-mana Allah telah menciptakan tujuh langit berlapis-lapis?","hasanah_per_verse":310},{"text_madani":"وَجَعَلَ الْقَمَرَ فِيهِنَّ نُورًا وَجَعَلَ الشَّمْسَ سِرَاجًا","text_tajweed":"وَجَعَلَ [h:13957[ٱ]لْقَمَرَ فِيهِ[g[نّ]َ نُو[a:13958[رًا و]َجَعَلَ [h:13959[ٱ][l[ل]شَّمْسَ سِرَاجًا","translation_en":"And made the moon therein a light, and made the sun a lamp?","translation_id":"Dan di sana Dia menciptakan bulan yang bercahaya dan menjadikan matahari sebagai pelita (yang cemerlang)?","hasanah_per_verse":310},{"text_madani":"وَاللَّهُ أَنبَتَكُم مِّنَ الْأَرْضِ نَبَاتًا","text_tajweed":"وَ[h:9999[ٱ]للَّهُ أَ[i:13960[نۢب]َتَك[w:13961[ُم م]ِّنَ [h:1579[ٱ]لْأَرْضِ نَبَاتًا","translation_en":"And Allah has made you grow out of the earth as a growth:","translation_id":"Dan Allah menumbuhkan kamu dari tanah, tumbuh (berangsur-angsur),","hasanah_per_verse":230},{"text_madani":"ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجًا","text_tajweed":"ثُ[g[مّ]َ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجًا","translation_en":"Then He returns you to it, then will He bring you forth a (new) bringing forth:","translation_id":"kemudian Dia akan mengembalikan kamu ke dalamnya (tanah) dan mengeluarkan kamu (pada hari Kiamat) dengan pasti.","hasanah_per_verse":250},{"text_madani":"وَاللَّهُ جَعَلَ لَكُمُ الْأَرْضَ بِسَاطًا","text_tajweed":"وَ[h:9999[ٱ]للَّهُ جَعَلَ لَكُمُ [h:87[ٱ]لْأَرْضَ بِسَاطًا","translation_en":"And Allah has made for you the earth a wide expanse,","translation_id":"Dan Allah menjadikan bumi untukmu sebagai hamparan,","hasanah_per_verse":210},{"text_madani":"لِّتَسْلُكُوا مِنْهَا سُبُلًا فِجَاجًا","text_tajweed":"لِّتَسْلُكُو[s[اْ] مِنْهَا سُبُل[f:13962[اً ف]ِجَاجًا","translation_en":"That you may go along therein in wide paths.","translation_id":"agar kamu dapat pergi kian kemari di jalan-jalan yang luas","hasanah_per_verse":200},{"text_madani":"قَالَ نُوحٌ رَّبِّ إِنَّهُمْ عَصَوْنِي وَاتَّبَعُوا مَن لَّمْ يَزِدْهُ مَالُهُ وَوَلَدُهُ إِلَّا خَسَارًا","text_tajweed":"قَالَ نُو[u:13963[حٌ ر]َّبِّ إِ[g[نّ]َهُمْ عَصَوْنِى وَ[h:2433[ٱ]تَّبَعُو[s[اْ] م[u:11941[َن ل]َّمْ يَزِ[q:13964[دْ]هُ مَالُهُ[n[ۥ] وَوَلَدُهُ[o[ۥٓ] إِلَّا خَسَارًا","translation_en":"Nuh said: My Lord! surely they have disobeyed me and followed him whose wealth and children have added to him nothing but loss.","translation_id":"Nuh berkata, “Ya Tuhanku, sesungguhnya mereka durhaka kepadaku, dan mereka mengikuti orang-orang yang harta dan anak-anaknya hanya menambah kerugian baginya,","hasanah_per_verse":490},{"text_madani":"وَمَكَرُوا مَكْرًا كُبَّارًا","text_tajweed":"وَمَكَرُو[s[اْ] مَكْ[f:13965[رًا ك]ُبَّارًا","translation_en":"And they have planned a very great plan.","translation_id":"dan mereka melakukan tipu daya yang sangat besar.”","hasanah_per_verse":150},{"text_madani":"وَقَالُوا لَا تَذَرُنَّ آلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا","text_tajweed":"وَقَالُو[s[اْ] لَا تَذَرُ[g[نّ]َ ءَالِهَتَكُمْ وَلَا تَذَرُ[g[نّ]َ وَد[a:13966[ًّا و]َلَا سُوَا[a:13967[عًا و]َلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا","translation_en":"And they say: By no means leave your gods, nor leave Wadd, nor Suwa; nor Yaghus, and Yauq and Nasr.","translation_id":"Dan mereka berkata, “Jangan sekali-kali kamu meninggalkan (penyembahan) tuhan-tuhan kamu dan jangan pula sekali-kali kamu meninggalkan (penyembahan) Wadd, dan jangan pula Suw±‘, Yagµ£, Ya‘µq dan Nasr.”","hasanah_per_verse":530},{"text_madani":"وَقَدْ أَضَلُّوا كَثِيرًا ۖ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا ضَلَالًا","text_tajweed":"وَقَ[q:387[دْ] أَضَلُّو[s[اْ] كَثِي[a:13968[رًا‌ۖ و]َلَا تَزِدِ [h:13969[ٱ][l[ل]ظَّ[n[ـٰ]لِمِينَ إِلَّا ضَلَ[n[ـٰ]لاً","translation_en":"And indeed they have led astray many, and do not increase the unjust in aught but error.","translation_id":"Dan sungguh, mereka telah menyesatkan banyak orang; dan janganlah Engkau tambahkan bagi orang-orang yang zhalim itu selain kesesatan.","hasanah_per_verse":350},{"text_madani":"مِّمَّا خَطِيئَاتِهِمْ أُغْرِقُوا فَأُدْخِلُوا نَارًا فَلَمْ يَجِدُوا لَهُم مِّن دُونِ اللَّهِ أَنصَارًا","text_tajweed":"مِّ[g[مّ]َا خَط[o[ِيٓ]ـَٔ[n[ـٰ]تِهِمْ أُغْرِقُو[s[اْ] فَأُ[q:13970[دْ]خِلُو[s[اْ] نَا[f:13971[رًا ف]َلَمْ يَجِدُو[s[اْ] لَه[w:1812[ُم م]ِّ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ أَ[f:13972[نص]َارًا","translation_en":"Because of their wrongs they were drowned, then made to enter fire, so they did not find any helpers besides Allah.","translation_id":"Disebabkan kesalahan-kesalahan mereka, mereka ditenggelamkan lalu dimasukkan ke neraka, maka mereka tidak mendapat penolong selain Allah.","hasanah_per_verse":540},{"text_madani":"وَقَالَ نُوحٌ رَّبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا","text_tajweed":"وَقَالَ نُو[u:13963[حٌ ر]َّبِّ لَا تَذَرْ عَلَى [h:7958[ٱ]لْأَرْضِ مِنَ [h:182[ٱ]لْكَ[n[ـٰ]فِرِينَ دَيَّارًا","translation_en":"And Nuh said: My Lord! leave not upon the land any dweller from among the unbelievers:","translation_id":"Dan Nuh berkata, “Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi.","hasanah_per_verse":370},{"text_madani":"إِنَّكَ إِن تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا","text_tajweed":"إِ[g[نّ]َكَ إِ[f:13973[ن ت]َذَرْهُمْ يُضِلُّو[s[اْ] عِبَادَكَ وَلَا يَلِد[o[ُوٓ][s[اْ] إِلَّا فَاجِ[f:13974[رًا ك]َفَّارًا","translation_en":"For surely if Thou leave them they will lead astray Thy servants, and will not beget any but immoral, ungrateful (children)","translation_id":"Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hamba-Mu, dan mereka hanya akan melahirkan anak-anak yang jahat dan tidak tahu bersyukur.","hasanah_per_verse":410},{"text_madani":"رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا","text_tajweed":"رَّبِّ [h:5032[ٱ]غْفِرْ لِى وَلِو[n[َٲ]لِدَىَّ وَلِمَ[f:13975[ن د]َخَلَ بَيْتِىَ مُؤْمِ[a:13976[نًا و]َلِلْمُؤْمِنِينَ وَ[h:5718[ٱ]لْمُؤْمِنَ[n[ـٰ]تِ وَلَا تَزِدِ [h:13969[ٱ][l[ل]ظَّ[n[ـٰ]لِمِينَ إِلَّا تَبَارَۢا","translation_en":"My Lord! forgive me and my parents and him who enters my house believing, and the believing men and the believing women; and do not increase the unjust in aught but destruction!","translation_id":"Ya Tuhanku, ampunilah aku, ibu bapakku, dan siapa pun yang memasuki rumahku dengan beriman dan semua orang yang beriman laki-laki dan perempuan. Dan janganlah Engkau tambahkan bagi orang-orang yang zhalim itu selain kehancuran.”","hasanah_per_verse":710}]}
