{"chapter_number":14,"name_simple":"Ibrahim","name_meaning":{"text":"Abrahim","en":"Abrahim","id":"Ibrahim"},"verses_count":52,"hasanah":35390,"verses":[{"text_madani":"الر ۚ كِتَابٌ أَنزَلْنَاهُ إِلَيْكَ لِتُخْرِجَ النَّاسَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ بِإِذْنِ رَبِّهِمْ إِلَىٰ صِرَاطِ الْعَزِيزِ الْحَمِيدِ","text_tajweed":"ا[m[لٓ]ر‌ۚ كِتَ[n[ـٰ]بٌ أَ[f:4236[نز]َلْنَ[n[ـٰ]هُ إِلَيْكَ لِتُخْرِجَ [h:7035[ٱ][l[ل][g[نّ]َاسَ مِنَ [h:1491[ٱ][l[ل]ظُّلُمَ[n[ـٰ]تِ إِلَى [h:1492[ٱ][l[ل][g[نّ]ُورِ بِإِذْنِ رَبِّهِمْ إِلَىٰ صِر[n[َٲ]طِ [h:7036[ٱ]لْعَزِيزِ [h:7037[ٱ]لْحَم[p[ِي][q[د]ِ","translation_en":"Alif Lam Ra. (This is) a Book which We have revealed to you that you may bring forth men, by their Lord's permission from utter darkness into light-- to the way of the Mighty, the Praised One,","translation_id":"Alif Lam Ra. (Ini adalah) Kitab yang Kami turunkan kepadamu (Muhammad) agar engkau mengeluarkan manusia dari kegelapan kepada cahaya terang-benderang dengan izin Tuhan, (yaitu) menuju jalan Tuhan Yang Mahaperkasa, Maha Terpuji.","hasanah_per_verse":720},{"text_madani":"اللَّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَوَيْلٌ لِّلْكَافِرِينَ مِنْ عَذَابٍ شَدِيدٍ","text_tajweed":"ٱللَّهِ [h:7038[ٱ]لَّذِى لَهُ[n[ۥ] مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَا فِى [h:44[ٱ]لْأَرْضِ‌ۗ وَوَيْ[u:7039[لٌ ل]ِّلْكَ[n[ـٰ]فِرِينَ مِنْ عَذَا[f:7040[بٍ ش]َد[p[ِي][q[د]ٍ","translation_en":"(Of) Allah, Whose is whatever is in the heavens and whatever Is in the earth; and woe to the unbelievers on account of the severe chastisement,","translation_id":"Allah yang memiliki apa yang ada di langit dan apa yang ada di bumi. Celakalah bagi orang yang ingkar kepada Tuhan karena siksaan yang sangat berat,","hasanah_per_verse":540},{"text_madani":"الَّذِينَ يَسْتَحِبُّونَ الْحَيَاةَ الدُّنْيَا عَلَى الْآخِرَةِ وَيَصُدُّونَ عَن سَبِيلِ اللَّهِ وَيَبْغُونَهَا عِوَجًا ۚ أُولَٰئِكَ فِي ضَلَالٍ بَعِيدٍ","text_tajweed":"ٱلَّذِينَ يَسْتَحِبُّونَ [h:7041[ٱ]لْحَيَ[s[و][n[ٲ]ةَ [h:446[ٱ][l[ل]دُّنْيَا عَلَى [h:7042[ٱ]لْأَخِرَةِ وَيَصُدُّونَ عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ وَيَ[q:4708[بْ]غُونَهَا عِوَجًا‌ۚ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ فِى ضَلَ[n[ـٰ][i:7043[لِۭ ب]َع[p[ِي][q[د]ٍ","translation_en":"(To) those who love this world's life more than the hereafter, and turn away from Allah's path and desire to make it crooked; these are in a great error.","translation_id":"(yaitu) orang yang lebih menyukai kehidupan dunia daripada (kehidupan) akhirat, dan menghalang-halangi (manusia) dari jalan Allah dan menginginkan (jalan yang) bengkok. Mereka itu berada dalam kesesatan yang jauh.","hasanah_per_verse":760},{"text_madani":"وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ ۖ فَيُضِلُّ اللَّهُ مَن يَشَاءُ وَيَهْدِي مَن يَشَاءُ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ","text_tajweed":"وَم[o[َآ] أَرْسَلْنَا م[u:2882[ِن ر]َّسُولٍ إِلَّا بِلِسَانِ قَوْمِه[n[ِۦ] لِيُبَيِّنَ لَهُمْ‌ۖ فَيُضِلُّ [h:7044[ٱ]للَّهُ م[a:476[َن ي]َش[o[َا]ٓءُ وَيَهْدِى م[a:476[َن ي]َش[o[َا]ٓءُ‌ۚ وَهُوَ [h:7045[ٱ]لْعَزِيزُ [h:681[ٱ]لْحَك[p[ِي]مُ","translation_en":"And We did not send any messenger but with the language of his people, so that he might explain to them clearly; then Allah makes whom He pleases err and He guides whom He pleases and He is the Mighty, the Wise.","translation_id":"Dan Kami tidak mengutus seorang rasul pun, melainkan dengan bahasa kaumnya, agar dia dapat memberi penjelasan kepada mereka. Maka Allah menyesatkan siapa yang Dia kehendaki, dan memberi petunjuk kepada siapa yang Dia kehendaki. Dia Yang Mahaperkasa, Mahabijaksana.","hasanah_per_verse":750},{"text_madani":"وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِآيَاتِنَا أَنْ أَخْرِجْ قَوْمَكَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ وَذَكِّرْهُم بِأَيَّامِ اللَّهِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّكُلِّ صَبَّارٍ شَكُورٍ","text_tajweed":"وَلَقَ[q:341[دْ] أَرْسَلْنَا مُوسَىٰ بِـَٔـايَ[n[ـٰ]تِن[o[َآ] أَنْ أَخْرِ[q:7046[جْ] قَوْمَكَ مِنَ [h:1491[ٱ][l[ل]ظُّلُمَ[n[ـٰ]تِ إِلَى [h:1492[ٱ][l[ل][g[نّ]ُورِ وَذَكِّرْه[c:7047[ُم ب]ِأَيَّ[n[ـٰ]مِ [h:7048[ٱ]للَّهِ‌ۚ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:7049[تٍ ل]ِّكُلِّ صَبَّا[f:7050[رٍ ش]َك[p[ُو]رٍ","translation_en":"And certainly We sent Musa with Our communications, saying: Bring forth your people from utter darkness into light and remind them of the days of Allah; most surely there are signs in this for every patient, grateful one.","translation_id":"Dan sungguh, Kami telah mengutus Musa dengan membawa tanda-tanda (kekuasaan) Kami, (dan Kami perintahkan kepadanya), “Keluarkanlah kaummu dari kegelapan kepada cahaya terang-benderang dan ingatkanlah mereka kepada hari-hari Allah.” Sungguh, pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi setiap orang penyabar dan banyak bersyukur.","hasanah_per_verse":860},{"text_madani":"وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ أَنجَاكُم مِّنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ وَيُذَبِّحُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءَكُمْ ۚ وَفِي ذَٰلِكُم بَلَاءٌ مِّن رَّبِّكُمْ عَظِيمٌ","text_tajweed":"وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ [h:7051[ٱ]ذْكُرُو[s[اْ] نِعْمَةَ [h:1154[ٱ]للَّهِ عَلَيْكُمْ إِذْ أَ[f:7052[نج]َ[n[ـٰ]ك[w:7053[ُم م]ِّنْ ءَالِ فِرْعَوْنَ يَسُومُونَكُمْ س[o[ُو]ٓءَ [h:239[ٱ]لْعَذَابِ وَيُذَبِّحُونَ أَ[q:240[بْ]ن[o[َا]ٓءَكُمْ وَيَسْتَحْيُونَ نِس[o[َا]ٓءَكُمْ‌ۚ وَفِى ذ[n[َٲ]لِك[c:241[ُم ب]َل[o[َا]ٓ[a:242[ءٌ م]ّ[u:243[ِن ر]َّبِّكُمْ عَظ[p[ِي]مٌ","translation_en":"And when Musa said to his people: Call to mind Allah's favor to you when He delivered you from Firon's people, who subjected you to severe torment, and slew your sons and spared your women; and in this there was a great trial from your Lord.","translation_id":"Dan (ingatlah) ketika Musa berkata kepada kaumnya, “Ingatlah nikmat Allah atasmu ketika Dia menyelamatkan kamu dari pengikut-pengikut Fir‘aun; mereka menyiksa kamu dengan siksa yang pedih, dan menyembelih anak-anakmu yang laki-laki, dan membiarkan hidup anak-anak perempuanmu; pada yang demikian itu suatu cobaan yang besar dari Tuhanmu.","hasanah_per_verse":1170},{"text_madani":"وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ ۖ وَلَئِن كَفَرْتُمْ إِنَّ عَذَابِي لَشَدِيدٌ","text_tajweed":"وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِ[f:7054[ن ش]َكَرْتُمْ لَأَزِيدَ[g[نّ]َكُمْ‌ۖ وَلَئِ[f:7055[ن ك]َفَرْتُمْ إِ[g[نّ]َ عَذَابِى لَشَد[p[ِي][q[د]ٌ","translation_en":"And when your Lord made it known: If you are grateful, I would certainly give to you more, and if you are ungrateful, My chastisement is truly severe.","translation_id":"Dan (ingatlah) ketika Tuhanmu memaklumkan, “Sesungguhnya jika kamu bersyukur, niscaya Aku akan menambah (nikmat) kepadamu, tetapi jika kamu mengingkari (nikmat-Ku), maka pasti azab-Ku sangat berat.”","hasanah_per_verse":480},{"text_madani":"وَقَالَ مُوسَىٰ إِن تَكْفُرُوا أَنتُمْ وَمَن فِي الْأَرْضِ جَمِيعًا فَإِنَّ اللَّهَ لَغَنِيٌّ حَمِيدٌ","text_tajweed":"وَقَالَ مُوسَ[o[ىٰٓ] إِ[f:7056[ن ت]َكْفُر[o[ُوٓ][s[اْ] أَ[f:428[نت]ُمْ وَمَ[f:3453[ن ف]ِى [h:44[ٱ]لْأَرْضِ جَمِي[f:7057[عًا ف]َإِ[g[نّ]َ [h:513[ٱ]للَّهَ لَغَنِىٌّ حَم[p[ِي][q[د]ٌ","translation_en":"And Musa said: If you are ungrateful, you and those on earth all together, most surely Allah is Self-sufficient, Praised;","translation_id":"Dan Musa berkata, “Jika kamu dan orang yang ada di bumi semuanya mengingkari (nikmat Allah), maka sesungguhnya Allah Mahakaya, Maha Terpuji.","hasanah_per_verse":500},{"text_madani":"أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ مِن قَبْلِكُمْ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ ۛ وَالَّذِينَ مِن بَعْدِهِمْ ۛ لَا يَعْلَمُهُمْ إِلَّا اللَّهُ ۚ جَاءَتْهُمْ رُسُلُهُم بِالْبَيِّنَاتِ فَرَدُّوا أَيْدِيَهُمْ فِي أَفْوَاهِهِمْ وَقَالُوا إِنَّا كَفَرْنَا بِمَا أُرْسِلْتُم بِهِ وَإِنَّا لَفِي شَكٍّ مِّمَّا تَدْعُونَنَا إِلَيْهِ مُرِيبٍ","text_tajweed":"أَلَمْ يَأْتِكُمْ نَبَؤُ[s[اْ] [h:7058[ٱ]لَّذِينَ مِ[f:85[ن ق]َ[q:86[بْ]لِكُمْ قَوْمِ نُو[a:5711[حٍ و]َعَا[a:5712[دٍ و]َثَمُودَ‌ۛ وَ[h:37[ٱ]لَّذِينَ م[i:1453[ِنۢ ب]َعْدِهِمْ‌ۛ لَا يَعْلَمُهُمْ إِلَّا [h:1742[ٱ]للَّهُ‌ۚ ج[o[َا]ٓءَتْهُمْ رُسُلُه[c:4900[ُم ب]ِ[h:484[ٱ]لْبَيِّنَ[n[ـٰ]تِ فَرَدّ[o[ُوٓ][s[اْ] أَيْدِيَهُمْ ف[o[ِىٓ] أَفْو[n[َٲ]هِهِمْ وَقَال[o[ُوٓ][s[اْ] إِ[g[نّ]َا كَفَرْنَا بِم[o[َآ] أُرْسِلْت[c:7059[ُم ب]ِه[n[ِۦ] وَإِ[g[نّ]َا لَفِى شَ[a:6196[كٍّ م]ِّ[g[مّ]َا تَ[q:7060[دْ]عُونَن[o[َآ] إِلَيْهِ مُر[p[ِي][q[ب]ٍ","translation_en":"Has not the account reached you of those before you, of the people of Nuh and Ad and Samood, and those after them? None knows them but Allah. Their messengers come to them with clear arguments, but they thrust their hands into their mouths and said: Surely we deny that with which you are sent, and most surely we are in serious doubt as to that to which you invite us.","translation_id":"Apakah belum sampai kepadamu berita orang-orang sebelum kamu (yaitu) kaum Nuh, ‘Ad, ¤amµd dan orang-orang setelah mereka. Tidak ada yang mengetahui mereka selain Allah. Rasul-rasul telah datang kepada mereka membawa bukti-bukti (yang nyata), namun mereka menutupkan tangannya ke mulutnya (karena kebencian), dan berkata, “Sesungguhnya kami tidak percaya akan (bukti bahwa) kamu diutus (kepada kami), dan kami benar-benar dalam keraguan yang menggelisahkan terhadap apa yang kamu serukan kepada kami.”","hasanah_per_verse":1570},{"text_madani":"قَالَتْ رُسُلُهُمْ أَفِي اللَّهِ شَكٌّ فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ ۖ يَدْعُوكُمْ لِيَغْفِرَ لَكُم مِّن ذُنُوبِكُمْ وَيُؤَخِّرَكُمْ إِلَىٰ أَجَلٍ مُّسَمًّى ۚ قَالُوا إِنْ أَنتُمْ إِلَّا بَشَرٌ مِّثْلُنَا تُرِيدُونَ أَن تَصُدُّونَا عَمَّا كَانَ يَعْبُدُ آبَاؤُنَا فَأْتُونَا بِسُلْطَانٍ مُّبِينٍ","text_tajweed":"۞ قَالَتْ رُسُلُهُمْ أَفِى [h:7061[ٱ]للَّهِ شَ[f:7062[كٌّ ف]َاطِرِ [h:3956[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۖ يَ[q:2332[دْ]عُوكُمْ لِيَغْفِرَ لَك[w:556[ُم م]ِّ[f:7063[ن ذ]ُنُوبِكُمْ وَيُؤَخِّرَكُمْ إِلَ[o[ىٰٓ] أَجَ[a:1657[لٍ م]ُّسَم[f:7064[ًّى‌ۚ ق]َال[o[ُوٓ][s[اْ] إِنْ أَ[f:428[نت]ُمْ إِلَّا بَشَ[a:7065[رٌ م]ِّثْلُنَا تُرِيدُونَ أَ[f:7066[ن ت]َصُدُّونَا عَ[g[مّ]َا كَانَ يَعْبُدُ ءَاب[o[َا]ٓؤُنَا فَأْتُونَا بِسُلْطَ[n[ـٰ][a:7067[نٍ م]ُّب[p[ِي]نٍ","translation_en":"Their messengers said: Is there doubt about Allah, the Maker of the heavens and the earth? He invites you to forgive you your faults and to respite you till an appointed term. They said: You are nothing but mortals like us; you wish to turn us away from what our fathers used to worship; bring us therefore some clear authority.","translation_id":"Rasul-rasul mereka berkata, “Apakah ada keraguan terhadap Allah, Pencipta langit dan bumi? Dia menyeru kamu (untuk beriman) agar Dia mengampuni sebagian dosa-dosamu dan menangguhkan (siksaan)mu sampai waktu yang ditentukan?” Mereka berkata, “Kamu hanyalah manusia seperti kami juga. Kamu ingin menghalangi kami (menyembah) apa yang dari dahulu disembah nenek moyang kami, karena itu datangkanlah kepada kami bukti yang nyata.”","hasanah_per_verse":1430},{"text_madani":"قَالَتْ لَهُمْ رُسُلُهُمْ إِن نَّحْنُ إِلَّا بَشَرٌ مِّثْلُكُمْ وَلَٰكِنَّ اللَّهَ يَمُنُّ عَلَىٰ مَن يَشَاءُ مِنْ عِبَادِهِ ۖ وَمَا كَانَ لَنَا أَن نَّأْتِيَكُم بِسُلْطَانٍ إِلَّا بِإِذْنِ اللَّهِ ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ","text_tajweed":"قَالَتْ لَهُمْ رُسُلُهُمْ إ[a:7068[ِن ن]َّحْنُ إِلَّا بَشَ[a:7069[رٌ م]ِّثْلُكُمْ وَلَ[n[ـٰ]كِ[g[نّ]َ [h:1441[ٱ]للَّهَ يَمُ[g[نّ]ُ عَلَىٰ م[a:476[َن ي]َش[o[َا]ٓءُ مِنْ عِبَادِه[n[ِۦ]‌ۖ وَمَا كَانَ لَن[o[َآ] أ[a:7070[َن ن]َّأْتِيَك[c:7071[ُم ب]ِسُلْطَ[n[ـٰ]نٍ إِلَّا بِإِذْنِ [h:509[ٱ]للَّهِ‌ۚ وَعَلَى [h:2207[ٱ]للَّهِ فَلْيَتَوَكَّلِ [h:2208[ٱ]لْمُؤْمِن[p[ُو]نَ","translation_en":"Their messengers said to them: We are nothing but mortals like yourselves, but Allah bestows (His) favors on whom He pleases of His servants, and it is not for us that we should bring you an authority except by Allah's permission; and on Allah should the believers rely.","translation_id":"Rasul-rasul mereka berkata kepada mereka, “Kami hanyalah manusia seperti kamu, tetapi Allah memberi karunia kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya. Tidak pantas bagi kami mendatangkan suatu bukti kepada kamu melainkan dengan izin Allah. Dan hanya kepada Allah saja hendaknya orang yang beriman bertawakal.","hasanah_per_verse":1120},{"text_madani":"وَمَا لَنَا أَلَّا نَتَوَكَّلَ عَلَى اللَّهِ وَقَدْ هَدَانَا سُبُلَنَا ۚ وَلَنَصْبِرَنَّ عَلَىٰ مَا آذَيْتُمُونَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ","text_tajweed":"وَمَا لَن[o[َآ] أَلَّا نَتَوَكَّلَ عَلَى [h:412[ٱ]للَّهِ وَقَ[q:387[دْ] هَدَ[n[ٮٰ]نَا سُبُلَنَا‌ۚ وَلَنَصْبِرَ[g[نّ]َ عَلَىٰ م[o[َآ] ءَاذَيْتُمُونَا‌ۚ وَعَلَى [h:2207[ٱ]للَّهِ فَلْيَتَوَكَّلِ [h:6748[ٱ]لْمُتَوَكِّل[p[ُو]نَ","translation_en":"And what reason have we that we should not rely on Allah? And He has indeed guided us in our ways; and certainly we would bear with patience your persecution of us; and on Allah should the reliant rely.","translation_id":"Dan mengapa kami tidak akan bertawakal kepada Allah, sedangkan Dia telah menunjukkan jalan kepada kami, dan kami sungguh, akan tetap bersabar terhadap gangguan yang kamu lakukan kepada kami. Dan hanya kepada Allah saja orang yang bertawakal berserah diri.”","hasanah_per_verse":780},{"text_madani":"وَقَالَ الَّذِينَ كَفَرُوا لِرُسُلِهِمْ لَنُخْرِجَنَّكُم مِّنْ أَرْضِنَا أَوْ لَتَعُودُنَّ فِي مِلَّتِنَا ۖ فَأَوْحَىٰ إِلَيْهِمْ رَبُّهُمْ لَنُهْلِكَنَّ الظَّالِمِينَ","text_tajweed":"وَقَالَ [h:614[ٱ]لَّذِينَ كَفَرُو[s[اْ] لِرُسُلِهِمْ لَنُخْرِجَ[g[نّ]َك[w:7072[ُم م]ِّنْ أَرْضِن[o[َآ] أَوْ لَتَعُودُ[g[نّ]َ فِى مِلَّتِنَا‌ۖ فَأَوْحَ[o[ىٰٓ] إِلَيْهِمْ رَبُّهُمْ لَنُهْلِكَ[g[نّ]َ [h:7073[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And those who disbelieved said to their messengers: We will most certainly drive you forth from our land, or else you shall come back into our religion. So their Lord revealed to them: Most certainly We will destroy the unjust.","translation_id":"Dan orang-orang kafir berkata kepada rasul-rasul mereka, “Kami pasti akan mengusir kamu dari negeri kami atau kamu benar-benar kembali kepada agama kami.” Maka Tuhan mewahyukan kepada mereka, “Kami pasti akan membinasakan orang yang zhalim itu.","hasanah_per_verse":780},{"text_madani":"وَلَنُسْكِنَنَّكُمُ الْأَرْضَ مِن بَعْدِهِمْ ۚ ذَٰلِكَ لِمَنْ خَافَ مَقَامِي وَخَافَ وَعِيدِ","text_tajweed":"وَلَنُسْكِنَ[g[نّ]َكُمُ [h:7074[ٱ]لْأَرْضَ م[i:1453[ِنۢ ب]َعْدِهِمْ‌ۚ ذ[n[َٲ]لِكَ لِمَنْ خَافَ مَقَامِى وَخَافَ وَع[p[ِي][q[د]ِ","translation_en":"And most certainly We will settle you in the land after them; this is for him who fears standing in My presence and who fears My threat.","translation_id":"Dan Kami pasti akan menempatkan kamu di negeri-negeri itu setelah mereka. Yang demikian itu (adalah untuk) orang-orang yang takut (menghadap) ke hadirat-Ku dan takut akan ancaman-Ku.”","hasanah_per_verse":430},{"text_madani":"وَاسْتَفْتَحُوا وَخَابَ كُلُّ جَبَّارٍ عَنِيدٍ","text_tajweed":"وَ[h:9999[ٱ]سْتَفْتَحُو[s[اْ] وَخَابَ كُلُّ جَبَّارٍ عَن[p[ِي][q[د]ٍ","translation_en":"And they asked for judgment and every insolent opposer was disappointed:","translation_id":"Dan mereka memohon diberi kemenangan dan binasalah semua orang yang berlaku sewenang-wenang lagi keras kepala","hasanah_per_verse":230},{"text_madani":"مِّن وَرَائِهِ جَهَنَّمُ وَيُسْقَىٰ مِن مَّاءٍ صَدِيدٍ","text_tajweed":"مّ[a:7075[ِن و]َر[o[َا]ٓئِه[n[ِۦ] جَهَ[g[نّ]َمُ وَيُسْقَىٰ م[a:840[ِن م]ّ[o[َا]ٓ[f:7076[ءٍ ص]َد[p[ِي][q[د]ٍ","translation_en":"Hell is before him and he shall be given to drink of festering water:","translation_id":"di hadapannya ada neraka Jahanam dan dia akan diberi minuman dengan air nanah,","hasanah_per_verse":250},{"text_madani":"يَتَجَرَّعُهُ وَلَا يَكَادُ يُسِيغُهُ وَيَأْتِيهِ الْمَوْتُ مِن كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ ۖ وَمِن وَرَائِهِ عَذَابٌ غَلِيظٌ","text_tajweed":"يَتَجَرَّعُهُ[n[ۥ] وَلَا يَكَادُ يُسِيغُهُ[n[ۥ] وَيَأْتِيهِ [h:7077[ٱ]لْمَوْتُ مِ[f:843[ن ك]ُلِّ مَكَا[a:7078[نٍ و]َمَا هُوَ بِمَيِّ[a:7079[تٍ‌ۖ و]َم[a:7080[ِن و]َر[o[َا]ٓئِه[n[ِۦ] عَذَابٌ غَل[p[ِي]ظٌ","translation_en":"He will drink it little by little and will not be able to swallow it agreeably, and death will come to him from every quarter, but he shall not die; and there shall be vehement chastisement before him.","translation_id":"diteguk-teguknya (air nanah itu) dan dia hampir tidak bisa menelannya dan datanglah (bahaya) maut kepadanya dari segenap penjuru, tetapi dia tidak juga mati; dan di hadapannya (masih ada) azab yang berat.","hasanah_per_verse":620},{"text_madani":"مَّثَلُ الَّذِينَ كَفَرُوا بِرَبِّهِمْ ۖ أَعْمَالُهُمْ كَرَمَادٍ اشْتَدَّتْ بِهِ الرِّيحُ فِي يَوْمٍ عَاصِفٍ ۖ لَّا يَقْدِرُونَ مِمَّا كَسَبُوا عَلَىٰ شَيْءٍ ۚ ذَٰلِكَ هُوَ الضَّلَالُ الْبَعِيدُ","text_tajweed":"مَّثَلُ [h:1179[ٱ]لَّذِينَ كَفَرُو[s[اْ] بِرَبِّهِمْ‌ۖ أَعْمَ[n[ـٰ]لُهُمْ كَرَمَادٍ [h:7081[ٱ]شْتَدَّتْ بِهِ [h:7082[ٱ][l[ل]رِّيحُ فِى يَوْمٍ عَاصِ[u:7083[فٍ‌ۖ ل]َّا يَ[q:1555[قْ]دِرُونَ مِ[g[مّ]َا كَسَبُو[s[اْ] عَلَىٰ ش[f:6654[َىْءٍ‌ۚ ذ][n[َٲ]لِكَ هُوَ [h:7084[ٱ][l[ل]ضَّلَ[n[ـٰ]لُ [h:7085[ٱ]لْبَع[p[ِي][q[د]ُ","translation_en":"The parable of those who disbelieve in their Lord: their actions are like ashes on which the wind blows hard on a stormy day; they shall not have power over any thing out of what they have earned; this is the great error.","translation_id":"Perumpamaan orang yang ingkar kepada Tuhannya, perbuatan mereka seperti abu yang ditiup oleh angin keras pada suatu hari yang berangin kencang. Mereka tidak kuasa (mendatangkan manfaat) sama sekali dari apa yang telah mereka usahakan (di dunia). Yang demikian itu adalah kesesatan yang jauh.","hasanah_per_verse":900},{"text_madani":"أَلَمْ تَرَ أَنَّ اللَّهَ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۚ إِن يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ","text_tajweed":"أَلَمْ تَرَ أَ[g[نّ]َ [h:394[ٱ]للَّهَ خَلَقَ [h:3913[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ بِ[h:370[ٱ]لْحَقِّ‌ۚ إ[a:3197[ِن ي]َشَأْ يُذْهِ[q:3198[بْ]كُمْ وَيَأْتِ بِخَلْ[f:7086[قٍ ج]َد[p[ِي][q[د]ٍ","translation_en":"Do you not see that Allah created the heavens and the earth with truth? If He please He will take you off and bring a new creation,","translation_id":"Tidakkah kamu memperhatikan, bahwa sesungguhnya Allah telah menciptakan langit dan bumi dengan hak (benar)? Jika Dia menghendaki, niscaya Dia membinasakan kamu dan mendatangkan makhluk yang baru (untuk menggantikan kamu),","hasanah_per_verse":560},{"text_madani":"وَمَا ذَٰلِكَ عَلَى اللَّهِ بِعَزِيزٍ","text_tajweed":"وَمَا ذ[n[َٲ]لِكَ عَلَى [h:412[ٱ]للَّهِ بِعَز[p[ِي]زٍ","translation_en":"And this is not difficult for Allah.","translation_id":"dan yang demikian itu tidak sukar bagi Allah.","hasanah_per_verse":180},{"text_madani":"وَبَرَزُوا لِلَّهِ جَمِيعًا فَقَالَ الضُّعَفَاءُ لِلَّذِينَ اسْتَكْبَرُوا إِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ أَنتُم مُّغْنُونَ عَنَّا مِنْ عَذَابِ اللَّهِ مِن شَيْءٍ ۚ قَالُوا لَوْ هَدَانَا اللَّهُ لَهَدَيْنَاكُمْ ۖ سَوَاءٌ عَلَيْنَا أَجَزِعْنَا أَمْ صَبَرْنَا مَا لَنَا مِن مَّحِيصٍ","text_tajweed":"وَبَرَزُو[s[اْ] لِلَّهِ جَمِي[f:7087[عًا ف]َقَالَ [h:7088[ٱ][l[ل]ضُّعَفَ[o[ـٰٓ]ؤُ[s[اْ] لِلَّذِينَ [h:7089[ٱ]سْتَكْبَر[o[ُوٓ][s[اْ] إِ[g[نّ]َا كُ[g[نّ]َا لَكُمْ تَبَ[f:7090[عًا ف]َهَلْ أَ[f:428[نت][w:7091[ُم م]ُّغْنُونَ عَ[g[نّ]َا مِنْ عَذَابِ [h:6845[ٱ]للَّهِ مِ[f:2103[ن ش][f:7092[َىْءٍ‌ۚ ق]َالُو[s[اْ] لَوْ هَدَ[n[ٮٰ]نَا [h:4173[ٱ]للَّهُ لَهَدَيْنَ[n[ـٰ]كُمْ‌ۖ سَو[o[َا]ٓءٌ عَلَيْن[o[َآ] أَجَزِعْن[o[َآ] أَمْ صَبَرْنَا مَا لَنَا م[a:7093[ِن م]َّح[p[ِي]صٍ","translation_en":"And they shall all come forth before Allah, then the weak shall say to those who were proud: Surely we were your followers, can you therefore avert from us any part of the chastisement of Allah? They would say: If Allah had guided us, we too would have guided you; it is the same to us whether we are impatient (now) or patient, there is no place for us to fly to.","translation_id":"Dan mereka semua (di padang Mahsyar) berkumpul untuk menghadap ke hadirat Allah, lalu orang yang lemah berkata kepada orang yang sombong, “Sesungguhnya kami dahulu adalah pengikut-pengikutmu, maka dapatkah kamu menghindarkan kami dari azab Allah (walaupun) sedikit saja?” Mereka menjawab, “Sekiranya Allah memberi petunjuk kepada kami, niscaya kami dapat memberi petunjuk kepadamu. Sama saja bagi kita, apakah kita mengeluh atau bersabar. Kita tidak mempunyai tempat untuk melarikan diri.”","hasanah_per_verse":1380},{"text_madani":"وَقَالَ الشَّيْطَانُ لَمَّا قُضِيَ الْأَمْرُ إِنَّ اللَّهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَوَعَدتُّكُمْ فَأَخْلَفْتُكُمْ ۖ وَمَا كَانَ لِيَ عَلَيْكُم مِّن سُلْطَانٍ إِلَّا أَن دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي ۖ فَلَا تَلُومُونِي وَلُومُوا أَنفُسَكُم ۖ مَّا أَنَا بِمُصْرِخِكُمْ وَمَا أَنتُم بِمُصْرِخِيَّ ۖ إِنِّي كَفَرْتُ بِمَا أَشْرَكْتُمُونِ مِن قَبْلُ ۗ إِنَّ الظَّالِمِينَ لَهُمْ عَذَابٌ أَلِيمٌ","text_tajweed":"وَقَالَ [h:7094[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ لَ[g[مّ]َا قُضِىَ [h:6667[ٱ]لْأَمْرُ إِ[g[نّ]َ [h:80[ٱ]للَّهَ وَعَدَكُمْ وَعْدَ [h:7095[ٱ]لْحَقِّ وَوَعَ[d:7096[د]تُّكُمْ فَأَخْلَفْتُكُمْ‌ۖ وَمَا كَانَ لِىَ عَلَيْك[w:548[ُم م]ِّ[f:4798[ن س]ُلْطَ[n[ـٰ]نٍ إِلّ[o[َآ] أَ[f:7097[ن د]َعَوْتُكُمْ فَ[h:7098[ٱ]سْتَجَ[q:7098[بْ]تُمْ لِى‌ۖ فَلَا تَلُومُونِى وَلُوم[o[ُوٓ][s[اْ] أَ[f:221[نف]ُسَك[w:7099[ُم‌ۖ م]ّ[o[َآ] أَنَا۟ بِمُصْرِخِكُمْ وَم[o[َآ] أَ[f:428[نت][c:7100[ُم ب]ِمُصْرِخِىَّ‌ۖ إِ[g[نّ]ِى كَفَرْتُ بِم[o[َآ] أَشْرَكْتُمُونِ مِ[f:128[ن ق]َ[q:129[بْ]لُ‌ۗ إِ[g[نّ]َ [h:7101[ٱ][l[ل]ظَّ[n[ـٰ]لِمِينَ لَهُمْ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"And the Shaitan shall say after the affair is decided: Surely Allah promised you the promise of truth, and I gave you promises, then failed to keep them to you, and I had no authority over you, except that I called you and you obeyed me, therefore do not blame me but blame yourselves: I cannot be your aider (now) nor can you be my aiders; surely I disbelieved in your associating me with Allah before; surely it is the unjust that shall have the painful punishment.","translation_id":"Dan setan berkata ketika perkara (hisab) telah diselesaikan, “Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan aku pun telah menjanjikan kepadamu tetapi aku menyalahinya. Tidak ada kekuasaan bagiku terhadapmu, melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku, tetapi cercalah dirimu sendiri. Aku tidak dapat menolongmu, dan kamu pun tidak dapat menolongku. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dahulu.” Sungguh, orang yang zhalim akan mendapat siksaan yang pedih.","hasanah_per_verse":1870},{"text_madani":"وَأُدْخِلَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا بِإِذْنِ رَبِّهِمْ ۖ تَحِيَّتُهُمْ فِيهَا سَلَامٌ","text_tajweed":"وَأُ[q:2480[دْ]خِلَ [h:7102[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ جَ[g[نّ]َ[n[ـٰ][f:119[تٍ ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ خَ[n[ـٰ]لِدِينَ فِيهَا بِإِذْنِ رَبِّهِمْ‌ۖ تَحِيَّتُهُمْ فِيهَا سَلَ[p[ـٰ]مٌ","translation_en":"And those who believe and do good are made to enter gardens, beneath which rivers flow, to abide in them by their Lord's permission; their greeting therein is, Peace.","translation_id":"Dan orang yang beriman dan mengerjakan kebajikan dimasukkan ke dalam surga-surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya dengan seizin Tuhan mereka. Ucapan penghormatan mereka dalam (surga) itu ialah salam.","hasanah_per_verse":830},{"text_madani":"أَلَمْ تَرَ كَيْفَ ضَرَبَ اللَّهُ مَثَلًا كَلِمَةً طَيِّبَةً كَشَجَرَةٍ طَيِّبَةٍ أَصْلُهَا ثَابِتٌ وَفَرْعُهَا فِي السَّمَاءِ","text_tajweed":"أَلَمْ تَرَ كَيْفَ ضَرَبَ [h:7103[ٱ]للَّهُ مَثَل[f:7104[اً ك]َلِمَ[f:7105[ةً ط]َيِّبَ[f:7106[ةً ك]َشَجَرَ[f:7107[ةٍ ط]َيِّبَةٍ أَصْلُهَا ثَابِ[a:7108[تٌ و]َفَرْعُهَا فِى [h:746[ٱ][l[ل]سَّم[o[َا]ٓءِ","translation_en":"Have you not considered how Allah sets forth a parable of a good word (being) like a good tree, whose root is firm and whose branches are in heaven,","translation_id":"Tidakkah kamu memperhatikan bagai-mana Allah telah membuat perumpamaan kalimat yang baik seperti pohon yang baik, akarnya kuat dan cabangnya (menjulang) ke langit,","hasanah_per_verse":590},{"text_madani":"تُؤْتِي أُكُلَهَا كُلَّ حِينٍ بِإِذْنِ رَبِّهَا ۗ وَيَضْرِبُ اللَّهُ الْأَمْثَالَ لِلنَّاسِ لَعَلَّهُمْ يَتَذَكَّرُونَ","text_tajweed":"تُؤْت[o[ِىٓ] أُكُلَهَا كُلَّ حِي[i:7109[نِۭ ب]ِإِذْنِ رَبِّهَا‌ۗ وَيَضْرِبُ [h:7110[ٱ]للَّهُ [h:6948[ٱ]لْأَمْثَالَ لِل[g[نّ]َاسِ لَعَلَّهُمْ يَتَذَكَّر[p[ُو]نَ","translation_en":"Yielding its fruit in every season by the permission of its Lord? And Allah sets forth parables for men that they may be mindful.","translation_id":"(pohon) itu menghasilkan buahnya pada setiap waktu dengan seizin Tuhannya. Dan Allah membuat perumpamaan itu untuk manusia agar mereka selalu ingat.","hasanah_per_verse":550},{"text_madani":"وَمَثَلُ كَلِمَةٍ خَبِيثَةٍ كَشَجَرَةٍ خَبِيثَةٍ اجْتُثَّتْ مِن فَوْقِ الْأَرْضِ مَا لَهَا مِن قَرَارٍ","text_tajweed":"وَمَثَلُ كَلِمَةٍ خَبِيثَ[f:7111[ةٍ ك]َشَجَرَةٍ خَبِيثَةٍ [h:7112[ٱ][q:7113[جْ]تُثَّتْ مِ[f:7114[ن ف]َوْقِ [h:7115[ٱ]لْأَرْضِ مَا لَهَا مِ[f:7116[ن ق]َر[p[َا]رٍ","translation_en":"And the parable of an evil word is as an evil tree pulled up from the earth's surface; it has no stability.","translation_id":"Dan perumpamaan kalimat yang buruk seperti pohon yang buruk, yang telah dicabut akar-akarnya dari permukaan bumi; tidak dapat tetap (tegak) sedikit pun.","hasanah_per_verse":490},{"text_madani":"يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ ۖ وَيُضِلُّ اللَّهُ الظَّالِمِينَ ۚ وَيَفْعَلُ اللَّهُ مَا يَشَاءُ","text_tajweed":"يُثَبِّتُ [h:7117[ٱ]للَّهُ [h:1171[ٱ]لَّذِينَ ءَامَنُو[s[اْ] بِ[h:7118[ٱ]لْقَوْلِ [h:7119[ٱ][l[ل]ثَّابِتِ فِى [h:441[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا وَفِى [h:1108[ٱ]لْأَخِرَةِ‌ۖ وَيُضِلُّ [h:7120[ٱ]للَّهُ [h:7121[ٱ][l[ل]ظَّ[n[ـٰ]لِمِينَ‌ۚ وَيَفْعَلُ [h:7122[ٱ]للَّهُ مَا يَش[o[َا]ٓءُ","translation_en":"Allah confirms those who believe with the sure word in this world's life and in the hereafter, and Allah causes the unjust to go astray, and Allah does what He pleases.","translation_id":"Allah meneguhkan (iman) orang-orang yang beriman dengan ucapan yang teguh (dalam kehidupan) di dunia dan di akhirat; dan Allah menyesatkan orang-orang yang zhalim dan Allah berbuat apa yang Dia kehendaki.","hasanah_per_verse":840},{"text_madani":"أَلَمْ تَرَ إِلَى الَّذِينَ بَدَّلُوا نِعْمَتَ اللَّهِ كُفْرًا وَأَحَلُّوا قَوْمَهُمْ دَارَ الْبَوَارِ","text_tajweed":"۞ أَلَمْ تَرَ إِلَى [h:1372[ٱ]لَّذِينَ بَدَّلُو[s[اْ] نِعْمَتَ [h:1300[ٱ]للَّهِ كُفْ[a:7123[رًا و]َأَحَلُّو[s[اْ] قَوْمَهُمْ دَارَ [h:7124[ٱ]لْبَو[p[َا]رِ","translation_en":"Have you not seen those who have changed Allah's favor for ungratefulness and made their people to alight into the abode of perdition","translation_id":"Tidakkah kamu memperhatikan orang-orang yang telah menukar nikmat Allah dengan ingkar kepada Allah dan menjatuhkan kaumnya ke lembah kebinasaan?","hasanah_per_verse":500},{"text_madani":"جَهَنَّمَ يَصْلَوْنَهَا ۖ وَبِئْسَ الْقَرَارُ","text_tajweed":"جَهَ[g[نّ]َمَ يَصْلَوْنَهَا‌ۖ وَبِئْسَ [h:7125[ٱ]لْقَر[p[َا]رُ","translation_en":"(Into j hell? They shall enter into it and an evil place it is to settle in.","translation_id":"yaitu neraka Jahanam; mereka masuk ke dalamnya; dan itulah seburuk-buruk tempat kediaman.","hasanah_per_verse":210},{"text_madani":"وَجَعَلُوا لِلَّهِ أَندَادًا لِّيُضِلُّوا عَن سَبِيلِهِ ۗ قُلْ تَمَتَّعُوا فَإِنَّ مَصِيرَكُمْ إِلَى النَّارِ","text_tajweed":"وَجَعَلُو[s[اْ] لِلَّهِ أَ[f:96[ند]َا[u:7126[دًا ل]ِّيُضِلُّو[s[اْ] عَ[f:4361[ن س]َبِيلِه[n[ِۦ]‌ۗ قُلْ تَمَتَّعُو[s[اْ] فَإِ[g[نّ]َ مَصِيرَكُمْ إِلَى [h:1241[ٱ][l[ل][g[نّ][p[َا]رِ","translation_en":"And they set up equals with Allah that they may lead (people) astray from His path. Say: Enjoy yourselves, for surely your return is to the fire.","translation_id":"Dan mereka (orang kafir) itu telah menjadikan tandingan bagi Allah untuk menyesatkan (manusia) dari jalan-Nya. Katakanlah (Muhammad), “Bersenang-senanglah kamu, karena sesungguhnya tempat kembalimu ke neraka.”","hasanah_per_verse":530},{"text_madani":"قُل لِّعِبَادِيَ الَّذِينَ آمَنُوا يُقِيمُوا الصَّلَاةَ وَيُنفِقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً مِّن قَبْلِ أَن يَأْتِيَ يَوْمٌ لَّا بَيْعٌ فِيهِ وَلَا خِلَالٌ","text_tajweed":"قُل لِّعِبَادِىَ [h:7127[ٱ]لَّذِينَ ءَامَنُو[s[اْ] يُقِيمُو[s[اْ] [h:7128[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ وَيُ[f:7129[نف]ِقُو[s[اْ] مِ[g[مّ]َا رَزَ[q:15[قْ]نَ[n[ـٰ]هُمْ سِر[a:1623[ًّا و]َعَلَانِيَ[a:7130[ةً م]ِّ[f:1346[ن ق]َ[q:1347[بْ]لِ أ[a:1462[َن ي]َأْتِىَ يَوْ[u:1463[مٌ ل]َّا بَيْ[f:1464[عٌ ف]ِيهِ وَلَا خِلَ[p[ـٰ]لٌ","translation_en":"Say to My servants who believe that they should keep up prayer and spend out of what We have given them secretly and openly before the coming of the day in which there shall be no bartering nor mutual befriending.","translation_id":"Katakanlah (Muhammad) kepada hamba-hamba-Ku yang telah beriman, “Hendaklah mereka melaksanakan shalat, menginfakkan sebagian rezeki yang Kami berikan secara sembunyi atau terang-terangan sebelum datang hari, ketika tidak ada lagi jual beli dan persahabatan.”","hasanah_per_verse":860},{"text_madani":"اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَأَنزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقًا لَّكُمْ ۖ وَسَخَّرَ لَكُمُ الْفُلْكَ لِتَجْرِيَ فِي الْبَحْرِ بِأَمْرِهِ ۖ وَسَخَّرَ لَكُمُ الْأَنْهَارَ","text_tajweed":"ٱللَّهُ [h:4738[ٱ]لَّذِى خَلَقَ [h:3913[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ وَأَ[f:91[نز]َلَ مِنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ م[o[َا]ٓ[f:92[ءً ف]َأَخْرَجَ بِه[n[ِۦ] مِنَ [h:93[ٱ][l[ل]ثَّمَر[n[َٲ]تِ رِزْ[u:94[قًا ل]َّكُمْ‌ۖ وَسَخَّرَ لَكُمُ [h:7131[ٱ]لْفُلْكَ لِتَ[q:7132[جْ]رِىَ فِى [h:837[ٱ]لْبَحْرِ بِأَمْرِه[n[ِۦ]‌ۖ وَسَخَّرَ لَكُمُ [h:7133[ٱ]لْأَنْهَ[p[ـٰ]رَ","translation_en":"Allah is He Who created the heavens and the earth and sent down water from the clouds, then brought forth with it fruits as a sustenance for you, and He has made the ships subservient to you, that they might run their course in the sea by His command, and He has made the rivers subservient to you.","translation_id":"Allah-lah yang telah menciptakan langit dan bumi dan menurunkan air (hujan) dari langit, kemudian dengan (air hujan) itu Dia mengeluarkan berbagai buah-buahan sebagai rezeki untukmu; dan Dia telah menundukkan kapal bagimu agar berlayar di lautan dengan kehendak-Nya, dan Dia telah menundukkan sungai-sungai bagimu.","hasanah_per_verse":1070},{"text_madani":"وَسَخَّرَ لَكُمُ الشَّمْسَ وَالْقَمَرَ دَائِبَيْنِ ۖ وَسَخَّرَ لَكُمُ اللَّيْلَ وَالنَّهَارَ","text_tajweed":"وَسَخَّرَ لَكُمُ [h:7134[ٱ][l[ل]شَّمْسَ وَ[h:4265[ٱ]لْقَمَرَ د[o[َا]ٓئِبَيْنِ‌ۖ وَسَخَّرَ لَكُمُ [h:6116[ٱ]لَّيْلَ وَ[h:6117[ٱ][l[ل][g[نّ]َه[p[َا]رَ","translation_en":"And He has made subservient to you the sun and the moon pursuing their courses, and He has made subservient to you the night and the day.","translation_id":"Dan Dia telah menundukkan matahari dan bulan bagimu yang terus-menerus beredar (dalam orbitnya); dan telah menundukkan malam dan siang bagimu.","hasanah_per_verse":430},{"text_madani":"وَآتَاكُم مِّن كُلِّ مَا سَأَلْتُمُوهُ ۚ وَإِن تَعُدُّوا نِعْمَتَ اللَّهِ لَا تُحْصُوهَا ۗ إِنَّ الْإِنسَانَ لَظَلُومٌ كَفَّارٌ","text_tajweed":"وَءَاتَ[n[ـٰ]ك[w:7135[ُم م]ِّ[f:843[ن ك]ُلِّ مَا سَأَلْتُمُوهُ‌ۚ وَإِ[f:7136[ن ت]َعُدُّو[s[اْ] نِعْمَتَ [h:1300[ٱ]للَّهِ لَا تُحْصُوه[o[َآ‌ۗ] إِ[g[نّ]َ [h:7137[ٱ]لْإِ[f:5969[نس]َ[n[ـٰ]نَ لَظَلُو[f:7138[مٌ ك]َفّ[p[َا]رٌ","translation_en":"And He gives you of all that you ask Him; and if you count Allah's favors, you will not be able to number them; most surely man is very unjust, very ungrateful.","translation_id":"Dan Dia telah memberikan kepadamu segala apa yang kamu mohonkan kepada-Nya. Dan jika kamu menghitung nikmat Allah, niscaya kamu tidak akan mampu menghitungnya. Sungguh, manusia itu sangat zhalim dan sangat mengingkari (nikmat Allah).","hasanah_per_verse":610},{"text_madani":"وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَٰذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَن نَّعْبُدَ الْأَصْنَامَ","text_tajweed":"وَإِذْ قَالَ إِ[q:2003[بْ]ر[n[َٲ]هِيمُ رَبِّ [h:657[ٱ][q:658[جْ]عَلْ هَ[n[ـٰ]ذَا [h:7139[ٱ]لْبَلَدَ ءَامِ[a:7140[نًا و]َ[h:7141[ٱ][q:7141[جْ]نُ[q:7141[بْ]نِى وَبَنِىَّ أ[a:6403[َن ن]َّعْبُدَ [h:7142[ٱ]لْأَصْن[p[َا]مَ","translation_en":"And when Ibrahim said: My Lord! make this city secure, and save me and my sons from worshipping idols:","translation_id":"Dan (ingatlah), ketika Ibrahim berdoa, “Ya Tuhan, jadikanlah negeri ini (Mekah), negeri yang aman, dan jauhkanlah aku beserta anak cucuku agar tidak menyembah berhala.","hasanah_per_verse":550},{"text_madani":"رَبِّ إِنَّهُنَّ أَضْلَلْنَ كَثِيرًا مِّنَ النَّاسِ ۖ فَمَن تَبِعَنِي فَإِنَّهُ مِنِّي ۖ وَمَنْ عَصَانِي فَإِنَّكَ غَفُورٌ رَّحِيمٌ","text_tajweed":"رَبِّ إِ[g[نّ]َهُ[g[نّ]َ أَضْلَلْنَ كَثِي[a:3614[رًا م]ِّنَ [h:721[ٱ][l[ل][g[نّ]َاسِ‌ۖ فَمَ[f:7143[ن ت]َبِعَنِى فَإِ[g[نّ]َهُ[n[ۥ] مِ[g[نّ]ِى‌ۖ وَمَنْ عَصَانِى فَإِ[g[نّ]َكَ غَفُو[u:890[رٌ ر]َّح[p[ِي]مٌ","translation_en":"My Lord! surely they have led many men astray; then whoever follows me, he is surely of me, and whoever disobeys me, Thou surely arc Forgiving, Merciful:","translation_id":"Ya Tuhan, berhala-berhala itu telah menyesatkan banyak dari manusia. Barangsiapa mengikutiku, maka orang itu termasuk golonganku, dan barang-siapa mendurhakaiku, maka Engkau Maha Pengampun, Maha Penyayang.","hasanah_per_verse":580},{"text_madani":"رَّبَّنَا إِنِّي أَسْكَنتُ مِن ذُرِّيَّتِي بِوَادٍ غَيْرِ ذِي زَرْعٍ عِندَ بَيْتِكَ الْمُحَرَّمِ رَبَّنَا لِيُقِيمُوا الصَّلَاةَ فَاجْعَلْ أَفْئِدَةً مِّنَ النَّاسِ تَهْوِي إِلَيْهِمْ وَارْزُقْهُم مِّنَ الثَّمَرَاتِ لَعَلَّهُمْ يَشْكُرُونَ","text_tajweed":"رَّبَّن[o[َآ] إِ[g[نّ][o[ِىٓ] أَسْكَ[f:7144[نت]ُ مِ[f:7145[ن ذ]ُرِّيَّتِى بِوَادٍ غَيْرِ ذِى زَرْعٍ عِ[f:264[ند]َ بَيْتِكَ [h:7146[ٱ]لْمُحَرَّمِ رَبَّنَا لِيُقِيمُو[s[اْ] [h:7147[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ فَ[h:7148[ٱ][q:7148[جْ]عَلْ أَفْــِٔدَ[a:7149[ةً م]ِّنَ [h:721[ٱ][l[ل][g[نّ]َاسِ تَهْو[o[ِىٓ] إِلَيْهِمْ وَ[h:7150[ٱ]رْزُ[q:7150[قْ]ه[w:7151[ُم م]ِّنَ [h:93[ٱ][l[ل]ثَّمَر[n[َٲ]تِ لَعَلَّهُمْ يَشْكُر[p[ُو]نَ","translation_en":"O our Lord! surely I have settled a part of my offspring in a valley unproductive of fruit near Thy Sacred House, our Lord! that they may keep up prayer; therefore make the hearts of some people yearn towards them and provide them with fruits; haply they may be grateful:","translation_id":"Ya Tuhan, sesungguhnya aku telah menempatkan sebagian keturunanku di lembah yang tidak mempunyai tanam-tanaman di dekat rumah Engkau (Baitullah) yang dihormati, ya Tuhan (yang demikian itu) agar mereka melaksanakan shalat, maka jadikanlah hati sebagian manusia cenderung kepada mereka dan berilah mereka rezeki dari buah-buahan, mudah-mudahan mereka bersyukur.","hasanah_per_verse":1140},{"text_madani":"رَبَّنَا إِنَّكَ تَعْلَمُ مَا نُخْفِي وَمَا نُعْلِنُ ۗ وَمَا يَخْفَىٰ عَلَى اللَّهِ مِن شَيْءٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ","text_tajweed":"رَبَّن[o[َآ] إِ[g[نّ]َكَ تَعْلَمُ مَا نُخْفِى وَمَا نُعْلِنُ‌ۗ وَمَا يَخْفَىٰ عَلَى [h:412[ٱ]للَّهِ مِ[f:2103[ن ش][f:5402[َىْءٍ ف]ِى [h:44[ٱ]لْأَرْضِ وَلَا فِى [h:746[ٱ][l[ل]سَّم[o[َا]ٓءِ","translation_en":"O our Lord! Surely Thou knowest what we hide and what we make public, and nothing in the earth nor any thing in heaven is hidden from Allah:","translation_id":"Ya Tuhan kami, sesungguhnya Engkau mengetahui apa yang kami sembunyikan dan apa yang kami tampakkan; dan tidak ada sesuatu pun yang tersembunyi bagi Allah, baik yang ada di bumi maupun yang ada di langit.","hasanah_per_verse":610},{"text_madani":"الْحَمْدُ لِلَّهِ الَّذِي وَهَبَ لِي عَلَى الْكِبَرِ إِسْمَاعِيلَ وَإِسْحَاقَ ۚ إِنَّ رَبِّي لَسَمِيعُ الدُّعَاءِ","text_tajweed":"ٱلْحَمْدُ لِلَّهِ [h:3912[ٱ]لَّذِى وَهَبَ لِى عَلَى [h:7152[ٱ]لْكِبَرِ إِسْمَ[n[ـٰ]عِيلَ وَإِسْحَ[n[ـٰ]قَ‌ۚ إِ[g[نّ]َ رَبِّى لَسَمِيعُ [h:7153[ٱ][l[ل]دُّع[o[َا]ٓءِ","translation_en":"Praise be to Allah, Who has given me in old age Ismail and Ishaq; most surely my Lord is the Hearer of prayer:","translation_id":"Segala puji bagi Allah yang telah menganugerahkan kepadaku di hari tua(ku) Ismail dan Ishak. Sungguh, Tuhanku benar-benar Maha Mendengar (memperkenankan) doa.","hasanah_per_verse":540},{"text_madani":"رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ","text_tajweed":"رَبِّ [h:7154[ٱ][q:6717[جْ]عَلْنِى مُقِيمَ [h:7155[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةِ وَمِ[f:643[ن ذ]ُرِّيَّتِى‌ۚ رَبَّنَا وَتَقَبَّلْ دُع[o[َا]ٓءِ","translation_en":"My Lord! make me keep up prayer and from my offspring (too), O our Lord, and accept my prayer:","translation_id":"Ya Tuhanku, jadikanlah aku dan anak cucuku orang yang tetap melaksanakan shalat, ya Tuhan kami, perkenankanlah doaku.","hasanah_per_verse":390},{"text_madani":"رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ","text_tajweed":"رَبَّنَا [h:2305[ٱ]غْفِرْ لِى وَلِو[n[َٲ]لِدَىَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ [h:7156[ٱ]لْحِس[p[َا][q[ب]ُ","translation_en":"O our Lord! grant me protection and my parents and the believers on the day when the reckoning shall come to pass!","translation_id":"Ya Tuhan kami, ampunilah aku dan kedua ibu bapakku dan semua orang yang beriman pada hari diadakan perhitungan (hari Kiamat).”","hasanah_per_verse":390},{"text_madani":"وَلَا تَحْسَبَنَّ اللَّهَ غَافِلًا عَمَّا يَعْمَلُ الظَّالِمُونَ ۚ إِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيهِ الْأَبْصَارُ","text_tajweed":"وَلَا تَحْسَبَ[g[نّ]َ [h:7157[ٱ]للَّهَ غَ[n[ـٰ]فِلاً عَ[g[مّ]َا يَعْمَلُ [h:7158[ٱ][l[ل]ظَّ[n[ـٰ]لِمُونَ‌ۚ إِ[g[نّ]َمَا يُؤَخِّرُهُمْ لِيَوْ[f:7159[مٍ ت]َشْخَصُ فِيهِ [h:7160[ٱ]لْأَ[q:4305[بْ]صَ[p[ـٰ]رُ","translation_en":"And do not think Allah to be heedless of what the unjust do; He only respites them to a day on which the eyes shall be fixedly open,","translation_id":"Dan janganlah engkau mengira, bahwa Allah lengah dari apa yang diperbuat oleh orang yang zhalim. Sesungguhnya Allah menangguhkan mereka sampai hari yang pada waktu itu mata (mereka) terbelalak,","hasanah_per_verse":600},{"text_madani":"مُهْطِعِينَ مُقْنِعِي رُءُوسِهِمْ لَا يَرْتَدُّ إِلَيْهِمْ طَرْفُهُمْ ۖ وَأَفْئِدَتُهُمْ هَوَاءٌ","text_tajweed":"مُهْطِعِينَ مُ[q:7161[قْ]نِعِى رُءُوسِهِمْ لَا يَرْتَدُّ إِلَيْهِمْ طَرْفُهُمْ‌ۖ وَأَفْــِٔدَتُهُمْ هَو[o[َا]ٓءٌ","translation_en":"Hastening forward, their heads upraised, their eyes not reverting to them and their hearts vacant.","translation_id":"mereka datang tergesa-gesa (memenuhi panggilan) dengan mengangkat kepalanya, sedang mata mereka tidak berkedip-kedip dan hati mereka kosong.","hasanah_per_verse":450},{"text_madani":"وَأَنذِرِ النَّاسَ يَوْمَ يَأْتِيهِمُ الْعَذَابُ فَيَقُولُ الَّذِينَ ظَلَمُوا رَبَّنَا أَخِّرْنَا إِلَىٰ أَجَلٍ قَرِيبٍ نُّجِبْ دَعْوَتَكَ وَنَتَّبِعِ الرُّسُلَ ۗ أَوَلَمْ تَكُونُوا أَقْسَمْتُم مِّن قَبْلُ مَا لَكُم مِّن زَوَالٍ","text_tajweed":"وَأَ[f:7162[نذ]ِرِ [h:7163[ٱ][l[ل][g[نّ]َاسَ يَوْمَ يَأْتِيهِمُ [h:7164[ٱ]لْعَذَابُ فَيَقُولُ [h:7165[ٱ]لَّذِينَ ظَلَمُو[s[اْ] رَبَّن[o[َآ] أَخِّرْن[o[َآ] إِلَ[o[ىٰٓ] أَجَ[f:2940[لٍ ق]َرِي[a:7166[بٍ ن]ُّجِ[q:7167[بْ] دَعْوَتَكَ وَنَتَّبِعِ [h:7168[ٱ][l[ل]رُّسُلَ‌ۗ أَوَلَمْ تَكُون[o[ُوٓ][s[اْ] أَ[q:4723[قْ]سَمْت[w:7169[ُم م]ِّ[f:128[ن ق]َ[q:129[بْ]لُ مَا لَك[w:556[ُم م]ِّ[f:7170[ن ز]َو[p[َا]لٍ","translation_en":"And warn people of the day when the chastisement shall come to them, then those who were unjust will say: O our Lord! respite us to a near term, (so) we shall respond to Thy call and follow the messengers. What! did you not swear before (that) there will be no passing away for you!","translation_id":"Dan berikanlah peringatan (Muhammad) kepada manusia pada hari (ketika) azab datang kepada mereka, maka orang yang zhalim berkata, “Ya Tuhan kami, berilah kami kesempatan (kembali ke dunia) walaupun sebentar, niscaya kami akan mematuhi seruan Engkau dan akan mengikuti rasul-rasul.” (Kepada mereka dikatakan), “Bukankah dahulu (di dunia) kamu telah bersumpah bahwa sekali-kali kamu tidak akan binasa?","hasanah_per_verse":1090},{"text_madani":"وَسَكَنتُمْ فِي مَسَاكِنِ الَّذِينَ ظَلَمُوا أَنفُسَهُمْ وَتَبَيَّنَ لَكُمْ كَيْفَ فَعَلْنَا بِهِمْ وَضَرَبْنَا لَكُمُ الْأَمْثَالَ","text_tajweed":"وَسَكَ[f:7171[نت]ُمْ فِى مَسَ[n[ـٰ]كِنِ [h:7172[ٱ]لَّذِينَ ظَلَم[o[ُوٓ][s[اْ] أَ[f:38[نف]ُسَهُمْ وَتَبَيَّنَ لَكُمْ كَيْفَ فَعَلْنَا بِهِمْ وَضَرَ[q:7173[بْ]نَا لَكُمُ [h:7174[ٱ]لْأَمْث[p[َا]لَ","translation_en":"And you dwell in the abodes of those who were unjust to themselves, and it is clear to you how We dealt with them and We have made (them) examples to you.","translation_id":"Dan kamu telah tinggal di tempat orang yang menzhalimi diri sendiri, dan telah nyata bagimu bagaimana Kami telah berbuat terhadap mereka dan telah Kami berikan kepadamu beberapa perumpamaan.”","hasanah_per_verse":640},{"text_madani":"وَقَدْ مَكَرُوا مَكْرَهُمْ وَعِندَ اللَّهِ مَكْرُهُمْ وَإِن كَانَ مَكْرُهُمْ لِتَزُولَ مِنْهُ الْجِبَالُ","text_tajweed":"وَقَ[q:387[دْ] مَكَرُو[s[اْ] مَكْرَهُمْ وَعِ[f:5476[ند]َ [h:7175[ٱ]للَّهِ مَكْرُهُمْ وَإِ[f:1649[ن ك]َانَ مَكْرُهُمْ لِتَزُولَ مِنْهُ [h:7176[ٱ]لْجِب[p[َا]لُ","translation_en":"And they have indeed planned their plan, but their plan is with Allah, though their plan was such that the mountains should pass away thereby.","translation_id":"Dan sungguh, mereka telah membuat tipu daya padahal Allah (mengetahui dan akan membalas) tipu daya mereka. Dan sesungguhnya tipu daya mereka tidak mampu melenyapkan gunung-gunung.","hasanah_per_verse":510},{"text_madani":"فَلَا تَحْسَبَنَّ اللَّهَ مُخْلِفَ وَعْدِهِ رُسُلَهُ ۗ إِنَّ اللَّهَ عَزِيزٌ ذُو انتِقَامٍ","text_tajweed":"فَلَا تَحْسَبَ[g[نّ]َ [h:7157[ٱ]للَّهَ مُخْلِفَ وَعْدِه[n[ِۦ] رُسُلَهُ[o[ۥٓ‌ۗ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَزِي[f:1729[زٌ ذ]ُو [h:1730[ٱ][f:1731[نت]ِق[p[َا]مٍ","translation_en":"Therefore do not think Allah (to be one) failing in His promise to His messengers; surely Allah is Mighty, the Lord of Retribution.","translation_id":"Maka karena itu jangan sekali-kali kamu mengira bahwa Allah mengingkari janji-Nya kepada rasul-rasul-Nya. Sungguh, Allah Mahaperkasa dan mempunyai pembalasan.","hasanah_per_verse":420},{"text_madani":"يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ وَالسَّمَاوَاتُ ۖ وَبَرَزُوا لِلَّهِ الْوَاحِدِ الْقَهَّارِ","text_tajweed":"يَوْمَ تُبَدَّلُ [h:7177[ٱ]لْأَرْضُ غَيْرَ [h:7178[ٱ]لْأَرْضِ وَ[h:7179[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تُ‌ۖ وَبَرَزُو[s[اْ] لِلَّهِ [h:7180[ٱ]لْو[n[َٲ]حِدِ [h:7181[ٱ]لْقَهّ[p[َا]رِ","translation_en":"On the day when the earth shall be changed into a different earth, and the heavens (as well), and they shall come forth before Allah, the One, the Supreme.","translation_id":"(Yaitu) pada hari (ketika) bumi diganti dengan bumi yang lain dan (demikian pula) langit, dan mereka (manusia) berkumpul (di Padang Mahsyar) menghadap Allah Yang Maha Esa, Mahaperkasa.","hasanah_per_verse":500},{"text_madani":"وَتَرَى الْمُجْرِمِينَ يَوْمَئِذٍ مُّقَرَّنِينَ فِي الْأَصْفَادِ","text_tajweed":"وَتَرَى [h:7182[ٱ]لْمُ[q:4093[جْ]رِمِينَ يَوْمَئِ[a:7183[ذٍ م]ُّقَرَّنِينَ فِى [h:7184[ٱ]لْأَصْف[p[َا][q[د]ِ","translation_en":"And you will see the guilty on that day linked together in chains.","translation_id":"Dan pada hari itu engkau akan melihat orang yang berdosa bersama-sama diikat dengan belenggu.","hasanah_per_verse":320},{"text_madani":"سَرَابِيلُهُم مِّن قَطِرَانٍ وَتَغْشَىٰ وُجُوهَهُمُ النَّارُ","text_tajweed":"سَرَابِيلُه[w:7185[ُم م]ِّ[f:7186[ن ق]َطِرَا[a:7187[نٍ و]َتَغْشَىٰ وُجُوهَهُمُ [h:7188[ٱ][l[ل][g[نّ][p[َا]رُ","translation_en":"Their shirts made of pitch and the fire covering their faces","translation_id":"Pakaian mereka dari cairan aspal, dan wajah mereka ditutup oleh api neraka,","hasanah_per_verse":310},{"text_madani":"لِيَجْزِيَ اللَّهُ كُلَّ نَفْسٍ مَّا كَسَبَتْ ۚ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ","text_tajweed":"لِيَ[q:5945[جْ]زِىَ [h:7189[ٱ]للَّهُ كُلَّ نَفْ[a:1654[سٍ م]َّا كَسَبَتْ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ سَرِيعُ [h:1112[ٱ]لْحِس[p[َا][q[ب]ِ","translation_en":"That Allah may requite each soul (according to) what it has earned; surely Allah is swift in reckoning.","translation_id":"agar Allah memberi balasan kepada setiap orang terhadap apa yang dia usahakan. Sungguh, Allah Mahacepat perhitungan-Nya.","hasanah_per_verse":360},{"text_madani":"هَٰذَا بَلَاغٌ لِّلنَّاسِ وَلِيُنذَرُوا بِهِ وَلِيَعْلَمُوا أَنَّمَا هُوَ إِلَٰهٌ وَاحِدٌ وَلِيَذَّكَّرَ أُولُو الْأَلْبَابِ","text_tajweed":"هَ[n[ـٰ]ذَا بَلَ[n[ـٰ][u:7190[غٌ ل]ِّل[g[نّ]َاسِ وَلِيُ[f:7191[نذ]َرُو[s[اْ] بِه[n[ِۦ] وَلِيَعْلَم[o[ُوٓ][s[اْ] أَ[g[نّ]َمَا هُوَ إِلَ[n[ـٰ][a:827[هٌ و][n[َٲ]حِ[a:7192[دٌ و]َلِيَذَّكَّرَ أُ[s[وْ]لُو[s[اْ] [h:1595[ٱ]لْأَلْبَ[p[ـٰ][q[ب]ِ","translation_en":"This is a sufficient exposition for the people and that they may be warned thereby, and that they may know that He is One Allah and that those possessed of understanding may mind.","translation_id":"Dan (Al-Qur'an) ini adalah penjelasan (yang sempurna) bagi manusia, agar mereka diberi peringatan dengannya, agar mereka mengetahui bahwa Dia adalah Tuhan Yang Maha Esa dan agar orang yang berakal mengambil pelajaran.","hasanah_per_verse":600}]}
