{"chapter_number":65,"name_simple":"At-Talaq","name_meaning":{"text":"The Divorce","en":"The Divorce","id":"Perceraian"},"verses_count":12,"hasanah":12030,"verses":[{"text_madani":"يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمُ النِّسَاءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحْصُوا الْعِدَّةَ ۖ وَاتَّقُوا اللَّهَ رَبَّكُمْ ۖ لَا تُخْرِجُوهُنَّ مِن بُيُوتِهِنَّ وَلَا يَخْرُجْنَ إِلَّا أَن يَأْتِينَ بِفَاحِشَةٍ مُّبَيِّنَةٍ ۚ وَتِلْكَ حُدُودُ اللَّهِ ۚ وَمَن يَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ ۚ لَا تَدْرِي لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذَٰلِكَ أَمْرًا","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:5411[ٱ][l[ل][g[نّ]َبِىُّ إِذَا طَلَّ[q:1293[قْ]تُمُ [h:1294[ٱ][l[ل][g[نّ]ِس[o[َا]ٓءَ فَطَلِّقُوهُ[g[نّ]َ لِعِدَّتِهِ[g[نّ]َ وَأَحْصُو[s[اْ] [h:13657[ٱ]لْعِدَّةَ‌ۖ وَ[h:1018[ٱ]تَّقُو[s[اْ] [h:1019[ٱ]للَّهَ رَبَّكُمْ‌ۖ لَا تُخْرِجُوهُ[g[نّ]َ م[i:13658[ِنۢ ب]ُيُوتِهِ[g[نّ]َ وَلَا يَخْرُ[q:13659[جْ]نَ إِلّ[o[َآ] أ[a:2664[َن ي]َأْتِينَ بِفَ[n[ـٰ]حِشَ[a:2665[ةٍ م]ُّبَيِّنَ[a:13660[ةٍ‌ۚ و]َتِلْكَ حُدُودُ [h:1000[ٱ]للَّهِ‌ۚ وَم[a:1284[َن ي]َتَعَدَّ حُدُودَ [h:1282[ٱ]للَّهِ فَقَ[q:563[دْ] ظَلَمَ نَفْسَهُ[n[ۥ]‌ۚ لَا تَ[q:10618[دْ]رِى لَعَلَّ [h:13661[ٱ]للَّهَ يُحْدِثُ بَعْدَ ذ[n[َٲ]لِكَ أَمْرًا","translation_en":"O Prophet! when you divorce women, divorce them for~ their prescribed time, and calculate the number of the days prescribed, and be careful of (your duty to) Allah, your Lord. Do not drive them out of their houses, nor should they themselves go forth, unless they commit an open indecency; and these are the limits of Allah, and whoever goes beyond the limits of Allah, he indeed does injustice to his own soul. You do not know that Allah may after that bring about reunion.","translation_id":"Wahai Nabi! Apabila kamu menceraikan istri-istrimu maka hendaklah kamu ceraikan mereka pada waktu mereka dapat (menghadapi) idahnya (yang wajar), dan hitunglah waktu idah itu, serta bertakwalah kepada Allah Tuhanmu. Janganlah kamu keluarkan mereka dari rumahnya dan janganlah (diizinkan) keluar kecuali jika mereka mengerjakan perbuatan keji yang jelas. Itulah hukum-hukum Allah, dan barangsiapa melanggar hukum-hukum Allah, maka sungguh, dia telah berbuat zhalim terhadap dirinya sendiri. Kamu tidak mengetahui barangkali setelah itu Allah mengadakan suatu ketentuan yang baru.","hasanah_per_verse":1730},{"text_madani":"فَإِذَا بَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ فَارِقُوهُنَّ بِمَعْرُوفٍ وَأَشْهِدُوا ذَوَيْ عَدْلٍ مِّنكُمْ وَأَقِيمُوا الشَّهَادَةَ لِلَّهِ ۚ ذَٰلِكُمْ يُوعَظُ بِهِ مَن كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۚ وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مَخْرَجًا","text_tajweed":"فَإِذَا بَلَغْنَ أَجَلَهُ[g[نّ]َ فَأَمْسِكُوهُ[g[نّ]َ بِمَعْرُوفٍ أَوْ فَارِقُوهُ[g[نّ]َ بِمَعْرُو[a:13662[فٍ و]َأَشْهِدُو[s[اْ] ذَوَىْ عَ[q:3797[دْ][a:3798[لٍ م]ِّ[f:344[نك]ُمْ وَأَقِيمُو[s[اْ] [h:13663[ٱ][l[ل]شَّهَ[n[ـٰ]دَةَ لِلَّهِ‌ۚ ذ[n[َٲ]لِكُمْ يُوعَظُ بِه[n[ِۦ] مَ[f:506[ن ك]َانَ يُؤْمِنُ بِ[h:32[ٱ]للَّهِ وَ[h:328[ٱ]لْيَوْمِ [h:329[ٱ]لْأَخِرِ‌ۚ وَم[a:13664[َن ي]َتَّقِ [h:13665[ٱ]للَّهَ يَ[q:4397[جْ]عَل لَّهُ[n[ۥ] مَخْرَجًا","translation_en":"So when they have reached their prescribed time, then retain them with kindness or separate them with kindness, and call to witness two men of justice from among you, and give upright testimony for Allah. With that is admonished he who believes in Allah and the latter day; and whoever is careful of (his duty to) Allah, He will make for him an outlet,","translation_id":"Maka apabila mereka telah mendekati akhir idahnya, maka rujuklah (kembali kepada) mereka dengan baik atau lepaskanlah mereka dengan baik dan persaksikanlah dengan dua orang saksi yang adil di antara kamu dan hendaklah kamu tegakkan kesaksian itu karena Allah. Demikianlah pengajaran itu diberikan bagi orang yang beriman kepada Allah dan hari akhirat. Barangsiapa bertakwa kepada Allah niscaya Dia akan membukakan jalan keluar baginya,","hasanah_per_verse":1320},{"text_madani":"وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ ۚ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ ۚ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا","text_tajweed":"وَيَرْزُ[q:13666[قْ]هُ مِنْ حَيْثُ لَا يَحْتَسِبُ‌ۚ وَم[a:5377[َن ي]َتَوَكَّلْ عَلَى [h:412[ٱ]للَّهِ فَهُوَ حَسْبُهُ[o[ۥٓ‌ۚ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ بَ[n[ـٰ]لِغُ أَمْرِه[n[ِۦ]‌ۚ قَ[q:298[دْ] جَعَلَ [h:2556[ٱ]للَّهُ لِكُلِّ ش[f:13667[َىْءٍ ق]َ[q:13668[دْ]رًا","translation_en":"And give him sustenance from whence he thinks not; and whoever trusts in Allah, He is sufficient for him; surely Allah attains His purpose; Allah indeed has appointed a measure for everything.","translation_id":"dan Dia memberinya rezeki dari arah yang tidak disangka-sangkanya. Dan barangsiapa bertawakal kepada Allah, niscaya Allah akan mencukupkan (keperluan)nya. Sesungguhnya Allah melaksanakan urusan-Nya. Sungguh, Allah telah mengadakan ketentuan bagi setiap sesuatu.","hasanah_per_verse":730},{"text_madani":"وَاللَّائِي يَئِسْنَ مِنَ الْمَحِيضِ مِن نِّسَائِكُمْ إِنِ ارْتَبْتُمْ فَعِدَّتُهُنَّ ثَلَاثَةُ أَشْهُرٍ وَاللَّائِي لَمْ يَحِضْنَ ۚ وَأُولَاتُ الْأَحْمَالِ أَجَلُهُنَّ أَن يَضَعْنَ حَمْلَهُنَّ ۚ وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مِنْ أَمْرِهِ يُسْرًا","text_tajweed":"وَ[h:9999[ٱ]لَّ[o[ــٰٓ]ــِٔى يَئِسْنَ مِنَ [h:13669[ٱ]لْمَحِيضِ م[a:2638[ِن ن]ِّس[o[َا]ٓئِكُمْ إِنِ [h:3844[ٱ]رْتَ[q:3845[بْ]تُمْ فَعِدَّتُهُ[g[نّ]َ ثَلَ[n[ـٰ]ثَةُ أَشْهُ[a:13670[رٍ و]َ[h:13671[ٱ]لَّ[o[ــٰٓ]ــِٔى لَمْ يَحِضْنَ‌ۚ وَأُ[s[وْ]لَ[n[ـٰ]تُ [h:13672[ٱ]لْأَحْمَالِ أَجَلُهُ[g[نّ]َ أ[a:9527[َن ي]َضَعْنَ حَمْلَهُ[g[نّ]َ‌ۚ وَم[a:13664[َن ي]َتَّقِ [h:13665[ٱ]للَّهَ يَ[q:4397[جْ]عَل لَّهُ[n[ۥ] مِنْ أَمْرِه[n[ِۦ] يُسْرًا","translation_en":"And (as for) those of your women who have despaired of menstruation, if you have a doubt, their prescribed time shall be three months, and of those too who have not had their courses; and (as for) the pregnant women, their prescribed time is that they lay down their burden; and whoever is careful of (his duty to) Allah He will make easy for him his affair.","translation_id":"Perempuan-perempuan yang tidak haid lagi (menopause) di antara istri-istrimu jika kamu ragu-ragu (tentang masa idahnya) maka idahnya adalah tiga bulan; dan begitu (pula) perempuan-perempuan yang tidak haid. Sedangkan perempuan-perempuan yang hamil, waktu idah mereka itu ialah sampai mereka melahirkan kandungannya. Dan barangsiapa bertakwa kepada Allah, niscaya Dia menjadikan kemudahan baginya dalam urusannya.","hasanah_per_verse":1180},{"text_madani":"ذَٰلِكَ أَمْرُ اللَّهِ أَنزَلَهُ إِلَيْكُمْ ۚ وَمَن يَتَّقِ اللَّهَ يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُعْظِمْ لَهُ أَجْرًا","text_tajweed":"ذ[n[َٲ]لِكَ أَمْرُ [h:2832[ٱ]للَّهِ أَ[f:3300[نز]َلَهُ[o[ۥٓ] إِلَيْكُمْ‌ۚ وَم[a:13664[َن ي]َتَّقِ [h:13665[ٱ]للَّهَ يُكَفِّرْ عَنْهُ سَيِّـَٔـاتِه[n[ِۦ] وَيُعْظِمْ لَهُ[o[ۥٓ] أَ[q:2795[جْ]رًا","translation_en":"That is the command of Allah which He has revealed to you, and whoever is careful of (his duty to) Allah, He will remove from him his evil and give him a big reward.","translation_id":"Itulah perintah Allah yang diturunkan-Nya kepada kamu; barangsiapa bertakwa kepada Allah, niscaya Allah akan menghapus kesalahan-kesalahannya dan akan melipatgandakan pahala baginya.","hasanah_per_verse":540},{"text_madani":"أَسْكِنُوهُنَّ مِنْ حَيْثُ سَكَنتُم مِّن وُجْدِكُمْ وَلَا تُضَارُّوهُنَّ لِتُضَيِّقُوا عَلَيْهِنَّ ۚ وَإِن كُنَّ أُولَاتِ حَمْلٍ فَأَنفِقُوا عَلَيْهِنَّ حَتَّىٰ يَضَعْنَ حَمْلَهُنَّ ۚ فَإِنْ أَرْضَعْنَ لَكُمْ فَآتُوهُنَّ أُجُورَهُنَّ ۖ وَأْتَمِرُوا بَيْنَكُم بِمَعْرُوفٍ ۖ وَإِن تَعَاسَرْتُمْ فَسَتُرْضِعُ لَهُ أُخْرَىٰ","text_tajweed":"أَسْكِنُوهُ[g[نّ]َ مِنْ حَيْثُ سَكَ[f:13673[نت][w:13674[ُم م]ّ[a:13675[ِن و]ُ[q:13676[جْ]دِكُمْ وَلَا تُض[m[َا]ٓرُّوهُ[g[نّ]َ لِتُضَيِّقُو[s[اْ] عَلَيْهِ[g[نّ]َ‌ۚ وَإِ[f:13677[ن ك]ُ[g[نّ]َ أُ[s[وْ]لَ[n[ـٰ]تِ حَمْ[f:13678[لٍ ف]َأَ[f:13679[نف]ِقُو[s[اْ] عَلَيْهِ[g[نّ]َ حَتَّىٰ يَضَعْنَ حَمْلَهُ[g[نّ]َ‌ۚ فَإِنْ أَرْضَعْنَ لَكُمْ فَـَٔـاتُوهُ[g[نّ]َ أُجُورَهُ[g[نّ]َ‌ۖ وَأْتَمِرُو[s[اْ] بَيْنَك[c:13680[ُم ب]ِمَعْرُو[a:13681[فٍ‌ۖ و]َإِ[f:13682[ن ت]َعَاسَرْتُمْ فَسَتُرْضِعُ لَهُ[o[ۥٓ] أُخْرَىٰ","translation_en":"Lodge them where you lodge according to your means, and do not injure them in order that you may straiten them; and if they are pregnant, spend on them until they lay down their burden; then if they suckle for you, give them their recompense and enjoin one another among you to do good; and if you disagree, another (woman) shall suckle for him.","translation_id":"Tempatkanlah mereka (para istri) di mana kamu bertempat tinggal menurut kemampuanmu dan janganlah kamu menyusahkan mereka untuk menyempitkan (hati) mereka. Dan jika mereka (istri-istri yang sudah ditalak) itu sedang hamil, maka berikanlah kepada mereka nafkahnya sampai mereka melahirkan, kemudian jika mereka menyusukan (anak-anak)mu maka berikanlah imbalannya kepada mereka; dan musyawarahkanlah di antara kamu (segala sesuatu) dengan baik; dan jika kamu menemui kesulitan, maka perempuan lain boleh menyusukan (anak itu) untuknya.","hasanah_per_verse":1460},{"text_madani":"لِيُنفِقْ ذُو سَعَةٍ مِّن سَعَتِهِ ۖ وَمَن قُدِرَ عَلَيْهِ رِزْقُهُ فَلْيُنفِقْ مِمَّا آتَاهُ اللَّهُ ۚ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا مَا آتَاهَا ۚ سَيَجْعَلُ اللَّهُ بَعْدَ عُسْرٍ يُسْرًا","text_tajweed":"لِيُ[f:13683[نف]ِ[q:13683[قْ] ذُو سَعَ[a:13684[ةٍ م]ِّ[f:3193[ن س]َعَتِه[n[ِۦ]‌ۖ وَمَ[f:13685[ن ق]ُدِرَ عَلَيْهِ رِزْقُهُ[n[ۥ] فَلْيُ[f:13686[نف]ِ[q:13686[قْ] مِ[g[مّ][o[َآ] ءَاتَ[n[ـٰ]هُ [h:1498[ٱ]للَّهُ‌ۚ لَا يُكَلِّفُ [h:1713[ٱ]للَّهُ نَفْسًا إِلَّا م[o[َآ] ءَاتَ[n[ـٰ]هَا‌ۚ سَيَ[q:8428[جْ]عَلُ [h:13687[ٱ]للَّهُ بَعْدَ عُسْ[a:13688[رٍ ي]ُسْرًا","translation_en":"Let him who has abundance spend out of his abundance and whoever has his means of subsistence straitened to him, let him spend out of that which Allah has given him; Allah does not lay on any soul a burden except to the extent to which He has granted it; Allah brings about ease after difficulty.","translation_id":"Hendaklah orang yang mempunyai keluasan memberi nafkah menurut kemampuannya, dan orang yang terbatas rezekinya, hendaklah memberi nafkah dari harta yang diberikan Allah kepadanya. Allah tidak membebani kepada seseorang melainkan (sesuai) dengan apa yang diberikan Allah kepadanya. Allah kelak akan memberikan kelapangan setelah kesempitan.","hasanah_per_verse":900},{"text_madani":"وَكَأَيِّن مِّن قَرْيَةٍ عَتَتْ عَنْ أَمْرِ رَبِّهَا وَرُسُلِهِ فَحَاسَبْنَاهَا حِسَابًا شَدِيدًا وَعَذَّبْنَاهَا عَذَابًا نُّكْرًا","text_tajweed":"وَكَأَيّ[a:2298[ِن م]ِّ[f:4585[ن ق]َرْيَةٍ عَتَتْ عَنْ أَمْرِ رَبِّهَا وَرُسُلِه[n[ِۦ] فَحَاسَ[q:13689[بْ]نَ[n[ـٰ]هَا حِسَا[f:13690[بًا ش]َدِي[a:13691[دًا و]َعَذَّ[q:13692[بْ]نَ[n[ـٰ]هَا عَذَا[a:8212[بًا ن]ُّكْرًا","translation_en":"And how many a town which rebelled against the commandment of its Lord and His messengers, so We called it to account severely and We chastised it (with) a stern chastisement.","translation_id":"Dan betapa banyak (penduduk) negeri yang mendurhakai perintah Tuhan mereka dan rasul-rasul-Nya, maka Kami buat perhitungan terhadap penduduk negeri itu dengan perhitungan yang ketat, dan Kami azab mereka dengan azab yang mengerikan (di akhirat),","hasanah_per_verse":640},{"text_madani":"فَذَاقَتْ وَبَالَ أَمْرِهَا وَكَانَ عَاقِبَةُ أَمْرِهَا خُسْرًا","text_tajweed":"فَذَاقَتْ وَبَالَ أَمْرِهَا وَكَانَ عَ[n[ـٰ]قِبَةُ أَمْرِهَا خُسْرًا","translation_en":"So it tasted the evil result of its conduct, and the end of its affair was perdition.","translation_id":"sehingga mereka merasakan akibat yang buruk dari perbuatannya, dan akibat perbuatan mereka, itu adalah kerugian yang besar.","hasanah_per_verse":320},{"text_madani":"أَعَدَّ اللَّهُ لَهُمْ عَذَابًا شَدِيدًا ۖ فَاتَّقُوا اللَّهَ يَا أُولِي الْأَلْبَابِ الَّذِينَ آمَنُوا ۚ قَدْ أَنزَلَ اللَّهُ إِلَيْكُمْ ذِكْرًا","text_tajweed":"أَعَدَّ [h:5775[ٱ]للَّهُ لَهُمْ عَذَا[f:1966[بًا ش]َدِي[f:13693[دًا‌ۖ ف]َ[h:112[ٱ]تَّقُو[s[اْ] [h:1945[ٱ]للَّهَ يَ[o[ـٰٓ]أُ[s[وْ]لِى [h:941[ٱ]لْأَلْبَ[n[ـٰ]بِ [h:13694[ٱ]لَّذِينَ ءَامَنُو[s[اْ‌ۚ] قَ[q:298[دْ] أَ[f:471[نز]َلَ [h:472[ٱ]للَّهُ إِلَيْكُمْ ذِكْرًا","translation_en":"Allah has prepared for them severe chastisement, therefore be careful of (your duty to) Allah, O men of understanding who believe! Allah has indeed revealed to you a reminder,","translation_id":"Allah menyediakan azab yang keras bagi mereka, maka bertakwalah kepada Allah wahai orang-orang yang mempunyai akal! (Yaitu) orang-orang yang beriman. Sungguh, Allah telah menurunkan peringatan kepadamu,","hasanah_per_verse":720},{"text_madani":"رَّسُولًا يَتْلُو عَلَيْكُمْ آيَاتِ اللَّهِ مُبَيِّنَاتٍ لِّيُخْرِجَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ مِنَ الظُّلُمَاتِ إِلَى النُّورِ ۚ وَمَن يُؤْمِن بِاللَّهِ وَيَعْمَلْ صَالِحًا يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ قَدْ أَحْسَنَ اللَّهُ لَهُ رِزْقًا","text_tajweed":"رَّسُول[a:10208[اً ي]َتْلُو[s[اْ] عَلَيْكُمْ ءَايَ[n[ـٰ]تِ [h:1298[ٱ]للَّهِ مُبَيِّنَ[n[ـٰ][u:13695[تٍ ل]ِّيُخْرِجَ [h:13696[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ مِنَ [h:1491[ٱ][l[ل]ظُّلُمَ[n[ـٰ]تِ إِلَى [h:1492[ٱ][l[ل][g[نّ]ُورِ‌ۚ وَم[a:13644[َن ي]ُؤْم[i:12652[ِنۢ ب]ِ[h:32[ٱ]للَّهِ وَيَعْمَلْ صَ[n[ـٰ]لِ[a:13697[حًا ي]ُ[q:2631[دْ]خِلْهُ جَ[g[نّ]َ[n[ـٰ][f:119[تٍ ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ خَ[n[ـٰ]لِدِينَ فِيه[o[َآ] أَبَ[f:13698[دًا‌ۖ ق]َ[q:298[دْ] أَحْسَنَ [h:10249[ٱ]للَّهُ لَهُ[n[ۥ] رِزْقًا","translation_en":"An Messenger who recites to you the clear communications of Allah so that he may bring forth those who believe and do good deeds from darkness into light; and whoever believes in Allah and does good deeds, He will cause him to enter gardens beneath which rivers now, to abide therein forever, Allah has indeed given him a goodly sustenance.","translation_id":"(dengan mengutus) seorang Rasul yang membacakan ayat-ayat Allah kepadamu yang menerangkan (bermacam-macam hukum), agar Dia mengeluarkan orang-orang yang beriman dan mengerjakan kebajikan, dari kegelapan kepada cahaya. Dan barangsiapa beriman kepada Allah dan mengerjakan kebajikan, niscaya Dia akan memasukkannya ke dalam surga-surga yang mengalir di bawahnya sungai-sungai; mereka kekal di dalamnya selama-lamanya. Sungguh, Allah memberikan rezeki yang baik kepadanya.","hasanah_per_verse":1530},{"text_madani":"اللَّهُ الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوا أَنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا","text_tajweed":"ٱللَّهُ [h:4738[ٱ]لَّذِى خَلَقَ سَ[q:158[بْ]عَ سَمَ[n[ـٰ]و[n[َٲ][a:13699[تٍ و]َمِنَ [h:13700[ٱ]لْأَرْضِ مِثْلَهُ[g[نّ]َ يَتَنَزَّلُ [h:13701[ٱ]لْأَمْرُ بَيْنَهُ[g[نّ]َ لِتَعْلَم[o[ُوٓ][s[اْ] أَ[g[نّ]َ [h:394[ٱ]للَّهَ عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َدِي[a:13702[رٌ و]َأَ[g[نّ]َ [h:859[ٱ]للَّهَ قَ[q:298[دْ] أَحَاطَ بِكُلِّ شَىْءٍ عِلْمَۢا","translation_en":"Allah is He Who created seven heavens, and of the earth the like of them; the decree continues to descend among them, that you may know that Allah has power over all things and that Allah indeed encompasses all things in (His) knowledge.","translation_id":"Allah yang menciptakan tujuh langit dan dari (penciptaan) bumi juga serupa. Perintah Allah berlaku padanya, agar kamu mengetahui bahwa Allah Mahakuasa atas segala sesuatu, dan ilmu Allah benar-benar meliputi segala sesuatu.","hasanah_per_verse":960}]}
