{"chapter_number":12,"name_simple":"Yusuf","name_meaning":{"text":"Joseph","en":"Joseph","id":"Yusuf"},"verses_count":111,"hasanah":73070,"verses":[{"text_madani":"الر ۚ تِلْكَ آيَاتُ الْكِتَابِ الْمُبِينِ","text_tajweed":"ا[m[لٓ]ر‌ۚ تِلْكَ ءَايَ[n[ـٰ]تُ [h:5932[ٱ]لْكِتَ[n[ـٰ]بِ [h:6541[ٱ]لْمُب[p[ِي]نِ","translation_en":"Alif Lam Ra. These are the verses of the Book that makes (things) manifest.","translation_id":"Alif Lam Ra. Ini adalah ayat-ayat Kitab (Al-Qur'an) yang jelas.","hasanah_per_verse":220},{"text_madani":"إِنَّا أَنزَلْنَاهُ قُرْآنًا عَرَبِيًّا لَّعَلَّكُمْ تَعْقِلُونَ","text_tajweed":"إِ[g[نّ][o[َآ] أَ[f:4236[نز]َلْنَ[n[ـٰ]هُ قُرْء[n[َٲ]نًا عَرَبِي[u:6542[ًّا ل]َّعَلَّكُمْ تَعْقِل[p[ُو]نَ","translation_en":"Surely We have revealed it-- an Arabic Quran-- that you may understand.","translation_id":"Sesungguhnya Kami menurunkannya sebagai Qur'an berbahasa Arab, agar kamu mengerti.","hasanah_per_verse":310},{"text_madani":"نَحْنُ نَقُصُّ عَلَيْكَ أَحْسَنَ الْقَصَصِ بِمَا أَوْحَيْنَا إِلَيْكَ هَٰذَا الْقُرْآنَ وَإِن كُنتَ مِن قَبْلِهِ لَمِنَ الْغَافِلِينَ","text_tajweed":"نَحْنُ نَقُصُّ عَلَيْكَ أَحْسَنَ [h:6543[ٱ]لْقَصَصِ بِم[o[َآ] أَوْحَيْن[o[َآ] إِلَيْكَ هَ[n[ـٰ]ذَا [h:6544[ٱ]لْقُرْءَانَ وَإِ[f:6545[ن ك]ُ[f:735[نت]َ مِ[f:1097[ن ق]َ[q:1098[بْ]لِه[n[ِۦ] لَمِنَ [h:6546[ٱ]لْغَ[n[ـٰ]فِل[p[ِي]نَ","translation_en":"We narrate to you the best of narratives, by Our revealing to you this Quran, though before this you were certainly one of those who did not know.","translation_id":"Kami menceritakan kepadamu (Muhammad) kisah yang paling baik dengan mewahyukan Al-Qur'an ini kepadamu, dan sesungguhnya engkau sebelum itu termasuk orang yang tidak mengetahui.","hasanah_per_verse":640},{"text_madani":"إِذْ قَالَ يُوسُفُ لِأَبِيهِ يَا أَبَتِ إِنِّي رَأَيْتُ أَحَدَ عَشَرَ كَوْكَبًا وَالشَّمْسَ وَالْقَمَرَ رَأَيْتُهُمْ لِي سَاجِدِينَ","text_tajweed":"إِذْ قَالَ يُوسُفُ لِأَبِيهِ يَ[o[ـٰٓ]أَبَتِ إِ[g[نّ]ِى رَأَيْتُ أَحَدَ عَشَرَ كَوْكَ[a:6547[بًا و]َ[h:4264[ٱ][l[ل]شَّمْسَ وَ[h:4265[ٱ]لْقَمَرَ رَأَيْتُهُمْ لِى سَ[n[ـٰ]جِد[p[ِي]نَ","translation_en":"When Yusuf said to his father: O my father! surely I saw eleven stars and the sun and the moon-- I saw them making obeisance to me.","translation_id":"(Ingatlah), ketika Yusuf berkata kepada ayahnya, “Wahai ayahku! Sungguh, aku (bermimpi) melihat sebelas bintang, matahari dan bulan; kulihat semuanya sujud kepadaku.”","hasanah_per_verse":630},{"text_madani":"قَالَ يَا بُنَيَّ لَا تَقْصُصْ رُؤْيَاكَ عَلَىٰ إِخْوَتِكَ فَيَكِيدُوا لَكَ كَيْدًا ۖ إِنَّ الشَّيْطَانَ لِلْإِنسَانِ عَدُوٌّ مُّبِينٌ","text_tajweed":"قَالَ يَ[n[ـٰ]بُنَىَّ لَا تَ[q:6548[قْ]صُصْ رُءْيَاكَ عَلَ[o[ىٰٓ] إِخْوَتِكَ فَيَكِيدُو[s[اْ] لَكَ كَيْدًا‌ۖ إِ[g[نّ]َ [h:4634[ٱ][l[ل]شَّيْطَ[n[ـٰ]نَ لِلْإِ[f:6549[نس]َ[n[ـٰ]نِ عَدُ[a:873[وٌّ م]ُّب[p[ِي]نٌ","translation_en":"He said: O my son! do not relate your vision to your brothers, lest they devise a plan against you; surely the Shaitan is an open enemy to man.","translation_id":"Dia (ayahnya) berkata, “Wahai anakku! Janganlah engkau ceritakan mimpimu kepada saudara-saudaramu, mereka akan membuat tipu daya (untuk membinasakan)mu. Sungguh, setan itu musuh yang jelas bagi manusia.”","hasanah_per_verse":630},{"text_madani":"وَكَذَٰلِكَ يَجْتَبِيكَ رَبُّكَ وَيُعَلِّمُكَ مِن تَأْوِيلِ الْأَحَادِيثِ وَيُتِمُّ نِعْمَتَهُ عَلَيْكَ وَعَلَىٰ آلِ يَعْقُوبَ كَمَا أَتَمَّهَا عَلَىٰ أَبَوَيْكَ مِن قَبْلُ إِبْرَاهِيمَ وَإِسْحَاقَ ۚ إِنَّ رَبَّكَ عَلِيمٌ حَكِيمٌ","text_tajweed":"وَكَذ[n[َٲ]لِكَ يَ[q:6550[جْ]تَبِيكَ رَبُّكَ وَيُعَلِّمُكَ مِ[f:6551[ن ت]َأْوِيلِ [h:6552[ٱ]لْأَحَادِيثِ وَيُتِ[g[مّ]ُ نِعْمَتَهُ[n[ۥ] عَلَيْكَ وَعَلَ[o[ىٰٓ] ءَالِ يَعْقُوبَ كَم[o[َآ] أَتَ[g[مّ]َهَا عَلَ[o[ىٰٓ] أَبَوَيْكَ مِ[f:128[ن ق]َ[q:129[بْ]لُ إِ[q:1860[بْ]ر[n[َٲ]هِيمَ وَإِسْحَ[n[ـٰ]قَ‌ۚ إِ[g[نّ]َ رَبَّكَ عَلِيمٌ حَك[p[ِي]مٌ","translation_en":"And thus will your Lord choose you and teach you the interpretation of sayings and make His favor complete to you and to the children of Yaqoub, as He made it complete before to your fathers, Ibrahim and Ishaq; surely your Lord is Knowing, Wise.","translation_id":"Dan demikianlah, Tuhan memilih engkau (untuk menjadi Nabi) dan mengajarkan kepadamu sebagian dari takwil mimpi dan menyempurnakan (nikmat-Nya) kepadamu dan kepada keluarga Yakub, sebagaimana Dia telah menyempurnakan nikmat-Nya kepada kedua orang kakekmu sebelum itu, (yaitu) Ibrahim dan Ishak. Sungguh, Tuhanmu Maha Mengetahui, Mahabijak-sana.","hasanah_per_verse":1060},{"text_madani":"لَّقَدْ كَانَ فِي يُوسُفَ وَإِخْوَتِهِ آيَاتٌ لِّلسَّائِلِينَ","text_tajweed":"۞ لَّقَ[q:2389[دْ] كَانَ فِى يُوسُفَ وَإِخْوَتِه[o[ِۦٓ] ءَايَ[n[ـٰ][u:6553[تٌ ل]ِّلسّ[o[َا]ٓئِل[p[ِي]نَ","translation_en":"Certainly in Yusuf and his brothers there are signs for the inquirers.","translation_id":"Sungguh, dalam (kisah) Yusuf dan saudara-saudaranya terdapat tanda-tanda (kekuasaan Allah) bagi orang yang bertanya.","hasanah_per_verse":300},{"text_madani":"إِذْ قَالُوا لَيُوسُفُ وَأَخُوهُ أَحَبُّ إِلَىٰ أَبِينَا مِنَّا وَنَحْنُ عُصْبَةٌ إِنَّ أَبَانَا لَفِي ضَلَالٍ مُّبِينٍ","text_tajweed":"إِذْ قَالُو[s[اْ] لَيُوسُفُ وَأَخُوهُ أَحَبُّ إِلَ[o[ىٰٓ] أَبِينَا مِ[g[نّ]َا وَنَحْنُ عُصْبَةٌ إِ[g[نّ]َ أَبَانَا لَفِى ضَلَ[n[ـٰ][a:2393[لٍ م]ُّب[p[ِي]نٍ","translation_en":"When they said: Certainly Yusuf and his brother are dearer to our father than we, though we are a (stronger) company; most surely our father is in manifest error:","translation_id":"Ketika mereka berkata, “Sesungguhnya Yusuf dan saudaranya (Bunyamin) lebih dicintai ayah daripada kita, padahal kita adalah satu golongan (yang kuat). Sungguh, ayah kita dalam kekeliruan yang nyata.","hasanah_per_verse":570},{"text_madani":"اقْتُلُوا يُوسُفَ أَوِ اطْرَحُوهُ أَرْضًا يَخْلُ لَكُمْ وَجْهُ أَبِيكُمْ وَتَكُونُوا مِن بَعْدِهِ قَوْمًا صَالِحِينَ","text_tajweed":"ٱ[q:2891[قْ]تُلُو[s[اْ] يُوسُفَ أَوِ [h:6554[ٱ][q:6555[طْ]رَحُوهُ أَرْ[a:6556[ضًا ي]َخْلُ لَكُمْ وَ[q:603[جْ]هُ أَبِيكُمْ وَتَكُونُو[s[اْ] م[i:254[ِنۢ ب]َعْدِه[n[ِۦ] قَوْ[f:6557[مًا ص]َ[n[ـٰ]لِح[p[ِي]نَ","translation_en":"Slay Yusuf or cast him (forth) into some land, so that your father's regard may be exclusively for you, and after that you may be a righteous people.","translation_id":"Bunuhlah Yusuf atau buanglah dia ke suatu tempat agar perhatian ayah tertumpah kepadamu, dan setelah itu kamu menjadi orang yang baik.”","hasanah_per_verse":590},{"text_madani":"قَالَ قَائِلٌ مِّنْهُمْ لَا تَقْتُلُوا يُوسُفَ وَأَلْقُوهُ فِي غَيَابَتِ الْجُبِّ يَلْتَقِطْهُ بَعْضُ السَّيَّارَةِ إِن كُنتُمْ فَاعِلِينَ","text_tajweed":"قَالَ ق[o[َا]ٓئِ[a:6558[لٌ م]ِّنْهُمْ لَا تَ[q:2734[قْ]تُلُو[s[اْ] يُوسُفَ وَأَلْقُوهُ فِى غَيَ[n[ـٰ]بَتِ [h:6559[ٱ]لْجُبِّ يَلْتَقِ[q:6560[طْ]هُ بَعْضُ [h:6561[ٱ][l[ل]سَّيَّارَةِ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ فَ[n[ـٰ]عِل[p[ِي]نَ","translation_en":"A speaker from among them said: Do not slay Yusuf, and cast him down into the bottom of the pit if you must do (it), (so that) some of the travellers may pick him up.","translation_id":"Seorang di antara mereka berkata, “Janganlah kamu membunuh Yusuf, tetapi masukan saja dia ke dasar sumur agar dia dipungut oleh sebagian musafir, jika kamu hendak berbuat.”","hasanah_per_verse":680},{"text_madani":"قَالُوا يَا أَبَانَا مَا لَكَ لَا تَأْمَنَّا عَلَىٰ يُوسُفَ وَإِنَّا لَهُ لَنَاصِحُونَ","text_tajweed":"قَالُو[s[اْ] يَ[o[ـٰٓ]أَبَانَا مَا لَكَ لَا تَأْمَ۫[g[نّ]َا عَلَىٰ يُوسُفَ وَإِ[g[نّ]َا لَهُ[n[ۥ] لَنَ[n[ـٰ]صِح[p[ُو]نَ","translation_en":"They said: O our father! what reason have you that you do not trust in us with respect to Yusuf? And most surely we are his sincere well-wishers:","translation_id":"Mereka berkata, “Wahai ayah kami! Mengapa engkau tidak mempercayai kami terhadap Yusuf, padahal sesungguhnya kami semua menginginkan kebaikan baginya.","hasanah_per_verse":430},{"text_madani":"أَرْسِلْهُ مَعَنَا غَدًا يَرْتَعْ وَيَلْعَبْ وَإِنَّا لَهُ لَحَافِظُونَ","text_tajweed":"أَرْسِلْهُ مَعَنَا غَ[a:6562[دًا ي]َرْتَعْ وَيَلْعَ[q:6563[بْ] وَإِ[g[نّ]َا لَهُ[n[ۥ] لَحَ[n[ـٰ]فِظ[p[ُو]نَ","translation_en":"Send him with us tomorrow that he may enjoy himself and sport, and surely we will guard him well.","translation_id":"Biarkanlah dia pergi bersama kami besok pagi, agar dia bersenang-senang dan bermain-main, dan kami pasti menjaganya.”","hasanah_per_verse":340},{"text_madani":"قَالَ إِنِّي لَيَحْزُنُنِي أَن تَذْهَبُوا بِهِ وَأَخَافُ أَن يَأْكُلَهُ الذِّئْبُ وَأَنتُمْ عَنْهُ غَافِلُونَ","text_tajweed":"قَالَ إِ[g[نّ]ِى لَيَحْزُنُن[o[ِىٓ] أَ[f:6564[ن ت]َذْهَبُو[s[اْ] بِه[n[ِۦ] وَأَخَافُ أ[a:6565[َن ي]َأْكُلَهُ [h:6566[ٱ][l[ل]ذِّئْبُ وَأَ[f:98[نت]ُمْ عَنْهُ غَ[n[ـٰ]فِل[p[ُو]نَ","translation_en":"He said: Surely it grieves me that you should take him off, and I fear lest the wolf devour him while you are heedless of him.","translation_id":"Dia (Yakub) berkata, “Sesungguhnya kepergian kamu bersama dia (Yusuf) sangat menyedihkanku dan aku khawatir dia dimakan serigala, sedang kamu lengah darinya.”","hasanah_per_verse":540},{"text_madani":"قَالُوا لَئِنْ أَكَلَهُ الذِّئْبُ وَنَحْنُ عُصْبَةٌ إِنَّا إِذًا لَّخَاسِرُونَ","text_tajweed":"قَالُو[s[اْ] لَئِنْ أَكَلَهُ [h:6567[ٱ][l[ل]ذِّئْبُ وَنَحْنُ عُصْبَةٌ إِ[g[نّ][o[َآ] إِ[u:4868[ذًا ل]َّخَ[n[ـٰ]سِر[p[ُو]نَ","translation_en":"They said: Surely if the wolf should devour him notwithstanding that we are a (strong) company, we should then certainly be losers.","translation_id":"Sesungguhnya mereka berkata, “Jika dia dimakan serigala, padahal kami golongan (yang kuat), kalau demikian tentu kami orang-orang yang rugi.”","hasanah_per_verse":380},{"text_madani":"فَلَمَّا ذَهَبُوا بِهِ وَأَجْمَعُوا أَن يَجْعَلُوهُ فِي غَيَابَتِ الْجُبِّ ۚ وَأَوْحَيْنَا إِلَيْهِ لَتُنَبِّئَنَّهُم بِأَمْرِهِمْ هَٰذَا وَهُمْ لَا يَشْعُرُونَ","text_tajweed":"فَلَ[g[مّ]َا ذَهَبُو[s[اْ] بِه[n[ِۦ] وَأَ[q:6568[جْ]مَع[o[ُوٓ][s[اْ] أ[a:6569[َن ي]َ[q:6570[جْ]عَلُوهُ فِى غَيَ[n[ـٰ]بَتِ [h:6559[ٱ]لْجُبِّ‌ۚ وَأَوْحَيْن[o[َآ] إِلَيْهِ لَتُنَبِّئَ[g[نّ]َه[c:6571[ُم ب]ِأَمْرِهِمْ هَ[n[ـٰ]ذَا وَهُمْ لَا يَشْعُر[p[ُو]نَ","translation_en":"So when they had gone off with him and agreed that they should put him down at the bottom of the pit, and We revealed to him: You will most certainly inform them of this their affair while they do not perceive.","translation_id":"Maka ketika mereka membawanya dan sepakat memasukkan ke dasar sumur, Kami wahyukan kepadanya, “Engkau kelak pasti akan menceritakan perbuatan ini kepada mereka, sedang mereka tidak menyadari.”","hasanah_per_verse":760},{"text_madani":"وَجَاءُوا أَبَاهُمْ عِشَاءً يَبْكُونَ","text_tajweed":"وَج[o[َا]ٓء[o[ُوٓ] أَبَاهُمْ عِش[o[َا]ٓ[a:6572[ءً ي]َ[q:6573[بْ]ك[p[ُو]نَ","translation_en":"And they came to their father at nightfall, weeping.","translation_id":"Kemudian mereka datang kepada ayah mereka pada petang hari sambil menangis.","hasanah_per_verse":200},{"text_madani":"قَالُوا يَا أَبَانَا إِنَّا ذَهَبْنَا نَسْتَبِقُ وَتَرَكْنَا يُوسُفَ عِندَ مَتَاعِنَا فَأَكَلَهُ الذِّئْبُ ۖ وَمَا أَنتَ بِمُؤْمِنٍ لَّنَا وَلَوْ كُنَّا صَادِقِينَ","text_tajweed":"قَالُو[s[اْ] يَ[o[ـٰٓ]أَبَان[o[َآ] إِ[g[نّ]َا ذَهَ[q:6574[بْ]نَا نَسْتَبِقُ وَتَرَكْنَا يُوسُفَ عِ[f:264[ند]َ مَتَ[n[ـٰ]عِنَا فَأَكَلَهُ [h:6575[ٱ][l[ل]ذِّئْبُ‌ۖ وَم[o[َآ] أَ[f:169[نت]َ بِمُؤْمِ[u:6576[نٍ ل]َّنَا وَلَوْ كُ[g[نّ]َا صَ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"They said: O our father! surely we went off racing and left Yusuf by our goods, so the wolf devoured him, and you will not believe us though we are truthful.","translation_id":"Mereka berkata, “Wahai ayah kami! Sesungguhnya kami pergi berlomba dan kami tinggalkan Yusuf di dekat barang-barang kami, lalu dia dimakan serigala; dan engkau tentu tidak akan percaya kepada kami, sekalipun kami berkata benar.”","hasanah_per_verse":800},{"text_madani":"وَجَاءُوا عَلَىٰ قَمِيصِهِ بِدَمٍ كَذِبٍ ۚ قَالَ بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا ۖ فَصَبْرٌ جَمِيلٌ ۖ وَاللَّهُ الْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ","text_tajweed":"وَج[o[َا]ٓءُو عَلَىٰ قَمِيصِه[n[ِۦ] بِدَ[f:6577[مٍ ك]َذِ[f:6578[بٍ‌ۚ ق]َالَ بَلْ سَوَّلَتْ لَكُمْ أَ[f:6579[نف]ُسُكُمْ أَمْ[f:6580[رًا‌ۖ ف]َصَ[q:6581[بْ][f:6582[رٌ ج]َمِي[a:6583[لٌ‌ۖ و]َ[h:72[ٱ]للَّهُ [h:6584[ٱ]لْمُسْتَعَانُ عَلَىٰ مَا تَصِف[p[ُو]نَ","translation_en":"And they brought his shirt with false blood upon it. He said: Nay, your souls have made the matter light for you, but patience is good and Allah is He Whose help is sought for against what you describe.","translation_id":"Dan mereka datang membawa baju gamisnya (yang berlumuran) darah palsu. Dia (Yakub) berkata, “Sebenarnya hanya dirimu sendirilah yang memandang baik urusan yang buruk itu; maka hanya bersabar itulah yang terbaik (bagiku). Dan kepada Allah saja memohon pertolongan-Nya terhadap apa yang kamu ceritakan.”","hasanah_per_verse":730},{"text_madani":"وَجَاءَتْ سَيَّارَةٌ فَأَرْسَلُوا وَارِدَهُمْ فَأَدْلَىٰ دَلْوَهُ ۖ قَالَ يَا بُشْرَىٰ هَٰذَا غُلَامٌ ۚ وَأَسَرُّوهُ بِضَاعَةً ۚ وَاللَّهُ عَلِيمٌ بِمَا يَعْمَلُونَ","text_tajweed":"وَج[o[َا]ٓءَتْ سَيَّارَ[f:6585[ةٌ ف]َأَرْسَلُو[s[اْ] وَارِدَهُمْ فَأَ[q:6586[دْ]لَىٰ دَلْوَهُ[n[ۥ]‌ۖ قَالَ يَ[n[ـٰ]بُشْرَىٰ هَ[n[ـٰ]ذَا غُلَ[n[ـٰ][a:6587[مٌ‌ۚ و]َأَسَرُّوهُ بِضَ[n[ـٰ]عَ[a:6588[ةً‌ۚ و]َ[h:72[ٱ]للَّهُ عَلِي[i:6056[مُۢ ب]ِمَا يَعْمَل[p[ُو]نَ","translation_en":"And there came travellers and they sent their water-drawer and he let down his bucket. He said: O good news! this is a youth; and they concealed him as an article of merchandise, and Allah knew what they did.","translation_id":"Dan datanglah sekelompok musafir, mereka menyuruh seorang pengambil air. Lalu dia menurunkan timbanya. Dia berkata, “Oh, senangnya, ini ada seorang anak muda!” Kemudian mereka menyembunyikannya sebagai barang dagangan. Dan Allah Maha Mengetahui apa yang mereka kerjakan.","hasanah_per_verse":770},{"text_madani":"وَشَرَوْهُ بِثَمَنٍ بَخْسٍ دَرَاهِمَ مَعْدُودَةٍ وَكَانُوا فِيهِ مِنَ الزَّاهِدِينَ","text_tajweed":"وَشَرَوْهُ بِثَمَ[i:6589[نِۭ ب]َخْ[f:6590[سٍ د]َر[n[َٲ]هِمَ مَعْدُودَ[a:6591[ةٍ و]َكَانُو[s[اْ] فِيهِ مِنَ [h:6592[ٱ][l[ل]زّ[n[َٲ]هِد[p[ِي]نَ","translation_en":"And they sold him for a small price, a few pieces of silver, and they showed no desire for him.","translation_id":"Dan mereka menjualnya (Yusuf) dengan harga rendah, yaitu beberapa dirham saja, sebab mereka tidak tertarik kepadanya.","hasanah_per_verse":420},{"text_madani":"وَقَالَ الَّذِي اشْتَرَاهُ مِن مِّصْرَ لِامْرَأَتِهِ أَكْرِمِي مَثْوَاهُ عَسَىٰ أَن يَنفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا ۚ وَكَذَٰلِكَ مَكَّنَّا لِيُوسُفَ فِي الْأَرْضِ وَلِنُعَلِّمَهُ مِن تَأْوِيلِ الْأَحَادِيثِ ۚ وَاللَّهُ غَالِبٌ عَلَىٰ أَمْرِهِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ","text_tajweed":"وَقَالَ [h:6593[ٱ]لَّذِى [h:6594[ٱ]شْتَرَ[n[ٮٰ]هُ م[a:6595[ِن م]ِّصْرَ لِ[h:6596[ٱ]مْرَأَتِه[o[ِۦٓ] أَكْرِمِى مَثْوَ[n[ٮٰ]هُ عَسَ[o[ىٰٓ] أ[a:6597[َن ي]َ[f:6598[نف]َعَن[o[َآ] أَوْ نَتَّخِذَهُ[n[ۥ] وَلَ[a:6599[دًا‌ۚ و]َكَذ[n[َٲ]لِكَ مَكَّ[g[نّ]َا لِيُوسُفَ فِى [h:44[ٱ]لْأَرْضِ وَلِنُعَلِّمَهُ[n[ۥ] مِ[f:6551[ن ت]َأْوِيلِ [h:6552[ٱ]لْأَحَادِيثِ‌ۚ وَ[h:72[ٱ]للَّهُ غَالِبٌ عَلَ[o[ىٰٓ] أَمْرِه[n[ِۦ] وَلَ[n[ـٰ]كِ[g[نّ]َ أَكْثَرَ [h:1374[ٱ][l[ل][g[نّ]َاسِ لَا يَعْلَم[p[ُو]نَ","translation_en":"And the Egyptian who bought him said to his wife: Give him an honorable abode, maybe he will be useful to us, or we may adopt him as a son. And thus did We establish Yusuf in the land and that We might teach him the interpretation of sayings; and Allah is the master of His affair, but most people do not know.","translation_id":"Dan orang dari Mesir yang membelinya berkata kepada istrinya,” Berikanlah kepadanya tempat (dan layanan) yang baik, mudah-mudahan dia bermanfaat bagi kita atau kita pungut dia sebagai anak.” Dan demikianlah Kami memberikan kedudukan yang baik kepada Yusuf di negeri (Mesir), dan agar Kami ajarkan kepadanya takwil mimpi. Dan Allah berkuasa terhadap urusan-Nya, tetapi kebanyakan manusia tidak mengerti.","hasanah_per_verse":1380},{"text_madani":"وَلَمَّا بَلَغَ أَشُدَّهُ آتَيْنَاهُ حُكْمًا وَعِلْمًا ۚ وَكَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ","text_tajweed":"وَلَ[g[مّ]َا بَلَغَ أَشُدَّهُ[o[ۥٓ] ءَاتَيْنَ[n[ـٰ]هُ حُكْ[a:6600[مًا و]َعِلْ[a:6601[مًا‌ۚ و]َكَذ[n[َٲ]لِكَ نَ[q:4214[جْ]زِى [h:4215[ٱ]لْمُحْسِن[p[ِي]نَ","translation_en":"And when he had attained his maturity, We gave him wisdom and knowledge: and thus do We reward those who do good.","translation_id":"Dan ketika dia telah cukup dewasa Kami berikan kepadanya kekuasaan dan ilmu. Demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik.","hasanah_per_verse":430},{"text_madani":"وَرَاوَدَتْهُ الَّتِي هُوَ فِي بَيْتِهَا عَن نَّفْسِهِ وَغَلَّقَتِ الْأَبْوَابَ وَقَالَتْ هَيْتَ لَكَ ۚ قَالَ مَعَاذَ اللَّهِ ۖ إِنَّهُ رَبِّي أَحْسَنَ مَثْوَايَ ۖ إِنَّهُ لَا يُفْلِحُ الظَّالِمُونَ","text_tajweed":"وَر[n[َٲ]وَدَتْهُ [h:6602[ٱ]لَّتِى هُوَ فِى بَيْتِهَا ع[a:5890[َن ن]َّفْسِه[n[ِۦ] وَغَلَّقَتِ [h:6603[ٱ]لْأَ[q:6604[بْ]و[n[َٲ]بَ وَقَالَتْ هَيْتَ لَكَ‌ۚ قَالَ مَعَاذَ [h:6605[ٱ]للَّهِ‌ۖ إِ[g[نّ]َهُ[n[ۥ] رَبّ[o[ِىٓ] أَحْسَنَ مَثْوَاىَ‌ۖ إِ[g[نّ]َهُ[n[ۥ] لَا يُفْلِحُ [h:3981[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ُو]نَ","translation_en":"And she in whose house he was sought to make himself yield (to her), and she made fast the doors and said: Come forward. He said: I seek Allah's refuge, surely my Lord made good my abode: Surely the unjust do not prosper.","translation_id":"Dan perempuan yang dia (Yusuf) tinggal di rumahnya menggoda dirinya. Dan dia menutup pintu-pintu, lalu berkata, “Marilah mendekat kepadaku.” Yusuf berkata, “Aku berlindung kepada Allah, sungguh, tuanku telah memperlakukan aku dengan baik.” Sesungguhnya orang yang zhalim itu tidak akan beruntung.","hasanah_per_verse":910},{"text_madani":"وَلَقَدْ هَمَّتْ بِهِ ۖ وَهَمَّ بِهَا لَوْلَا أَن رَّأَىٰ بُرْهَانَ رَبِّهِ ۚ كَذَٰلِكَ لِنَصْرِفَ عَنْهُ السُّوءَ وَالْفَحْشَاءَ ۚ إِنَّهُ مِنْ عِبَادِنَا الْمُخْلَصِينَ","text_tajweed":"وَلَقَ[q:341[دْ] هَ[g[مّ]َتْ بِه[n[ِۦ]‌ۖ وَهَ[g[مّ]َ بِهَا لَوْل[o[َآ] أ[u:6606[َن ر]َّءَا بُرْهَ[n[ـٰ]نَ رَبِّه[n[ِۦ]‌ۚ كَذ[n[َٲ]لِكَ لِنَصْرِفَ عَنْهُ [h:6607[ٱ][l[ل]سّ[o[ُو]ٓءَ وَ[h:6608[ٱ]لْفَحْش[o[َا]ٓءَ‌ۚ إِ[g[نّ]َهُ[n[ۥ] مِنْ عِبَادِنَا [h:6609[ٱ]لْمُخْلَص[p[ِي]نَ","translation_en":"And certainly she made for him, and he would have made for her, were it not that he had seen the manifest evidence of his Lord; thus (it was) that We might turn away from him evil and indecency, surely he was one of Our sincere servants.","translation_id":"Dan sungguh, perempuan itu telah berkehendak kepadanya (Yusuf). Dan Yusuf pun berkehendak kepadanya, sekiranya dia tidak melihat tanda (dari) Tuhannya. Demikianlah, Kami palingkan darinya keburukan dan kekejian. Sungguh, dia (Yusuf) termasuk hamba Kami yang terpilih.","hasanah_per_verse":760},{"text_madani":"وَاسْتَبَقَا الْبَابَ وَقَدَّتْ قَمِيصَهُ مِن دُبُرٍ وَأَلْفَيَا سَيِّدَهَا لَدَى الْبَابِ ۚ قَالَتْ مَا جَزَاءُ مَنْ أَرَادَ بِأَهْلِكَ سُوءًا إِلَّا أَن يُسْجَنَ أَوْ عَذَابٌ أَلِيمٌ","text_tajweed":"وَ[h:9999[ٱ]سْتَبَقَا [h:6610[ٱ]لْبَابَ وَقَدَّتْ قَمِيصَهُ[n[ۥ] مِ[f:6611[ن د]ُبُ[a:6612[رٍ و]َأَلْفَيَا سَيِّدَهَا لَدَا [h:6613[ٱ]لْبَابِ‌ۚ قَالَتْ مَا جَز[o[َا]ٓءُ مَنْ أَرَادَ بِأَهْلِكَ س[o[ُو]ٓءًا إِلّ[o[َآ] أ[a:6614[َن ي]ُسْجَنَ أَوْ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"And they both hastened to the door, and she rent his shirt from behind and they met her husband at the door. She said: What is the punishment of him who intends evil to your wife except imprisonment or a painful chastisement?","translation_id":"Dan keduanya berlomba menuju pintu dan perempuan itu menarik baju gamisnya (Yusuf) dari belakang hingga koyak dan keduanya mendapati suami perempuan itu di depan pintu. Dia (perempuan itu) berkata, “Apakah balasan terhadap orang yang bermaksud buruk terhadap istrimu, selain dipenjarakan atau (dihukum) dengan siksa yang pedih?”","hasanah_per_verse":890},{"text_madani":"قَالَ هِيَ رَاوَدَتْنِي عَن نَّفْسِي ۚ وَشَهِدَ شَاهِدٌ مِّنْ أَهْلِهَا إِن كَانَ قَمِيصُهُ قُدَّ مِن قُبُلٍ فَصَدَقَتْ وَهُوَ مِنَ الْكَاذِبِينَ","text_tajweed":"قَالَ هِىَ ر[n[َٲ]وَدَتْنِى ع[a:6615[َن ن]َّفْسِى‌ۚ وَشَهِدَ شَاهِ[a:6616[دٌ م]ِّنْ أَهْلِه[o[َآ] إِ[f:2594[ن ك]َانَ قَمِيصُهُ[n[ۥ] قُدَّ مِ[f:6617[ن ق]ُبُ[f:6618[لٍ ف]َصَدَقَتْ وَهُوَ مِنَ [h:4785[ٱ]لْكَ[n[ـٰ]ذِب[p[ِي]نَ","translation_en":"He said: She sought to make me yield (to her); and a witness of her own family bore witness: If his shirt is rent from front, she speaks the truth and he is one of the liars:","translation_id":"Dia (Yusuf) berkata, “Dia yang menggodaku dan merayu diriku.” Seorang saksi dari keluarga perempuan itu memberikan kesaksian, “Jika baju gamisnya koyak di bagian depan, maka perempuan itu benar, dan dia (Yusuf) termasuk orang yang dusta.","hasanah_per_verse":680},{"text_madani":"وَإِن كَانَ قَمِيصُهُ قُدَّ مِن دُبُرٍ فَكَذَبَتْ وَهُوَ مِنَ الصَّادِقِينَ","text_tajweed":"وَإِ[f:1649[ن ك]َانَ قَمِيصُهُ[n[ۥ] قُدَّ مِ[f:6611[ن د]ُبُ[f:6619[رٍ ف]َكَذَبَتْ وَهُوَ مِنَ [h:4793[ٱ][l[ل]صَّ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"And if his shirt is rent from behind, she tells a lie and he is one of the truthful.","translation_id":"Dan jika baju gamisnya koyak di bagian belakang, maka perempuan itulah yang dusta, dan dia (Yusuf) termasuk orang yang benar.”","hasanah_per_verse":360},{"text_madani":"فَلَمَّا رَأَىٰ قَمِيصَهُ قُدَّ مِن دُبُرٍ قَالَ إِنَّهُ مِن كَيْدِكُنَّ ۖ إِنَّ كَيْدَكُنَّ عَظِيمٌ","text_tajweed":"فَلَ[g[مّ]َا رَءَا قَمِيصَهُ[n[ۥ] قُدَّ مِ[f:6611[ن د]ُبُ[f:6620[رٍ ق]َالَ إِ[g[نّ]َهُ[n[ۥ] مِ[f:6621[ن ك]َيْدِكُ[g[نّ]َ‌ۖ إِ[g[نّ]َ كَيْدَكُ[g[نّ]َ عَظ[p[ِي]مٌ","translation_en":"So when he saw his shirt rent from behind, he said: Surely it is a guile of you women; surely your guile is great:","translation_id":"Maka ketika dia (suami perempuan itu) melihat baju gamisnya (Yusuf) koyak di bagian belakang, dia berkata, “Sesungguhnya ini adalah tipu dayamu. Tipu dayamu benar-benar hebat.”","hasanah_per_verse":430},{"text_madani":"يُوسُفُ أَعْرِضْ عَنْ هَٰذَا ۚ وَاسْتَغْفِرِي لِذَنبِكِ ۖ إِنَّكِ كُنتِ مِنَ الْخَاطِئِينَ","text_tajweed":"يُوسُفُ أَعْرِضْ عَنْ هَ[n[ـٰ]ذَا‌ۚ وَ[h:6622[ٱ]سْتَغْفِرِى لِذَ[i:6623[نۢب]ِكِ‌ۖ إِ[g[نّ]َكِ كُ[f:6624[نت]ِ مِنَ [h:6625[ٱ]لْخَاطِــٔ[p[ِي]نَ","translation_en":"O Yusuf! turn aside from this; and (O my wife)! ask forgiveness for your fault, surely you are one of the wrong-doers.","translation_id":"Wahai Yusuf! ”Lupakanlah ini, dan (istriku) mohonlah ampunan atas dosamu, karena engkau termasuk orang yang bersalah.”","hasanah_per_verse":420},{"text_madani":"وَقَالَ نِسْوَةٌ فِي الْمَدِينَةِ امْرَأَتُ الْعَزِيزِ تُرَاوِدُ فَتَاهَا عَن نَّفْسِهِ ۖ قَدْ شَغَفَهَا حُبًّا ۖ إِنَّا لَنَرَاهَا فِي ضَلَالٍ مُّبِينٍ","text_tajweed":"۞ وَقَالَ نِسْوَ[f:6626[ةٌ ف]ِى [h:4932[ٱ]لْمَدِينَةِ [h:6627[ٱ]مْرَأَتُ [h:6628[ٱ]لْعَزِيزِ تُر[n[َٲ]وِدُ فَتَ[n[ـٰ]هَا ع[a:5890[َن ن]َّفْسِه[n[ِۦ]‌ۖ قَ[q:298[دْ] شَغَفَهَا حُبًّا‌ۖ إِ[g[نّ]َا لَنَرَ[n[ٮٰ]هَا فِى ضَلَ[n[ـٰ][a:2393[لٍ م]ُّب[p[ِي]نٍ","translation_en":"And women in the city said: The chiefs wife seeks her slave to yield himself (to her), surely he has affected her deeply with (his) love; most surely we see her in manifest error.","translation_id":"Dan perempuan-perempuan di kota berkata, “Istri Al-Aziz menggoda dan merayu pelayannya untuk menundukkan dirinya, pelayannya benar-benar membuatnya mabuk cinta. Kami pasti memandang dia dalam kesesatan yang nyata.”","hasanah_per_verse":730},{"text_madani":"فَلَمَّا سَمِعَتْ بِمَكْرِهِنَّ أَرْسَلَتْ إِلَيْهِنَّ وَأَعْتَدَتْ لَهُنَّ مُتَّكَأً وَآتَتْ كُلَّ وَاحِدَةٍ مِّنْهُنَّ سِكِّينًا وَقَالَتِ اخْرُجْ عَلَيْهِنَّ ۖ فَلَمَّا رَأَيْنَهُ أَكْبَرْنَهُ وَقَطَّعْنَ أَيْدِيَهُنَّ وَقُلْنَ حَاشَ لِلَّهِ مَا هَٰذَا بَشَرًا إِنْ هَٰذَا إِلَّا مَلَكٌ كَرِيمٌ","text_tajweed":"فَلَ[g[مّ]َا سَمِعَتْ بِمَكْرِهِ[g[نّ]َ أَرْسَلَتْ إِلَيْهِ[g[نّ]َ وَأَعْتَدَتْ لَهُ[g[نّ]َ مُتَّكَـ[a:6629[ـًٔا و]َءَاتَتْ كُلَّ و[n[َٲ]حِدَ[a:6630[ةٍ م]ِّنْهُ[g[نّ]َ سِكِّي[a:6631[نًا و]َقَالَتِ [h:6632[ٱ]خْرُ[q:4615[جْ] عَلَيْهِ[g[نّ]َ‌ۖ فَلَ[g[مّ]َا رَأَيْنَهُ[o[ۥٓ] أَكْبَرْنَهُ[n[ۥ] وَقَطَّعْنَ أَيْدِيَهُ[g[نّ]َ وَقُلْنَ حَ[n[ـٰ]شَ لِلَّهِ مَا هَ[n[ـٰ]ذَا بَشَرًا إِنْ هَ[n[ـٰ]ذ[o[َآ] إِلَّا مَلَ[f:6633[كٌ ك]َر[p[ِي]مٌ","translation_en":"So when she heard of their sly talk she sent for them and prepared for them a repast, and gave each of them a knife, and said (to Yusuf): Come forth to them. So when they saw him, they deemed him great, and cut their hands (in amazement), and said: Remote is Allah (from inperfection); this is not a mortal; this is but a noble angel.","translation_id":"Maka ketika perempuan itu mendengar cercaan mereka, diundangnyalah perempuan-perempuan itu dan disediakannya tempat duduk bagi mereka, dan kepada masing-masing mereka diberikan sebuah pisau (untuk memotong jamuan), kemudian dia berkata (kepada Yusuf), “Keluarlah (tampakkanlah dirimu) kepada mereka.” Ketika perempuan-perempuan itu melihatnya, mereka terpesona kepada (keelokan rupa)nya, dan mereka (tanpa sadar) melukai tangannya sendiri. Seraya berkata, “Mahasempurna Allah, ini bukanlah manusia. Ini benar-benar malaikat yang mulia.”","hasanah_per_verse":1310},{"text_madani":"قَالَتْ فَذَٰلِكُنَّ الَّذِي لُمْتُنَّنِي فِيهِ ۖ وَلَقَدْ رَاوَدتُّهُ عَن نَّفْسِهِ فَاسْتَعْصَمَ ۖ وَلَئِن لَّمْ يَفْعَلْ مَا آمُرُهُ لَيُسْجَنَنَّ وَلَيَكُونًا مِّنَ الصَّاغِرِينَ","text_tajweed":"قَالَتْ فَذ[n[َٲ]لِكُ[g[نّ]َ [h:6634[ٱ]لَّذِى لُمْتُ[g[نّ]َنِى فِيهِ‌ۖ وَلَقَ[q:341[دْ] ر[n[َٲ]وَ[d:6635[د]تُّهُ[n[ۥ] ع[a:5890[َن ن]َّفْسِه[n[ِۦ] فَ[h:6636[ٱ]سْتَعْصَمَ‌ۖ وَلَئ[u:6637[ِن ل]َّمْ يَفْعَلْ م[o[َآ] ءَامُرُهُ[n[ۥ] لَيُسْجَنَ[g[نّ]َ وَلَيَكُو[a:6638[نًا م]ِّنَ [h:4604[ٱ][l[ل]صَّ[n[ـٰ]غِر[p[ِي]نَ","translation_en":"She said: This is he with respect to whom you blamed me, and certainly I sought his yielding himself (to me), but he abstained, and if he does not do what I bid him, he shall certainly be imprisoned, and he shall certainly be of those who are in a state of ignominy.","translation_id":"Dia (istri Al-Aziz) berkata, “Itulah orangnya yang menyebabkan kamu mencela aku karena (aku tertarik) kepadanya, dan sungguh, aku telah menggoda untuk menundukkan dirinya tetapi dia menolak. Jika dia tidak melakukan apa yang aku perintahkan kepadanya, niscaya dia akan dipenjarakan, dan dia akan menjadi orang yang hina.”","hasanah_per_verse":840},{"text_madani":"قَالَ رَبِّ السِّجْنُ أَحَبُّ إِلَيَّ مِمَّا يَدْعُونَنِي إِلَيْهِ ۖ وَإِلَّا تَصْرِفْ عَنِّي كَيْدَهُنَّ أَصْبُ إِلَيْهِنَّ وَأَكُن مِّنَ الْجَاهِلِينَ","text_tajweed":"قَالَ رَبِّ [h:6639[ٱ][l[ل]سِّ[q:6640[جْ]نُ أَحَبُّ إِلَىَّ مِ[g[مّ]َا يَ[q:6641[دْ]عُونَن[o[ِىٓ] إِلَيْهِ‌ۖ وَإِلَّا تَصْرِفْ عَ[g[نّ]ِى كَيْدَهُ[g[نّ]َ أَصْبُ إِلَيْهِ[g[نّ]َ وَأَك[a:6642[ُن م]ِّنَ [h:352[ٱ]لْجَ[n[ـٰ]هِل[p[ِي]نَ","translation_en":"He said: My Lord! the prison house is dearer to me than that to which they invite me; and if Thou turn not away their device from me, I will yearn towards them and become (one) of the ignorant.","translation_id":"Yusuf berkata, “Wahai Tuhanku! Penjara lebih aku sukai daripada memenuhi ajakan mereka. Jika aku tidak Engkau hindarkan dari tipu daya mereka, niscaya aku akan cenderung untuk (memenuhi keinginan mereka) dan tentu aku termasuk orang yang bodoh.”","hasanah_per_verse":680},{"text_madani":"فَاسْتَجَابَ لَهُ رَبُّهُ فَصَرَفَ عَنْهُ كَيْدَهُنَّ ۚ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ","text_tajweed":"فَ[h:9999[ٱ]سْتَجَابَ لَهُ[n[ۥ] رَبُّهُ[n[ۥ] فَصَرَفَ عَنْهُ كَيْدَهُ[g[نّ]َ‌ۚ إِ[g[نّ]َهُ[n[ۥ] هُوَ [h:3721[ٱ][l[ل]سَّمِيعُ [h:669[ٱ]لْعَل[p[ِي]مُ","translation_en":"Thereupon his Lord accepted his prayer and turned away their guile from him; surely He is the Hearing, the Knowing.","translation_id":"Maka Tuhan memperkenankan doa Yusuf, dan Dia menghindarkan Yusuf dari tipu daya mereka. Dialah Yang Maha Mendengar, Maha Mengetahui.","hasanah_per_verse":410},{"text_madani":"ثُمَّ بَدَا لَهُم مِّن بَعْدِ مَا رَأَوُا الْآيَاتِ لَيَسْجُنُنَّهُ حَتَّىٰ حِينٍ","text_tajweed":"ثُ[g[مّ]َ بَدَا لَه[w:1812[ُم م]ّ[i:146[ِنۢ ب]َعْدِ مَا رَأَوُ[s[اْ] [h:6643[ٱ]لْأَيَ[n[ـٰ]تِ لَيَسْجُنُ[g[نّ]َهُ[n[ۥ] حَتَّىٰ ح[p[ِي]نٍ","translation_en":"Then it occurred to them after they had seen the signs that they should imprison him till a time.","translation_id":"Kemudian timbul pikiran pada mereka setelah melihat tanda-tanda (kebenaran Yusuf) bahwa mereka harus memenjarakannya sampai waktu tertentu.","hasanah_per_verse":380},{"text_madani":"وَدَخَلَ مَعَهُ السِّجْنَ فَتَيَانِ ۖ قَالَ أَحَدُهُمَا إِنِّي أَرَانِي أَعْصِرُ خَمْرًا ۖ وَقَالَ الْآخَرُ إِنِّي أَرَانِي أَحْمِلُ فَوْقَ رَأْسِي خُبْزًا تَأْكُلُ الطَّيْرُ مِنْهُ ۖ نَبِّئْنَا بِتَأْوِيلِهِ ۖ إِنَّا نَرَاكَ مِنَ الْمُحْسِنِينَ","text_tajweed":"وَدَخَلَ مَعَهُ [h:6644[ٱ][l[ل]سِّ[q:6645[جْ]نَ فَتَيَانِ‌ۖ قَالَ أَحَدُهُم[o[َآ] إِ[g[نّ][o[ِىٓ] أَرَ[n[ٮٰ]ن[o[ِىٓ] أَعْصِرُ خَمْ[a:6646[رًا‌ۖ و]َقَالَ [h:6647[ٱ]لْأَخَرُ إِ[g[نّ][o[ِىٓ] أَرَ[n[ٮٰ]ن[o[ِىٓ] أَحْمِلُ فَوْقَ رَأْسِى خُ[q:6648[بْ][f:6649[زًا ت]َأْكُلُ [h:6650[ٱ][l[ل]طَّيْرُ مِنْهُ‌ۖ نَبِّئْنَا بِتَأْوِيلِه[o[ِۦٓ‌ۖ] إِ[g[نّ]َا نَرَ[n[ٮٰ]كَ مِنَ [h:4754[ٱ]لْمُحْسِن[p[ِي]نَ","translation_en":"And two youths entered the prison with him. One of them said: I saw myself pressing wine. And the other said: I saw myself carrying bread on my head, of which birds ate. Inform us of its interpretation; surely we see you to be of the doers of good.","translation_id":"Dan bersama dia masuk pula dua orang pemuda ke dalam penjara. Salah satunya berkata, “Sesungguhnya aku bermimpi memeras anggur,” dan yang lainnya berkata, “Aku bermimpi, membawa roti di atas kepalaku, sebagiannya dimakan burung.” Berikanlah kepada kami takwilnya. Sesungguhnya kami memandangmu termasuk orang yang berbuat baik.","hasanah_per_verse":1150},{"text_madani":"قَالَ لَا يَأْتِيكُمَا طَعَامٌ تُرْزَقَانِهِ إِلَّا نَبَّأْتُكُمَا بِتَأْوِيلِهِ قَبْلَ أَن يَأْتِيَكُمَا ۚ ذَٰلِكُمَا مِمَّا عَلَّمَنِي رَبِّي ۚ إِنِّي تَرَكْتُ مِلَّةَ قَوْمٍ لَّا يُؤْمِنُونَ بِاللَّهِ وَهُم بِالْآخِرَةِ هُمْ كَافِرُونَ","text_tajweed":"قَالَ لَا يَأْتِيكُمَا طَعَا[f:6651[مٌ ت]ُرْزَقَانِه[o[ِۦٓ] إِلَّا نَبَّأْتُكُمَا بِتَأْوِيلِه[n[ِۦ] قَ[q:3282[بْ]لَ أ[a:6652[َن ي]َأْتِيَكُمَا‌ۚ ذ[n[َٲ]لِكُمَا مِ[g[مّ]َا عَلَّمَنِى رَبّ[o[ِىٓ‌ۚ] إِ[g[نّ]ِى تَرَكْتُ مِلَّةَ قَوْ[u:6210[مٍ ل]َّا يُؤْمِنُونَ بِ[h:32[ٱ]للَّهِ وَه[c:4710[ُم ب]ِ[h:447[ٱ]لْأَخِرَةِ هُمْ كَ[n[ـٰ]فِر[p[ُو]نَ","translation_en":"He said: There shall not come to you the food with which you are fed, but I will inform you both of its interpretation before it comes to you; this is of what my Lord has taught me; surely I have forsaken the religion of a people who do not believe in Allah, and they are deniers of the hereafter:","translation_id":"Dia (Yusuf) berkata, “Makanan apa pun yang akan diberikan kepadamu berdua aku telah dapat menerangkan takwilnya, sebelum (makanan) itu sampai kepadamu. Itu sebagian dari yang diajarkan Tuhan kepadaku. Sesungguhnya aku telah meninggalkan agama orang-orang yang tidak beriman kepada Allah, bahkan mereka tidak percaya kepada hari akhirat.","hasanah_per_verse":1120},{"text_madani":"وَاتَّبَعْتُ مِلَّةَ آبَائِي إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ ۚ مَا كَانَ لَنَا أَن نُّشْرِكَ بِاللَّهِ مِن شَيْءٍ ۚ ذَٰلِكَ مِن فَضْلِ اللَّهِ عَلَيْنَا وَعَلَى النَّاسِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَشْكُرُونَ","text_tajweed":"وَ[h:9999[ٱ]تَّبَعْتُ مِلَّةَ ءَاب[o[َا]ٓء[o[ِىٓ] إِ[q:1860[بْ]ر[n[َٲ]هِيمَ وَإِسْحَ[n[ـٰ]قَ وَيَعْقُوبَ‌ۚ مَا كَانَ لَن[o[َآ] أ[a:6653[َن ن]ُّشْرِكَ بِ[h:32[ٱ]للَّهِ مِ[f:2103[ن ش][f:6654[َىْءٍ‌ۚ ذ][n[َٲ]لِكَ مِ[f:6655[ن ف]َضْلِ [h:6656[ٱ]للَّهِ عَلَيْنَا وَعَلَى [h:6657[ٱ][l[ل][g[نّ]َاسِ وَلَ[n[ـٰ]كِ[g[نّ]َ أَكْثَرَ [h:1374[ٱ][l[ل][g[نّ]َاسِ لَا يَشْكُر[p[ُو]نَ","translation_en":"And I follow the religion of my fathers, Ibrahim and Ishaq and Yaqoub; it beseems us not that we should associate aught with Allah; this is by Allah's grace upon us and on mankind, but most people do not give thanks:","translation_id":"Dan aku mengikuti agama nenek moyangku: Ibrahim, Ishak dan Yakub. Tidak pantas bagi kami (para nabi) mempersekutukan sesuatu apa pun dengan Allah. Itu adalah dari karunia Allah kepada kami dan kepada manusia (semuanya); tetapi kebanyakan manusia tidak bersyukur.","hasanah_per_verse":1040},{"text_madani":"يَا صَاحِبَيِ السِّجْنِ أَأَرْبَابٌ مُّتَفَرِّقُونَ خَيْرٌ أَمِ اللَّهُ الْوَاحِدُ الْقَهَّارُ","text_tajweed":"يَ[n[ـٰ]صَ[n[ـٰ]حِبَىِ [h:6658[ٱ][l[ل]سِّ[q:6659[جْ]نِ ءَأَرْبَا[a:6660[بٌ م]ُّتَفَرِّقُونَ خَيْرٌ أَمِ [h:717[ٱ]للَّهُ [h:6661[ٱ]لْو[n[َٲ]حِدُ [h:6662[ٱ]لْقَهّ[p[َا]رُ","translation_en":"O my two mates of the prison! are sundry lords better or Allah the One, the Supreme?","translation_id":"Wahai kedua penghuni penjara! Manakah yang baik, tuhan-tuhan yang bermacam-macam itu ataukah Allah Yang Maha Esa, Mahaperkasa?","hasanah_per_verse":460},{"text_madani":"مَا تَعْبُدُونَ مِن دُونِهِ إِلَّا أَسْمَاءً سَمَّيْتُمُوهَا أَنتُمْ وَآبَاؤُكُم مَّا أَنزَلَ اللَّهُ بِهَا مِن سُلْطَانٍ ۚ إِنِ الْحُكْمُ إِلَّا لِلَّهِ ۚ أَمَرَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ ۚ ذَٰلِكَ الدِّينُ الْقَيِّمُ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ","text_tajweed":"مَا تَعْبُدُونَ مِ[f:3136[ن د]ُونِه[o[ِۦٓ] إِلّ[o[َآ] أَسْم[o[َا]ٓ[f:6663[ءً س]َ[g[مّ]َيْتُمُوه[o[َآ] أَ[f:428[نت]ُمْ وَءَاب[o[َا]ٓؤُك[w:4796[ُم م]ّ[o[َآ] أَ[f:471[نز]َلَ [h:472[ٱ]للَّهُ بِهَا مِ[f:4798[ن س]ُلْطَ[n[ـٰ]نٍ‌ۚ إِنِ [h:4101[ٱ]لْحُكْمُ إِلَّا لِلَّهِ‌ۚ أَمَرَ أَلَّا تَعْبُد[o[ُوٓ][s[اْ] إِلّ[o[َآ] إِيَّاهُ‌ۚ ذ[n[َٲ]لِكَ [h:5569[ٱ][l[ل]دِّينُ [h:5570[ٱ]لْقَيِّمُ وَلَ[n[ـٰ]كِ[g[نّ]َ أَكْثَرَ [h:1374[ٱ][l[ل][g[نّ]َاسِ لَا يَعْلَم[p[ُو]نَ","translation_en":"You do not serve besides Him but names which you have named, you and your fathers; Allah has not sent down any authority for them; judgment is only Allah's; He has commanded that you shall not serve aught but Him; this is the right religion but most people do not know:","translation_id":"Apa yang kamu sembah selain Dia, hanyalah nama-nama yang kamu buat-buat baik oleh kamu sendiri maupun oleh nenek moyangmu. Allah tidak menurunkan suatu keterangan pun tentang hal (nama-nama) itu. Keputusan itu hanyalah milik Allah. Dia telah memerintahkan agar kamu tidak menyembah selain Dia. Itulah agama yang lurus, tetapi kebanyakan manusia tidak mengetahui.","hasanah_per_verse":1270},{"text_madani":"يَا صَاحِبَيِ السِّجْنِ أَمَّا أَحَدُكُمَا فَيَسْقِي رَبَّهُ خَمْرًا ۖ وَأَمَّا الْآخَرُ فَيُصْلَبُ فَتَأْكُلُ الطَّيْرُ مِن رَّأْسِهِ ۚ قُضِيَ الْأَمْرُ الَّذِي فِيهِ تَسْتَفْتِيَانِ","text_tajweed":"يَ[n[ـٰ]صَ[n[ـٰ]حِبَىِ [h:6658[ٱ][l[ل]سِّ[q:6659[جْ]نِ أَ[g[مّ][o[َآ] أَحَدُكُمَا فَيَسْقِى رَبَّهُ[n[ۥ] خَمْ[a:6664[رًا‌ۖ و]َأَ[g[مّ]َا [h:6665[ٱ]لْأَخَرُ فَيُصْلَبُ فَتَأْكُلُ [h:6666[ٱ][l[ل]طَّيْرُ م[u:1057[ِن ر]َّأْسِه[n[ِۦ]‌ۚ قُضِىَ [h:6667[ٱ]لْأَمْرُ [h:6668[ٱ]لَّذِى فِيهِ تَسْتَفْتِي[p[َا]نِ","translation_en":"O my two mates of the prison! as for one of you, he shall give his lord to drink wine; and as for the other, he shall be crucified, so that the birds shall eat from his head, the matter is decreed concerning which you inquired.","translation_id":"Wahai kedua penghuni penjara, “Salah seorang di antara kamu, akan bertugas menyediakan minuman khamar bagi tuannya. Adapun yang seorang lagi dia akan disalib, lalu burung memakan sebagian kepalanya. Telah terjawab perkara yang kamu tanyakan (kepadaku).”","hasanah_per_verse":860},{"text_madani":"وَقَالَ لِلَّذِي ظَنَّ أَنَّهُ نَاجٍ مِّنْهُمَا اذْكُرْنِي عِندَ رَبِّكَ فَأَنسَاهُ الشَّيْطَانُ ذِكْرَ رَبِّهِ فَلَبِثَ فِي السِّجْنِ بِضْعَ سِنِينَ","text_tajweed":"وَقَالَ لِلَّذِى ظَ[g[نّ]َ أَ[g[نّ]َهُ[n[ۥ] نَا[a:6669[جٍ م]ِّنْهُمَا [h:6670[ٱ]ذْكُرْنِى عِ[f:264[ند]َ رَبِّكَ فَأَ[f:6671[نس]َ[n[ـٰ]هُ [h:6672[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ ذِكْرَ رَبِّه[n[ِۦ] فَلَبِثَ فِى [h:6673[ٱ][l[ل]سِّ[q:6659[جْ]نِ بِضْعَ سِن[p[ِي]نَ","translation_en":"And he said to him whom he knew would be delivered of the two: Remember me with your lord; but the Shaitan caused him to forget mentioning (it) to his lord, so he remained in the prison a few years.","translation_id":"Dan dia (Yusuf) berkata kepada orang yang diketahuinya akan selamat di antara mereka berdua, “Terangkanlah keadaanku kepada tuanmu.” Maka setan menjadikan dia lupa untuk menerangkan (keadaan Yusuf) kepada tuannya. Karena itu dia (Yusuf) tetap dalam penjara beberapa tahun lamanya.","hasanah_per_verse":700},{"text_madani":"وَقَالَ الْمَلِكُ إِنِّي أَرَىٰ سَبْعَ بَقَرَاتٍ سِمَانٍ يَأْكُلُهُنَّ سَبْعٌ عِجَافٌ وَسَبْعَ سُنبُلَاتٍ خُضْرٍ وَأُخَرَ يَابِسَاتٍ ۖ يَا أَيُّهَا الْمَلَأُ أَفْتُونِي فِي رُؤْيَايَ إِن كُنتُمْ لِلرُّؤْيَا تَعْبُرُونَ","text_tajweed":"وَقَالَ [h:6674[ٱ]لْمَلِكُ إِ[g[نّ][o[ِىٓ] أَرَىٰ سَ[q:158[بْ]عَ بَقَر[n[َٲ][f:6675[تٍ س]ِمَا[a:6676[نٍ ي]َأْكُلُهُ[g[نّ]َ سَ[q:6677[بْ]عٌ عِجَا[a:6678[فٌ و]َسَ[q:6679[بْ]عَ سُ[i:6680[نۢب]ُلَ[n[ـٰ]تٍ خُضْ[a:6681[رٍ و]َأُخَرَ يَابِسَ[n[ـٰ][a:6682[تٍ‌ۖ ي]َ[o[ـٰٓ]أَيُّهَا [h:6683[ٱ]لْمَلَأُ أَفْتُونِى فِى رُءْيَ[n[ـٰ]ىَ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ لِلرُّءْيَا تَعْبُر[p[ُو]نَ","translation_en":"And the king said: Surely I see seven fat kine which seven lean ones devoured; and seven green ears and (seven) others dry: O chiefs! explain to me my dream, if you can interpret the dream.","translation_id":"Dan raja berkata (kepada para pemuka kaumnya), “Sesungguhnya aku bermimpi melihat tujuh ekor sapi betina yang gemuk dimakan oleh tujuh ekor sapi betina yang kurus; tujuh tangkai (gandum) yang hijau dan (tujuh tangkai) lainnya yang kering. Wahai orang yang terkemuka! Terangkanlah kepadaku tentang takwil mimpiku itu jika kamu dapat menakwilkan mimpi.”","hasanah_per_verse":1050},{"text_madani":"قَالُوا أَضْغَاثُ أَحْلَامٍ ۖ وَمَا نَحْنُ بِتَأْوِيلِ الْأَحْلَامِ بِعَالِمِينَ","text_tajweed":"قَال[o[ُوٓ][s[اْ] أَضْغَ[n[ـٰ]ثُ أَحْلَ[n[ـٰ][a:6684[مٍ‌ۖ و]َمَا نَحْنُ بِتَأْوِيلِ [h:6685[ٱ]لْأَحْلَ[n[ـٰ]مِ بِعَ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"They said: Confused dreams, and we do not know the interpretation of dreams.","translation_id":"Mereka menjawab, “(Itu) mimpi-mimpi yang kosong dan kami tidak mampu menakwilkan mimpi itu.”","hasanah_per_verse":410},{"text_madani":"وَقَالَ الَّذِي نَجَا مِنْهُمَا وَادَّكَرَ بَعْدَ أُمَّةٍ أَنَا أُنَبِّئُكُم بِتَأْوِيلِهِ فَأَرْسِلُونِ","text_tajweed":"وَقَالَ [h:6593[ٱ]لَّذِى نَجَا مِنْهُمَا وَ[h:6686[ٱ]دَّكَرَ بَعْدَ أُ[g[مّ]َةٍ أَنَا۟ أُنَبِّئُك[c:6687[ُم ب]ِتَأْوِيلِه[n[ِۦ] فَأَرْسِل[p[ُو]نِ","translation_en":"And of the two (prisoners) he who had found deliverance and remembered after a long time said: I will inform you of its interpretation, so let me go:","translation_id":"Dan berkatalah orang yang selamat di antara mereka berdua dan teringat (kepada Yusuf) setelah beberapa waktu lamanya, “Aku akan memberitahukan kepadamu tentang (orang yang pandai) menakwilkan mimpi itu, maka utuslah aku (kepadanya).”","hasanah_per_verse":500},{"text_madani":"يُوسُفُ أَيُّهَا الصِّدِّيقُ أَفْتِنَا فِي سَبْعِ بَقَرَاتٍ سِمَانٍ يَأْكُلُهُنَّ سَبْعٌ عِجَافٌ وَسَبْعِ سُنبُلَاتٍ خُضْرٍ وَأُخَرَ يَابِسَاتٍ لَّعَلِّي أَرْجِعُ إِلَى النَّاسِ لَعَلَّهُمْ يَعْلَمُونَ","text_tajweed":"يُوسُفُ أَيُّهَا [h:6688[ٱ][l[ل]صِّدِّيقُ أَفْتِنَا فِى سَ[q:6689[بْ]عِ بَقَر[n[َٲ][f:6675[تٍ س]ِمَا[a:6676[نٍ ي]َأْكُلُهُ[g[نّ]َ سَ[q:6677[بْ]عٌ عِجَا[a:6690[فٌ و]َسَ[q:6691[بْ]عِ سُ[i:6680[نۢب]ُلَ[n[ـٰ]تٍ خُضْ[a:6681[رٍ و]َأُخَرَ يَابِسَ[n[ـٰ][u:6692[تٍ ل]َّعَلّ[o[ِىٓ] أَرْجِعُ إِلَى [h:5455[ٱ][l[ل][g[نّ]َاسِ لَعَلَّهُمْ يَعْلَم[p[ُو]نَ","translation_en":"Yusuf! O truthful one! explain to us seven fat kine which seven lean ones devoured, and seven green ears and (seven) others dry, that I may go back to the people so that they may know.","translation_id":"”Yusuf, wahai orang yang sangat dipercaya! Terangkanlah kepada kami (takwil mimpi) tentang tujuh ekor sapi betina yang gemuk yang dimakan oleh tujuh (ekor sapi betina) yang kurus, tujuh tangkai (gandum) yang hijau dan (tujuh tangkai) lainnya yang kering agar aku kembali kepada orang-orang itu, agar mereka mengetahui.”","hasanah_per_verse":960},{"text_madani":"قَالَ تَزْرَعُونَ سَبْعَ سِنِينَ دَأَبًا فَمَا حَصَدتُّمْ فَذَرُوهُ فِي سُنبُلِهِ إِلَّا قَلِيلًا مِّمَّا تَأْكُلُونَ","text_tajweed":"قَالَ تَزْرَعُونَ سَ[q:158[بْ]عَ سِنِينَ دَأَ[f:6693[بًا ف]َمَا حَصَ[d:6694[د]تُّمْ فَذَرُوهُ فِى سُ[i:6695[نۢب]ُلِه[o[ِۦٓ] إِلَّا قَلِيل[a:6696[اً م]ِّ[g[مّ]َا تَأْكُل[p[ُو]نَ","translation_en":"He said: You shall sow for seven years continuously, then what you reap leave it in its ear except a little of which you eat.","translation_id":"Dia (Yusuf) berkata, “Agar kamu bercocok tanam tujuh tahun (berturut-turut) sebagaimana biasa; kemudian apa yang kamu tuai hendaklah kamu biarkan di tangkainya kecuali sedikit untuk kamu makan.","hasanah_per_verse":570},{"text_madani":"ثُمَّ يَأْتِي مِن بَعْدِ ذَٰلِكَ سَبْعٌ شِدَادٌ يَأْكُلْنَ مَا قَدَّمْتُمْ لَهُنَّ إِلَّا قَلِيلًا مِّمَّا تُحْصِنُونَ","text_tajweed":"ثُ[g[مّ]َ يَأْتِى م[i:146[ِنۢ ب]َعْدِ ذ[n[َٲ]لِكَ سَ[q:6677[بْ][f:6697[عٌ ش]ِدَا[a:6698[دٌ ي]َأْكُلْنَ مَا قَدَّمْتُمْ لَهُ[g[نّ]َ إِلَّا قَلِيل[a:6696[اً م]ِّ[g[مّ]َا تُحْصِن[p[ُو]نَ","translation_en":"Then there shall come after that seven years of hardship which shall eat away all that you have beforehand laid up in store for them, except a little of what you shall have preserved:","translation_id":"Kemudian setelah itu akan datang tujuh (tahun) yang sangat sulit, yang menghabiskan apa yang kamu simpan untuk menghadapinya (tahun sulit), kecuali sedikit dari apa (bibit gandum) yang kamu simpan.","hasanah_per_verse":530},{"text_madani":"ثُمَّ يَأْتِي مِن بَعْدِ ذَٰلِكَ عَامٌ فِيهِ يُغَاثُ النَّاسُ وَفِيهِ يَعْصِرُونَ","text_tajweed":"ثُ[g[مّ]َ يَأْتِى م[i:146[ِنۢ ب]َعْدِ ذ[n[َٲ]لِكَ عَا[f:6699[مٌ ف]ِيهِ يُغَاثُ [h:6700[ٱ][l[ل][g[نّ]َاسُ وَفِيهِ يَعْصِر[p[ُو]نَ","translation_en":"Then there will come after that a year in which people shall have rain and in which they shall press (grapes).","translation_id":"Setelah itu akan datang tahun, di mana manusia diberi hujan (dengan cukup) dan pada masa itu mereka memeras (anggur).”","hasanah_per_verse":390},{"text_madani":"وَقَالَ الْمَلِكُ ائْتُونِي بِهِ ۖ فَلَمَّا جَاءَهُ الرَّسُولُ قَالَ ارْجِعْ إِلَىٰ رَبِّكَ فَاسْأَلْهُ مَا بَالُ النِّسْوَةِ اللَّاتِي قَطَّعْنَ أَيْدِيَهُنَّ ۚ إِنَّ رَبِّي بِكَيْدِهِنَّ عَلِيمٌ","text_tajweed":"وَقَالَ [h:6674[ٱ]لْمَلِكُ [h:6701[ٱ]ئْتُونِى بِه[n[ِۦ]‌ۖ فَلَ[g[مّ]َا ج[o[َا]ٓءَهُ [h:6702[ٱ][l[ل]رَّسُولُ قَالَ [h:6703[ٱ]رْجِعْ إِلَىٰ رَبِّكَ فَسْــَٔلْهُ مَا بَالُ [h:6704[ٱ][l[ل][g[نّ]ِسْوَةِ [h:6705[ٱ]لَّ[n[ـٰ]تِى قَطَّعْنَ أَيْدِيَهُ[g[نّ]َ‌ۚ إِ[g[نّ]َ رَبِّى بِكَيْدِهِ[g[نّ]َ عَل[p[ِي]مٌ","translation_en":"And the king said: Bring him to me. So when the messenger came to him, he said: Go back to your lord and ask him, what is the case of the women who cut their hands; surely my Lord knows their guile.","translation_id":"Dan raja berkata, “Bawalah dia kepadaku.” Ketika utusan itu datang kepadanya, dia (Yusuf) berkata, “Kembalilah kepada tuanmu dan tanyakan kepadanya bagaimana halnya perempuan-perempuan yang telah melukai tangannya. Sungguh, Tuhanku Maha Mengetahui tipu daya mereka.”","hasanah_per_verse":920},{"text_madani":"قَالَ مَا خَطْبُكُنَّ إِذْ رَاوَدتُّنَّ يُوسُفَ عَن نَّفْسِهِ ۚ قُلْنَ حَاشَ لِلَّهِ مَا عَلِمْنَا عَلَيْهِ مِن سُوءٍ ۚ قَالَتِ امْرَأَتُ الْعَزِيزِ الْآنَ حَصْحَصَ الْحَقُّ أَنَا رَاوَدتُّهُ عَن نَّفْسِهِ وَإِنَّهُ لَمِنَ الصَّادِقِينَ","text_tajweed":"قَالَ مَا خَ[q:6706[طْ]بُكُ[g[نّ]َ إِذْ ر[n[َٲ]وَ[d:6707[د]تُّ[g[نّ]َ يُوسُفَ ع[a:5890[َن ن]َّفْسِه[n[ِۦ]‌ۚ قُلْنَ حَ[n[ـٰ]شَ لِلَّهِ مَا عَلِمْنَا عَلَيْهِ مِ[f:1847[ن س][o[ُو]ٓ[f:6708[ءٍ‌ۚ ق]َالَتِ [h:1864[ٱ]مْرَأَتُ [h:6628[ٱ]لْعَزِيزِ [h:6709[ٱ]لْـَٔ[n[ـٰ]نَ حَصْحَصَ [h:6710[ٱ]لْحَقُّ أَنَا۟ ر[n[َٲ]وَ[d:6635[د]تُّهُ[n[ۥ] ع[a:5890[َن ن]َّفْسِه[n[ِۦ] وَإِ[g[نّ]َهُ[n[ۥ] لَمِنَ [h:6711[ٱ][l[ل]صَّ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"He said: How was your affair when you sought Yusuf to yield himself (to you)? They said: Remote is Allah (from imperfection), we knew of no evil on his part. The chief's wife said: Now has the truth become established: I sought him to yield himself (to me), and he is most surely of the truthful ones.","translation_id":"Dia (raja) berkata (kepada perempuan-perempuan itu), “Bagaimana keadaanmu ketika kamu menggoda Yusuf untuk menundukkan dirinya?” Mereka berkata, “Mahasempurna Allah, kami tidak mengetahui sesuatu keburukan darinya.” Istri Al-Aziz berkata, “Sekarang jelaslah kebenaran itu, akulah yang menggoda dan merayunya, dan sesungguhnya dia termasuk orang yang benar.”","hasanah_per_verse":1100},{"text_madani":"ذَٰلِكَ لِيَعْلَمَ أَنِّي لَمْ أَخُنْهُ بِالْغَيْبِ وَأَنَّ اللَّهَ لَا يَهْدِي كَيْدَ الْخَائِنِينَ","text_tajweed":"ذ[n[َٲ]لِكَ لِيَعْلَمَ أَ[g[نّ]ِى لَمْ أَخُنْهُ بِ[h:13[ٱ]لْغَيْبِ وَأَ[g[نّ]َ [h:859[ٱ]للَّهَ لَا يَهْدِى كَيْدَ [h:6712[ٱ]لْخ[o[َا]ٓئِن[p[ِي]نَ","translation_en":"This is that he might know that I have not been unfaithful to him in secret and that Allah does not guide the device of the unfaithful.","translation_id":"(Yusuf berkata), “Yang demikian itu agar dia (Al-Aziz) mengetahui bahwa aku benar-benar tidak mengkhianatinya ketika dia tidak ada (di rumah), dan bahwa Allah tidak meridhai tipu daya orang-orang yang berkhianat.","hasanah_per_verse":470},{"text_madani":"وَمَا أُبَرِّئُ نَفْسِي ۚ إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ إِلَّا مَا رَحِمَ رَبِّي ۚ إِنَّ رَبِّي غَفُورٌ رَّحِيمٌ","text_tajweed":"۞ وَم[o[َآ] أُبَرِّئُ نَفْس[o[ِىٓ‌ۚ] إِ[g[نّ]َ [h:6713[ٱ][l[ل][g[نّ]َفْسَ لَأَ[g[مّ]َارَ[i:6714[ةُۢ ب]ِ[h:875[ٱ][l[ل]سّ[o[ُو]ٓءِ إِلَّا مَا رَحِمَ رَبّ[o[ِىٓ‌ۚ] إِ[g[نّ]َ رَبِّى غَفُو[u:890[رٌ ر]َّح[p[ِي]مٌ","translation_en":"And I do not declare myself free, most surely (man's) self is wont to command (him to do) evil, except such as my Lord has had mercy on, surely my Lord is Forgiving, Merciful.","translation_id":"Dan aku tidak (menyatakan) diriku bebas (dari kesalahan), karena sesungguhnya nafsu itu selalu mendorong kepada kejahatan, kecuali (nafsu) yang diberi rahmat oleh Tuhanku. Sesungguhnya Tuhanku Maha Pengampun, Maha Penyayang.","hasanah_per_verse":540},{"text_madani":"وَقَالَ الْمَلِكُ ائْتُونِي بِهِ أَسْتَخْلِصْهُ لِنَفْسِي ۖ فَلَمَّا كَلَّمَهُ قَالَ إِنَّكَ الْيَوْمَ لَدَيْنَا مَكِينٌ أَمِينٌ","text_tajweed":"وَقَالَ [h:6674[ٱ]لْمَلِكُ [h:6701[ٱ]ئْتُونِى بِه[o[ِۦٓ] أَسْتَخْلِصْهُ لِنَفْسِى‌ۖ فَلَ[g[مّ]َا كَلَّمَهُ[n[ۥ] قَالَ إِ[g[نّ]َكَ [h:6715[ٱ]لْيَوْمَ لَدَيْنَا مَكِينٌ أَم[p[ِي]نٌ","translation_en":"And the king said: Bring him to me, I will choose him for myself. So when he had spoken with him, he said: Surely you are in our presence today an honorable, a faithful one.","translation_id":"Dan raja berkata, “Bawalah dia (Yusuf) kepadaku, agar aku memilih dia (sebagai orang yang dekat) kepadaku.” Ketika dia (raja) telah bercakap-cakap dengan dia, dia (raja) berkata, “Sesungguhnya kamu (mulai) hari ini menjadi seorang yang berkedudukan tinggi di lingkungan kami dan dipercaya.”","hasanah_per_verse":610},{"text_madani":"قَالَ اجْعَلْنِي عَلَىٰ خَزَائِنِ الْأَرْضِ ۖ إِنِّي حَفِيظٌ عَلِيمٌ","text_tajweed":"قَالَ [h:6716[ٱ][q:6717[جْ]عَلْنِى عَلَىٰ خَز[o[َا]ٓئِنِ [h:6718[ٱ]لْأَرْضِ‌ۖ إِ[g[نّ]ِى حَفِيظٌ عَل[p[ِي]مٌ","translation_en":"He said: Place me (in authority) over the treasures of the land, surely I am a good keeper, knowing well.","translation_id":"Dia (Yusuf) berkata, “Jadikanlah aku bendaharawan negeri (Mesir); karena sesungguhnya aku adalah orang yang pandai menjaga, dan berpengetahuan.”","hasanah_per_verse":330},{"text_madani":"وَكَذَٰلِكَ مَكَّنَّا لِيُوسُفَ فِي الْأَرْضِ يَتَبَوَّأُ مِنْهَا حَيْثُ يَشَاءُ ۚ نُصِيبُ بِرَحْمَتِنَا مَن نَّشَاءُ ۖ وَلَا نُضِيعُ أَجْرَ الْمُحْسِنِينَ","text_tajweed":"وَكَذ[n[َٲ]لِكَ مَكَّ[g[نّ]َا لِيُوسُفَ فِى [h:44[ٱ]لْأَرْضِ يَتَبَوَّأُ مِنْهَا حَيْثُ يَش[o[َا]ٓءُ‌ۚ نُصِيبُ بِرَحْمَتِنَا م[a:4211[َن ن]َّش[o[َا]ٓءُ‌ۖ وَلَا نُضِيعُ أَ[q:2418[جْ]رَ [h:5898[ٱ]لْمُحْسِن[p[ِي]نَ","translation_en":"And thus did We give to Yusuf power in the land-- he had mastery in it wherever he liked; We send down Our mercy on whom We please, and We do not waste the reward of those who do good.","translation_id":"Dan demikianlah Kami memberi kedudukan kepada Yusuf di negeri ini (Mesir); untuk tinggal di mana saja yang dia kehendaki. Kami melimpahkan rahmat kepada siapa yang Kami kehendaki dan Kami tidak menyia-nyiakan pahala orang yang berbuat baik.","hasanah_per_verse":720},{"text_madani":"وَلَأَجْرُ الْآخِرَةِ خَيْرٌ لِّلَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ","text_tajweed":"وَلَأَ[q:6719[جْ]رُ [h:6720[ٱ]لْأَخِرَةِ خَيْ[u:4005[رٌ ل]ِّلَّذِينَ ءَامَنُو[s[اْ] وَكَانُو[s[اْ] يَتَّق[p[ُو]نَ","translation_en":"And certainly the reward of the hereafter is much better for those who believe and guard (against evil).","translation_id":"Dan sungguh, pahala akhirat itu lebih baik bagi orang-orang yang beriman dan selalu bertakwa.","hasanah_per_verse":350},{"text_madani":"وَجَاءَ إِخْوَةُ يُوسُفَ فَدَخَلُوا عَلَيْهِ فَعَرَفَهُمْ وَهُمْ لَهُ مُنكِرُونَ","text_tajweed":"وَج[o[َا]ٓءَ إِخْوَةُ يُوسُفَ فَدَخَلُو[s[اْ] عَلَيْهِ فَعَرَفَهُمْ وَهُمْ لَهُ[n[ۥ] مُ[f:6721[نك]ِر[p[ُو]نَ","translation_en":"And Yusuf's brothers came and went in to him, and he knew them, while they did not recognize him.","translation_id":"Dan saudara-saudara Yusuf datang (ke Mesir) lalu mereka masuk ke (tempat)nya. Maka dia (Yusuf) mengenal mereka, sedang mereka tidak mengenalinya (lagi) kepadanya.","hasanah_per_verse":390},{"text_madani":"وَلَمَّا جَهَّزَهُم بِجَهَازِهِمْ قَالَ ائْتُونِي بِأَخٍ لَّكُم مِّنْ أَبِيكُمْ ۚ أَلَا تَرَوْنَ أَنِّي أُوفِي الْكَيْلَ وَأَنَا خَيْرُ الْمُنزِلِينَ","text_tajweed":"وَلَ[g[مّ]َا جَهَّزَه[c:6722[ُم ب]ِجَهَازِهِمْ قَالَ [h:6723[ٱ]ئْتُونِى بِأَ[u:6724[خٍ ل]َّك[w:556[ُم م]ِّنْ أَبِيكُمْ‌ۚ أَلَا تَرَوْنَ أَ[g[نّ][o[ِىٓ] أُوفِى [h:6725[ٱ]لْكَيْلَ وَأَنَا۟ خَيْرُ [h:6726[ٱ]لْمُ[f:6727[نز]ِل[p[ِي]نَ","translation_en":"And when he furnished them with their provision, he said: Bring to me a brother of yours from your father; do you not see that I give full measure and that I am the best of hosts?","translation_id":"Dan ketika dia (Yusuf) menyiapkan bahan makanan untuk mereka, dia berkata, “Bawalah kepadaku saudaramu yang seayah dengan kamu (Bunyamin), tidakkah kamu melihat bahwa aku menyempurnakan takaran dan aku adalah penerima tamu yang terbaik?","hasanah_per_verse":720},{"text_madani":"فَإِن لَّمْ تَأْتُونِي بِهِ فَلَا كَيْلَ لَكُمْ عِندِي وَلَا تَقْرَبُونِ","text_tajweed":"فَإ[u:110[ِن ل]َّمْ تَأْتُونِى بِه[n[ِۦ] فَلَا كَيْلَ لَكُمْ عِ[f:4065[ند]ِى وَلَا تَ[q:6728[قْ]رَب[p[ُو]نِ","translation_en":"But if you do not bring him to me, you shall have no measure (of corn) from me, nor shall you come near me.","translation_id":"Maka jika kamu tidak membawanya kepadaku, maka kamu tidak akan mendapat jatah (gandum) lagi dariku dan jangan kamu mendekatiku.”","hasanah_per_verse":350},{"text_madani":"قَالُوا سَنُرَاوِدُ عَنْهُ أَبَاهُ وَإِنَّا لَفَاعِلُونَ","text_tajweed":"قَالُو[s[اْ] سَنُر[n[َٲ]وِدُ عَنْهُ أَبَاهُ وَإِ[g[نّ]َا لَفَ[n[ـٰ]عِل[p[ُو]نَ","translation_en":"They said: We will strive to make his father yield in respect of him, and we are sure to do (it).","translation_id":"Mereka berkata, “Kami akan membujuk ayahnya (untuk membawanya) dan kami benar-benar akan melaksanakannya.”","hasanah_per_verse":290},{"text_madani":"وَقَالَ لِفِتْيَانِهِ اجْعَلُوا بِضَاعَتَهُمْ فِي رِحَالِهِمْ لَعَلَّهُمْ يَعْرِفُونَهَا إِذَا انقَلَبُوا إِلَىٰ أَهْلِهِمْ لَعَلَّهُمْ يَرْجِعُونَ","text_tajweed":"وَقَالَ لِفِتْيَ[n[ـٰ]نِهِ [h:6729[ٱ][q:6730[جْ]عَلُو[s[اْ] بِضَ[n[ـٰ]عَتَهُمْ فِى رِحَالِهِمْ لَعَلَّهُمْ يَعْرِفُونَه[o[َآ] إِذَا [h:6731[ٱ][f:6732[نق]َلَب[o[ُوٓ][s[اْ] إِلَ[o[ىٰٓ] أَهْلِهِمْ لَعَلَّهُمْ يَرْجِع[p[ُو]نَ","translation_en":"And he said to his servants: Put their money into their bags that they may recognize it when they go back to their family, so that they may come back.","translation_id":"Dan dia (Yusuf) berkata kepada pelayan-pelayannya, “Masukkanlah barang-barang (penukar) mereka ke dalam karung-karungnya, agar mereka mengetahuinya apabila telah kembali kepada keluarganya, mudah-mudahan mereka kembali lagi.”","hasanah_per_verse":740},{"text_madani":"فَلَمَّا رَجَعُوا إِلَىٰ أَبِيهِمْ قَالُوا يَا أَبَانَا مُنِعَ مِنَّا الْكَيْلُ فَأَرْسِلْ مَعَنَا أَخَانَا نَكْتَلْ وَإِنَّا لَهُ لَحَافِظُونَ","text_tajweed":"فَلَ[g[مّ]َا رَجَع[o[ُوٓ][s[اْ] إِلَ[o[ىٰٓ] أَبِيهِمْ قَالُو[s[اْ] يَ[o[ـٰٓ]أَبَانَا مُنِعَ مِ[g[نّ]َا [h:6733[ٱ]لْكَيْلُ فَأَرْسِلْ مَعَن[o[َآ] أَخَانَا نَكْتَلْ وَإِ[g[نّ]َا لَهُ[n[ۥ] لَحَ[n[ـٰ]فِظ[p[ُو]نَ","translation_en":"So when they returned to their father, they said: O our father, the measure is withheld from us, therefore send with us our brother, (so that) we may get the measure, and we will most surely guard him.","translation_id":"Maka ketika mereka telah kembali kepada ayahnya (Yakub) mereka berkata, “Wahai ayah kami! Kami tidak akan mendapat jatah (gandum) lagi, (jika tidak membawa saudara kami), sebab itu biarkanlah saudara kami pergi bersama kami agar kami mendapat jatah, dan kami benar-benar akan menjaganya.”","hasanah_per_verse":710},{"text_madani":"قَالَ هَلْ آمَنُكُمْ عَلَيْهِ إِلَّا كَمَا أَمِنتُكُمْ عَلَىٰ أَخِيهِ مِن قَبْلُ ۖ فَاللَّهُ خَيْرٌ حَافِظًا ۖ وَهُوَ أَرْحَمُ الرَّاحِمِينَ","text_tajweed":"قَالَ هَلْ ءَامَنُكُمْ عَلَيْهِ إِلَّا كَم[o[َآ] أَمِ[f:6734[نت]ُكُمْ عَلَ[o[ىٰٓ] أَخِيهِ مِ[f:128[ن ق]َ[q:129[بْ]لُ‌ۖ فَ[h:591[ٱ]للَّهُ خَيْرٌ حَ[n[ـٰ]فِ[a:6735[ظًا‌ۖ و]َهُوَ أَرْحَمُ [h:5034[ٱ][l[ل]رّ[n[َٲ]حِم[p[ِي]نَ","translation_en":"He said: I cannot trust in you with respect to him, except as I trusted in you with respect to his brother before; but Allah is the best Keeper, and He is the most Merciful of the merciful ones.","translation_id":"Dia (Yakub) berkata, “Bagaimana aku akan mempercayakannya (Bunyamin) kepadamu, seperti aku telah mempercayakan saudaranya (Yusuf) kepada kamu dahulu?” Maka Allah adalah penjaga yang terbaik dan Dia Maha Penyayang di antara para penyayang.","hasanah_per_verse":660},{"text_madani":"وَلَمَّا فَتَحُوا مَتَاعَهُمْ وَجَدُوا بِضَاعَتَهُمْ رُدَّتْ إِلَيْهِمْ ۖ قَالُوا يَا أَبَانَا مَا نَبْغِي ۖ هَٰذِهِ بِضَاعَتُنَا رُدَّتْ إِلَيْنَا ۖ وَنَمِيرُ أَهْلَنَا وَنَحْفَظُ أَخَانَا وَنَزْدَادُ كَيْلَ بَعِيرٍ ۖ ذَٰلِكَ كَيْلٌ يَسِيرٌ","text_tajweed":"وَلَ[g[مّ]َا فَتَحُو[s[اْ] مَتَ[n[ـٰ]عَهُمْ وَجَدُو[s[اْ] بِضَ[n[ـٰ]عَتَهُمْ رُدَّتْ إِلَيْهِمْ‌ۖ قَالُو[s[اْ] يَ[o[ـٰٓ]أَبَانَا مَا نَ[q:6736[بْ]غِى‌ۖ هَ[n[ـٰ]ذِه[n[ِۦ] بِضَ[n[ـٰ]عَتُنَا رُدَّتْ إِلَيْنَا‌ۖ وَنَمِيرُ أَهْلَنَا وَنَحْفَظُ أَخَانَا وَنَزْدَادُ كَيْلَ بَعِي[f:6737[رٍ‌ۖ ذ][n[َٲ]لِكَ كَيْ[a:6738[لٌ ي]َس[p[ِي]رٌ","translation_en":"And when they opened their goods, they found their money returned to them. They said: O our father! what (more) can we desire? This is our property returned to us, and we will bring corn for our family and guard our brother, and will have in addition the measure of a camel (load); this is an easy measure.","translation_id":"Dan ketika mereka membuka barang-barangnya, mereka menemukan barang-barang (penukar) mereka dikembalikan kepada mereka. Mereka berkata, “Wahai ayah kami! Apalagi yang kita inginkan. Ini barang-barang kita dikembalikan kepada kita, dan kita akan dapat memberi makan keluarga kita, dan kami akan memelihara saudara kami, dan kita akan mendapat tambahan jatah (gandum) seberat beban seekor unta. Itu suatu hal yang mudah (bagi raja Mesir).”","hasanah_per_verse":1140},{"text_madani":"قَالَ لَنْ أُرْسِلَهُ مَعَكُمْ حَتَّىٰ تُؤْتُونِ مَوْثِقًا مِّنَ اللَّهِ لَتَأْتُنَّنِي بِهِ إِلَّا أَن يُحَاطَ بِكُمْ ۖ فَلَمَّا آتَوْهُ مَوْثِقَهُمْ قَالَ اللَّهُ عَلَىٰ مَا نَقُولُ وَكِيلٌ","text_tajweed":"قَالَ لَنْ أُرْسِلَهُ[n[ۥ] مَعَكُمْ حَتَّىٰ تُؤْتُونِ مَوْثِ[a:6739[قًا م]ِّنَ [h:321[ٱ]للَّهِ لَتَأْتُ[g[نّ]َنِى بِه[o[ِۦٓ] إِلّ[o[َآ] أ[a:6740[َن ي]ُحَاطَ بِكُمْ‌ۖ فَلَ[g[مّ][o[َآ] ءَاتَوْهُ مَوْثِقَهُمْ قَالَ [h:1961[ٱ]للَّهُ عَلَىٰ مَا نَقُولُ وَك[p[ِي]لٌ","translation_en":"He said: I will by no means send him with you until you give me a firm covenant in Allah's name that you will most certainly bring him back to me, unless you are completely surrounded. And when they gave him their covenant, he said: Allah is the One in Whom trust is placed as regards what we say.","translation_id":"Dia (Yakub) berkata, “Aku tidak akan melepaskannya (pergi) bersama kamu, sebelum kamu bersumpah kepadaku atas (nama) Allah, bahwa kamu pasti akan membawanya kepadaku kembali, kecuali jika kamu dikepung (musuh).” Setelah mereka mengucapkan sumpah, dia (Yakub) berkata, “Allah adalah saksi terhadap apa yang kita ucapkan.”","hasanah_per_verse":880},{"text_madani":"وَقَالَ يَا بَنِيَّ لَا تَدْخُلُوا مِن بَابٍ وَاحِدٍ وَادْخُلُوا مِنْ أَبْوَابٍ مُّتَفَرِّقَةٍ ۖ وَمَا أُغْنِي عَنكُم مِّنَ اللَّهِ مِن شَيْءٍ ۖ إِنِ الْحُكْمُ إِلَّا لِلَّهِ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَعَلَيْهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ","text_tajweed":"وَقَالَ يَ[n[ـٰ]بَنِىَّ لَا تَ[q:1176[دْ]خُلُو[s[اْ] م[i:6741[ِنۢ ب]َا[a:6742[بٍ و][n[َٲ]حِ[a:6743[دٍ و]َ[h:281[ٱ][q:281[دْ]خُلُو[s[اْ] مِنْ أَ[q:6744[بْ]و[n[َٲ][a:6745[بٍ م]ُّتَفَرِّقَ[a:6746[ةٍ‌ۖ و]َم[o[َآ] أُغْنِى عَ[f:255[نك][w:6747[ُم م]ِّنَ [h:321[ٱ]للَّهِ مِ[f:2103[ن ش]َىْءٍ‌ۖ إِنِ [h:4101[ٱ]لْحُكْمُ إِلَّا لِلَّهِ‌ۖ عَلَيْهِ تَوَكَّلْتُ‌ۖ وَعَلَيْهِ فَلْيَتَوَكَّلِ [h:6748[ٱ]لْمُتَوَكِّل[p[ُو]نَ","translation_en":"And he said: O my sons! do not (all) enter by one gate and enter by different gates and I cannot avail you aught against Allah; judgment is only Allah's; on Him do I rely, and on Him let those who are reliant rely.","translation_id":"Dan dia (Yakub) berkata, “Wahai anak-anakku! Janganlah kamu masuk dari satu pintu gerbang, dan masuklah dari pintu-pintu gerbang yang berbeda; namun demikian aku tidak dapat mempertahankan kamu sedikit pun dari (takdir) Allah. Keputusan itu hanyalah bagi Allah. Kepada-Nya aku bertawakal dan kepada-Nya pula bertawakallah orang-orang yang bertawakal.”","hasanah_per_verse":1110},{"text_madani":"وَلَمَّا دَخَلُوا مِنْ حَيْثُ أَمَرَهُمْ أَبُوهُم مَّا كَانَ يُغْنِي عَنْهُم مِّنَ اللَّهِ مِن شَيْءٍ إِلَّا حَاجَةً فِي نَفْسِ يَعْقُوبَ قَضَاهَا ۚ وَإِنَّهُ لَذُو عِلْمٍ لِّمَا عَلَّمْنَاهُ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ","text_tajweed":"وَلَ[g[مّ]َا دَخَلُو[s[اْ] مِنْ حَيْثُ أَمَرَهُمْ أَبُوه[w:6749[ُم م]َّا كَانَ يُغْنِى عَنْه[w:6750[ُم م]ِّنَ [h:321[ٱ]للَّهِ مِ[f:2103[ن ش]َىْءٍ إِلَّا حَاجَ[f:6751[ةً ف]ِى نَفْسِ يَعْقُوبَ قَضَ[n[ـٰ]هَا‌ۚ وَإِ[g[نّ]َهُ[n[ۥ] لَذُو عِلْ[u:6752[مٍ ل]ِّمَا عَلَّمْنَ[n[ـٰ]هُ وَلَ[n[ـٰ]كِ[g[نّ]َ أَكْثَرَ [h:1374[ٱ][l[ل][g[نّ]َاسِ لَا يَعْلَم[p[ُو]نَ","translation_en":"And when they had entered as their father had bidden them, it did not avail them aught against Allah, but (it was only) a desire in the soul of Yaqoub which he satisfied; and surely he was possessed of knowledge because We had given him knowledge, but most people do not know.","translation_id":"Dan ketika mereka masuk sesuai dengan perintah ayah mereka, (masuknya mereka itu) tidak dapat menolak sedikit pun keputusan Allah, (tetapi itu) hanya suatu keinginan pada diri Yakub yang telah ditetapkannya. Dan sesungguhnya dia mempunyai pengetahuan, karena Kami telah mengajarkan kepadanya. Tetapi kebanyakan manusia tidak mengetahui.","hasanah_per_verse":1100},{"text_madani":"وَلَمَّا دَخَلُوا عَلَىٰ يُوسُفَ آوَىٰ إِلَيْهِ أَخَاهُ ۖ قَالَ إِنِّي أَنَا أَخُوكَ فَلَا تَبْتَئِسْ بِمَا كَانُوا يَعْمَلُونَ","text_tajweed":"وَلَ[g[مّ]َا دَخَلُو[s[اْ] عَلَىٰ يُوسُفَ ءَاوَ[o[ىٰٓ] إِلَيْهِ أَخَاهُ‌ۖ قَالَ إِ[g[نّ][o[ِىٓ] أَنَا۟ أَخُوكَ فَلَا تَ[q:6317[بْ]تَئِسْ بِمَا كَانُو[s[اْ] يَعْمَل[p[ُو]نَ","translation_en":"And when they went in to Yusuf. he lodged his brother with himself, saying: I am your brother, therefore grieve not at what they do.","translation_id":"Dan ketika mereka masuk ke (tempat) Yusuf, dia menempatkan saudaranya (Bunyamin) di tempatnya, dia (Yusuf) berkata, “Sesungguhnya aku adalah saudaramu, jangan engkau bersedih hati terhadap apa yang telah mereka kerjakan.”","hasanah_per_verse":620},{"text_madani":"فَلَمَّا جَهَّزَهُم بِجَهَازِهِمْ جَعَلَ السِّقَايَةَ فِي رَحْلِ أَخِيهِ ثُمَّ أَذَّنَ مُؤَذِّنٌ أَيَّتُهَا الْعِيرُ إِنَّكُمْ لَسَارِقُونَ","text_tajweed":"فَلَ[g[مّ]َا جَهَّزَه[c:6722[ُم ب]ِجَهَازِهِمْ جَعَلَ [h:6753[ٱ][l[ل]سِّقَايَةَ فِى رَحْلِ أَخِيهِ ثُ[g[مّ]َ أَذَّنَ مُؤَذِّنٌ أَيَّتُهَا [h:6754[ٱ]لْعِيرُ إِ[g[نّ]َكُمْ لَسَ[n[ـٰ]رِق[p[ُو]نَ","translation_en":"So when he furnished them with their provisions, (someone) placed the drinking cup in his brother's bag. Then a crier cried out: O caravan! you are most surely thieves.","translation_id":"Maka ketika telah disiapkan bahan makanan untuk mereka, dia (Yusuf) memasukkan piala ke dalam karung saudaranya. Kemudian berteriaklah seseorang yang menyerukan, “Wahai kafilah! Sesungguhnya kamu pasti pencuri.”","hasanah_per_verse":650},{"text_madani":"قَالُوا وَأَقْبَلُوا عَلَيْهِم مَّاذَا تَفْقِدُونَ","text_tajweed":"قَالُو[s[اْ] وَأَ[q:6755[قْ]بَلُو[s[اْ] عَلَيْه[w:6756[ِم م]َّاذَا تَفْقِد[p[ُو]نَ","translation_en":"They said while they were facing them: What is it that you miss?","translation_id":"Mereka bertanya, sambil menghadap kepada mereka (yang menuduh), “Kamu kehilangan apa?”","hasanah_per_verse":270},{"text_madani":"قَالُوا نَفْقِدُ صُوَاعَ الْمَلِكِ وَلِمَن جَاءَ بِهِ حِمْلُ بَعِيرٍ وَأَنَا بِهِ زَعِيمٌ","text_tajweed":"قَالُو[s[اْ] نَفْقِدُ صُوَاعَ [h:6757[ٱ]لْمَلِكِ وَلِمَ[f:6758[ن ج][o[َا]ٓءَ بِه[n[ِۦ] حِمْلُ بَعِي[a:6759[رٍ و]َأَنَا۟ بِه[n[ِۦ] زَع[p[ِي]مٌ","translation_en":"They said: We miss the king's drinking cup, and he who shall bring it shall have a camel-load and I am responsible for it.","translation_id":"Mereka menjawab, “Kami kehilangan piala raja, dan siapa yang dapat mengembalikannya akan memperoleh (bahan makanan seberat) beban unta, dan aku jamin itu.”","hasanah_per_verse":440},{"text_madani":"قَالُوا تَاللَّهِ لَقَدْ عَلِمْتُم مَّا جِئْنَا لِنُفْسِدَ فِي الْأَرْضِ وَمَا كُنَّا سَارِقِينَ","text_tajweed":"قَالُو[s[اْ] تَ[h:6760[ٱ]للَّهِ لَقَ[q:2389[دْ] عَلِمْت[w:6761[ُم م]َّا جِئْنَا لِنُفْسِدَ فِى [h:44[ٱ]لْأَرْضِ وَمَا كُ[g[نّ]َا سَ[n[ـٰ]رِق[p[ِي]نَ","translation_en":"They said: By Allah! you know for certain that we have not come to make mischief in the land, and we are not thieves.","translation_id":"Mereka (saudara-saudara Yusuf) menjawab, “Demi Allah, sungguh, kamu mengetahui bahwa kami datang bukan untuk berbuat kerusakan di negeri ini dan kami bukanlah para pencuri.”","hasanah_per_verse":480},{"text_madani":"قَالُوا فَمَا جَزَاؤُهُ إِن كُنتُمْ كَاذِبِينَ","text_tajweed":"قَالُو[s[اْ] فَمَا جَز[o[َٲ]ٓؤُهُ[o[ۥٓ] إِ[f:109[ن ك]ُ[f:100[نت]ُمْ كَ[n[ـٰ]ذِب[p[ِي]نَ","translation_en":"They said: But what shall be the requital of this, if you are liars?","translation_id":"Mereka berkata, “Tetapi apa hukumannya jika kamu dusta?”","hasanah_per_verse":250},{"text_madani":"قَالُوا جَزَاؤُهُ مَن وُجِدَ فِي رَحْلِهِ فَهُوَ جَزَاؤُهُ ۚ كَذَٰلِكَ نَجْزِي الظَّالِمِينَ","text_tajweed":"قَالُو[s[اْ] جَز[o[َٲ]ٓؤُهُ[n[ۥ] م[a:6762[َن و]ُجِدَ فِى رَحْلِه[n[ِۦ] فَهُوَ جَز[o[َٲ]ٓؤُهُ[n[ۥ]‌ۚ كَذ[n[َٲ]لِكَ نَ[q:4214[جْ]زِى [h:4693[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"They said: The requital of this is that the person in whose bag it is found shall himself be (held for) the satisfaction thereof; thus do we punish the wrongdoers.","translation_id":"Mereka menjawab, “Hukumannya ialah pada siapa ditemukan dalam karungnya (barang yang hilang itu), maka dia sendirilah menerima hukumannya. Demikianlah kami memberi hukuman kepada orang-orang zhalim.”","hasanah_per_verse":450},{"text_madani":"فَبَدَأَ بِأَوْعِيَتِهِمْ قَبْلَ وِعَاءِ أَخِيهِ ثُمَّ اسْتَخْرَجَهَا مِن وِعَاءِ أَخِيهِ ۚ كَذَٰلِكَ كِدْنَا لِيُوسُفَ ۖ مَا كَانَ لِيَأْخُذَ أَخَاهُ فِي دِينِ الْمَلِكِ إِلَّا أَن يَشَاءَ اللَّهُ ۚ نَرْفَعُ دَرَجَاتٍ مَّن نَّشَاءُ ۗ وَفَوْقَ كُلِّ ذِي عِلْمٍ عَلِيمٌ","text_tajweed":"فَبَدَأَ بِأَوْعِيَتِهِمْ قَ[q:3282[بْ]لَ وِع[o[َا]ٓءِ أَخِيهِ ثُ[g[مّ]َ [h:6763[ٱ]سْتَخْرَجَهَا م[a:6764[ِن و]ِع[o[َا]ٓءِ أَخِيهِ‌ۚ كَذ[n[َٲ]لِكَ كِ[q:6765[دْ]نَا لِيُوسُفَ‌ۖ مَا كَانَ لِيَأْخُذَ أَخَاهُ فِى دِينِ [h:6766[ٱ]لْمَلِكِ إِلّ[o[َآ] أ[a:4201[َن ي]َش[o[َا]ٓءَ [h:4334[ٱ]للَّهُ‌ۚ نَرْفَعُ دَرَجَ[n[ـٰ][a:4210[تٍ م]ّ[a:4211[َن ن]َّش[o[َا]ٓءُ‌ۗ وَفَوْقَ كُلِّ ذِى عِلْمٍ عَل[p[ِي]مٌ","translation_en":"So he began with their sacks before the sack of his brother, then he brought it out from his brother's sack. Thus did We plan for the sake of Yusuf; it was not (lawful) that he should take his brother under the king's law unless Allah pleased; We raise the degrees of whomsoever We please, and above every one possessed of knowledge is the All-knowing one.","translation_id":"Maka mulailah dia (memeriksa) karung-karung mereka sebelum (memeriksa) karung saudaranya sendiri, kemudian dia mengeluarkan (piala raja) itu dari karung saudaranya. Demikianlah Kami mengatur (rencana) untuk Yusuf. Dia tidak dapat menghukum saudaranya menurut undang-undang raja, kecuali Allah menghendakinya. Kami angkat derajat orang yang Kami kehendaki; dan di atas setiap orang yang berpengetahuan ada yang lebih mengetahui.","hasanah_per_verse":1230},{"text_madani":"قَالُوا إِن يَسْرِقْ فَقَدْ سَرَقَ أَخٌ لَّهُ مِن قَبْلُ ۚ فَأَسَرَّهَا يُوسُفُ فِي نَفْسِهِ وَلَمْ يُبْدِهَا لَهُمْ ۚ قَالَ أَنتُمْ شَرٌّ مَّكَانًا ۖ وَاللَّهُ أَعْلَمُ بِمَا تَصِفُونَ","text_tajweed":"۞ قَال[o[ُوٓ][s[اْ] إ[a:6767[ِن ي]َسْرِ[q:6768[قْ] فَقَ[q:563[دْ] سَرَقَ أَ[u:6769[خٌ ل]َّهُ[n[ۥ] مِ[f:128[ن ق]َ[q:129[بْ]لُ‌ۚ فَأَسَرَّهَا يُوسُفُ فِى نَفْسِه[n[ِۦ] وَلَمْ يُ[q:6770[بْ]دِهَا لَهُمْ‌ۚ قَالَ أَ[f:428[نت]ُمْ شَ[a:3659[رٌّ م]َّكَا[a:6771[نًا‌ۖ و]َ[h:72[ٱ]للَّهُ أَعْلَمُ بِمَا تَصِف[p[ُو]نَ","translation_en":"They said: If he steal, a brother of his did indeed steal before; but Yusuf kept it secret in his heart and did not disclose it to them. He said: You are in an evil condition and Allah knows best what you state.","translation_id":"Mereka berkata, “Jika dia mencuri, maka sungguh sebelum itu saudaranya pun pernah pula mencuri.” Maka Yusuf menyembunyikan (kejengkelan) dalam hatinya dan tidak ditampakkannya kepada mereka. Dia berkata (dalam hatinya), “Kedudukanmu justru lebih buruk. Dan Allah Maha Mengetahui apa yang kamu terangkan.”","hasanah_per_verse":840},{"text_madani":"قَالُوا يَا أَيُّهَا الْعَزِيزُ إِنَّ لَهُ أَبًا شَيْخًا كَبِيرًا فَخُذْ أَحَدَنَا مَكَانَهُ ۖ إِنَّا نَرَاكَ مِنَ الْمُحْسِنِينَ","text_tajweed":"قَالُو[s[اْ] يَ[o[ـٰٓ]أَيُّهَا [h:6772[ٱ]لْعَزِيزُ إِ[g[نّ]َ لَهُ[o[ۥٓ] أَ[f:6773[بًا ش]َيْ[f:6774[خًا ك]َبِي[f:6775[رًا ف]َخُذْ أَحَدَنَا مَكَانَهُ[o[ۥٓ‌ۖ] إِ[g[نّ]َا نَرَ[n[ٮٰ]كَ مِنَ [h:4754[ٱ]لْمُحْسِن[p[ِي]نَ","translation_en":"They said: O chief! he has a father, a very old man, therefore retain one of us in his stead; surely we see you to be of the doers of good.","translation_id":"Mereka berkata, “Wahai Al-Aziz! Dia mempunyai ayah yang sudah lanjut usia, karena itu ambillah salah seorang di antara kami sebagai gantinya, sesungguhnya kami melihat engkau termasuk orang-orang yang berbuat baik.”","hasanah_per_verse":630},{"text_madani":"قَالَ مَعَاذَ اللَّهِ أَن نَّأْخُذَ إِلَّا مَن وَجَدْنَا مَتَاعَنَا عِندَهُ إِنَّا إِذًا لَّظَالِمُونَ","text_tajweed":"قَالَ مَعَاذَ [h:6605[ٱ]للَّهِ أ[a:6776[َن ن]َّأْخُذَ إِلَّا م[a:6777[َن و]َجَ[q:3834[دْ]نَا مَتَ[n[ـٰ]عَنَا عِ[f:719[ند]َهُ[o[ۥٓ] إِ[g[نّ][o[َآ] إِ[u:6778[ذًا ل]َّظَ[n[ـٰ]لِم[p[ُو]نَ","translation_en":"He said: Allah protect us that we should seize other than him with whom we found our property, for then most surely we would be unjust.","translation_id":"Dia (Yusuf) berkata, “Aku memohon perlindungan kepada Allah dari menahan (seseorang), kecuali orang yang kami temukan harta kami padanya, jika kami (berbuat) demikian, berarti kami orang yang zhalim.”","hasanah_per_verse":500},{"text_madani":"فَلَمَّا اسْتَيْأَسُوا مِنْهُ خَلَصُوا نَجِيًّا ۖ قَالَ كَبِيرُهُمْ أَلَمْ تَعْلَمُوا أَنَّ أَبَاكُمْ قَدْ أَخَذَ عَلَيْكُم مَّوْثِقًا مِّنَ اللَّهِ وَمِن قَبْلُ مَا فَرَّطتُمْ فِي يُوسُفَ ۖ فَلَنْ أَبْرَحَ الْأَرْضَ حَتَّىٰ يَأْذَنَ لِي أَبِي أَوْ يَحْكُمَ اللَّهُ لِي ۖ وَهُوَ خَيْرُ الْحَاكِمِينَ","text_tajweed":"فَلَ[g[مّ]َا [h:6779[ٱ]سْتَيْــَٔسُو[s[اْ] مِنْهُ خَلَصُو[s[اْ] نَجِي[f:6780[ًّا‌ۖ ق]َالَ كَبِيرُهُمْ أَلَمْ تَعْلَم[o[ُوٓ][s[اْ] أَ[g[نّ]َ أَبَاكُمْ قَ[q:298[دْ] أَخَذَ عَلَيْك[w:6781[ُم م]َّوْثِ[a:6739[قًا م]ِّنَ [h:321[ٱ]للَّهِ وَمِ[f:6432[ن ق]َ[q:129[بْ]لُ مَا فَرَّطتُمْ فِى يُوسُفَ‌ۖ فَلَنْ أَ[q:6782[بْ]رَحَ [h:6783[ٱ]لْأَرْضَ حَتَّىٰ يَأْذَنَ ل[o[ِىٓ] أَب[o[ِىٓ] أَوْ يَحْكُمَ [h:4856[ٱ]للَّهُ لِى‌ۖ وَهُوَ خَيْرُ [h:4857[ٱ]لْحَ[n[ـٰ]كِم[p[ِي]نَ","translation_en":"Then when they despaired of him, they retired, conferring privately together. The eldest of them said: Do you not know that your father took from you a covenant in Allah's name, and how you fell short of your duty with respect to Yusuf before? Therefore I will by no means depart from this land until my father permits me or Allah decides for me, and He is the best of the judges:","translation_id":"Maka ketika mereka berputus asa darinya (putusan Yusuf) mereka menyendiri (sambil berunding) dengan berbisik-bisik. Yang tertua di antara mereka berkata, “Tidakkah kamu ketahui bahwa ayahmu telah mengambil janji dari kamu dengan (nama) Allah dan sebelum itu kamu telah menyia-nyiakan Yusuf? Sebab itu aku tidak akan meninggalkan negeri ini (Mesir), sampai ayahku mengizinkan (untuk kembali), atau Allah memberi keputusan terhadapku. Dan Dia adalah hakim yang terbaik.”","hasanah_per_verse":1390},{"text_madani":"ارْجِعُوا إِلَىٰ أَبِيكُمْ فَقُولُوا يَا أَبَانَا إِنَّ ابْنَكَ سَرَقَ وَمَا شَهِدْنَا إِلَّا بِمَا عَلِمْنَا وَمَا كُنَّا لِلْغَيْبِ حَافِظِينَ","text_tajweed":"ٱرْجِع[o[ُوٓ][s[اْ] إِلَ[o[ىٰٓ] أَبِيكُمْ فَقُولُو[s[اْ] يَ[o[ـٰٓ]أَبَان[o[َآ] إِ[g[نّ]َ [h:6784[ٱ][q:6785[بْ]نَكَ سَرَقَ وَمَا شَهِ[q:4421[دْ]ن[o[َآ] إِلَّا بِمَا عَلِمْنَا وَمَا كُ[g[نّ]َا لِلْغَيْبِ حَ[n[ـٰ]فِظ[p[ِي]نَ","translation_en":"Go back to your father and say: O our father! surely your son committed theft, and we do not bear witness except to what we have known, and we could not keep watch over the unseen:","translation_id":"Kembalilah kepada ayahmu dan katakanlah, “Wahai ayah kami! Sesungguhnya anakmu telah mencuri dan kami hanya menyaksikan apa yang kami ketahui dan kami tidak mengetahui apa yang di balik itu.","hasanah_per_verse":720},{"text_madani":"وَاسْأَلِ الْقَرْيَةَ الَّتِي كُنَّا فِيهَا وَالْعِيرَ الَّتِي أَقْبَلْنَا فِيهَا ۖ وَإِنَّا لَصَادِقُونَ","text_tajweed":"وَسْــَٔلِ [h:6786[ٱ]لْقَرْيَةَ [h:6787[ٱ]لَّتِى كُ[g[نّ]َا فِيهَا وَ[h:6788[ٱ]لْعِيرَ [h:6789[ٱ]لَّت[o[ِىٓ] أَ[q:6790[قْ]بَلْنَا فِيهَا‌ۖ وَإِ[g[نّ]َا لَصَ[n[ـٰ]دِق[p[ُو]نَ","translation_en":"And inquire in the town in which we were and the caravan with which we proceeded, and most surely we are truthful.","translation_id":"Dan tanyalah (penduduk) negeri tem-pat kami berada, dan kafilah yang datang bersama kami. Dan kami adalah orang yang benar.”","hasanah_per_verse":530},{"text_madani":"قَالَ بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا ۖ فَصَبْرٌ جَمِيلٌ ۖ عَسَى اللَّهُ أَن يَأْتِيَنِي بِهِمْ جَمِيعًا ۚ إِنَّهُ هُوَ الْعَلِيمُ الْحَكِيمُ","text_tajweed":"قَالَ بَلْ سَوَّلَتْ لَكُمْ أَ[f:6579[نف]ُسُكُمْ أَمْ[f:6580[رًا‌ۖ ف]َصَ[q:6581[بْ][f:6582[رٌ ج]َمِيلٌ‌ۖ عَسَى [h:2982[ٱ]للَّهُ أ[a:6791[َن ي]َأْتِيَنِى بِهِمْ جَمِيعًا‌ۚ إِ[g[نّ]َهُ[n[ۥ] هُوَ [h:6792[ٱ]لْعَلِيمُ [h:171[ٱ]لْحَك[p[ِي]مُ","translation_en":"He (Yaqoub) said: Nay, your souls have made a matter light for you, so patience is good; maybe Allah will bring them all together to me; surely He is the Knowing, the Wise.","translation_id":"Dia (Yakub) berkata, “Sebenarnya hanya dirimu sendiri yang memandang baik urusan (yang buruk) itu. Maka (kesabaranku) adalah kesabaran yang baik. Mudah-mudahan Allah mendatangkan mereka semuanya kepadaku. Sungguh, Dialah Yang Maha Mengetahui, Mahabijaksana.”","hasanah_per_verse":700},{"text_madani":"وَتَوَلَّىٰ عَنْهُمْ وَقَالَ يَا أَسَفَىٰ عَلَىٰ يُوسُفَ وَابْيَضَّتْ عَيْنَاهُ مِنَ الْحُزْنِ فَهُوَ كَظِيمٌ","text_tajweed":"وَتَوَلَّىٰ عَنْهُمْ وَقَالَ يَ[o[ـٰٓ]أَسَفَىٰ عَلَىٰ يُوسُفَ وَ[h:6793[ٱ][q:6793[بْ]يَضَّتْ عَيْنَاهُ مِنَ [h:6794[ٱ]لْحُزْنِ فَهُوَ كَظ[p[ِي]مٌ","translation_en":"And he turned away from them, and said: O my sorrow for Yusuf! and his eyes became white on account of the grief, and he was a repressor (of grief).","translation_id":"Dan dia (Yakub) berpaling dari mereka (anak-anaknya) seraya berkata, “Aduhai dukacitaku terhadap Yusuf,” dan kedua matanya menjadi putih karena sedih. Dia diam menahan amarah (terhadap anak-anaknya).","hasanah_per_verse":510},{"text_madani":"قَالُوا تَاللَّهِ تَفْتَأُ تَذْكُرُ يُوسُفَ حَتَّىٰ تَكُونَ حَرَضًا أَوْ تَكُونَ مِنَ الْهَالِكِينَ","text_tajweed":"قَالُو[s[اْ] تَ[h:6760[ٱ]للَّهِ تَفْتَؤُ[s[اْ] تَذْكُرُ يُوسُفَ حَتَّىٰ تَكُونَ حَرَضًا أَوْ تَكُونَ مِنَ [h:6795[ٱ]لْهَ[n[ـٰ]لِك[p[ِي]نَ","translation_en":"They said: By Allah! you will not cease to remember Yusuf until you are a prey to constant disease or (until) you are of those who perish.","translation_id":"Mereka berkata, “Demi Allah, engkau tidak henti-hentinya mengingat Yusuf, sehingga engkau (mengidap) penyakit berat atau engkau termasuk orang-orang yang akan binasa.”","hasanah_per_verse":490},{"text_madani":"قَالَ إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ وَأَعْلَمُ مِنَ اللَّهِ مَا لَا تَعْلَمُونَ","text_tajweed":"قَالَ إِ[g[نّ]َم[o[َآ] أَشْكُو[s[اْ] بَثِّى وَحُزْن[o[ِىٓ] إِلَى [h:1637[ٱ]للَّهِ وَأَعْلَمُ مِنَ [h:321[ٱ]للَّهِ مَا لَا تَعْلَم[p[ُو]نَ","translation_en":"He said: I only complain of my grief and sorrow to Allah, and I know from Allah what you do not know.","translation_id":"Dia (Yakub) menjawab, “Hanya kepada Allah aku mengadukan kesusahan dan kesedihanku. Dan aku mengetahui dari Allah apa yang tidak kamu ketahui.","hasanah_per_verse":470},{"text_madani":"يَا بَنِيَّ اذْهَبُوا فَتَحَسَّسُوا مِن يُوسُفَ وَأَخِيهِ وَلَا تَيْأَسُوا مِن رَّوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِن رَّوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ","text_tajweed":"يَ[n[ـٰ]بَنِىَّ [h:6796[ٱ]ذْهَبُو[s[اْ] فَتَحَسَّسُو[s[اْ] م[a:6797[ِن ي]ُوسُفَ وَأَخِيهِ وَلَا تَ[s[اْ]يْــَٔسُو[s[اْ] م[u:6798[ِن ر]َّوْحِ [h:6799[ٱ]للَّهِ‌ۖ إِ[g[نّ]َهُ[n[ۥ] لَا يَ[s[اْ]يْــَٔسُ م[u:6798[ِن ر]َّوْحِ [h:6799[ٱ]للَّهِ إِلَّا [h:4061[ٱ]لْقَوْمُ [h:6800[ٱ]لْكَ[n[ـٰ]فِر[p[ُو]نَ","translation_en":"O my sons! Go and inquire respecting Yusuf and his brother, and despair not of Allah's mercy; surely none despairs of Allah's mercy except the unbelieving people.","translation_id":"Wahai anak-anakku! Pergilah kamu, carilah (berita) tentang Yusuf dan saudaranya dan jangan kamu berputus asa dari rahmat Allah. Sesungguhnya yang berputus asa dari rahmat Allah, hanyalah orang-orang yang kafir.”","hasanah_per_verse":810},{"text_madani":"فَلَمَّا دَخَلُوا عَلَيْهِ قَالُوا يَا أَيُّهَا الْعَزِيزُ مَسَّنَا وَأَهْلَنَا الضُّرُّ وَجِئْنَا بِبِضَاعَةٍ مُّزْجَاةٍ فَأَوْفِ لَنَا الْكَيْلَ وَتَصَدَّقْ عَلَيْنَا ۖ إِنَّ اللَّهَ يَجْزِي الْمُتَصَدِّقِينَ","text_tajweed":"فَلَ[g[مّ]َا دَخَلُو[s[اْ] عَلَيْهِ قَالُو[s[اْ] يَ[o[ـٰٓ]أَيُّهَا [h:6772[ٱ]لْعَزِيزُ مَسَّنَا وَأَهْلَنَا [h:6801[ٱ][l[ل]ضُّرُّ وَجِئْنَا بِبِضَ[n[ـٰ]عَ[a:6802[ةٍ م]ُّزْجَ[n[ـٰ][f:6803[ةٍ ف]َأَوْفِ لَنَا [h:6804[ٱ]لْكَيْلَ وَتَصَدَّ[q:6805[قْ] عَلَيْن[o[َآ‌ۖ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ يَ[q:6806[جْ]زِى [h:6807[ٱ]لْمُتَصَدِّق[p[ِي]نَ","translation_en":"So when they came in to him, they said: O chief! distress has afflicted us and our family and we have brought scanty money, so give us full measure and be charitable to us; surely Allah rewards the charitable.","translation_id":"Maka ketika mereka masuk ke (tempat) Yusuf, mereka berkata, “Wahai Al-Aziz! Kami dan keluarga kami telah ditimpa kesengsaraan dan kami datang membawa barang-barang yang tidak berharga, maka penuhilah jatah (gandum) untuk kami, dan bersedekahlah kepada kami. Sesungguhnya Allah memberi balasan kepada orang yang bersedekah.”","hasanah_per_verse":1010},{"text_madani":"قَالَ هَلْ عَلِمْتُم مَّا فَعَلْتُم بِيُوسُفَ وَأَخِيهِ إِذْ أَنتُمْ جَاهِلُونَ","text_tajweed":"قَالَ هَلْ عَلِمْت[w:6761[ُم م]َّا فَعَلْت[c:6808[ُم ب]ِيُوسُفَ وَأَخِيهِ إِذْ أَ[f:428[نت]ُمْ جَ[n[ـٰ]هِل[p[ُو]نَ","translation_en":"He said: Do you know how you treated Yusuf and his brother when you were ignorant?","translation_id":"Dia (Yusuf) berkata, “Tahukah kamu (kejelekan) apa yang telah kamu perbuat terhadap Yusuf dan saudaranya karena kamu tidak menyadari (akibat) perbuatanmu itu?”","hasanah_per_verse":390},{"text_madani":"قَالُوا أَإِنَّكَ لَأَنتَ يُوسُفُ ۖ قَالَ أَنَا يُوسُفُ وَهَٰذَا أَخِي ۖ قَدْ مَنَّ اللَّهُ عَلَيْنَا ۖ إِنَّهُ مَن يَتَّقِ وَيَصْبِرْ فَإِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ","text_tajweed":"قَال[o[ُوٓ][s[اْ] أَءِ[g[نّ]َكَ لَأَ[f:6457[نت]َ يُوسُفُ‌ۖ قَالَ أَنَا۟ يُوسُفُ وَهَ[n[ـٰ]ذ[o[َآ] أَخِى‌ۖ قَ[q:298[دْ] مَ[g[نّ]َ [h:2390[ٱ]للَّهُ عَلَيْن[o[َآ‌ۖ] إِ[g[نّ]َهُ[n[ۥ] م[a:6809[َن ي]َتَّقِ وَيَصْبِرْ فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ لَا يُضِيعُ أَ[q:2418[جْ]رَ [h:5898[ٱ]لْمُحْسِن[p[ِي]نَ","translation_en":"They said: Are you indeed Yusuf? He said: I am Yusuf and this is my brother; Allah has indeed been gracious to us; surely he who guards (against evil) and is patient (is rewarded) for surely Allah does not waste the reward of those who do good.","translation_id":"Mereka berkata, “Apakah engkau benar-benar Yusuf?” Dia (Yusuf) menjawab, “Aku Yusuf dan ini saudaraku. Sungguh, Allah telah melimpahkan karunia-Nya kepada kami. Sesungguhnya barangsiapa bertakwa dan bersabar, maka Sungguh, Allah tidak menyia-nyiakan pahala orang yang berbuat baik.”","hasanah_per_verse":840},{"text_madani":"قَالُوا تَاللَّهِ لَقَدْ آثَرَكَ اللَّهُ عَلَيْنَا وَإِن كُنَّا لَخَاطِئِينَ","text_tajweed":"قَالُو[s[اْ] تَ[h:6760[ٱ]للَّهِ لَقَ[q:2389[دْ] ءَاثَرَكَ [h:6810[ٱ]للَّهُ عَلَيْنَا وَإِ[f:4542[ن ك]ُ[g[نّ]َا لَخَ[n[ـٰ]طِــٔ[p[ِي]نَ","translation_en":"They said: By Allah! now has Allah certainly chosen you over us, and we were certainly sinners.","translation_id":"Mereka berkata, “Demi Allah, sungguh Allah telah melebihkan engkau di atas kami, dan sesungguhnya kami adalah orang yang bersalah (berdosa).”","hasanah_per_verse":390},{"text_madani":"قَالَ لَا تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ ۖ يَغْفِرُ اللَّهُ لَكُمْ ۖ وَهُوَ أَرْحَمُ الرَّاحِمِينَ","text_tajweed":"قَالَ لَا تَثْرِيبَ عَلَيْكُمُ [h:6811[ٱ]لْيَوْمَ‌ۖ يَغْفِرُ [h:6812[ٱ]للَّهُ لَكُمْ‌ۖ وَهُوَ أَرْحَمُ [h:5034[ٱ][l[ل]رّ[n[َٲ]حِم[p[ِي]نَ","translation_en":"He said: (There shall be) no reproof against you this day; Allah may forgive you, and He is the most Merciful of the merciful.","translation_id":"Dia (Yusuf) berkata, “Pada hari ini tidak ada cercaan terhadap kamu, mudah-mudahan Allah mengampuni kamu. Dan Dia Maha Penyayang di antara para penyayang.","hasanah_per_verse":460},{"text_madani":"اذْهَبُوا بِقَمِيصِي هَٰذَا فَأَلْقُوهُ عَلَىٰ وَجْهِ أَبِي يَأْتِ بَصِيرًا وَأْتُونِي بِأَهْلِكُمْ أَجْمَعِينَ","text_tajweed":"ٱذْهَبُو[s[اْ] بِقَمِيصِى هَ[n[ـٰ]ذَا فَأَلْقُوهُ عَلَىٰ وَ[q:1611[جْ]هِ أَبِى يَأْتِ بَصِي[a:6813[رًا و]َأْتُونِى بِأَهْلِكُمْ أَ[q:825[جْ]مَع[p[ِي]نَ","translation_en":"Take this my shirt and cast it on my father's face, he will (again) be able to see, and come to me with all your families.","translation_id":"Pergilah kamu dengan membawa bajuku ini, lalu usapkan ke wajah ayahku, nanti dia akan melihat kembali; dan bawalah seluruh keluargamu kepadaku.”","hasanah_per_verse":560},{"text_madani":"وَلَمَّا فَصَلَتِ الْعِيرُ قَالَ أَبُوهُمْ إِنِّي لَأَجِدُ رِيحَ يُوسُفَ ۖ لَوْلَا أَن تُفَنِّدُونِ","text_tajweed":"وَلَ[g[مّ]َا فَصَلَتِ [h:6814[ٱ]لْعِيرُ قَالَ أَبُوهُمْ إِ[g[نّ]ِى لَأَجِدُ رِيحَ يُوسُفَ‌ۖ لَوْل[o[َآ] أَ[f:6815[ن ت]ُفَ[g[نّ]ِد[p[ُو]نِ","translation_en":"And when the caravan had departed, their father said: Most surely I perceive the greatness of Yusuf, unless you pronounce me to be weak in judgment.","translation_id":"Dan ketika kafilah itu telah keluar (dari negeri Mesir), ayah mereka berkata, “Sesungguhnya Aku mencium bau Yusuf, sekiranya kamu tidak menuduhku lemah akal (tentu kamu membenarkan aku).”","hasanah_per_verse":470},{"text_madani":"قَالُوا تَاللَّهِ إِنَّكَ لَفِي ضَلَالِكَ الْقَدِيمِ","text_tajweed":"قَالُو[s[اْ] تَ[h:6760[ٱ]للَّهِ إِ[g[نّ]َكَ لَفِى ضَلَ[n[ـٰ]لِكَ [h:6816[ٱ]لْقَد[p[ِي]مِ","translation_en":"They said: By Allah, you are most surely in your old error.","translation_id":"Mereka (keluarganya) berkata, “Demi Allah, sesungguhnya engkau masih dalam kekeliruanmu yang dahulu.”","hasanah_per_verse":270},{"text_madani":"فَلَمَّا أَن جَاءَ الْبَشِيرُ أَلْقَاهُ عَلَىٰ وَجْهِهِ فَارْتَدَّ بَصِيرًا ۖ قَالَ أَلَمْ أَقُل لَّكُمْ إِنِّي أَعْلَمُ مِنَ اللَّهِ مَا لَا تَعْلَمُونَ","text_tajweed":"فَلَ[g[مّ][o[َآ] أَ[f:6417[ن ج][o[َا]ٓءَ [h:6817[ٱ]لْبَشِيرُ أَلْقَ[n[ـٰ]هُ عَلَىٰ وَ[q:6818[جْ]هِه[n[ِۦ] فَ[h:6819[ٱ]رْتَدَّ بَصِي[f:6820[رًا‌ۖ ق]َالَ أَلَمْ أَقُل لَّكُمْ إِ[g[نّ][o[ِىٓ] أَعْلَمُ مِنَ [h:321[ٱ]للَّهِ مَا لَا تَعْلَم[p[ُو]نَ","translation_en":"So when the bearer of good news came he cast it on his face, so forthwith he regained his sight. He said: Did I not say to you that I know from Allah what you do not know?","translation_id":"Maka ketika telah tiba pembawa kabar gembira itu, maka diusapkannya (baju itu) ke wajahnya (Yakub), lalu dia dapat melihat kembali. Dia (Yakub) berkata, “Bukankah telah aku katakan kepadamu, bahwa aku mengetahui dari Allah apa yang tidak kamu ketahui.”","hasanah_per_verse":720},{"text_madani":"قَالُوا يَا أَبَانَا اسْتَغْفِرْ لَنَا ذُنُوبَنَا إِنَّا كُنَّا خَاطِئِينَ","text_tajweed":"قَالُو[s[اْ] يَ[o[ـٰٓ]أَبَانَا [h:6821[ٱ]سْتَغْفِرْ لَنَا ذُنُوبَن[o[َآ] إِ[g[نّ]َا كُ[g[نّ]َا خَ[n[ـٰ]طِــٔ[p[ِي]نَ","translation_en":"They said: O our father! ask forgiveness of our faults for us, surely we were sinners.","translation_id":"Mereka berkata, “Wahai ayah kami! Mohonkanlah ampunan untuk kami atas dosa-dosa kami, sesungguhnya kami adalah orang yang bersalah (berdosa).”","hasanah_per_verse":390},{"text_madani":"قَالَ سَوْفَ أَسْتَغْفِرُ لَكُمْ رَبِّي ۖ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ","text_tajweed":"قَالَ سَوْفَ أَسْتَغْفِرُ لَكُمْ رَبّ[o[ِىٓ‌ۖ] إِ[g[نّ]َهُ[n[ۥ] هُوَ [h:6822[ٱ]لْغَفُورُ [h:6228[ٱ][l[ل]رَّح[p[ِي]مُ","translation_en":"He said: I will ask for you forgiveness from my Lord; surely He is the Forgiving, the Merciful.","translation_id":"Dia (Yakub) berkata, “Aku akan memohonkan ampunan bagimu kepada Tuhanku. Sungguh, Dia Yang Maha Pengampun, Maha Penyayang.”","hasanah_per_verse":350},{"text_madani":"فَلَمَّا دَخَلُوا عَلَىٰ يُوسُفَ آوَىٰ إِلَيْهِ أَبَوَيْهِ وَقَالَ ادْخُلُوا مِصْرَ إِن شَاءَ اللَّهُ آمِنِينَ","text_tajweed":"فَلَ[g[مّ]َا دَخَلُو[s[اْ] عَلَىٰ يُوسُفَ ءَاوَ[o[ىٰٓ] إِلَيْهِ أَبَوَيْهِ وَقَالَ [h:6823[ٱ][q:278[دْ]خُلُو[s[اْ] مِصْرَ إِ[f:364[ن ش][o[َا]ٓءَ [h:78[ٱ]للَّهُ ءَامِن[p[ِي]نَ","translation_en":"Then when they came in to Yusuf, he took his parents to lodge with him and said: Enter safe into Egypt, if Allah please.","translation_id":"Maka ketika mereka masuk ke (tempat) Yusuf, dia merangkul (dan menyiapkan tempat untuk) kedua orang tuanya seraya berkata, “Masuklah kamu ke negeri Mesir, insya Allah dalam keadaan aman.”","hasanah_per_verse":550},{"text_madani":"وَرَفَعَ أَبَوَيْهِ عَلَى الْعَرْشِ وَخَرُّوا لَهُ سُجَّدًا ۖ وَقَالَ يَا أَبَتِ هَٰذَا تَأْوِيلُ رُؤْيَايَ مِن قَبْلُ قَدْ جَعَلَهَا رَبِّي حَقًّا ۖ وَقَدْ أَحْسَنَ بِي إِذْ أَخْرَجَنِي مِنَ السِّجْنِ وَجَاءَ بِكُم مِّنَ الْبَدْوِ مِن بَعْدِ أَن نَّزَغَ الشَّيْطَانُ بَيْنِي وَبَيْنَ إِخْوَتِي ۚ إِنَّ رَبِّي لَطِيفٌ لِّمَا يَشَاءُ ۚ إِنَّهُ هُوَ الْعَلِيمُ الْحَكِيمُ","text_tajweed":"وَرَفَعَ أَبَوَيْهِ عَلَى [h:4740[ٱ]لْعَرْشِ وَخَرُّو[s[اْ] لَهُ[n[ۥ] سُجَّ[a:6824[دًا‌ۖ و]َقَالَ يَ[o[ـٰٓ]أَبَتِ هَ[n[ـٰ]ذَا تَأْوِيلُ رُءْيَ[n[ـٰ]ىَ مِ[f:128[ن ق]َ[q:129[بْ]لُ قَ[q:298[دْ] جَعَلَهَا رَبِّى حَق[a:6825[ًّا‌ۖ و]َقَ[q:387[دْ] أَحْسَنَ ب[o[ِىٓ] إِذْ أَخْرَجَنِى مِنَ [h:6826[ٱ][l[ل]سِّ[q:6659[جْ]نِ وَج[o[َا]ٓءَ بِك[w:6827[ُم م]ِّنَ [h:6828[ٱ]لْبَ[q:6829[دْ]وِ م[i:146[ِنۢ ب]َعْدِ أ[a:6830[َن ن]َّزَغَ [h:6831[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ بَيْنِى وَبَيْنَ إِخْوَت[o[ِىٓ‌ۚ] إِ[g[نّ]َ رَبِّى لَطِي[u:6832[فٌ ل]ِّمَا يَش[o[َا]ٓءُ‌ۚ إِ[g[نّ]َهُ[n[ۥ] هُوَ [h:6792[ٱ]لْعَلِيمُ [h:171[ٱ]لْحَك[p[ِي]مُ","translation_en":"And he raised his parents upon the throne and they fell down in prostration before him, and he said: O my father! this is the significance of my vision of old; my Lord has indeed made it to be true; and He was indeed kind to me when He brought me forth from the prison and brought you from the desert after the Shaitan had sown dissensions between me and my brothers, surely my Lord is benignant to whom He pleases; surely He is the Knowing, the Wise.","translation_id":"Dan dia menaikkan kedua orang tuanya ke atas singgasana. Dan mereka (semua) tunduk bersujud kepadanya (Yusuf). Dan dia (Yusuf) berkata, “Wahai ayahku! Inilah takwil mimpiku yang dahulu itu. Dan sesungguhnya Tuhanku telah menjadikannya kenyataan. Sesungguhnya Tuhanku telah berbuat baik kepadaku, ketika Dia membebaskan aku dari penjara dan ketika membawa kamu dari dusun, setelah setan merusak (hubungan) antara aku dengan saudara-saudaraku. Sungguh, Tuhanku Mahalembut terhadap apa yang Dia kehendaki. Sungguh, Dia Yang Maha Mengetahui, Mahabijaksana.","hasanah_per_verse":1690},{"text_madani":"رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِن تَأْوِيلِ الْأَحَادِيثِ ۚ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ","text_tajweed":"۞ رَبِّ قَ[q:298[دْ] ءَاتَيْتَنِى مِنَ [h:2845[ٱ]لْمُلْكِ وَعَلَّمْتَنِى مِ[f:6551[ن ت]َأْوِيلِ [h:6552[ٱ]لْأَحَادِيثِ‌ۚ فَاطِرَ [h:6833[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ أَ[f:169[نت]َ وَلِىّ[n[ِۦ] فِى [h:599[ٱ][l[ل]دُّنْيَا وَ[h:1213[ٱ]لْأَخِرَةِ‌ۖ تَوَفَّنِى مُسْلِ[a:6834[مًا و]َأَلْحِ[q:6835[قْ]نِى بِ[h:6836[ٱ][l[ل]صَّ[n[ـٰ]لِح[p[ِي]نَ","translation_en":"My Lord! Thou hast given me of the kingdom and taught me of the interpretation of sayings: Originator of the heavens and the earth! Thou art my guardian in this world and the hereafter; make me die a muslim and join me with the good.","translation_id":"Tuhanku, sesungguhnya Engkau telah menganugerahkan kepadaku sebagian kekuasaan dan telah mengajarkan kepadaku sebagian takwil mimpi. (Wahai Tuhan) pencipta langit dan bumi, Engkaulah pelindungku di dunia dan di akhirat, wafatkanlah aku dalam keadaan muslim dan gabungkanlah aku dengan orang yang shalih.”","hasanah_per_verse":1050},{"text_madani":"ذَٰلِكَ مِنْ أَنبَاءِ الْغَيْبِ نُوحِيهِ إِلَيْكَ ۖ وَمَا كُنتَ لَدَيْهِمْ إِذْ أَجْمَعُوا أَمْرَهُمْ وَهُمْ يَمْكُرُونَ","text_tajweed":"ذ[n[َٲ]لِكَ مِنْ أَ[i:1910[نۢب][o[َا]ٓءِ [h:1911[ٱ]لْغَيْبِ نُوحِيهِ إِلَيْكَ‌ۖ وَمَا كُ[f:735[نت]َ لَدَيْهِمْ إِذْ أَ[q:6837[جْ]مَع[o[ُوٓ][s[اْ] أَمْرَهُمْ وَهُمْ يَمْكُر[p[ُو]نَ","translation_en":"This is of the announcements relating to the unseen (which) We reveal to you, and you were not with them when they resolved upon their affair, and they were devising plans.","translation_id":"Itulah sebagian berita gaib yang Kami wahyukan kepadamu (Muhammad); padahal engkau tidak berada di samping mereka, ketika mereka bersepakat mengatur tipu muslihat (untuk memasukkan Yusuf ke dalam sumur).","hasanah_per_verse":570},{"text_madani":"وَمَا أَكْثَرُ النَّاسِ وَلَوْ حَرَصْتَ بِمُؤْمِنِينَ","text_tajweed":"وَم[o[َآ] أَكْثَرُ [h:6838[ٱ][l[ل][g[نّ]َاسِ وَلَوْ حَرَصْتَ بِمُؤْمِن[p[ِي]نَ","translation_en":"And most men will not believe though you desire it eagerly.","translation_id":"Dan kebanyakan manusia tidak akan beriman walaupun engkau sangat menginginkannya.","hasanah_per_verse":260},{"text_madani":"وَمَا تَسْأَلُهُمْ عَلَيْهِ مِنْ أَجْرٍ ۚ إِنْ هُوَ إِلَّا ذِكْرٌ لِّلْعَالَمِينَ","text_tajweed":"وَمَا تَسْــَٔلُهُمْ عَلَيْهِ مِنْ أَ[q:6133[جْ]رٍ‌ۚ إِنْ هُوَ إِلَّا ذِكْ[u:6839[رٌ ل]ِّلْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"And you do not ask them for a reward for this; it is nothing but a reminder for all mankind.","translation_id":"Dan engkau tidak meminta imbalan apa pun kepada mereka (terhadap seruanmu ini), sebab (seruan) itu adalah pengajaran bagi seluruh alam.","hasanah_per_verse":360},{"text_madani":"وَكَأَيِّن مِّنْ آيَةٍ فِي السَّمَاوَاتِ وَالْأَرْضِ يَمُرُّونَ عَلَيْهَا وَهُمْ عَنْهَا مُعْرِضُونَ","text_tajweed":"وَكَأَيّ[a:2298[ِن م]ِّنْ ءَايَ[f:6840[ةٍ ف]ِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ يَمُرُّونَ عَلَيْهَا وَهُمْ عَنْهَا مُعْرِض[p[ُو]نَ","translation_en":"And how many a sign in the heavens and the earth which they pass by, yet they turn aside from it.","translation_id":"Dan berapa banyak tanda-tanda (kebesaran Allah) di langit dan di bumi yang mereka lalui, namun mereka berpaling daripadanya.","hasanah_per_verse":490},{"text_madani":"وَمَا يُؤْمِنُ أَكْثَرُهُم بِاللَّهِ إِلَّا وَهُم مُّشْرِكُونَ","text_tajweed":"وَمَا يُؤْمِنُ أَكْثَرُه[c:6841[ُم ب]ِ[h:32[ٱ]للَّهِ إِلَّا وَه[w:6842[ُم م]ُّشْرِك[p[ُو]نَ","translation_en":"And most of them do not believe in Allah without associating others (with Him).","translation_id":"Dan kebanyakan mereka tidak beriman kepada Allah, bahkan mereka mempersekutukan-Nya.","hasanah_per_verse":300},{"text_madani":"أَفَأَمِنُوا أَن تَأْتِيَهُمْ غَاشِيَةٌ مِّنْ عَذَابِ اللَّهِ أَوْ تَأْتِيَهُمُ السَّاعَةُ بَغْتَةً وَهُمْ لَا يَشْعُرُونَ","text_tajweed":"أَفَأَمِن[o[ُوٓ][s[اْ] أَ[f:6843[ن ت]َأْتِيَهُمْ غَ[n[ـٰ]شِيَ[a:6844[ةٌ م]ِّنْ عَذَابِ [h:6845[ٱ]للَّهِ أَوْ تَأْتِيَهُمُ [h:6846[ٱ][l[ل]سَّاعَةُ بَغْتَ[a:4880[ةً و]َهُمْ لَا يَشْعُر[p[ُو]نَ","translation_en":"Do they then feel secure that there may come to them an extensive chastisement from Allah or (that) the hour may come to them suddenly while they do not perceive?","translation_id":"Apakah mereka merasa aman dari kedatangan siksa Allah yang meliputi mereka, atau kedatangan Kiamat kepada mereka secara mendadak, sedang mereka tidak menyadarinya?","hasanah_per_verse":590},{"text_madani":"قُلْ هَٰذِهِ سَبِيلِي أَدْعُو إِلَى اللَّهِ ۚ عَلَىٰ بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي ۖ وَسُبْحَانَ اللَّهِ وَمَا أَنَا مِنَ الْمُشْرِكِينَ","text_tajweed":"قُلْ هَ[n[ـٰ]ذِه[n[ِۦ] سَبِيل[o[ِىٓ] أَ[q:6847[دْ]ع[o[ُوٓ][s[اْ] إِلَى [h:1637[ٱ]للَّهِ‌ۚ عَلَىٰ بَصِيرَةٍ أَنَا۟ وَمَنِ [h:6848[ٱ]تَّبَعَنِى‌ۖ وَسُ[q:6849[بْ]حَ[n[ـٰ]نَ [h:6850[ٱ]للَّهِ وَم[o[َآ] أَنَا۟ مِنَ [h:699[ٱ]لْمُشْرِك[p[ِي]نَ","translation_en":"Say: This is my way: I call to Allah, I and those who follow me being certain, and glory be to Allah, and I am not one of the polytheists.","translation_id":"Katakanlah (Muhammad), “Inilah jalanku, aku dan orang-orang yang mengikutiku mengajak (kamu) kepada Allah dengan yakin, Mahasuci Allah, dan aku tidak termasuk orang-orang musyrik.”","hasanah_per_verse":670},{"text_madani":"وَمَا أَرْسَلْنَا مِن قَبْلِكَ إِلَّا رِجَالًا نُّوحِي إِلَيْهِم مِّنْ أَهْلِ الْقُرَىٰ ۗ أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِن قَبْلِهِمْ ۗ وَلَدَارُ الْآخِرَةِ خَيْرٌ لِّلَّذِينَ اتَّقَوْا ۗ أَفَلَا تَعْقِلُونَ","text_tajweed":"وَم[o[َآ] أَرْسَلْنَا مِ[f:18[ن ق]َ[q:19[بْ]لِكَ إِلَّا رِجَال[a:6851[اً ن]ُّوح[o[ِىٓ] إِلَيْه[w:3682[ِم م]ِّنْ أَهْلِ [h:6852[ٱ]لْقُرَ[o[ىٰٓ‌ۗ] أَفَلَمْ يَسِيرُو[s[اْ] فِى [h:44[ٱ]لْأَرْضِ فَيَ[f:6853[نظ]ُرُو[s[اْ] كَيْفَ كَانَ عَ[n[ـٰ]قِبَةُ [h:6854[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ‌ۗ وَلَدَارُ [h:6855[ٱ]لْأَخِرَةِ خَيْ[u:4005[رٌ ل]ِّلَّذِينَ [h:1785[ٱ]تَّقَوْ[s[اْ‌ۗ] أَفَلَا تَعْقِل[p[ُو]نَ","translation_en":"And We have not sent before you but men from (among) the people of the towns, to whom We sent revelations. Have they not then travelled in the land and seen what was the end of those before them? And certainly the abode of the hereafter is best for those who guard (against evil); do you not then understand?","translation_id":"Dan Kami tidak mengutus sebelummu (Muhammad), melainkan orang laki-laki yang Kami berikan wahyu kepadanya di antara penduduk negeri. Tidakkah mereka bepergian di bumi lalu melihat bagaimana kesudahan orang-orang sebelum mereka (yang mendustakan rasul). Dan sungguh, negeri akhirat itu lebih baik bagi orang yang bertakwa. Tidakkah kamu mengerti?","hasanah_per_verse":1230},{"text_madani":"حَتَّىٰ إِذَا اسْتَيْأَسَ الرُّسُلُ وَظَنُّوا أَنَّهُمْ قَدْ كُذِبُوا جَاءَهُمْ نَصْرُنَا فَنُجِّيَ مَن نَّشَاءُ ۖ وَلَا يُرَدُّ بَأْسُنَا عَنِ الْقَوْمِ الْمُجْرِمِينَ","text_tajweed":"حَتَّ[o[ىٰٓ] إِذَا [h:6856[ٱ]سْتَيْــَٔسَ [h:6857[ٱ][l[ل]رُّسُلُ وَظَ[g[نّ][o[ُوٓ][s[اْ] أَ[g[نّ]َهُمْ قَ[q:298[دْ] كُذِبُو[s[اْ] ج[o[َا]ٓءَهُمْ نَصْرُنَا فَنُجِّىَ م[a:4211[َن ن]َّش[o[َا]ٓءُ‌ۖ وَلَا يُرَدُّ بَأْسُنَا عَنِ [h:4503[ٱ]لْقَوْمِ [h:4504[ٱ]لْمُ[q:4093[جْ]رِم[p[ِي]نَ","translation_en":"Until when the messengers despaired and the people became sure that they were indeed told a lie, Our help came to them and whom We pleased was delivered; and Our punishment is not averted from the guilty people.","translation_id":"Sehingga apabila para rasul tidak mempunyai harapan lagi (tentang keimanan kaumnya) dan telah meyakini bahwa mereka telah didustakan, datanglah kepada mereka (para rasul) itu pertolongan Kami, lalu diselamatkan orang yang Kami kehendaki. Dan siksa Kami tidak dapat ditolak dari orang yang berdosa.","hasanah_per_verse":790},{"text_madani":"لَقَدْ كَانَ فِي قَصَصِهِمْ عِبْرَةٌ لِّأُولِي الْأَلْبَابِ ۗ مَا كَانَ حَدِيثًا يُفْتَرَىٰ وَلَٰكِن تَصْدِيقَ الَّذِي بَيْنَ يَدَيْهِ وَتَفْصِيلَ كُلِّ شَيْءٍ وَهُدًى وَرَحْمَةً لِّقَوْمٍ يُؤْمِنُونَ","text_tajweed":"لَقَ[q:2389[دْ] كَانَ فِى قَصَصِهِمْ عِ[q:6858[بْ]رَ[u:6859[ةٌ ل]ِّأُ[s[وْ]لِى [h:2496[ٱ]لْأَلْبَ[n[ـٰ]بِ‌ۗ مَا كَانَ حَدِي[a:6860[ثًا ي]ُفْتَرَىٰ وَلَ[n[ـٰ]كِ[f:6058[ن ت]َصْدِيقَ [h:6059[ٱ]لَّذِى بَيْنَ يَدَيْهِ وَتَفْصِيلَ كُلِّ ش[a:4536[َىْءٍ و]َهُ[a:4537[دًى و]َرَحْمَ[u:4735[ةً ل]ِّقَوْ[a:4294[مٍ ي]ُؤْمِن[p[ُو]نَ","translation_en":"In their histories there is certainly a lesson for men of understanding. It is not a narrative which could be forged, but a verification of what is before it and a distinct explanation of all things and a guide and a mercy to a people who believe.","translation_id":"Sungguh, pada kisah-kisah mereka itu terdapat pengajaran bagi orang yang mempunyai akal. (Al-Qur'an) itu bukanlah cerita yang dibuat-buat, tetapi membenarkan (kitab-kitab) yang sebelumnya, menjelaskan segala sesuatu, dan (sebagai) petunjuk dan rahmat bagi orang-orang yang beriman.","hasanah_per_verse":940}]}
