{"chapter_number":15,"name_simple":"Al-Hijr","name_meaning":{"text":"The Rocky Tract","en":"The Rocky Tract","id":"Bukit"},"verses_count":99,"hasanah":28820,"verses":[{"text_madani":"الر ۚ تِلْكَ آيَاتُ الْكِتَابِ وَقُرْآنٍ مُّبِينٍ","text_tajweed":"ا[m[لٓ]ر‌ۚ تِلْكَ ءَايَ[n[ـٰ]تُ [h:5932[ٱ]لْكِتَ[n[ـٰ]بِ وَقُرْءَا[a:7193[نٍ م]ُّب[p[ِي]نٍ","translation_en":"Alif Lam Ra. These are the verses of the Book and (of) a Quran that makes (things) clear.","translation_id":"Alif Lam Ra. (Surah) ini adalah (sebagian dari) ayat-ayat Kitab (yang sempurna) yaitu (ayat-ayat) Al-Qur'an yang memberi penjelasan.","hasanah_per_verse":250},{"text_madani":"رُّبَمَا يَوَدُّ الَّذِينَ كَفَرُوا لَوْ كَانُوا مُسْلِمِينَ","text_tajweed":"رُّبَمَا يَوَدُّ [h:544[ٱ]لَّذِينَ كَفَرُو[s[اْ] لَوْ كَانُو[s[اْ] مُسْلِم[p[ِي]نَ","translation_en":"Often will those who disbelieve wish that they had been Muslims.","translation_id":"Orang kafir itu kadang-kadang (nanti di akhirat) menginginkan, sekiranya mereka dahulu (di dunia) menjadi orang Muslim.","hasanah_per_verse":300},{"text_madani":"ذَرْهُمْ يَأْكُلُوا وَيَتَمَتَّعُوا وَيُلْهِهِمُ الْأَمَلُ ۖ فَسَوْفَ يَعْلَمُونَ","text_tajweed":"ذَرْهُمْ يَأْكُلُو[s[اْ] وَيَتَمَتَّعُو[s[اْ] وَيُلْهِهِمُ [h:7194[ٱ]لْأَمَلُ‌ۖ فَسَوْفَ يَعْلَم[p[ُو]نَ","translation_en":"Leave them that they may eat and enjoy themselves and (that) hope may beguile them, for they will soon know.","translation_id":"Biarkanlah mereka (di dunia ini) makan dan bersenang-senang dan dilalaikan oleh angan-angan (kosong) mereka, kelak mereka akan mengetahui (akibat perbuatannya).","hasanah_per_verse":390},{"text_madani":"وَمَا أَهْلَكْنَا مِن قَرْيَةٍ إِلَّا وَلَهَا كِتَابٌ مَّعْلُومٌ","text_tajweed":"وَم[o[َآ] أَهْلَكْنَا مِ[f:4585[ن ق]َرْيَةٍ إِلَّا وَلَهَا كِتَا[a:7195[بٌ م]َّعْل[p[ُو]مٌ","translation_en":"And never did We destroy a town but it had a term made known.","translation_id":"Dan Kami tidak membinasakan suatu negeri, melainkan sudah ada ketentuan yang ditetapkan baginya.","hasanah_per_verse":310},{"text_madani":"مَّا تَسْبِقُ مِنْ أُمَّةٍ أَجَلَهَا وَمَا يَسْتَأْخِرُونَ","text_tajweed":"مَّا تَسْبِقُ مِنْ أُ[g[مّ]َةٍ أَجَلَهَا وَمَا يَسْتَــْٔخِر[p[ُو]نَ","translation_en":"No people can hasten on their doom nor can they postpone (it).","translation_id":"Tidak ada suatu umat pun yang dapat mendahului ajalnya, dan tidak (pula) dapat meminta penundaan(nya).","hasanah_per_verse":270},{"text_madani":"وَقَالُوا يَا أَيُّهَا الَّذِي نُزِّلَ عَلَيْهِ الذِّكْرُ إِنَّكَ لَمَجْنُونٌ","text_tajweed":"وَقَالُو[s[اْ] يَ[o[ـٰٓ]أَيُّهَا [h:7196[ٱ]لَّذِى نُزِّلَ عَلَيْهِ [h:7197[ٱ][l[ل]ذِّكْرُ إِ[g[نّ]َكَ لَمَ[q:7198[جْ]ن[p[ُو]نٌ","translation_en":"And they say: O you to whom the Reminder has been revealed! you are most surely insane:","translation_id":"Dan mereka berkata, “Wahai orang yang kepadanya diturunkan Al-Qur'an, sesungguhnya engkau (Muhammad) benar-benar orang gila.","hasanah_per_verse":370},{"text_madani":"لَّوْ مَا تَأْتِينَا بِالْمَلَائِكَةِ إِن كُنتَ مِنَ الصَّادِقِينَ","text_tajweed":"لَّوْ مَا تَأْتِينَا بِ[h:7199[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةِ إِ[f:4792[ن ك]ُ[f:735[نت]َ مِنَ [h:4793[ٱ][l[ل]صَّ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"Why do you not bring to us the angels if you are of the truthful ones?","translation_id":"Mengapa engkau tidak mendatangkan malaikat kepada kami, jika engkau termasuk orang yang benar?”","hasanah_per_verse":340},{"text_madani":"مَا نُنَزِّلُ الْمَلَائِكَةَ إِلَّا بِالْحَقِّ وَمَا كَانُوا إِذًا مُّنظَرِينَ","text_tajweed":"مَا نُنَزِّلُ [h:7200[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةَ إِلَّا بِ[h:370[ٱ]لْحَقِّ وَمَا كَان[o[ُوٓ][s[اْ] إِ[a:7201[ذًا م]ُّ[f:7202[نظ]َر[p[ِي]نَ","translation_en":"We do not send the angels but with truth, and then they would not be respited.","translation_id":"Kami tidak menurunkan malaikat melainkan dengan kebenaran (untuk membawa azab) dan mereka ketika itu tidak diberikan penangguhan.","hasanah_per_verse":390},{"text_madani":"إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ","text_tajweed":"إِ[g[نّ]َا نَحْنُ نَزَّلْنَا [h:7203[ٱ][l[ل]ذِّكْرَ وَإِ[g[نّ]َا لَهُ[n[ۥ] لَحَ[n[ـٰ]فِظ[p[ُو]نَ","translation_en":"Surely We have revealed the Reminder and We will most surely be its guardian.","translation_id":"Sesungguhnya Kamilah yang menurunkan Al-Qur'an, dan pasti Kami (pula) yang memeliharanya.","hasanah_per_verse":290},{"text_madani":"وَلَقَدْ أَرْسَلْنَا مِن قَبْلِكَ فِي شِيَعِ الْأَوَّلِينَ","text_tajweed":"وَلَقَ[q:341[دْ] أَرْسَلْنَا مِ[f:18[ن ق]َ[q:19[بْ]لِكَ فِى شِيَعِ [h:7204[ٱ]لْأَوَّل[p[ِي]نَ","translation_en":"And certainly We sent (messengers) before you among the nations of yore.","translation_id":"Dan sungguh, Kami telah mengutus (beberapa rasul) sebelum engkau (Muhammad) kepada umat-umat terdahulu.","hasanah_per_verse":280},{"text_madani":"وَمَا يَأْتِيهِم مِّن رَّسُولٍ إِلَّا كَانُوا بِهِ يَسْتَهْزِئُونَ","text_tajweed":"وَمَا يَأْتِيه[w:7205[ِم م]ّ[u:2882[ِن ر]َّسُولٍ إِلَّا كَانُو[s[اْ] بِه[n[ِۦ] يَسْتَهْزِء[p[ُو]نَ","translation_en":"And there never came a messenger to them but they mocked him.","translation_id":"Dan setiap kali seorang rasul datang kepada mereka, mereka selalu memperolok-olokannya.","hasanah_per_verse":330},{"text_madani":"كَذَٰلِكَ نَسْلُكُهُ فِي قُلُوبِ الْمُجْرِمِينَ","text_tajweed":"كَذ[n[َٲ]لِكَ نَسْلُكُهُ[n[ۥ] فِى قُلُوبِ [h:7206[ٱ]لْمُ[q:4093[جْ]رِم[p[ِي]نَ","translation_en":"Thus do We make it to enter into the hearts of the guilty;","translation_id":"Demikianlah, Kami memasukkannya (olok-olok itu) ke dalam hati orang yang berdosa,","hasanah_per_verse":230},{"text_madani":"لَا يُؤْمِنُونَ بِهِ ۖ وَقَدْ خَلَتْ سُنَّةُ الْأَوَّلِينَ","text_tajweed":"لَا يُؤْمِنُونَ بِه[n[ِۦ]‌ۖ وَقَ[q:387[دْ] خَلَتْ سُ[g[نّ]َةُ [h:7207[ٱ]لْأَوَّل[p[ِي]نَ","translation_en":"They do not believe in it, and indeed the example of the former people has already passed.","translation_id":"mereka tidak beriman kepadanya (Al-Qur'an) padahal telah berlalu sunatullah terhadap orang-orang terdahulu.","hasanah_per_verse":260},{"text_madani":"وَلَوْ فَتَحْنَا عَلَيْهِم بَابًا مِّنَ السَّمَاءِ فَظَلُّوا فِيهِ يَعْرُجُونَ","text_tajweed":"وَلَوْ فَتَحْنَا عَلَيْه[c:7208[ِم ب]َا[a:7209[بًا م]ِّنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ فَظَلُّو[s[اْ] فِيهِ يَعْرُج[p[ُو]نَ","translation_en":"And even if We open to them a gateway of heaven, so that they ascend into it all the while,","translation_id":"Dan kalau Kami bukakan kepada mereka salah satu pintu langit, lalu mereka terus menerus naik ke atasnya,","hasanah_per_verse":390},{"text_madani":"لَقَالُوا إِنَّمَا سُكِّرَتْ أَبْصَارُنَا بَلْ نَحْنُ قَوْمٌ مَّسْحُورُونَ","text_tajweed":"لَقَال[o[ُوٓ][s[اْ] إِ[g[نّ]َمَا سُكِّرَتْ أَ[q:7210[بْ]صَ[n[ـٰ]رُنَا بَلْ نَحْنُ قَوْ[a:7211[مٌ م]َّسْحُور[p[ُو]نَ","translation_en":"They would certainly say: Only our eyes have been covered over, rather we are an enchanted people.","translation_id":"tentulah mereka berkata, “Sesungguhnya pandangan kamilah yang dikaburkan, bahkan kami adalah orang yang terkena sihir.”","hasanah_per_verse":360},{"text_madani":"وَلَقَدْ جَعَلْنَا فِي السَّمَاءِ بُرُوجًا وَزَيَّنَّاهَا لِلنَّاظِرِينَ","text_tajweed":"وَلَقَ[q:341[دْ] جَعَلْنَا فِى [h:746[ٱ][l[ل]سَّم[o[َا]ٓءِ بُرُو[a:7212[جًا و]َزَيَّ[g[نّ]َ[n[ـٰ]هَا لِل[g[نّ]َ[n[ـٰ]ظِر[p[ِي]نَ","translation_en":"And certainly We have made strongholds in the heaven and We have made it fair seeming to the beholders.","translation_id":"Dan sungguh, Kami telah menciptakan gugusan bintang di langit dan men-jadikannya terasa indah bagi orang yang memandang(nya),","hasanah_per_verse":370},{"text_madani":"وَحَفِظْنَاهَا مِن كُلِّ شَيْطَانٍ رَّجِيمٍ","text_tajweed":"وَحَفِظْنَ[n[ـٰ]هَا مِ[f:843[ن ك]ُلِّ شَيْطَ[n[ـٰ][u:7213[نٍ ر]َّج[p[ِي]مٍ","translation_en":"And We guard it against every accursed Shaitan,","translation_id":"dan Kami menjaganya dari setiap (gangguan) setan yang terkutuk,","hasanah_per_verse":210},{"text_madani":"إِلَّا مَنِ اسْتَرَقَ السَّمْعَ فَأَتْبَعَهُ شِهَابٌ مُّبِينٌ","text_tajweed":"إِلَّا مَنِ [h:7214[ٱ]سْتَرَقَ [h:7215[ٱ][l[ل]سَّمْعَ فَأَتْبَعَهُ[n[ۥ] شِهَا[a:7216[بٌ م]ُّب[p[ِي]نٌ","translation_en":"But he who steals a hearing, so there follows him a visible flame.","translation_id":"kecuali (setan) yang mencuri-curi (berita) yang dapat didengar (dari malaikat) lalu dikejar oleh semburan api yang terang.","hasanah_per_verse":290},{"text_madani":"وَالْأَرْضَ مَدَدْنَاهَا وَأَلْقَيْنَا فِيهَا رَوَاسِيَ وَأَنبَتْنَا فِيهَا مِن كُلِّ شَيْءٍ مَّوْزُونٍ","text_tajweed":"وَ[h:9999[ٱ]لْأَرْضَ مَدَ[q:7217[دْ]نَ[n[ـٰ]هَا وَأَلْقَيْنَا فِيهَا رَو[n[َٲ]سِىَ وَأَ[i:7218[نۢب]َتْنَا فِيهَا مِ[f:843[ن ك]ُلِّ ش[a:7219[َىْءٍ م]َّوْز[p[ُو]نٍ","translation_en":"And the earth-- We have spread it forth and made in it firm mountains and caused to grow in it of every suitable thing.","translation_id":"Dan Kami telah menghamparkan bumi dan Kami pancangkan padanya gunung-gunung serta Kami tumbuhkan di sana segala sesuatu menurut ukuran.","hasanah_per_verse":520},{"text_madani":"وَجَعَلْنَا لَكُمْ فِيهَا مَعَايِشَ وَمَن لَّسْتُمْ لَهُ بِرَازِقِينَ","text_tajweed":"وَجَعَلْنَا لَكُمْ فِيهَا مَعَ[n[ـٰ]يِشَ وَم[u:7220[َن ل]َّسْتُمْ لَهُ[n[ۥ] بِر[n[َٲ]زِق[p[ِي]نَ","translation_en":"And We have made in it means of subsistence for you and for him for whom you are not the suppliers.","translation_id":"Dan Kami telah menjadikan padanya sumber-sumber kehidupan untuk keperluanmu, dan (Kami ciptakan pula) makhluk-makhluk yang bukan kamu pemberi rezekinya.","hasanah_per_verse":340},{"text_madani":"وَإِن مِّن شَيْءٍ إِلَّا عِندَنَا خَزَائِنُهُ وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَّعْلُومٍ","text_tajweed":"وَإ[a:3281[ِن م]ِّ[f:2103[ن ش]َىْءٍ إِلَّا عِ[f:2359[ند]َنَا خَز[o[َا]ٓئِنُهُ[n[ۥ] وَمَا نُنَزِّلُهُ[o[ۥٓ] إِلَّا بِقَدَ[a:7221[رٍ م]َّعْل[p[ُو]مٍ","translation_en":"And there is not a thing but with Us are the treasures of it, and We do not send it down but in a known measure.","translation_id":"Dan tidak ada sesuatu pun, melainkan pada sisi Kamilah khazanahnya; Kami tidak menurunkannya melainkan dengan ukuran tertentu.","hasanah_per_verse":420},{"text_madani":"وَأَرْسَلْنَا الرِّيَاحَ لَوَاقِحَ فَأَنزَلْنَا مِنَ السَّمَاءِ مَاءً فَأَسْقَيْنَاكُمُوهُ وَمَا أَنتُمْ لَهُ بِخَازِنِينَ","text_tajweed":"وَأَرْسَلْنَا [h:7222[ٱ][l[ل]رِّيَ[n[ـٰ]حَ لَو[n[َٲ]قِحَ فَأَ[f:288[نز]َلْنَا مِنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ م[o[َا]ٓ[f:7223[ءً ف]َأَسْقَيْنَ[n[ـٰ]كُمُوهُ وَم[o[َآ] أَ[f:428[نت]ُمْ لَهُ[n[ۥ] بِخَ[n[ـٰ]زِن[p[ِي]نَ","translation_en":"And We send the winds fertilizing, then send down water from the cloud so We give it to you to drink of, nor is it you who store it up.","translation_id":"Dan Kami telah meniupkan angin untuk mengawinkan dan Kami turunkan hujan dari langit, lalu Kami beri minum kamu dengan (air) itu, dan bukanlah kamu yang menyimpannya.","hasanah_per_verse":630},{"text_madani":"وَإِنَّا لَنَحْنُ نُحْيِي وَنُمِيتُ وَنَحْنُ الْوَارِثُونَ","text_tajweed":"وَإِ[g[نّ]َا لَنَحْنُ نُحْى[n[ِۦ] وَنُمِيتُ وَنَحْنُ [h:7224[ٱ]لْو[n[َٲ]رِث[p[ُو]نَ","translation_en":"And most surely We bring to life and cause to die and We are the heirs.","translation_id":"Dan sungguh, Kamilah yang menghidupkan dan mematikan dan Kami (pulalah) yang mewarisi.","hasanah_per_verse":290},{"text_madani":"وَلَقَدْ عَلِمْنَا الْمُسْتَقْدِمِينَ مِنكُمْ وَلَقَدْ عَلِمْنَا الْمُسْتَأْخِرِينَ","text_tajweed":"وَلَقَ[q:341[دْ] عَلِمْنَا [h:7225[ٱ]لْمُسْتَ[q:7226[قْ]دِمِينَ مِ[f:344[نك]ُمْ وَلَقَ[q:341[دْ] عَلِمْنَا [h:7227[ٱ]لْمُسْتَــْٔخِر[p[ِي]نَ","translation_en":"And certainly We know those of you who have gone before and We certainly know those who shall come later.","translation_id":"Dan sungguh, Kami mengetahui orang yang terdahulu sebelum kamu dan Kami mengetahui pula orang yang terkemudian.","hasanah_per_verse":420},{"text_madani":"وَإِنَّ رَبَّكَ هُوَ يَحْشُرُهُمْ ۚ إِنَّهُ حَكِيمٌ عَلِيمٌ","text_tajweed":"وَإِ[g[نّ]َ رَبَّكَ هُوَ يَحْشُرُهُمْ‌ۚ إِ[g[نّ]َهُ[n[ۥ] حَكِيمٌ عَل[p[ِي]مٌ","translation_en":"And surely your Lord will gather them together; surely He is Wise, Knowing.","translation_id":"Dan sesungguhnya Tuhanmu, Dialah yang akan mengumpulkan mereka. Sungguh, Dia Mahabijaksana, Maha Mengetahui.","hasanah_per_verse":250},{"text_madani":"وَلَقَدْ خَلَقْنَا الْإِنسَانَ مِن صَلْصَالٍ مِّنْ حَمَإٍ مَّسْنُونٍ","text_tajweed":"وَلَقَ[q:341[دْ] خَلَ[q:5159[قْ]نَا [h:7228[ٱ]لْإِ[f:5969[نس]َ[n[ـٰ]نَ مِ[f:7229[ن ص]َلْصَ[n[ـٰ][a:7230[لٍ م]ِّنْ حَمَ[a:7231[إٍ م]َّسْن[p[ُو]نٍ","translation_en":"And certainly We created man of clay that gives forth sound, of black mud fashioned in shape.","translation_id":"Dan sungguh, Kami telah menciptakan manusia (Adam) dari tanah liat kering dari lumpur hitam yang diberi bentuk.","hasanah_per_verse":330},{"text_madani":"وَالْجَانَّ خَلَقْنَاهُ مِن قَبْلُ مِن نَّارِ السَّمُومِ","text_tajweed":"وَ[h:9999[ٱ]لْج[m[َا]ٓ[g[نّ]َ خَلَ[q:7232[قْ]نَ[n[ـٰ]هُ مِ[f:128[ن ق]َ[q:129[بْ]لُ م[a:7233[ِن ن]َّارِ [h:7234[ٱ][l[ل]سَّم[p[ُو]مِ","translation_en":"And the jinn We created before, of intensely hot fire.","translation_id":"Dan Kami telah menciptakan jin sebelum (Adam) dari api yang sangat panas.","hasanah_per_verse":280},{"text_madani":"وَإِذْ قَالَ رَبُّكَ لِلْمَلَائِكَةِ إِنِّي خَالِقٌ بَشَرًا مِّن صَلْصَالٍ مِّنْ حَمَإٍ مَّسْنُونٍ","text_tajweed":"وَإِذْ قَالَ رَبُّكَ لِلْمَلَ[o[ـٰٓ]ئِكَةِ إِ[g[نّ]ِى خَ[n[ـٰ]لِ[i:7235[قُۢ ب]َشَ[a:7236[رًا م]ِّ[f:7229[ن ص]َلْصَ[n[ـٰ][a:7230[لٍ م]ِّنْ حَمَ[a:7231[إٍ م]َّسْن[p[ُو]نٍ","translation_en":"And when your Lord said to the angels: Surely I am going to create a mortal of the essence of black mud fashioned in shape.","translation_id":"Dan (ingatlah), ketika Tuhanmu berfirman kepada para malaikat, “Sungguh, Aku akan menciptakan seorang manusia dari tanah liat kering dari lumpur hitam yang diberi bentuk.","hasanah_per_verse":450},{"text_madani":"فَإِذَا سَوَّيْتُهُ وَنَفَخْتُ فِيهِ مِن رُّوحِي فَقَعُوا لَهُ سَاجِدِينَ","text_tajweed":"فَإِذَا سَوَّيْتُهُ[n[ۥ] وَنَفَخْتُ فِيهِ م[u:7237[ِن ر]ُّوحِى فَقَعُو[s[اْ] لَهُ[n[ۥ] سَ[n[ـٰ]جِد[p[ِي]نَ","translation_en":"So when I have made him complete and breathed into him of My spirit, fall down making obeisance to him.","translation_id":"Maka apabila Aku telah menyempurnakan (kejadian)nya, dan Aku telah meniupkan roh (ciptaan)-Ku ke dalamnya, maka tunduklah kamu kepadanya dengan bersujud.”","hasanah_per_verse":360},{"text_madani":"فَسَجَدَ الْمَلَائِكَةُ كُلُّهُمْ أَجْمَعُونَ","text_tajweed":"فَسَجَدَ [h:7238[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ كُلُّهُمْ أَ[q:7239[جْ]مَع[p[ُو]نَ","translation_en":"So the angels made obeisance, all of them together,","translation_id":"Maka bersujudlah para malaikat itu semuanya bersama-sama,","hasanah_per_verse":220},{"text_madani":"إِلَّا إِبْلِيسَ أَبَىٰ أَن يَكُونَ مَعَ السَّاجِدِينَ","text_tajweed":"إِلّ[o[َآ] إِ[q:180[بْ]لِيسَ أَبَ[o[ىٰٓ] أ[a:3312[َن ي]َكُونَ مَعَ [h:7240[ٱ][l[ل]سَّ[n[ـٰ]جِد[p[ِي]نَ","translation_en":"But Iblis (did it not); he refused to be with those who made obeisance.","translation_id":"kecuali Iblis. Ia enggan ikut bersama-sama para (malaikat) yang sujud itu.","hasanah_per_verse":270},{"text_madani":"قَالَ يَا إِبْلِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ السَّاجِدِينَ","text_tajweed":"قَالَ يَ[o[ـٰٓ]إِ[q:7241[بْ]لِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ [h:7240[ٱ][l[ل]سَّ[n[ـٰ]جِد[p[ِي]نَ","translation_en":"He said: O Iblis! what excuse have you that you are not with those who make obeisance?","translation_id":"Dia (Allah) berfirman, “Wahai Iblis! Apa sebabnya kamu (tidak ikut) sujud bersama mereka?”","hasanah_per_verse":310},{"text_madani":"قَالَ لَمْ أَكُن لِّأَسْجُدَ لِبَشَرٍ خَلَقْتَهُ مِن صَلْصَالٍ مِّنْ حَمَإٍ مَّسْنُونٍ","text_tajweed":"قَالَ لَمْ أَك[u:7242[ُن ل]ِّأَسْجُدَ لِبَشَرٍ خَلَ[q:7243[قْ]تَهُ[n[ۥ] مِ[f:7229[ن ص]َلْصَ[n[ـٰ][a:7230[لٍ م]ِّنْ حَمَ[a:7231[إٍ م]َّسْن[p[ُو]نٍ","translation_en":"He said: I am not such that I should make obeisance to a mortal whom Thou hast created of the essence of black mud fashioned in shape.","translation_id":"Ia (Iblis) berkata, “Aku sekali-kali tidak akan sujud kepada manusia yang Engkau telah menciptakannya dari tanah liat kering dari lumpur hitam yang diberi bentuk.”","hasanah_per_verse":390},{"text_madani":"قَالَ فَاخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ","text_tajweed":"قَالَ فَ[h:4603[ٱ]خْرُ[q:4603[جْ] مِنْهَا فَإِ[g[نّ]َكَ رَج[p[ِي]مٌ","translation_en":"He said: Then get out of it, for surely you are driven away:","translation_id":"Dia (Allah) berfirman, “(Kalau begitu) keluarlah dari surga, karena sesungguhnya kamu terkutuk,","hasanah_per_verse":200},{"text_madani":"وَإِنَّ عَلَيْكَ اللَّعْنَةَ إِلَىٰ يَوْمِ الدِّينِ","text_tajweed":"وَإِ[g[نّ]َ عَلَيْكَ [h:7244[ٱ][l[ل]لَّعْنَةَ إِلَىٰ يَوْمِ [h:5[ٱ][l[ل]دّ[p[ِي]نِ","translation_en":"And surely on you is curse until the day of judgment.","translation_id":"dan sesungguhnya kutukan itu tetap menimpamu sampai hari Kiamat.”","hasanah_per_verse":240},{"text_madani":"قَالَ رَبِّ فَأَنظِرْنِي إِلَىٰ يَوْمِ يُبْعَثُونَ","text_tajweed":"قَالَ رَبِّ فَأَ[f:7245[نظ]ِرْن[o[ِىٓ] إِلَىٰ يَوْمِ يُ[q:4606[بْ]عَث[p[ُو]نَ","translation_en":"He said: My Lord! then respite me till the time when they are raised.","translation_id":"Ia (Iblis) berkata, “Ya Tuhanku, (kalau begitu) maka berilah penangguhan kepadaku sampai hari (manusia) dibangkitkan.”","hasanah_per_verse":240},{"text_madani":"قَالَ فَإِنَّكَ مِنَ الْمُنظَرِينَ","text_tajweed":"قَالَ فَإِ[g[نّ]َكَ مِنَ [h:4607[ٱ]لْمُ[f:4608[نظ]َر[p[ِي]نَ","translation_en":"He said: So surely you are of the respited ones","translation_id":"Allah berfirman, “(Baiklah) maka sesungguhnya kamu termasuk yang diberi penangguhan,","hasanah_per_verse":170},{"text_madani":"إِلَىٰ يَوْمِ الْوَقْتِ الْمَعْلُومِ","text_tajweed":"إِلَىٰ يَوْمِ [h:7246[ٱ]لْوَ[q:7247[قْ]تِ [h:7248[ٱ]لْمَعْل[p[ُو]مِ","translation_en":"Till the period of the time made known.","translation_id":"sampai hari yang telah ditentukan (kiamat).”","hasanah_per_verse":180},{"text_madani":"قَالَ رَبِّ بِمَا أَغْوَيْتَنِي لَأُزَيِّنَنَّ لَهُمْ فِي الْأَرْضِ وَلَأُغْوِيَنَّهُمْ أَجْمَعِينَ","text_tajweed":"قَالَ رَبِّ بِم[o[َآ] أَغْوَيْتَنِى لَأُزَيِّنَ[g[نّ]َ لَهُمْ فِى [h:44[ٱ]لْأَرْضِ وَلَأُغْوِيَ[g[نّ]َهُمْ أَ[q:825[جْ]مَع[p[ِي]نَ","translation_en":"He said: My Lord! because Thou hast made life evil to me, I will certainly make (evil) fair-seeming to them on earth, and I will certainly cause them all to deviate","translation_id":"Ia (Iblis) berkata, “Tuhanku, oleh karena Engkau telah memutuskan bahwa aku sesat, aku pasti akan jadikan (kejahatan) terasa indah bagi mereka di bumi, dan aku akan menyesatkan mereka semuanya,","hasanah_per_verse":460},{"text_madani":"إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ","text_tajweed":"إِلَّا عِبَادَكَ مِنْهُمُ [h:7249[ٱ]لْمُخْلَص[p[ِي]نَ","translation_en":"Except Thy servants from among them, the devoted ones.","translation_id":"kecuali hamba-hamba-Mu yang terpilih di antara mereka.”","hasanah_per_verse":200},{"text_madani":"قَالَ هَٰذَا صِرَاطٌ عَلَيَّ مُسْتَقِيمٌ","text_tajweed":"قَالَ هَ[n[ـٰ]ذَا صِر[n[َٲ]طٌ عَلَىَّ مُسْتَق[p[ِي]مٌ","translation_en":"He said: This is a right way with Me:","translation_id":"Dia (Allah) berfirman, “Ini adalah jalan yang lurus (menuju) kepada-Ku.”","hasanah_per_verse":190},{"text_madani":"إِنَّ عِبَادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطَانٌ إِلَّا مَنِ اتَّبَعَكَ مِنَ الْغَاوِينَ","text_tajweed":"إِ[g[نّ]َ عِبَادِى لَيْسَ لَكَ عَلَيْهِمْ سُلْطَ[n[ـٰ]نٌ إِلَّا مَنِ [h:7250[ٱ]تَّبَعَكَ مِنَ [h:5135[ٱ]لْغَاو[p[ِي]نَ","translation_en":"Surely. as regards My servants, you have no authority, over them except those who follow you of the deviators.","translation_id":"Sesungguhnya kamu (Iblis) tidak kuasa atas hamba-hamba-Ku, kecuali mereka yang mengikutimu, yaitu orang yang sesat.","hasanah_per_verse":410},{"text_madani":"وَإِنَّ جَهَنَّمَ لَمَوْعِدُهُمْ أَجْمَعِينَ","text_tajweed":"وَإِ[g[نّ]َ جَهَ[g[نّ]َمَ لَمَوْعِدُهُمْ أَ[q:825[جْ]مَع[p[ِي]نَ","translation_en":"And surely Hell is the promised place of them all:","translation_id":"Dan sungguh, Jahanam itu benar-benar (tempat) yang telah dijanjikan untuk mereka (pengikut setan) semuanya.","hasanah_per_verse":200},{"text_madani":"لَهَا سَبْعَةُ أَبْوَابٍ لِّكُلِّ بَابٍ مِّنْهُمْ جُزْءٌ مَّقْسُومٌ","text_tajweed":"لَهَا سَ[q:7251[بْ]عَةُ أَ[q:6744[بْ]و[n[َٲ][u:7252[بٍ ل]ِّكُلِّ بَا[a:7253[بٍ م]ِّنْهُمْ جُزْ[a:7254[ءٌ م]َّ[q:7255[قْ]س[p[ُو]مٌ","translation_en":"It has seven gates; for every gate there shall be a separate party of them.","translation_id":"(Jahanam) itu mempunyai tujuh pintu. Setiap pintu (telah ditetapkan) untuk golongan tertentu dari mereka.","hasanah_per_verse":300},{"text_madani":"إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَعُيُونٍ","text_tajweed":"إِ[g[نّ]َ [h:7256[ٱ]لْمُتَّقِينَ فِى جَ[g[نّ]َ[n[ـٰ][a:7257[تٍ و]َعُي[p[ُو]نٍ","translation_en":"Surely those who guard (against evil) shall be in the midst of gardens and fountains:","translation_id":"Sesungguhnya orang yang bertakwa itu berada dalam surga-surga (taman-taman), dan (di dekat) mata air (yang mengalir).","hasanah_per_verse":200},{"text_madani":"ادْخُلُوهَا بِسَلَامٍ آمِنِينَ","text_tajweed":"ٱ[q:7258[دْ]خُلُوهَا بِسَلَ[n[ـٰ]مٍ ءَامِن[p[ِي]نَ","translation_en":"Enter them in peace, secure.","translation_id":"(Allah berfirman), “Masuklah ke dalamnya dengan sejahtera dan aman.”","hasanah_per_verse":170},{"text_madani":"وَنَزَعْنَا مَا فِي صُدُورِهِم مِّنْ غِلٍّ إِخْوَانًا عَلَىٰ سُرُرٍ مُّتَقَابِلِينَ","text_tajweed":"وَنَزَعْنَا مَا فِى صُدُورِه[w:4694[ِم م]ِّنْ غِلٍّ إِخْو[n[َٲ]نًا عَلَىٰ سُرُ[a:7259[رٍ م]ُّتَقَ[n[ـٰ]بِل[p[ِي]نَ","translation_en":"And We will root out whatever of rancor is in their breasts-- (they shall be) as brethren, on raised couches, face to face.","translation_id":"Dan Kami lenyapkan segala rasa dendam yang ada dalam hati mereka; mereka merasa bersaudara, duduk berhadap-hadapan di atas dipan-dipan.","hasanah_per_verse":400},{"text_madani":"لَا يَمَسُّهُمْ فِيهَا نَصَبٌ وَمَا هُم مِّنْهَا بِمُخْرَجِينَ","text_tajweed":"لَا يَمَسُّهُمْ فِيهَا نَصَ[a:7260[بٌ و]َمَا ه[w:7261[ُم م]ِّنْهَا بِمُخْرَج[p[ِي]نَ","translation_en":"Toil shall not afflict them in it, nor shall they be ever ejected from it.","translation_id":"Mereka tidak merasa lelah di dalamnya dan mereka tidak akan dikeluarkan darinya.","hasanah_per_verse":300},{"text_madani":"نَبِّئْ عِبَادِي أَنِّي أَنَا الْغَفُورُ الرَّحِيمُ","text_tajweed":"۞ نَبِّئْ عِبَاد[o[ِىٓ] أَ[g[نّ][o[ِىٓ] أَنَا [h:7262[ٱ]لْغَفُورُ [h:6228[ٱ][l[ل]رَّح[p[ِي]مُ","translation_en":"Inform My servants that I am the Forgiving, the Merciful,","translation_id":"Kabarkanlah kepada hamba-hamba-Ku, bahwa Akulah Yang Maha Pengampun, Maha Penyayang,","hasanah_per_verse":260},{"text_madani":"وَأَنَّ عَذَابِي هُوَ الْعَذَابُ الْأَلِيمُ","text_tajweed":"وَأَ[g[نّ]َ عَذَابِى هُوَ [h:7263[ٱ]لْعَذَابُ [h:7264[ٱ]لْأَل[p[ِي]مُ","translation_en":"And that My punishment-- that is the painful punishment.","translation_id":"dan sesungguhnya azab-Ku adalah azab yang sangat pedih.","hasanah_per_verse":220},{"text_madani":"وَنَبِّئْهُمْ عَن ضَيْفِ إِبْرَاهِيمَ","text_tajweed":"وَنَبِّئْهُمْ عَ[f:7265[ن ض]َيْفِ إِ[q:1860[بْ]ر[n[َٲ]ه[p[ِي]مَ","translation_en":"And inform them of the guests of Ibrahim:","translation_id":"Dan kabarkanlah (Muhammad) kepada mereka tentang tamu Ibrahim (malaikat).","hasanah_per_verse":180},{"text_madani":"إِذْ دَخَلُوا عَلَيْهِ فَقَالُوا سَلَامًا قَالَ إِنَّا مِنكُمْ وَجِلُونَ","text_tajweed":"إِذْ دَخَلُو[s[اْ] عَلَيْهِ فَقَالُو[s[اْ] سَلَ[n[ـٰ][f:6415[مًا ق]َالَ إِ[g[نّ]َا مِ[f:344[نك]ُمْ وَجِل[p[ُو]نَ","translation_en":"When they entered upon him, they said, Peace. He said: Surely we are afraid of you.","translation_id":"Ketika mereka masuk ke tempatnya, lalu mereka mengucapkan, “Salam.” Dia (Ibrahim) berkata, “Kami benar-benar merasa takut kepadamu.”","hasanah_per_verse":370},{"text_madani":"قَالُوا لَا تَوْجَلْ إِنَّا نُبَشِّرُكَ بِغُلَامٍ عَلِيمٍ","text_tajweed":"قَالُو[s[اْ] لَا تَوْجَلْ إِ[g[نّ]َا نُبَشِّرُكَ بِغُلَ[n[ـٰ]مٍ عَل[p[ِي]مٍ","translation_en":"They said: Be not afraid, surely we give you the good news of a boy, possessing knowledge.","translation_id":"(Mereka) berkata, “Janganlah engkau merasa takut, sesungguhnya kami memberi kabar gembira kepadamu dengan (kelahiran seorang) anak laki-laki (yang akan menjadi) orang yang pandai (Ishak).”","hasanah_per_verse":280},{"text_madani":"قَالَ أَبَشَّرْتُمُونِي عَلَىٰ أَن مَّسَّنِيَ الْكِبَرُ فَبِمَ تُبَشِّرُونَ","text_tajweed":"قَالَ أَبَشَّرْتُمُونِى عَلَ[o[ىٰٓ] أ[a:7266[َن م]َّسَّنِىَ [h:7267[ٱ]لْكِبَرُ فَبِمَ تُبَشِّر[p[ُو]نَ","translation_en":"He said: Do you give me good news (of a son) when old age has come upon me?-- Of what then do you give me good news!","translation_id":"Dia (Ibrahim) berkata, “Benarkah kamu memberi kabar gembira kepadaku padahal usiaku telah lanjut, lalu (dengan cara) bagaimana kamu memberi (kabar gembira) tersebut?”","hasanah_per_verse":350},{"text_madani":"قَالُوا بَشَّرْنَاكَ بِالْحَقِّ فَلَا تَكُن مِّنَ الْقَانِطِينَ","text_tajweed":"قَالُو[s[اْ] بَشَّرْنَ[n[ـٰ]كَ بِ[h:370[ٱ]لْحَقِّ فَلَا تَك[a:1974[ُن م]ِّنَ [h:7268[ٱ]لْقَ[n[ـٰ]نِط[p[ِي]نَ","translation_en":"They said: We give you good news with truth, therefore be not of the despairing.","translation_id":"(Mereka) menjawab, “Kami menyampaikan kabar gembira kepadamu dengan benar, maka janganlah engkau termasuk orang yang berputus asa.”","hasanah_per_verse":320},{"text_madani":"قَالَ وَمَن يَقْنَطُ مِن رَّحْمَةِ رَبِّهِ إِلَّا الضَّالُّونَ","text_tajweed":"قَالَ وَم[a:7269[َن ي]َ[q:7270[قْ]نَطُ م[u:7271[ِن ر]َّحْمَةِ رَبِّه[o[ِۦٓ] إِلَّا [h:7272[ٱ][l[ل]ضّ[m[َا]ٓلّ[p[ُو]نَ","translation_en":"He said: And who despairs of the mercy of his Lord but the erring ones?","translation_id":"Dia (Ibrahim) berkata, “Tidak ada yang berputus asa dari rahmat Tuhannya, kecuali orang yang sesat.”","hasanah_per_verse":290},{"text_madani":"قَالَ فَمَا خَطْبُكُمْ أَيُّهَا الْمُرْسَلُونَ","text_tajweed":"قَالَ فَمَا خَ[q:7273[طْ]بُكُمْ أَيُّهَا [h:7274[ٱ]لْمُرْسَل[p[ُو]نَ","translation_en":"He said: What is your business then, O messengers?","translation_id":"Dia (Ibrahim) berkata, “Apakah urusanmu yang penting, wahai para utusan?”","hasanah_per_verse":230},{"text_madani":"قَالُوا إِنَّا أُرْسِلْنَا إِلَىٰ قَوْمٍ مُّجْرِمِينَ","text_tajweed":"قَال[o[ُوٓ][s[اْ] إِ[g[نّ][o[َآ] أُرْسِلْن[o[َآ] إِلَىٰ قَوْ[a:7275[مٍ م]ُّ[q:4958[جْ]رِم[p[ِي]نَ","translation_en":"They said: Surely we are sent towards a guilty people,","translation_id":"(Mereka) menjawab, “Sesungguhnya kami diutus kepada kaum yang berdosa,","hasanah_per_verse":260},{"text_madani":"إِلَّا آلَ لُوطٍ إِنَّا لَمُنَجُّوهُمْ أَجْمَعِينَ","text_tajweed":"إِلّ[o[َآ] ءَالَ لُوطٍ إِ[g[نّ]َا لَمُنَجُّوهُمْ أَ[q:825[جْ]مَع[p[ِي]نَ","translation_en":"Except Lut's followers: We will most surely deliver them all,","translation_id":"kecuali para pengikut Luth. Sesungguhnya kami pasti menyelamatkan mereka semuanya,","hasanah_per_verse":240},{"text_madani":"إِلَّا امْرَأَتَهُ قَدَّرْنَا ۙ إِنَّهَا لَمِنَ الْغَابِرِينَ","text_tajweed":"إِلَّا [h:4837[ٱ]مْرَأَتَهُ[n[ۥ] قَدَّرْن[o[َآ‌ۙ] إِ[g[نّ]َهَا لَمِنَ [h:7276[ٱ]لْغَ[n[ـٰ]بِر[p[ِي]نَ","translation_en":"Except his wife; We ordained that she shall surely be of those who remain behind.","translation_id":"kecuali istrinya, kami telah menentukan, bahwa dia termasuk orang yang tertinggal (bersama orang kafir lainnya).”","hasanah_per_verse":290},{"text_madani":"فَلَمَّا جَاءَ آلَ لُوطٍ الْمُرْسَلُونَ","text_tajweed":"فَلَ[g[مّ]َا ج[o[َا]ٓءَ ءَالَ لُوطٍ [h:7277[ٱ]لْمُرْسَل[p[ُو]نَ","translation_en":"So when the messengers came to Lut's followers,","translation_id":"Maka ketika utusan itu datang kepada para pengikut Luth,","hasanah_per_verse":200},{"text_madani":"قَالَ إِنَّكُمْ قَوْمٌ مُّنكَرُونَ","text_tajweed":"قَالَ إِ[g[نّ]َكُمْ قَوْ[a:7278[مٌ م]ُّ[f:7279[نك]َر[p[ُو]نَ","translation_en":"He said: Surely you are an unknown people.","translation_id":"dia (Luth) berkata, “Sesungguhnya kamu orang yang tidak kami kenal.”","hasanah_per_verse":160},{"text_madani":"قَالُوا بَلْ جِئْنَاكَ بِمَا كَانُوا فِيهِ يَمْتَرُونَ","text_tajweed":"قَالُو[s[اْ] بَلْ جِئْنَ[n[ـٰ]كَ بِمَا كَانُو[s[اْ] فِيهِ يَمْتَر[p[ُو]نَ","translation_en":"They said: Nay, we have come to you with that about which they disputed.","translation_id":"(Para utusan) menjawab, “Sebenarnya kami ini datang kepadamu membawa azab yang selalu mereka dustakan.","hasanah_per_verse":290},{"text_madani":"وَأَتَيْنَاكَ بِالْحَقِّ وَإِنَّا لَصَادِقُونَ","text_tajweed":"وَأَتَيْنَ[n[ـٰ]كَ بِ[h:370[ٱ]لْحَقِّ وَإِ[g[نّ]َا لَصَ[n[ـٰ]دِق[p[ُو]نَ","translation_en":"And we have come to you with the truth, and we are most surely truthful.","translation_id":"Dan kami datang kepadamu membawa kebenaran dan sungguh, kami orang yang benar.","hasanah_per_verse":230},{"text_madani":"فَأَسْرِ بِأَهْلِكَ بِقِطْعٍ مِّنَ اللَّيْلِ وَاتَّبِعْ أَدْبَارَهُمْ وَلَا يَلْتَفِتْ مِنكُمْ أَحَدٌ وَامْضُوا حَيْثُ تُؤْمَرُونَ","text_tajweed":"فَأَسْرِ بِأَهْلِكَ بِقِ[q:6438[طْ][a:6439[عٍ م]ِّنَ [h:6029[ٱ]لَّيْلِ وَ[h:7280[ٱ]تَّبِعْ أَ[q:7281[دْ]بَ[n[ـٰ]رَهُمْ وَلَا يَلْتَفِتْ مِ[f:344[نك]ُمْ أَحَ[a:7282[دٌ و]َ[h:7283[ٱ]مْضُو[s[اْ] حَيْثُ تُؤْمَر[p[ُو]نَ","translation_en":"Therefore go forth with your followers in a part of the night and yourself follow their rear, and let not any one of you turn round, and go forth whither you are commanded.","translation_id":"Maka pergilah kamu pada akhir malam beserta keluargamu, dan ikutilah mereka dari belakang. Jangan ada di antara kamu yang menoleh ke belakang dan teruskanlah perjalanan ke tempat yang diperintahkan kepadamu.”","hasanah_per_verse":620},{"text_madani":"وَقَضَيْنَا إِلَيْهِ ذَٰلِكَ الْأَمْرَ أَنَّ دَابِرَ هَٰؤُلَاءِ مَقْطُوعٌ مُّصْبِحِينَ","text_tajweed":"وَقَضَيْن[o[َآ] إِلَيْهِ ذ[n[َٲ]لِكَ [h:7284[ٱ]لْأَمْرَ أَ[g[نّ]َ دَابِرَ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ مَ[q:7285[قْ]طُو[a:7286[عٌ م]ُّصْبِح[p[ِي]نَ","translation_en":"And We revealed to him this decree, that the roots of these shall be cut off in the morning.","translation_id":"Dan telah Kami tetapkan kepadanya (Luth) keputusan itu, bahwa akhirnya mereka akan ditumpas habis pada waktu subuh.","hasanah_per_verse":400},{"text_madani":"وَجَاءَ أَهْلُ الْمَدِينَةِ يَسْتَبْشِرُونَ","text_tajweed":"وَج[o[َا]ٓءَ أَهْلُ [h:7287[ٱ]لْمَدِينَةِ يَسْتَ[q:2415[بْ]شِر[p[ُو]نَ","translation_en":"And the people of the town came rejoicing.","translation_id":"Dan datanglah penduduk kota itu (ke rumah Luth) dengan gembira (karena kedatangan tamu itu).","hasanah_per_verse":220},{"text_madani":"قَالَ إِنَّ هَٰؤُلَاءِ ضَيْفِي فَلَا تَفْضَحُونِ","text_tajweed":"قَالَ إِ[g[نّ]َ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ ضَيْفِى فَلَا تَفْضَح[p[ُو]نِ","translation_en":"He said: Surely these are my guests, therefore do not disgrace me,","translation_id":"Dia (Luth) berkata, “Sesungguhnya mereka adalah tamuku; maka jangan kamu mempermalukan aku,","hasanah_per_verse":230},{"text_madani":"وَاتَّقُوا اللَّهَ وَلَا تُخْزُونِ","text_tajweed":"وَ[h:9999[ٱ]تَّقُو[s[اْ] [h:1019[ٱ]للَّهَ وَلَا تُخْز[p[ُو]نِ","translation_en":"And guard against (the punishment of) Allah and do not put me to shame.","translation_id":"Dan bertakwalah kepada Allah dan janganlah kamu membuat aku terhina.”","hasanah_per_verse":180},{"text_madani":"قَالُوا أَوَلَمْ نَنْهَكَ عَنِ الْعَالَمِينَ","text_tajweed":"قَال[o[ُوٓ][s[اْ] أَوَلَمْ نَنْهَكَ عَنِ [h:2124[ٱ]لْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"They said: Have we not forbidden you from (other) people?","translation_id":"(Mereka) berkata, “Bukankah kami telah melarangmu dari (melindungi) manusia?”","hasanah_per_verse":230},{"text_madani":"قَالَ هَٰؤُلَاءِ بَنَاتِي إِن كُنتُمْ فَاعِلِينَ","text_tajweed":"قَالَ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ بَنَات[o[ِىٓ] إِ[f:109[ن ك]ُ[f:100[نت]ُمْ فَ[n[ـٰ]عِل[p[ِي]نَ","translation_en":"He said: These are my daughters, if you will do (aught).","translation_id":"Dia (Luth) berkata, “Mereka itulah putri-putri (negeri)ku (nikahlah dengan mereka), jika kamu hendak berbuat.”","hasanah_per_verse":250},{"text_madani":"لَعَمْرُكَ إِنَّهُمْ لَفِي سَكْرَتِهِمْ يَعْمَهُونَ","text_tajweed":"لَعَمْرُكَ إِ[g[نّ]َهُمْ لَفِى سَكْرَتِهِمْ يَعْمَه[p[ُو]نَ","translation_en":"By your life! they were blindly wandering on in their intoxication.","translation_id":"(Allah berfirman), “Demi umurmu (Muhammad), sungguh, mereka terombang-ambing dalam kemabukan (kesesatan).”","hasanah_per_verse":240},{"text_madani":"فَأَخَذَتْهُمُ الصَّيْحَةُ مُشْرِقِينَ","text_tajweed":"فَأَخَذَتْهُمُ [h:7288[ٱ][l[ل]صَّيْحَةُ مُشْرِق[p[ِي]نَ","translation_en":"So the rumbling overtook them (while) entering upon the time of sunrise;","translation_id":"Maka mereka dibinasakan oleh suara keras yang mengguntur, ketika matahari akan terbit.","hasanah_per_verse":190},{"text_madani":"فَجَعَلْنَا عَالِيَهَا سَافِلَهَا وَأَمْطَرْنَا عَلَيْهِمْ حِجَارَةً مِّن سِجِّيلٍ","text_tajweed":"فَجَعَلْنَا عَ[n[ـٰ]لِيَهَا سَافِلَهَا وَأَمْطَرْنَا عَلَيْهِمْ حِجَارَ[a:6444[ةً م]ِّ[f:6445[ن س]ِجّ[p[ِي]لٍ","translation_en":"Thus did We turn it upside down, and rained down upon them stones of what had been decreed.","translation_id":"Maka Kami jungkirbalikkan (negeri itu) dan Kami hujani mereka dengan batu dari tanah yang keras.","hasanah_per_verse":410},{"text_madani":"إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّلْمُتَوَسِّمِينَ","text_tajweed":"إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:7289[تٍ ل]ِّلْمُتَوَسِّم[p[ِي]نَ","translation_en":"Surely in this are signs for those who examine.","translation_id":"Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi orang yang memperhatikan tanda-tanda,","hasanah_per_verse":210},{"text_madani":"وَإِنَّهَا لَبِسَبِيلٍ مُّقِيمٍ","text_tajweed":"وَإِ[g[نّ]َهَا لَبِسَبِي[a:7290[لٍ م]ُّق[p[ِي]مٍ","translation_en":"And surely it is on a road that still abides.","translation_id":"dan sungguh, (negeri) itu benar-benar terletak di jalan yang masih tetap (dilalui manusia).","hasanah_per_verse":150},{"text_madani":"إِنَّ فِي ذَٰلِكَ لَآيَةً لِّلْمُؤْمِنِينَ","text_tajweed":"إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[u:7291[ةً ل]ِّلْمُؤْمِن[p[ِي]نَ","translation_en":"Most surely there is a sign in this for the believers.","translation_id":"Sungguh, pada yang demikian itu benar-benar terdapat tanda (kekuasaan Allah) bagi orang yang beriman.","hasanah_per_verse":190},{"text_madani":"وَإِن كَانَ أَصْحَابُ الْأَيْكَةِ لَظَالِمِينَ","text_tajweed":"وَإِ[f:1649[ن ك]َانَ أَصْحَ[n[ـٰ]بُ [h:7292[ٱ]لْأَيْكَةِ لَظَ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And the dwellers of the thicket also were most surely unjust.","translation_id":"Dan sesungguhnya penduduk Aikah itu benar-benar kaum yang zhalim,","hasanah_per_verse":240},{"text_madani":"فَانتَقَمْنَا مِنْهُمْ وَإِنَّهُمَا لَبِإِمَامٍ مُّبِينٍ","text_tajweed":"فَ[h:9999[ٱ][f:4969[نت]َقَمْنَا مِنْهُمْ وَإِ[g[نّ]َهُمَا لَبِإِمَا[a:7293[مٍ م]ُّب[p[ِي]نٍ","translation_en":"So We inflicted retribution on them, and they are both, indeed, on an open road (still) pursued.","translation_id":"maka Kami membinasakan mereka. Dan sesungguhnya kedua (negeri) itu terletak di satu jalur jalan raya.","hasanah_per_verse":280},{"text_madani":"وَلَقَدْ كَذَّبَ أَصْحَابُ الْحِجْرِ الْمُرْسَلِينَ","text_tajweed":"وَلَقَ[q:341[دْ] كَذَّبَ أَصْحَ[n[ـٰ]بُ [h:7294[ٱ]لْحِ[q:7295[جْ]رِ [h:7296[ٱ]لْمُرْسَل[p[ِي]نَ","translation_en":"And the dwellers of the Rock certainly rejected the messengers;","translation_id":"Dan sesungguhnya penduduk negeri Hijr benar-benar telah mendustakan para rasul (mereka),","hasanah_per_verse":250},{"text_madani":"وَآتَيْنَاهُمْ آيَاتِنَا فَكَانُوا عَنْهَا مُعْرِضِينَ","text_tajweed":"وَءَاتَيْنَ[n[ـٰ]هُمْ ءَايَ[n[ـٰ]تِنَا فَكَانُو[s[اْ] عَنْهَا مُعْرِض[p[ِي]نَ","translation_en":"And We gave them Our communications, but they turned aside from them;","translation_id":"dan Kami telah mendatangkan kepada mereka tanda-tanda (kekuasaan) Kami, tetapi mereka selalu berpaling darinya,","hasanah_per_verse":300},{"text_madani":"وَكَانُوا يَنْحِتُونَ مِنَ الْجِبَالِ بُيُوتًا آمِنِينَ","text_tajweed":"وَكَانُو[s[اْ] يَنْحِتُونَ مِنَ [h:7297[ٱ]لْجِبَالِ بُيُوتًا ءَامِن[p[ِي]نَ","translation_en":"And they hewed houses in the mountains in security.","translation_id":"dan mereka memahat rumah-rumah dari gunung batu, (yang didiami) dengan rasa aman.","hasanah_per_verse":300},{"text_madani":"فَأَخَذَتْهُمُ الصَّيْحَةُ مُصْبِحِينَ","text_tajweed":"فَأَخَذَتْهُمُ [h:7288[ٱ][l[ل]صَّيْحَةُ مُصْبِح[p[ِي]نَ","translation_en":"So the rumbling overtook them in the morning;","translation_id":"Kemudian mereka dibinasakan oleh suara keras yang mengguntur pada pagi hari,","hasanah_per_verse":190},{"text_madani":"فَمَا أَغْنَىٰ عَنْهُم مَّا كَانُوا يَكْسِبُونَ","text_tajweed":"فَم[o[َآ] أَغْنَىٰ عَنْه[w:3985[ُم م]َّا كَانُو[s[اْ] يَكْسِب[p[ُو]نَ","translation_en":"And what they earned did not avail them.","translation_id":"sehingga tidak berguna bagi mereka, apa yang telah mereka usahakan.","hasanah_per_verse":240},{"text_madani":"وَمَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ ۗ وَإِنَّ السَّاعَةَ لَآتِيَةٌ ۖ فَاصْفَحِ الصَّفْحَ الْجَمِيلَ","text_tajweed":"وَمَا خَلَ[q:5159[قْ]نَا [h:7298[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ وَمَا بَيْنَهُم[o[َآ] إِلَّا بِ[h:370[ٱ]لْحَقِّ‌ۗ وَإِ[g[نّ]َ [h:7299[ٱ][l[ل]سَّاعَةَ لَأَتِيَ[f:7300[ةٌ‌ۖ ف]َ[h:7301[ٱ]صْفَحِ [h:7302[ٱ][l[ل]صَّفْحَ [h:7303[ٱ]لْجَم[p[ِي]لَ","translation_en":"And We did not create the heavens and the earth and what is between them two but in truth; and the hour is most surely coming, so turn away with kindly forgiveness.","translation_id":"Dan Kami tidak menciptakan langit dan bumi serta apa yang ada di antara keduanya, melainkan dengan kebenaran. Dan sungguh, Kiamat pasti akan datang, maka maafkanlah (mereka) dengan cara yang baik.","hasanah_per_verse":690},{"text_madani":"إِنَّ رَبَّكَ هُوَ الْخَلَّاقُ الْعَلِيمُ","text_tajweed":"إِ[g[نّ]َ رَبَّكَ هُوَ [h:7304[ٱ]لْخَلَّ[n[ـٰ]قُ [h:7305[ٱ]لْعَل[p[ِي]مُ","translation_en":"Surely your Lord is the Creator of all things, the Knowing.","translation_id":"Sungguh, Tuhanmu, Dialah Yang Maha Pencipta, Maha Mengetahui.","hasanah_per_verse":190},{"text_madani":"وَلَقَدْ آتَيْنَاكَ سَبْعًا مِّنَ الْمَثَانِي وَالْقُرْآنَ الْعَظِيمَ","text_tajweed":"وَلَقَ[q:341[دْ] ءَاتَيْنَ[n[ـٰ]كَ سَ[q:7306[بْ][a:7307[عًا م]ِّنَ [h:7308[ٱ]لْمَثَانِى وَ[h:7309[ٱ]لْقُرْءَانَ [h:7310[ٱ]لْعَظ[p[ِي]مَ","translation_en":"And certainly We have given you seven of the oft-repeated (verses) and the grand Quran.","translation_id":"Dan sungguh, Kami telah memberikan kepadamu tujuh (ayat) yang (dibaca) berulang-ulang dan Al-Qur'an yang agung.","hasanah_per_verse":360},{"text_madani":"لَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِ أَزْوَاجًا مِّنْهُمْ وَلَا تَحْزَنْ عَلَيْهِمْ وَاخْفِضْ جَنَاحَكَ لِلْمُؤْمِنِينَ","text_tajweed":"لَا تَمُدَّ[g[نّ]َ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِه[o[ِۦٓ] أَزْو[n[َٲ][a:7311[جًا م]ِّنْهُمْ وَلَا تَحْزَنْ عَلَيْهِمْ وَ[h:7312[ٱ]خْفِضْ جَنَاحَكَ لِلْمُؤْمِن[p[ِي]نَ","translation_en":"Do not strain your eyes after what We have given certain classes of them to enjoy, and do not grieve for them, and make yourself gentle to the believers.","translation_id":"Jangan sekali-kali engkau (Muhammad) tujukan pandanganmu kepada kenikmatan hidup yang telah Kami berikan kepada beberapa golongan di antara mereka (orang kafir), dan jangan engkau bersedih hati terhadap mereka dan berendah hatilah engkau terhadap orang yang beriman.","hasanah_per_verse":630},{"text_madani":"وَقُلْ إِنِّي أَنَا النَّذِيرُ الْمُبِينُ","text_tajweed":"وَقُلْ إِ[g[نّ][o[ِىٓ] أَنَا [h:7313[ٱ][l[ل][g[نّ]َذِيرُ [h:7314[ٱ]لْمُب[p[ِي]نُ","translation_en":"And say: Surely I am the plain warner.","translation_id":"Dan katakanlah (Muhammad), “Sesungguhnya aku adalah pemberi peringatan yang jelas.”","hasanah_per_verse":210},{"text_madani":"كَمَا أَنزَلْنَا عَلَى الْمُقْتَسِمِينَ","text_tajweed":"كَم[o[َآ] أَ[f:515[نز]َلْنَا عَلَى [h:7315[ٱ]لْمُ[q:7316[قْ]تَسِم[p[ِي]نَ","translation_en":"Like as We sent down on the dividers","translation_id":"Sebagaimana (Kami telah memberi peringatan), Kami telah menurunkan (azab) kepada orang yang memilah-milah (Kitab Allah),","hasanah_per_verse":210},{"text_madani":"الَّذِينَ جَعَلُوا الْقُرْآنَ عِضِينَ","text_tajweed":"ٱلَّذِينَ جَعَلُو[s[اْ] [h:7317[ٱ]لْقُرْءَانَ عِض[p[ِي]نَ","translation_en":"Those who made the Quran into shreds.","translation_id":"(yaitu) orang-orang yang telah menjadikan Al-Qur'an itu terbagi-bagi.","hasanah_per_verse":200},{"text_madani":"فَوَرَبِّكَ لَنَسْأَلَنَّهُمْ أَجْمَعِينَ","text_tajweed":"فَوَرَبِّكَ لَنَسْــَٔلَ[g[نّ]َهُمْ أَ[q:825[جْ]مَع[p[ِي]نَ","translation_en":"So, by your Lord, We would most certainly question them all,","translation_id":"Maka demi Tuhanmu, Kami pasti akan menanyai mereka semua,","hasanah_per_verse":190},{"text_madani":"عَمَّا كَانُوا يَعْمَلُونَ","text_tajweed":"عَ[g[مّ]َا كَانُو[s[اْ] يَعْمَل[p[ُو]نَ","translation_en":"As to what they did.","translation_id":"tentang apa yang telah mereka kerjakan dahulu.","hasanah_per_verse":140},{"text_madani":"فَاصْدَعْ بِمَا تُؤْمَرُ وَأَعْرِضْ عَنِ الْمُشْرِكِينَ","text_tajweed":"فَ[h:9999[ٱ]صْدَعْ بِمَا تُؤْمَرُ وَأَعْرِضْ عَنِ [h:4314[ٱ]لْمُشْرِك[p[ِي]نَ","translation_en":"Therefore declare openly what you are bidden and turn aside from the polytheists.","translation_id":"Maka sampaikanlah (Muhammad) secara terang-terangan segala apa yang diperintahkan (kepadamu) dan berpalinglah dari orang yang musyrik.","hasanah_per_verse":270},{"text_madani":"إِنَّا كَفَيْنَاكَ الْمُسْتَهْزِئِينَ","text_tajweed":"إِ[g[نّ]َا كَفَيْنَ[n[ـٰ]كَ [h:7318[ٱ]لْمُسْتَهْزِء[p[ِي]نَ","translation_en":"Surely We will suffice you against the scoffers","translation_id":"Sesungguhnya Kami memelihara engkau (Muhammad) dari (kejahatan) orang yang memperolok-olokkan (engkau),","hasanah_per_verse":190},{"text_madani":"الَّذِينَ يَجْعَلُونَ مَعَ اللَّهِ إِلَٰهًا آخَرَ ۚ فَسَوْفَ يَعْلَمُونَ","text_tajweed":"ٱلَّذِينَ يَ[q:68[جْ]عَلُونَ مَعَ [h:3975[ٱ]للَّهِ إِلَ[n[ـٰ]هًا ءَاخَرَ‌ۚ فَسَوْفَ يَعْلَم[p[ُو]نَ","translation_en":"Those who set up another god with Allah; so they shall soon know.","translation_id":"(yaitu) orang yang menganggap adanya tuhan selain Allah; mereka kelak akan mengetahui (akibatnya).","hasanah_per_verse":340},{"text_madani":"وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ","text_tajweed":"وَلَقَ[q:341[دْ] نَعْلَمُ أَ[g[نّ]َكَ يَضِيقُ صَ[q:6262[دْ]رُكَ بِمَا يَقُول[p[ُو]نَ","translation_en":"And surely We know that your breast straitens at what they say;","translation_id":"Dan sungguh, Kami mengetahui bahwa dadamu menjadi sempit disebabkan apa yang mereka ucapkan,","hasanah_per_verse":280},{"text_madani":"فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُن مِّنَ السَّاجِدِينَ","text_tajweed":"فَسَبِّحْ بِحَمْدِ رَبِّكَ وَك[a:5006[ُن م]ِّنَ [h:4595[ٱ][l[ل]سَّ[n[ـٰ]جِد[p[ِي]نَ","translation_en":"Therefore celebrate the praise of your Lord, and be of those who make obeisance.","translation_id":"maka bertasbihlah dengan memuji Tuhanmu dan jadilah engkau di antara orang yang bersujud (shalat),","hasanah_per_verse":240},{"text_madani":"وَاعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ الْيَقِينُ","text_tajweed":"وَ[h:9999[ٱ]عْبُ[q:7319[دْ] رَبَّكَ حَتَّىٰ يَأْتِيَكَ [h:7320[ٱ]لْيَق[p[ِي]نُ","translation_en":"And serve your Lord until there comes to you that which is certain.","translation_id":"Dan sembahlah Tuhanmu sampai yakin (ajal) datang kepadamu.","hasanah_per_verse":220}]}
