{"chapter_number":72,"name_simple":"Al-Jinn","name_meaning":{"text":"The Jinn","en":"The Jinn","id":"Jin"},"verses_count":28,"hasanah":11090,"verses":[{"text_madani":"قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِّنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا","text_tajweed":"قُلْ أُوحِىَ إِلَىَّ أَ[g[نّ]َهُ [h:13977[ٱ]سْتَمَعَ نَفَ[a:13978[رٌ م]ِّنَ [h:4673[ٱ]لْجِ[g[نّ]ِ فَقَال[o[ُوٓ][s[اْ] إِ[g[نّ]َا سَمِعْنَا قُرْءَانًا عَجَبًا","translation_en":"Say: It has been revealed to me that a party of the jinn listened, and they said: Surely we have heard a wonderful Quran,","translation_id":"Katakanlah (Muhammad), “Telah diwahyukan kepadaku bahwa sekumpulan jin telah mendengarkan (bacaan),” lalu mereka berkata, “Kami telah mendengarkan bacaan yang menakjubkan (Al-Qur'an),","hasanah_per_verse":490},{"text_madani":"يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ ۖ وَلَن نُّشْرِكَ بِرَبِّنَا أَحَدًا","text_tajweed":"يَهْد[o[ِىٓ] إِلَى [h:13979[ٱ][l[ل]رُّشْدِ فَـَٔـامَ[g[نّ]َا بِه[n[ِۦ]‌ۖ وَل[a:13980[َن ن]ُّشْرِكَ بِرَبِّن[o[َآ] أَحَدًا","translation_en":"Guiding to the right way, so we believe in it, and we will not set up any one with our Lord:","translation_id":"(yang) memberi petunjuk kepada jalan yang benar, lalu kami beriman kepadanya. Dan kami sekali-kali tidak akan mempersekutukan sesuatu pun dengan Tuhan kami,","hasanah_per_verse":350},{"text_madani":"وَأَنَّهُ تَعَالَىٰ جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلَا وَلَدًا","text_tajweed":"وَأَ[g[نّ]َهُ[n[ۥ] تَعَ[n[ـٰ]لَىٰ جَدُّ رَبِّنَا مَا [h:9277[ٱ]تَّخَذَ صَ[n[ـٰ]حِبَ[a:13981[ةً و]َلَا وَلَدًا","translation_en":"And that He-- exalted be the majesty of our Lord-- has not taken a consort, nor a son:","translation_id":"dan sesungguhnya Mahatinggi keagungan Tuhan kami, Dia tidak beristri dan tidak beranak.”","hasanah_per_verse":330},{"text_madani":"وَأَنَّهُ كَانَ يَقُولُ سَفِيهُنَا عَلَى اللَّهِ شَطَطًا","text_tajweed":"وَأَ[g[نّ]َهُ[n[ۥ] كَانَ يَقُولُ سَفِيهُنَا عَلَى [h:412[ٱ]للَّهِ شَطَطًا","translation_en":"And that the foolish amongst us used to forge extravagant things against Allah:","translation_id":"Dan sesungguhnya orang yang bodoh di antara kami dahulu selalu mengucapkan (perkataan) yang melampaui batas terhadap Allah,","hasanah_per_verse":280},{"text_madani":"وَأَنَّا ظَنَنَّا أَن لَّن تَقُولَ الْإِنسُ وَالْجِنُّ عَلَى اللَّهِ كَذِبًا","text_tajweed":"وَأَ[g[نّ]َا ظَنَ[g[نّ][o[َآ] أ[u:8842[َن ل]َّ[f:13982[ن ت]َقُولَ [h:13983[ٱ]لْإِ[f:7884[نس]ُ وَ[h:7885[ٱ]لْجِ[g[نّ]ُ عَلَى [h:412[ٱ]للَّهِ كَذِبًا","translation_en":"And that we thought that men and jinn did not utter a lie against Allah:","translation_id":"dan sesungguhnya kami mengira, bahwa manusia dan jin itu tidak akan mengatakan perkataan yang dusta terhadap Allah,","hasanah_per_verse":370},{"text_madani":"وَأَنَّهُ كَانَ رِجَالٌ مِّنَ الْإِنسِ يَعُوذُونَ بِرِجَالٍ مِّنَ الْجِنِّ فَزَادُوهُمْ رَهَقًا","text_tajweed":"وَأَ[g[نّ]َهُ[n[ۥ] كَانَ رِجَا[a:13984[لٌ م]ِّنَ [h:4410[ٱ]لْإِ[f:4338[نس]ِ يَعُوذُونَ بِرِجَا[a:13985[لٍ م]ِّنَ [h:4673[ٱ]لْجِ[g[نّ]ِ فَزَادُوهُمْ رَهَقًا","translation_en":"And that persons from among men used to seek refuge with persons from among jinn, so they increased them in wrongdoing:","translation_id":"dan sesungguhnya ada beberapa orang laki-laki dari kalangan manusia yang meminta perlindungan kepada beberapa laki-laki dari jin, tetapi mereka (jin) menjadikan mereka (manusia) bertambah sesat.","hasanah_per_verse":460},{"text_madani":"وَأَنَّهُمْ ظَنُّوا كَمَا ظَنَنتُمْ أَن لَّن يَبْعَثَ اللَّهُ أَحَدًا","text_tajweed":"وَأَ[g[نّ]َهُمْ ظَ[g[نّ]ُو[s[اْ] كَمَا ظَنَ[f:12002[نت]ُمْ أ[u:8842[َن ل]ّ[a:11863[َن ي]َ[q:4140[بْ]عَثَ [h:11864[ٱ]للَّهُ أَحَدًا","translation_en":"And that they thought as you think, that Allah would not raise anyone:","translation_id":"Dan sesungguhnya mereka (jin) mengira seperti kamu (orang musyrik Mekah) yang juga mengira bahwa Allah tidak akan membangkitkan kembali siapa pun (pada hari Kiamat).","hasanah_per_verse":330},{"text_madani":"وَأَنَّا لَمَسْنَا السَّمَاءَ فَوَجَدْنَاهَا مُلِئَتْ حَرَسًا شَدِيدًا وَشُهُبًا","text_tajweed":"وَأَ[g[نّ]َا لَمَسْنَا [h:13986[ٱ][l[ل]سَّم[o[َا]ٓءَ فَوَجَ[q:13987[دْ]نَ[n[ـٰ]هَا مُلِئَتْ حَرَ[f:13988[سًا ش]َدِي[a:13989[دًا و]َشُهُبًا","translation_en":"And that we sought to reach heaven, but we found it filled with strong guards and flaming stars.","translation_id":"Dan sesungguhnya kami (jin) telah mencoba mengetahui (rahasia) langit, maka kami mendapatinya penuh dengan penjagaan yang kuat dan panah-panah api,","hasanah_per_verse":410},{"text_madani":"وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ ۖ فَمَن يَسْتَمِعِ الْآنَ يَجِدْ لَهُ شِهَابًا رَّصَدًا","text_tajweed":"وَأَ[g[نّ]َا كُ[g[نّ]َا نَ[q:13990[قْ]عُدُ مِنْهَا مَقَ[n[ـٰ]عِدَ لِلسَّمْعِ‌ۖ فَم[a:13991[َن ي]َسْتَمِعِ [h:13992[ٱ]لْأَنَ يَجِ[q:1067[دْ] لَهُ[n[ۥ] شِهَا[u:13993[بًا ر]َّصَدًا","translation_en":"And that we used to sit in some of the sitting-places thereof to steal a hearing, but he who would (try to) listen now would find a flame lying in wait for him:","translation_id":"dan sesungguhnya kami (jin) dahulu dapat menduduki beberapa tempat di langit itu untuk mencuri dengar (berita-beritanya). Tetapi sekarang siapa (mencoba) mencuri dengar (seperti itu) pasti akan menjumpai panah-panah api yang mengintai (untuk membakarnya).","hasanah_per_verse":510},{"text_madani":"وَأَنَّا لَا نَدْرِي أَشَرٌّ أُرِيدَ بِمَن فِي الْأَرْضِ أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَدًا","text_tajweed":"وَأَ[g[نّ]َا لَا نَ[q:12439[دْ]ر[o[ِىٓ] أَشَرٌّ أُرِيدَ بِمَ[f:7793[ن ف]ِى [h:44[ٱ]لْأَرْضِ أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَدًا","translation_en":"And that we know not whether evil is meant for those who are on earth or whether their Lord means to bring them good:","translation_id":"Dan sesungguhnya kami (jin) tidak mengetahui (adanya penjagaan itu) apakah keburukan yang dikehendaki orang yang di bumi ataukah Tuhan mereka menghendaki kebaikan baginya.","hasanah_per_verse":440},{"text_madani":"وَأَنَّا مِنَّا الصَّالِحُونَ وَمِنَّا دُونَ ذَٰلِكَ ۖ كُنَّا طَرَائِقَ قِدَدًا","text_tajweed":"وَأَ[g[نّ]َا مِ[g[نّ]َا [h:13994[ٱ][l[ل]صَّ[n[ـٰ]لِحُونَ وَمِ[g[نّ]َا دُونَ ذ[n[َٲ]لِكَ‌ۖ كُ[g[نّ]َا طَر[o[َا]ٓئِقَ قِدَدًا","translation_en":"And that some of us are good and others of us are below that: we are sects following different ways:","translation_id":"Dan sesungguhnya di antara kami (jin) ada yang shalih dan ada (pula) kebalikannya. Kami menempuh jalan yang berbeda-beda.","hasanah_per_verse":370},{"text_madani":"وَأَنَّا ظَنَنَّا أَن لَّن نُّعْجِزَ اللَّهَ فِي الْأَرْضِ وَلَن نُّعْجِزَهُ هَرَبًا","text_tajweed":"وَأَ[g[نّ]َا ظَنَ[g[نّ][o[َآ] أ[u:8842[َن ل]ّ[a:13995[َن ن]ُّعْجِزَ [h:13996[ٱ]للَّهَ فِى [h:44[ٱ]لْأَرْضِ وَل[a:13997[َن ن]ُّعْجِزَهُ[n[ۥ] هَرَبًا","translation_en":"And that we know that we cannot escape Allah in the earth, nor can we escape Him by flight:","translation_id":"Dan sesungguhnya kami (jin) telah menduga, bahwa kami tidak akan mampu melepaskan diri (dari kekuasaan) Allah di bumi dan tidak (pula) dapat lari melepaskan diri (dari)-Nya.","hasanah_per_verse":390},{"text_madani":"وَأَنَّا لَمَّا سَمِعْنَا الْهُدَىٰ آمَنَّا بِهِ ۖ فَمَن يُؤْمِن بِرَبِّهِ فَلَا يَخَافُ بَخْسًا وَلَا رَهَقًا","text_tajweed":"وَأَ[g[نّ]َا لَ[g[مّ]َا سَمِعْنَا [h:13998[ٱ]لْهُدَ[o[ىٰٓ] ءَامَ[g[نّ]َا بِه[n[ِۦ]‌ۖ فَم[a:13999[َن ي]ُؤْم[i:14000[ِنۢ ب]ِرَبِّه[n[ِۦ] فَلَا يَخَافُ بَخْ[a:14001[سًا و]َلَا رَهَقًا","translation_en":"And that when we heard the guidance, we believed in it; so whoever believes in his Lord, he should neither fear loss nor being overtaken (by disgrace):","translation_id":"Dan sesungguhnya ketika kami (jin) mendengar petunjuk (Al-Qur'an), kami beriman kepadanya. Maka barangsiapa beriman kepada Tuhan, maka tidak perlu ia takut rugi atau berdosa.","hasanah_per_verse":520},{"text_madani":"وَأَنَّا مِنَّا الْمُسْلِمُونَ وَمِنَّا الْقَاسِطُونَ ۖ فَمَنْ أَسْلَمَ فَأُولَٰئِكَ تَحَرَّوْا رَشَدًا","text_tajweed":"وَأَ[g[نّ]َا مِ[g[نّ]َا [h:14002[ٱ]لْمُسْلِمُونَ وَمِ[g[نّ]َا [h:14003[ٱ]لْقَ[n[ـٰ]سِطُونَ‌ۖ فَمَنْ أَسْلَمَ فَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ تَحَرَّوْ[s[اْ] رَشَدًا","translation_en":"And that some of us are those who submit, and some of us are the deviators; so whoever submits, these aim at the right way:","translation_id":"Dan di antara kami ada yang Islam dan ada yang menyimpang dari kebenaran. Siapa yang Islam, maka mereka itu telah memilih jalan yang lurus.","hasanah_per_verse":490},{"text_madani":"وَأَمَّا الْقَاسِطُونَ فَكَانُوا لِجَهَنَّمَ حَطَبًا","text_tajweed":"وَأَ[g[مّ]َا [h:14004[ٱ]لْقَ[n[ـٰ]سِطُونَ فَكَانُو[s[اْ] لِجَهَ[g[نّ]َمَ حَطَبًا","translation_en":"And as to the deviators, they are fuel of hell:","translation_id":"Dan adapun yang menyimpang dari kebenaran, maka mereka menjadi bahan bakar bagi neraka Jahanam.”","hasanah_per_verse":270},{"text_madani":"وَأَن لَّوِ اسْتَقَامُوا عَلَى الطَّرِيقَةِ لَأَسْقَيْنَاهُم مَّاءً غَدَقًا","text_tajweed":"وَأَلَّوِ [h:14005[ٱ]سْتَقَ[n[ـٰ]مُو[s[اْ] عَلَى [h:14006[ٱ][l[ل]طَّرِيقَةِ لَأَسْقَيْنَ[n[ـٰ]ه[w:14007[ُم م]ّ[o[َا]ٓءً غَدَقًا","translation_en":"And that if they should keep to the (right) way, We would certainly give them to drink of abundant water,","translation_id":"Dan sekiranya mereka tetap berjalan lurus di atas jalan itu (agama Islam), niscaya Kami akan mencurahkan kepada mereka air yang cukup.","hasanah_per_verse":390},{"text_madani":"لِّنَفْتِنَهُمْ فِيهِ ۚ وَمَن يُعْرِضْ عَن ذِكْرِ رَبِّهِ يَسْلُكْهُ عَذَابًا صَعَدًا","text_tajweed":"لِّنَفْتِنَهُمْ فِيهِ‌ۚ وَم[a:14008[َن ي]ُعْرِضْ عَ[f:3773[ن ذ]ِكْرِ رَبِّه[n[ِۦ] يَسْلُكْهُ عَذَا[f:14009[بًا ص]َعَدًا","translation_en":"So that We might try them with respect to it; and whoever turns aside from the reminder of his Lord, He will make him enter into an afflicting chastisement:","translation_id":"Dengan (cara) itu Kami hendak menguji mereka. Dan barangsiapa berpaling dari peringatan Tuhannya, niscaya akan dimasukkan-Nya ke dalam azab yang sangat berat.","hasanah_per_verse":390},{"text_madani":"وَأَنَّ الْمَسَاجِدَ لِلَّهِ فَلَا تَدْعُوا مَعَ اللَّهِ أَحَدًا","text_tajweed":"وَأَ[g[نّ]َ [h:14010[ٱ]لْمَسَ[n[ـٰ]جِدَ لِلَّهِ فَلَا تَ[q:7934[دْ]عُو[s[اْ] مَعَ [h:3975[ٱ]للَّهِ أَحَدًا","translation_en":"And that the mosques are Allah's, therefore call not upon any one with Allah:","translation_id":"Dan sesungguhnya masjid-masjid itu adalah untuk Allah. Maka janganlah kamu menyembah apa pun di dalamnya selain Allah.","hasanah_per_verse":310},{"text_madani":"وَأَنَّهُ لَمَّا قَامَ عَبْدُ اللَّهِ يَدْعُوهُ كَادُوا يَكُونُونَ عَلَيْهِ لِبَدًا","text_tajweed":"وَأَ[g[نّ]َهُ[n[ۥ] لَ[g[مّ]َا قَامَ عَ[q:8319[بْ]دُ [h:8320[ٱ]للَّهِ يَ[q:14011[دْ]عُوهُ كَادُو[s[اْ] يَكُونُونَ عَلَيْهِ لِبَدًا","translation_en":"And that when the servant of Allah stood up calling upon Him, they wellnigh crowded him (to death).","translation_id":"Dan sesungguhnya ketika hamba Allah (Muhammad) berdiri menyembah-Nya (melaksanakan shalat), mereka (jin-jin) itu berdesakan mengerumuninya.","hasanah_per_verse":410},{"text_madani":"قُلْ إِنَّمَا أَدْعُو رَبِّي وَلَا أُشْرِكُ بِهِ أَحَدًا","text_tajweed":"قُلْ إِ[g[نّ]َم[o[َآ] أَ[q:6847[دْ]عُو[s[اْ] رَبِّى وَل[o[َآ] أُشْرِكُ بِه[o[ِۦٓ] أَحَدًا","translation_en":"Say: I only call upon my Lord, and I do not associate any one with Him.","translation_id":"Katakanlah (Muhammad), “Sesungguhnya aku hanya menyembah Tuhanku dan aku tidak mempersekutukan sesuatu pun dengan-Nya.”","hasanah_per_verse":260},{"text_madani":"قُلْ إِنِّي لَا أَمْلِكُ لَكُمْ ضَرًّا وَلَا رَشَدًا","text_tajweed":"قُلْ إِ[g[نّ]ِى ل[o[َآ] أَمْلِكُ لَكُمْ ضَر[a:3719[ًّا و]َلَا رَشَدًا","translation_en":"Say: I do not control for you evil or good.","translation_id":"Katakanlah (Muhammad), “Aku tidak kuasa menolak mudarat maupun mendatangkan kebaikan kepadamu.”","hasanah_per_verse":240},{"text_madani":"قُلْ إِنِّي لَن يُجِيرَنِي مِنَ اللَّهِ أَحَدٌ وَلَنْ أَجِدَ مِن دُونِهِ مُلْتَحَدًا","text_tajweed":"قُلْ إِ[g[نّ]ِى ل[a:14012[َن ي]ُجِيرَنِى مِنَ [h:321[ٱ]للَّهِ أَحَ[a:14013[دٌ و]َلَنْ أَجِدَ مِ[f:3136[ن د]ُونِه[n[ِۦ] مُلْتَحَدًا","translation_en":"Say: Surely no one can protect me against Allah, nor can I find besides Him any place of refuge:","translation_id":"Katakanlah (Muhammad), “Sesungguhnya tidak ada sesuatu pun yang dapat melindungiku dari (azab) Allah dan aku tidak akan memperoleh tempat berlindung selain dari-Nya.","hasanah_per_verse":400},{"text_madani":"إِلَّا بَلَاغًا مِّنَ اللَّهِ وَرِسَالَاتِهِ ۚ وَمَن يَعْصِ اللَّهَ وَرَسُولَهُ فَإِنَّ لَهُ نَارَ جَهَنَّمَ خَالِدِينَ فِيهَا أَبَدًا","text_tajweed":"إِلَّا بَلَ[n[ـٰ][a:14014[غًا م]ِّنَ [h:321[ٱ]للَّهِ وَرِسَ[n[ـٰ]لَ[n[ـٰ]تِه[n[ِۦ]‌ۚ وَم[a:2634[َن ي]َعْصِ [h:2635[ٱ]للَّهَ وَرَسُولَهُ[n[ۥ] فَإِ[g[نّ]َ لَهُ[n[ۥ] نَارَ جَهَ[g[نّ]َمَ خَ[n[ـٰ]لِدِينَ فِيه[o[َآ] أَبَدًا","translation_en":"(It is) only a delivering (of communications) from Allah and His messages; and whoever disobeys Allah and His Messenger surely he shall have the fire of hell to abide therein for a long time.","translation_id":"(Aku hanya) menyampaikan (peringatan) dari Allah dan risalah-Nya. Dan barangsiapa mendurhakai Allah dan Rasul-Nya maka sesungguhnya dia akan mendapat (azab) neraka Jahanam, mereka kekal di dalamnya selama-lamanya.”","hasanah_per_verse":640},{"text_madani":"حَتَّىٰ إِذَا رَأَوْا مَا يُوعَدُونَ فَسَيَعْلَمُونَ مَنْ أَضْعَفُ نَاصِرًا وَأَقَلُّ عَدَدًا","text_tajweed":"حَتَّ[o[ىٰٓ] إِذَا رَأَوْ[s[اْ] مَا يُوعَدُونَ فَسَيَعْلَمُونَ مَنْ أَضْعَفُ نَاصِ[a:14015[رًا و]َأَقَلُّ عَدَدًا","translation_en":"Until when they see what they are threatened with, then shall they know who is weaker in helpers and fewer in number.","translation_id":"Sehingga apabila mereka melihat (azab) yang diancamkan kepadanya, maka mereka akan mengetahui siapakah yang lebih lemah penolongnya dan lebih sedikit jumlahnya.","hasanah_per_verse":450},{"text_madani":"قُلْ إِنْ أَدْرِي أَقَرِيبٌ مَّا تُوعَدُونَ أَمْ يَجْعَلُ لَهُ رَبِّي أَمَدًا","text_tajweed":"قُلْ إِنْ أَ[q:8888[دْ]ر[o[ِىٓ] أَقَرِي[a:14016[بٌ م]َّا تُوعَدُونَ أَمْ يَ[q:4388[جْ]عَلُ لَهُ[n[ۥ] رَبّ[o[ِىٓ] أَمَدًا","translation_en":"Say: I do not know whether that with which you are threatened be nigh or whether my Lord will appoint for it a term:","translation_id":"Katakanlah (Muhammad), “Aku tidak mengetahui, apakah azab yang diancamkan kepadamu itu sudah dekat ataukah Tuhanku menetapkan waktunya masih lama.”","hasanah_per_verse":360},{"text_madani":"عَالِمُ الْغَيْبِ فَلَا يُظْهِرُ عَلَىٰ غَيْبِهِ أَحَدًا","text_tajweed":"عَ[n[ـٰ]لِمُ [h:4186[ٱ]لْغَيْبِ فَلَا يُظْهِرُ عَلَىٰ غَيْبِه[o[ِۦٓ] أَحَدًا","translation_en":"The Knower of the unseen! so He does not reveal His secrets to any,","translation_id":"Dia Mengetahui yang gaib, tetapi Dia tidak memperlihatkan kepada siapa pun tentang yang gaib itu.","hasanah_per_verse":270},{"text_madani":"إِلَّا مَنِ ارْتَضَىٰ مِن رَّسُولٍ فَإِنَّهُ يَسْلُكُ مِن بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ رَصَدًا","text_tajweed":"إِلَّا مَنِ [h:14017[ٱ]رْتَضَىٰ م[u:2882[ِن ر]َّسُو[f:14018[لٍ ف]َإِ[g[نّ]َهُ[n[ۥ] يَسْلُكُ م[i:4612[ِنۢ ب]َيْنِ يَدَيْهِ وَمِنْ خَلْفِه[n[ِۦ] رَصَدًا","translation_en":"Except to him whom He chooses as a messenger; for surely He makes a guard to march before him and after him,","translation_id":"Kecuali kepada rasul yang diridhai-Nya, maka sesungguhnya Dia mengadakan penjaga-penjaga (malaikat) di depan dan di belakangnya.","hasanah_per_verse":440},{"text_madani":"لِّيَعْلَمَ أَن قَدْ أَبْلَغُوا رِسَالَاتِ رَبِّهِمْ وَأَحَاطَ بِمَا لَدَيْهِمْ وَأَحْصَىٰ كُلَّ شَيْءٍ عَدَدًا","text_tajweed":"لِّيَعْلَمَ أَ[f:3885[ن ق]َ[q:298[دْ] أَ[q:14019[بْ]لَغُو[s[اْ] رِسَ[n[ـٰ]لَ[n[ـٰ]تِ رَبِّهِمْ وَأَحَاطَ بِمَا لَدَيْهِمْ وَأَحْصَىٰ كُلَّ شَىْءٍ عَدَدَۢا","translation_en":"So that He may know that they have truly delivered the messages of their Lord, and He encompasses what is with them and He records the number of all things.","translation_id":"Agar Dia mengetahui bahwa rasul-rasul itu sungguh telah menyampaikan risalah Tuhannya, sedang (ilmu-Nya) meliputi apa yang ada pada mereka, dan Dia menghitung segala sesuatu satu persatu.","hasanah_per_verse":520}]}
