{"chapter_number":30,"name_simple":"Ar-Rum","name_meaning":{"text":"The Romans","en":"The Romans","id":"Bangsa Romawi"},"verses_count":60,"hasanah":34720,"verses":[{"text_madani":"الم","text_tajweed":"ا[m[لٓ][m[مٓ]","translation_en":"Alif Lam Mim.","translation_id":"Alif Lam Mim","hasanah_per_verse":30},{"text_madani":"غُلِبَتِ الرُّومُ","text_tajweed":"غُلِبَتِ [h:10416[ٱ][l[ل]رّ[p[ُو]مُ","translation_en":"The Romans are vanquished,","translation_id":"Bangsa Romawi telah dikalahkan,","hasanah_per_verse":90},{"text_madani":"فِي أَدْنَى الْأَرْضِ وَهُم مِّن بَعْدِ غَلَبِهِمْ سَيَغْلِبُونَ","text_tajweed":"ف[o[ِىٓ] أَ[q:314[دْ]نَى [h:10417[ٱ]لْأَرْضِ وَه[w:8717[ُم م]ّ[i:146[ِنۢ ب]َعْدِ غَلَبِهِمْ سَيَغْلِب[p[ُو]نَ","translation_en":"In a near land, and they, after being vanquished, shall overcome,","translation_id":"di negeri yang terdekat dan mereka setelah kekalahannya itu akan menang,","hasanah_per_verse":310},{"text_madani":"فِي بِضْعِ سِنِينَ ۗ لِلَّهِ الْأَمْرُ مِن قَبْلُ وَمِن بَعْدُ ۚ وَيَوْمَئِذٍ يَفْرَحُ الْمُؤْمِنُونَ","text_tajweed":"فِى بِضْعِ سِنِينَ‌ۗ لِلَّهِ [h:10418[ٱ]لْأَمْرُ مِ[f:128[ن ق]َ[q:129[بْ]لُ وَم[i:10419[ِنۢ ب]َعْدُ‌ۚ وَيَوْمَئِ[a:10420[ذٍ ي]َفْرَحُ [h:10421[ٱ]لْمُؤْمِن[p[ُو]نَ","translation_en":"Within a few years. Allah's is the command before and after; and on that day the believers shall rejoice,","translation_id":"dalam beberapa tahun (lagi). Bagi Allah-lah urusan sebelum dan setelah (mereka menang). Dan pada hari (kemenangan bangsa Romawi) itu bergembiralah orang-orang yang beriman,","hasanah_per_verse":460},{"text_madani":"بِنَصْرِ اللَّهِ ۚ يَنصُرُ مَن يَشَاءُ ۖ وَهُوَ الْعَزِيزُ الرَّحِيمُ","text_tajweed":"بِنَصْرِ [h:10422[ٱ]للَّهِ‌ۚ يَ[f:10423[نص]ُرُ م[a:476[َن ي]َش[o[َا]ٓءُ‌ۖ وَهُوَ [h:7045[ٱ]لْعَزِيزُ [h:9718[ٱ][l[ل]رَّح[p[ِي]مُ","translation_en":"With the help of Allah; He helps whom He pleases; and He is the Mighty, the Merciful;","translation_id":"karena pertolongan Allah. Dia menolong siapa yang Dia kehendaki. Dia Mahaperkasa, Maha Penyayang.","hasanah_per_verse":330},{"text_madani":"وَعْدَ اللَّهِ ۖ لَا يُخْلِفُ اللَّهُ وَعْدَهُ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ","text_tajweed":"وَعْدَ [h:3149[ٱ]للَّهِ‌ۖ لَا يُخْلِفُ [h:10424[ٱ]للَّهُ وَعْدَهُ[n[ۥ] وَلَ[n[ـٰ]كِ[g[نّ]َ أَكْثَرَ [h:1374[ٱ][l[ل][g[نّ]َاسِ لَا يَعْلَم[p[ُو]نَ","translation_en":"(This is) Allah's promise! Allah will not fail His promise, but most people do not know.","translation_id":"(Itulah) janji Allah. Allah tidak akan menyalahi janji-Nya, tetapi kebanyakan manusia tidak mengetahui.","hasanah_per_verse":420},{"text_madani":"يَعْلَمُونَ ظَاهِرًا مِّنَ الْحَيَاةِ الدُّنْيَا وَهُمْ عَنِ الْآخِرَةِ هُمْ غَافِلُونَ","text_tajweed":"يَعْلَمُونَ ظَ[n[ـٰ]هِ[a:10425[رًا م]ِّنَ [h:10426[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا وَهُمْ عَنِ [h:10427[ٱ]لْأَخِرَةِ هُمْ غَ[n[ـٰ]فِل[p[ُو]نَ","translation_en":"They know the outward of this world's life, but of the hereafter they are absolutely heedless.","translation_id":"Mereka mengetahui yang lahir (tampak) dari kehidupan dunia; sedangkan terhadap (kehidupan) akhirat mereka lalai.","hasanah_per_verse":440},{"text_madani":"أَوَلَمْ يَتَفَكَّرُوا فِي أَنفُسِهِم ۗ مَّا خَلَقَ اللَّهُ السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ وَأَجَلٍ مُّسَمًّى ۗ وَإِنَّ كَثِيرًا مِّنَ النَّاسِ بِلِقَاءِ رَبِّهِمْ لَكَافِرُونَ","text_tajweed":"أَوَلَمْ يَتَفَكَّرُو[s[اْ] ف[o[ِىٓ] أَ[f:568[نف]ُسِه[w:2346[ِم‌ۗ م]َّا خَلَقَ [h:1272[ٱ]للَّهُ [h:10377[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ وَمَا بَيْنَهُم[o[َآ] إِلَّا بِ[h:370[ٱ]لْحَقِّ وَأَجَ[a:10428[لٍ م]ُّسَم[a:10429[ًّى‌ۗ و]َإِ[g[نّ]َ كَثِي[a:3614[رًا م]ِّنَ [h:721[ٱ][l[ل][g[نّ]َاسِ بِلِقَآىِٕ رَبِّهِمْ لَكَ[n[ـٰ]فِر[p[ُو]نَ","translation_en":"Do they not reflect within themselves: Allah did not create the heavens and the earth and what is between them two but with truth, and (for) an appointed term? And most surely most of the people are deniers of the meeting of their Lord.","translation_id":"Dan mengapa mereka tidak memikirkan tentang (kejadian) diri mereka? Allah tidak menciptakan langit dan bumi dan apa yang ada di antara keduanya melainkan dengan (tujuan) yang benar dan dalam waktu yang ditentukan. Dan sesungguhnya kebanyakan di antara manusia benar-benar mengingkari pertemuan dengan Tuhannya.","hasanah_per_verse":980},{"text_madani":"أَوَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِن قَبْلِهِمْ ۚ كَانُوا أَشَدَّ مِنْهُمْ قُوَّةً وَأَثَارُوا الْأَرْضَ وَعَمَرُوهَا أَكْثَرَ مِمَّا عَمَرُوهَا وَجَاءَتْهُمْ رُسُلُهُم بِالْبَيِّنَاتِ ۖ فَمَا كَانَ اللَّهُ لِيَظْلِمَهُمْ وَلَٰكِن كَانُوا أَنفُسَهُمْ يَظْلِمُونَ","text_tajweed":"أَوَلَمْ يَسِيرُو[s[اْ] فِى [h:44[ٱ]لْأَرْضِ فَيَ[f:6853[نظ]ُرُو[s[اْ] كَيْفَ كَانَ عَ[n[ـٰ]قِبَةُ [h:6854[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ‌ۚ كَان[o[ُوٓ][s[اْ] أَشَدَّ مِنْهُمْ قُوَّ[a:10430[ةً و]َأَثَارُو[s[اْ] [h:10431[ٱ]لْأَرْضَ وَعَمَرُوه[o[َآ] أَكْثَرَ مِ[g[مّ]َا عَمَرُوهَا وَج[o[َا]ٓءَتْهُمْ رُسُلُه[c:4900[ُم ب]ِ[h:484[ٱ]لْبَيِّنَ[n[ـٰ]تِ‌ۖ فَمَا كَانَ [h:742[ٱ]للَّهُ لِيَظْلِمَهُمْ وَلَ[n[ـٰ]كِ[f:276[ن ك]َان[o[ُوٓ][s[اْ] أَ[f:38[نف]ُسَهُمْ يَظْلِم[p[ُو]نَ","translation_en":"Have they not travelled in the earth and seen how was the end of those before them? They were stronger than these in prowess, and dug up the earth, and built on it in greater abundance than these have built on it, and there came to them their messengers with clear arguments; so it was not beseeming for Allah that He should deal with them unjustly, but they dealt unjustly with their own souls.","translation_id":"Dan tidakkah mereka bepergian di bumi lalu melihat bagaimana kesudahan orang-orang sebelum mereka (yang mendustakan rasul)? Orang-orang itu lebih kuat dari mereka (sendiri) dan mereka telah mengolah bumi (tanah) serta memakmurkannya melebihi apa yang telah mereka makmurkan. Dan telah datang kepada mereka rasul-rasul mereka dengan membawa bukti-bukti yang jelas. Maka Allah sama sekali tidak berlaku zhalim kepada mereka, tetapi merekalah yang berlaku zhalim kepada diri mereka sendiri.","hasanah_per_verse":1520},{"text_madani":"ثُمَّ كَانَ عَاقِبَةَ الَّذِينَ أَسَاءُوا السُّوأَىٰ أَن كَذَّبُوا بِآيَاتِ اللَّهِ وَكَانُوا بِهَا يَسْتَهْزِئُونَ","text_tajweed":"ثُ[g[مّ]َ كَانَ عَ[n[ـٰ]قِبَةَ [h:10432[ٱ]لَّذِينَ أَسَ[o[ـٰٓـ]ــُٔو[s[اْ] [h:10433[ٱ][l[ل]سّ[o[ُو]ٓأَ[o[ىٰٓ] أَ[f:10434[ن ك]َذَّبُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ وَكَانُو[s[اْ] بِهَا يَسْتَهْزِء[p[ُو]نَ","translation_en":"Then evil was the end of those who did evil, because they | rejected the communications of Allah and used to mock them.","translation_id":"Kemudian, azab yang lebih buruk adalah kesudahan bagi orang-orang yang mengerjakan kejahatan. Karena mereka mendustakan ayat-ayat Allah dan mereka selalu memperolok-olokkannya.","hasanah_per_verse":600},{"text_madani":"اللَّهُ يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ ثُمَّ إِلَيْهِ تُرْجَعُونَ","text_tajweed":"ٱللَّهُ يَ[q:5943[بْ]دَؤُ[s[اْ] [h:5944[ٱ]لْخَلْقَ ثُ[g[مّ]َ يُعِيدُهُ[n[ۥ] ثُ[g[مّ]َ إِلَيْهِ تُرْجَع[p[ُو]نَ","translation_en":"Allah originates the creation, then reproduces it, then to Him you shall be brought back.","translation_id":"Allah yang memulai penciptaan (makhluk), kemudian mengulanginya kembali; kemudian kepada-Nya kamu dikembalikan.","hasanah_per_verse":320},{"text_madani":"وَيَوْمَ تَقُومُ السَّاعَةُ يُبْلِسُ الْمُجْرِمُونَ","text_tajweed":"وَيَوْمَ تَقُومُ [h:10435[ٱ][l[ل]سَّاعَةُ يُ[q:10436[بْ]لِسُ [h:10437[ٱ]لْمُ[q:5255[جْ]رِم[p[ُو]نَ","translation_en":"And at the time when the hour shall come the guilty shall be in despair.","translation_id":"Dan pada hari (ketika) terjadi Kiamat, orang-orang yang berdosa (kaum musyrik) terdiam berputus asa.","hasanah_per_verse":260},{"text_madani":"وَلَمْ يَكُن لَّهُم مِّن شُرَكَائِهِمْ شُفَعَاءُ وَكَانُوا بِشُرَكَائِهِمْ كَافِرِينَ","text_tajweed":"وَلَمْ يَك[u:9334[ُن ل]َّه[w:1812[ُم م]ِّ[f:10438[ن ش]ُرَك[o[َا]ٓئِهِمْ شُفَعَ[o[ـٰٓ]ؤُ[s[اْ] وَكَانُو[s[اْ] بِشُرَك[o[َا]ٓئِهِمْ كَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"And they shall not have any intercessors from among their gods they have joined with Allah, and they shall be deniers of their associate-gods.","translation_id":"Dan tidak mungkin ada pemberi syafaat (pertolongan) bagi mereka dari berhala-berhala mereka, sedangkan mereka mengingkari berhala-berhala mereka itu.","hasanah_per_verse":430},{"text_madani":"وَيَوْمَ تَقُومُ السَّاعَةُ يَوْمَئِذٍ يَتَفَرَّقُونَ","text_tajweed":"وَيَوْمَ تَقُومُ [h:10435[ٱ][l[ل]سَّاعَةُ يَوْمَئِ[a:10439[ذٍ ي]َتَفَرَّق[p[ُو]نَ","translation_en":"And at the time when the hour shall come, at that time they shall become separated one from the other.","translation_id":"Dan pada hari (ketika) terjadi Kiamat, pada hari itu manusia terpecah-pecah (dalam kelompok).","hasanah_per_verse":260},{"text_madani":"فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَهُمْ فِي رَوْضَةٍ يُحْبَرُونَ","text_tajweed":"فَأَ[g[مّ]َا [h:136[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ فَهُمْ فِى رَوْضَ[a:10440[ةٍ ي]ُحْبَر[p[ُو]نَ","translation_en":"Then as to those who believed and did good, they shall be made happy in a garden.","translation_id":"Maka adapun orang-orang yang beriman dan mengerjakan kebajikan, maka mereka di dalam taman (surga) bergembira.","hasanah_per_verse":430},{"text_madani":"وَأَمَّا الَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا وَلِقَاءِ الْآخِرَةِ فَأُولَٰئِكَ فِي الْعَذَابِ مُحْضَرُونَ","text_tajweed":"وَأَ[g[مّ]َا [h:138[ٱ]لَّذِينَ كَفَرُو[s[اْ] وَكَذَّبُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِنَا وَلِقَآىِٕ [h:10441[ٱ]لْأَخِرَةِ فَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ فِى [h:10442[ٱ]لْعَذَابِ مُحْضَر[p[ُو]نَ","translation_en":"And as to those who disbelieved and rejected Our communications and the meeting of the hereafter, these shall be brought over to the chastisement.","translation_id":"Dan adapun orang-orang yang kafir dan mendustakan ayat-ayat Kami serta (mendustakan) pertemuan hari akhirat, maka mereka tetap berada di dalam azab (neraka).","hasanah_per_verse":580},{"text_madani":"فَسُبْحَانَ اللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ","text_tajweed":"فَسُ[q:8705[بْ]حَ[n[ـٰ]نَ [h:8706[ٱ]للَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِح[p[ُو]نَ","translation_en":"Therefore glory be to Allah when you enter upon the time of the evening and when you enter upon the time of the morning.","translation_id":"Maka bertasbihlah kepada Allah pada petang hari dan pada pagi hari (waktu subuh),","hasanah_per_verse":280},{"text_madani":"وَلَهُ الْحَمْدُ فِي السَّمَاوَاتِ وَالْأَرْضِ وَعَشِيًّا وَحِينَ تُظْهِرُونَ","text_tajweed":"وَلَهُ [h:10443[ٱ]لْحَمْدُ فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ وَعَشِي[a:10444[ًّا و]َحِينَ تُظْهِر[p[ُو]نَ","translation_en":"And to Him belongs praise in the heavens and the earth, and at nightfall and when you are at midday.","translation_id":"dan segala puji bagi-Nya baik di langit, di bumi, pada malam hari dan pada waktu zuhur (tengah hari).","hasanah_per_verse":390},{"text_madani":"يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَيُحْيِي الْأَرْضَ بَعْدَ مَوْتِهَا ۚ وَكَذَٰلِكَ تُخْرَجُونَ","text_tajweed":"يُخْرِجُ [h:4258[ٱ]لْحَىَّ مِنَ [h:1833[ٱ]لْمَيِّتِ وَيُخْرِجُ [h:6039[ٱ]لْمَيِّتَ مِنَ [h:1835[ٱ]لْحَىِّ وَيُحْىِ [h:10445[ٱ]لْأَرْضَ بَعْدَ مَوْتِهَا‌ۚ وَكَذ[n[َٲ]لِكَ تُخْرَج[p[ُو]نَ","translation_en":"He brings forth the living from the dead and brings forth the dead from the living, and gives life to the earth after its death, and thus shall you be brought forth.","translation_id":"Dia mengeluarkan yang hidup dari yang mati dan mengeluarkan yang mati dari yang hidup dan menghidupkan bumi setelah mati (kering). Dan seperti itulah kamu akan dikeluarkan (dari kubur).","hasanah_per_verse":600},{"text_madani":"وَمِنْ آيَاتِهِ أَنْ خَلَقَكُم مِّن تُرَابٍ ثُمَّ إِذَا أَنتُم بَشَرٌ تَنتَشِرُونَ","text_tajweed":"وَمِنْ ءَايَ[n[ـٰ]تِه[o[ِۦٓ] أَنْ خَلَقَك[w:2530[ُم م]ِّ[f:1972[ن ت]ُرَا[f:1973[بٍ ث]ُ[g[مّ]َ إِذ[o[َآ] أَ[f:428[نت][c:3459[ُم ب]َشَ[f:10446[رٌ ت]َ[f:10447[نت]َشِر[p[ُو]نَ","translation_en":"And one of His signs is that He created you from dust, then lo! you are mortals (who) scatter.","translation_id":"Dan di antara tanda-tanda (kebesaran)-Nya ialah Dia menciptakan kamu dari tanah, kemudian tiba-tiba kamu (menjadi) manusia yang berkembang biak.","hasanah_per_verse":400},{"text_madani":"وَمِنْ آيَاتِهِ أَنْ خَلَقَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَاجًا لِّتَسْكُنُوا إِلَيْهَا وَجَعَلَ بَيْنَكُم مَّوَدَّةً وَرَحْمَةً ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَتَفَكَّرُونَ","text_tajweed":"وَمِنْ ءَايَ[n[ـٰ]تِه[o[ِۦٓ] أَنْ خَلَقَ لَك[w:556[ُم م]ِّنْ أَ[f:1329[نف]ُسِكُمْ أَزْو[n[َٲ][u:10448[جًا ل]ِّتَسْكُن[o[ُوٓ][s[اْ] إِلَيْهَا وَجَعَلَ بَيْنَك[w:10449[ُم م]َّوَدَّ[a:10450[ةً و]َرَحْمَةً‌ۚ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:849[تٍ ل]ِّقَوْ[a:6018[مٍ ي]َتَفَكَّر[p[ُو]نَ","translation_en":"And one of His signs is that He created mates for you from yourselves that you may find rest in them, and He put between you love and compassion; most surely there are signs in this for a people who reflect.","translation_id":"Dan di antara tanda-tanda (kebesaran)-Nya ialah Dia menciptakan pasangan-pasangan untukmu dari jenismu sendiri, agar kamu cenderung dan merasa tenteram kepadanya, dan Dia menjadikan di antaramu rasa kasih dan sayang. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Allah) bagi kaum yang berpikir.","hasanah_per_verse":830},{"text_madani":"وَمِنْ آيَاتِهِ خَلْقُ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافُ أَلْسِنَتِكُمْ وَأَلْوَانِكُمْ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّلْعَالِمِينَ","text_tajweed":"وَمِنْ ءَايَ[n[ـٰ]تِه[n[ِۦ] خَلْقُ [h:10451[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ وَ[h:10452[ٱ]خْتِلَ[n[ـٰ]فُ أَلْسِنَتِكُمْ وَأَلْو[n[َٲ]نِكُمْ‌ۚ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:10453[تٍ ل]ِّلْعَ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And one of His signs is the creation of the heavens and the earth and the diversity of your tongues and colors; most surely there are signs in this for the learned.","translation_id":"Dan di antara tanda-tanda (kebesaran)-Nya ialah penciptaan langit dan bumi, perbedaan bahasamu dan warna kulitmu. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda bagi orang-orang yang mengetahui.","hasanah_per_verse":670},{"text_madani":"وَمِنْ آيَاتِهِ مَنَامُكُم بِاللَّيْلِ وَالنَّهَارِ وَابْتِغَاؤُكُم مِّن فَضْلِهِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَسْمَعُونَ","text_tajweed":"وَمِنْ ءَايَ[n[ـٰ]تِه[n[ِۦ] مَنَامُك[c:10454[ُم ب]ِ[h:1622[ٱ]لَّيْلِ وَ[h:834[ٱ][l[ل][g[نّ]َهَارِ وَ[h:10455[ٱ][q:10455[بْ]تِغ[o[َا]ٓؤُك[w:10456[ُم م]ِّ[f:475[ن ف]َضْلِه[o[ِۦٓ‌ۚ] إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:849[تٍ ل]ِّقَوْ[a:6119[مٍ ي]َسْمَع[p[ُو]نَ","translation_en":"And one of His signs is your sleeping and your seeking of His grace by night and (by) day; most surely there are signs in this for a people who would hear.","translation_id":"Dan di antara tanda-tanda (kebesaran)-Nya ialah tidurmu pada waktu malam dan siang hari dan usahamu mencari sebagian dari karunia-Nya. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang mendengarkan.","hasanah_per_verse":640},{"text_madani":"وَمِنْ آيَاتِهِ يُرِيكُمُ الْبَرْقَ خَوْفًا وَطَمَعًا وَيُنَزِّلُ مِنَ السَّمَاءِ مَاءً فَيُحْيِي بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَعْقِلُونَ","text_tajweed":"وَمِنْ ءَايَ[n[ـٰ]تِه[n[ِۦ] يُرِيكُمُ [h:6910[ٱ]لْبَرْقَ خَوْ[a:4752[فًا و]َطَمَ[a:10457[عًا و]َيُنَزِّلُ مِنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ م[o[َا]ٓ[f:10458[ءً ف]َيُحْى[n[ِۦ] بِهِ [h:842[ٱ]لْأَرْضَ بَعْدَ مَوْتِه[o[َآ‌ۚ] إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:849[تٍ ل]ِّقَوْ[a:850[مٍ ي]َعْقِل[p[ُو]نَ","translation_en":"And one of His signs is that He shows you the lightning for fear and for hope, and sends down water from the clouds then gives life therewith to the earth after its death; most surely there are signs in this for a people who understand","translation_id":"Dan di antara tanda-tanda (kebesaran)-Nya, Dia memperlihatkan kilat kepadamu untuk (menimbulkan) ketakutan dan harapan, dan Dia menurunkan air (hujan) dari langit, lalu dengan air itu dihidupkannya bumi setelah mati (kering). Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang mengerti.","hasanah_per_verse":850},{"text_madani":"وَمِنْ آيَاتِهِ أَن تَقُومَ السَّمَاءُ وَالْأَرْضُ بِأَمْرِهِ ۚ ثُمَّ إِذَا دَعَاكُمْ دَعْوَةً مِّنَ الْأَرْضِ إِذَا أَنتُمْ تَخْرُجُونَ","text_tajweed":"وَمِنْ ءَايَ[n[ـٰ]تِه[o[ِۦٓ] أَ[f:5839[ن ت]َقُومَ [h:10459[ٱ][l[ل]سَّم[o[َا]ٓءُ وَ[h:2241[ٱ]لْأَرْضُ بِأَمْرِه[n[ِۦ]‌ۚ ثُ[g[مّ]َ إِذَا دَعَاكُمْ دَعْوَ[a:10460[ةً م]ِّنَ [h:1579[ٱ]لْأَرْضِ إِذ[o[َآ] أَ[f:428[نت]ُمْ تَخْرُج[p[ُو]نَ","translation_en":"And one of His signs is that the heaven and the earth subsist by His command, then when He calls you with a (single) call from out of the earth, lo! you come forth.","translation_id":"Dan di antara tanda-tanda (kebesaran)-Nya ialah berdirinya langit dan bumi dengan kehendak-Nya. Kemudian apa-bila Dia memanggil kamu sekali panggil dari bumi, seketika itu kamu keluar (dari kubur).","hasanah_per_verse":650},{"text_madani":"وَلَهُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ كُلٌّ لَّهُ قَانِتُونَ","text_tajweed":"وَلَهُ[n[ۥ] مَ[f:2074[ن ف]ِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۖ كُ[u:610[لٌّ ل]َّهُ[n[ۥ] قَ[n[ـٰ]نِت[p[ُو]نَ","translation_en":"And His is whosoever is in the heavens and the earth; all are obedient to Him.","translation_id":"Dan milik-Nya apa yang di langit dan di bumi. Semuanya hanya kepada-Nya tunduk.","hasanah_per_verse":310},{"text_madani":"وَهُوَ الَّذِي يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ ۚ وَلَهُ الْمَثَلُ الْأَعْلَىٰ فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ","text_tajweed":"وَهُوَ [h:4114[ٱ]لَّذِى يَ[q:5943[بْ]دَؤُ[s[اْ] [h:5944[ٱ]لْخَلْقَ ثُ[g[مّ]َ يُعِيدُهُ[n[ۥ] وَهُوَ أَهْوَنُ عَلَيْهِ‌ۚ وَلَهُ [h:10461[ٱ]لْمَثَلُ [h:7451[ٱ]لْأَعْلَىٰ فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۚ وَهُوَ [h:7045[ٱ]لْعَزِيزُ [h:681[ٱ]لْحَك[p[ِي]مُ","translation_en":"And He it is Who originates the creation, then reproduces it, and it is easy to Him; and His are the most exalted attributes in the heavens and the earth, and He is the Mighty, the Wise.","translation_id":"Dan Dialah yang memulai penciptaan, kemudian mengulanginya kembali, dan itu lebih mudah bagi-Nya. Dia memiliki sifat yang Mahatinggi di langit dan di bumi. Dan Dialah Yang Mahaperkasa, Mahabijaksana.","hasanah_per_verse":790},{"text_madani":"ضَرَبَ لَكُم مَّثَلًا مِّنْ أَنفُسِكُمْ ۖ هَل لَّكُم مِّن مَّا مَلَكَتْ أَيْمَانُكُم مِّن شُرَكَاءَ فِي مَا رَزَقْنَاكُمْ فَأَنتُمْ فِيهِ سَوَاءٌ تَخَافُونَهُمْ كَخِيفَتِكُمْ أَنفُسَكُمْ ۚ كَذَٰلِكَ نُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْقِلُونَ","text_tajweed":"ضَرَبَ لَك[w:10462[ُم م]َّثَل[a:10463[اً م]ِّنْ أَ[f:1329[نف]ُسِكُمْ‌ۖ هَل لَّك[w:556[ُم م]ّ[a:10464[ِن م]َّا مَلَكَتْ أَيْمَ[n[ـٰ]نُك[w:2713[ُم م]ِّ[f:10465[ن ش]ُرَك[o[َا]ٓءَ فِى مَا رَزَ[q:275[قْ]نَ[n[ـٰ]كُمْ فَأَ[f:10466[نت]ُمْ فِيهِ سَو[o[َا]ٓ[f:10467[ءٌ ت]َخَافُونَهُمْ كَخِيفَتِكُمْ أَ[f:221[نف]ُسَكُمْ‌ۚ كَذ[n[َٲ]لِكَ نُفَصِّلُ [h:4091[ٱ]لْأَيَ[n[ـٰ]تِ لِقَوْ[a:850[مٍ ي]َعْقِل[p[ُو]نَ","translation_en":"He sets forth to you a parable relating to yourselves: Have you among those whom your right hands possess partners in what We have given you for sustenance, so that with respect to it you are alike; you fear them as you fear each other? Thus do We make the communications distinct for a people who understand.","translation_id":"Dia membuat perumpamaan bagimu dari dirimu sendiri. Apakah (kamu rela jika) ada di antara hamba sahaya yang kamu miliki, menjadi sekutu bagimu dalam (memiliki) rezeki yang telah Kami berikan kepadamu, sehingga kamu menjadi setara dengan mereka dalam hal ini, lalu kamu takut kepada mereka sebagaimana kamu takut kepada sesamamu. Demikianlah Kami jelaskan ayat-ayat itu bagi kaum yang mengerti.","hasanah_per_verse":1130},{"text_madani":"بَلِ اتَّبَعَ الَّذِينَ ظَلَمُوا أَهْوَاءَهُم بِغَيْرِ عِلْمٍ ۖ فَمَن يَهْدِي مَنْ أَضَلَّ اللَّهُ ۖ وَمَا لَهُم مِّن نَّاصِرِينَ","text_tajweed":"بَلِ [h:10468[ٱ]تَّبَعَ [h:10469[ٱ]لَّذِينَ ظَلَم[o[ُوٓ][s[اْ] أَهْو[o[َا]ٓءَه[c:10470[ُم ب]ِغَيْرِ عِلْ[f:10471[مٍ‌ۖ ف]َم[a:10472[َن ي]َهْدِى مَنْ أَضَلَّ [h:3001[ٱ]للَّهُ‌ۖ وَمَا لَه[w:1812[ُم م]ّ[a:1813[ِن ن]َّ[n[ـٰ]صِر[p[ِي]نَ","translation_en":"Nay! those who are unjust follow their low desires without any knowledge; so who can guide him whom Allah makes err? And they shall have no helpers.","translation_id":"Tetapi orang-orang yang zhalim, mengikuti keinginannya tanpa ilmu pengetahuan; maka siapakah yang dapat memberi petunjuk kepada orang yang telah disesatkan Allah. Dan tidak ada seorang penolong pun bagi mereka.","hasanah_per_verse":600},{"text_madani":"فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا ۚ فِطْرَتَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا ۚ لَا تَبْدِيلَ لِخَلْقِ اللَّهِ ۚ ذَٰلِكَ الدِّينُ الْقَيِّمُ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ","text_tajweed":"فَأَقِمْ وَ[q:749[جْ]هَكَ لِلدِّينِ حَنِي[f:10473[فًا‌ۚ ف]ِ[q:10474[طْ]رَتَ [h:10475[ٱ]للَّهِ [h:4656[ٱ]لَّتِى فَطَرَ [h:10476[ٱ][l[ل][g[نّ]َاسَ عَلَيْهَا‌ۚ لَا تَ[q:6113[بْ]دِيلَ لِخَلْقِ [h:10477[ٱ]للَّهِ‌ۚ ذ[n[َٲ]لِكَ [h:5569[ٱ][l[ل]دِّينُ [h:5570[ٱ]لْقَيِّمُ وَلَ[n[ـٰ]كِ[g[نّ]َ أَكْثَرَ [h:1374[ٱ][l[ل][g[نّ]َاسِ لَا يَعْلَم[p[ُو]نَ","translation_en":"Then set your face upright for religion in the right state-- the nature made by Allah in which He has made men; there is no altering of Allah's creation; that is the right religion, but most people do not know--","translation_id":"Maka hadapkanlah wajahmu dengan lurus kepada agama (Islam); (sesuai) fitrah Allah disebabkan Dia telah menciptakan manusia menurut (fitrah) itu. Tidak ada perubahan pada ciptaan Allah. (Itulah) agama yang lurus, tetapi kebanyakan manusia tidak mengetahui,","hasanah_per_verse":920},{"text_madani":"مُنِيبِينَ إِلَيْهِ وَاتَّقُوهُ وَأَقِيمُوا الصَّلَاةَ وَلَا تَكُونُوا مِنَ الْمُشْرِكِينَ","text_tajweed":"۞ مُنِيبِينَ إِلَيْهِ وَ[h:4181[ٱ]تَّقُوهُ وَأَقِيمُو[s[اْ] [h:214[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ وَلَا تَكُونُو[s[اْ] مِنَ [h:699[ٱ]لْمُشْرِك[p[ِي]نَ","translation_en":"Turning to Him, and be careful of (your duty to) Him and keep up prayer and be not of the polytheists","translation_id":"dengan kembali bertobat kepada-Nya dan bertakwalah kepada-Nya serta laksanakanlah shalat dan janganlah kamu termasuk orang-orang yang mempersekutukan Allah,","hasanah_per_verse":480},{"text_madani":"مِنَ الَّذِينَ فَرَّقُوا دِينَهُمْ وَكَانُوا شِيَعًا ۖ كُلُّ حِزْبٍ بِمَا لَدَيْهِمْ فَرِحُونَ","text_tajweed":"مِنَ [h:523[ٱ]لَّذِينَ فَرَّقُو[s[اْ] دِينَهُمْ وَكَانُو[s[اْ] شِيَ[f:10478[عًا‌ۖ ك]ُلُّ حِزْ[i:9228[بِۭ ب]ِمَا لَدَيْهِمْ فَرِح[p[ُو]نَ","translation_en":"Of those who divided their religion and became seas every sect rejoicing in what they had with them","translation_id":"yaitu orang-orang yang memecah belah agama mereka dan mereka menjadi beberapa golongan. Setiap golongan merasa bangga dengan apa yang ada pada golongan mereka.","hasanah_per_verse":450},{"text_madani":"وَإِذَا مَسَّ النَّاسَ ضُرٌّ دَعَوْا رَبَّهُم مُّنِيبِينَ إِلَيْهِ ثُمَّ إِذَا أَذَاقَهُم مِّنْهُ رَحْمَةً إِذَا فَرِيقٌ مِّنْهُم بِرَبِّهِمْ يُشْرِكُونَ","text_tajweed":"وَإِذَا مَسَّ [h:10479[ٱ][l[ل][g[نّ]َاسَ ضُ[f:10480[رٌّ د]َعَوْ[s[اْ] رَبَّه[w:10481[ُم م]ُّنِيبِينَ إِلَيْهِ ثُ[g[مّ]َ إِذ[o[َآ] أَذَاقَه[w:10482[ُم م]ِّنْهُ رَحْمَةً إِذَا فَرِي[a:388[قٌ م]ِّنْه[c:10483[ُم ب]ِرَبِّهِمْ يُشْرِك[p[ُو]نَ","translation_en":"And when harm afflicts men, they call upon their Lord, turning to Him, then when He makes them taste of mercy from Him, lo! some of them begin to associate (others) with their Lord,","translation_id":"Dan apabila manusia ditimpa oleh suatu bahaya, mereka menyeru Tuhannya dengan kembali (bertobat) kepada-Nya, kemudian apabila Dia memberikan sedikit rahmat-Nya kepada mereka, tiba-tiba sebagian mereka mempersekutukan Allah.","hasanah_per_verse":710},{"text_madani":"لِيَكْفُرُوا بِمَا آتَيْنَاهُمْ ۚ فَتَمَتَّعُوا فَسَوْفَ تَعْلَمُونَ","text_tajweed":"لِيَكْفُرُو[s[اْ] بِم[o[َآ] ءَاتَيْنَ[n[ـٰ]هُمْ‌ۚ فَتَمَتَّعُو[s[اْ] فَسَوْفَ تَعْلَم[p[ُو]نَ","translation_en":"So as to be ungrateful for what We have given them; but enjoy yourselves (for a while), for you shall soon come to know.","translation_id":"Biarkan mereka mengingkari rahmat yang telah Kami berikan. Dan bersenang-senanglah kamu, maka kelak kamu akan mengetahui (akibat perbuatanmu).","hasanah_per_verse":340},{"text_madani":"أَمْ أَنزَلْنَا عَلَيْهِمْ سُلْطَانًا فَهُوَ يَتَكَلَّمُ بِمَا كَانُوا بِهِ يُشْرِكُونَ","text_tajweed":"أَمْ أَ[f:515[نز]َلْنَا عَلَيْهِمْ سُلْطَ[n[ـٰ][f:10484[نًا ف]َهُوَ يَتَكَلَّمُ بِمَا كَانُو[s[اْ] بِه[n[ِۦ] يُشْرِك[p[ُو]نَ","translation_en":"Or, have We sent down upon them an authority so that it speaks of that which they associate with Him?","translation_id":"Atau pernahkah Kami menurunkan kepada mereka keterangan, yang menjelaskan (membenarkan) apa yang (selalu) mereka persekutukan dengan Tuhan?","hasanah_per_verse":430},{"text_madani":"وَإِذَا أَذَقْنَا النَّاسَ رَحْمَةً فَرِحُوا بِهَا ۖ وَإِن تُصِبْهُمْ سَيِّئَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ إِذَا هُمْ يَقْنَطُونَ","text_tajweed":"وَإِذ[o[َآ] أَذَ[q:5991[قْ]نَا [h:5992[ٱ][l[ل][g[نّ]َاسَ رَحْمَ[f:10485[ةً ف]َرِحُو[s[اْ] بِهَا‌ۖ وَإِ[f:2950[ن ت]ُصِ[q:2951[بْ]هُمْ سَيِّئَ[i:10486[ةُۢ ب]ِمَا قَدَّمَتْ أَيْدِيهِمْ إِذَا هُمْ يَ[q:10487[قْ]نَط[p[ُو]نَ","translation_en":"And when We make people taste of mercy they rejoice in it, and if an evil befall them for what their hands have already wrought, lo! they are in despair.","translation_id":"Dan apabila Kami berikan sesuatu rahmat kepada manusia, niscaya mereka gembira dengan (rahmat) itu. Tetapi apabila mereka ditimpa sesuatu musibah (bahaya) karena kesalahan mereka sendiri, seketika itu mereka berputus asa.","hasanah_per_verse":620},{"text_madani":"أَوَلَمْ يَرَوْا أَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَن يَشَاءُ وَيَقْدِرُ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يُؤْمِنُونَ","text_tajweed":"أَوَلَمْ يَرَوْ[s[اْ] أَ[g[نّ]َ [h:394[ٱ]للَّهَ يَ[q:6968[بْ]سُطُ [h:6969[ٱ][l[ل]رِّزْقَ لِم[a:1537[َن ي]َش[o[َا]ٓءُ وَيَ[q:6970[قْ]دِرُ‌ۚ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:849[تٍ ل]ِّقَوْ[a:4294[مٍ ي]ُؤْمِن[p[ُو]نَ","translation_en":"Do they not see that Allah makes ample provision for whom He pleases, or straitens? Most surely there are signs in this for a people who believe.","translation_id":"Dan tidakkah mereka memperhatikan bahwa Allah yang melapangkan rezeki bagi siapa yang Dia kehendaki dan Dia (pula) yang membatasi (bagi siapa yang Dia kehendaki). Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Allah) bagi kaum yang beriman.","hasanah_per_verse":570},{"text_madani":"فَآتِ ذَا الْقُرْبَىٰ حَقَّهُ وَالْمِسْكِينَ وَابْنَ السَّبِيلِ ۚ ذَٰلِكَ خَيْرٌ لِّلَّذِينَ يُرِيدُونَ وَجْهَ اللَّهِ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ","text_tajweed":"فَـَٔـاتِ ذَا [h:7727[ٱ]لْقُرْبَىٰ حَقَّهُ[n[ۥ] وَ[h:7728[ٱ]لْمِسْكِينَ وَ[h:911[ٱ][q:911[بْ]نَ [h:912[ٱ][l[ل]سَّبِيلِ‌ۚ ذ[n[َٲ]لِكَ خَيْ[u:4005[رٌ ل]ِّلَّذِينَ يُرِيدُونَ وَ[q:2019[جْ]هَ [h:10488[ٱ]للَّهِ‌ۖ وَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:23[ٱ]لْمُفْلِح[p[ُو]نَ","translation_en":"Then give to the near of kin his due, and to the needy and the wayfarer; this is best for those who desire Allah's pleasure, and these it is who are successful.","translation_id":"Maka berikanlah haknya kepada kerabat dekat, juga kepada orang miskin dan orang-orang yang dalam perjalanan. Itulah yang lebih baik bagi orang-orang yang mencari keridhaan Allah. Dan mereka itulah orang-orang yang beruntung.","hasanah_per_verse":720},{"text_madani":"وَمَا آتَيْتُم مِّن رِّبًا لِّيَرْبُوَ فِي أَمْوَالِ النَّاسِ فَلَا يَرْبُو عِندَ اللَّهِ ۖ وَمَا آتَيْتُم مِّن زَكَاةٍ تُرِيدُونَ وَجْهَ اللَّهِ فَأُولَٰئِكَ هُمُ الْمُضْعِفُونَ","text_tajweed":"وَم[o[َآ] ءَاتَيْت[w:10489[ُم م]ّ[u:10490[ِن ر]ِّ[u:10491[بًا ل]ِّيَرْبُوَ[s[اْ] ف[o[ِىٓ] أَمْو[n[َٲ]لِ [h:1008[ٱ][l[ل][g[نّ]َاسِ فَلَا يَرْبُو[s[اْ] عِ[f:264[ند]َ [h:408[ٱ]للَّهِ‌ۖ وَم[o[َآ] ءَاتَيْت[w:10489[ُم م]ِّ[f:10492[ن ز]َكَ[s[و][n[ٲ][f:10493[ةٍ ت]ُرِيدُونَ وَ[q:2019[جْ]هَ [h:10488[ٱ]للَّهِ فَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:10494[ٱ]لْمُضْعِف[p[ُو]نَ","translation_en":"And whatever you lay out as usury, so that it may increase in the property of men, it shall not increase with Allah; and whatever you give in charity, desiring Allah's pleasure-- it is these (persons) that shall get manifold.","translation_id":"Dan sesuatu riba (tambahan) yang kamu berikan agar harta manusia bertambah, maka tidak bertambah dalam pandangan Allah. Dan apa yang kamu berikan berupa zakat yang kamu maksudkan untuk memperoleh keridhaan Allah, maka itulah orang-orang yang melipatgandakan (pahalanya).","hasanah_per_verse":870},{"text_madani":"اللَّهُ الَّذِي خَلَقَكُمْ ثُمَّ رَزَقَكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ۖ هَلْ مِن شُرَكَائِكُم مَّن يَفْعَلُ مِن ذَٰلِكُم مِّن شَيْءٍ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ","text_tajweed":"ٱللَّهُ [h:4738[ٱ]لَّذِى خَلَقَكُمْ ثُ[g[مّ]َ رَزَقَكُمْ ثُ[g[مّ]َ يُمِيتُكُمْ ثُ[g[مّ]َ يُحْيِيكُمْ‌ۖ هَلْ مِ[f:6046[ن ش]ُرَك[o[َا]ٓئِك[w:6047[ُم م]ّ[a:439[َن ي]َفْعَلُ مِ[f:1784[ن ذ][n[َٲ]لِك[w:10495[ُم م]ِّ[f:2103[ن ش][f:10496[َىْءٍ‌ۚ س]ُ[q:608[بْ]حَ[n[ـٰ]نَهُ[n[ۥ] وَتَعَ[n[ـٰ]لَىٰ عَ[g[مّ]َا يُشْرِك[p[ُو]نَ","translation_en":"Allah is He Who created you, then gave you sustenance, then He causes you to die, then brings you to life. Is there any of your associate-gods who does aught of it? Glory be to Him, and exalted be He above what they associate (with Him).","translation_id":"Allah yang menciptakan kamu, kemudian memberimu rezeki, lalu mematikanmu, kemudian menghidupkanmu (kembali). Adakah di antara mereka yang kamu sekutukan dengan Allah itu yang dapat berbuat sesuatu yang demikian itu? Mahasuci Dia dan Mahatinggi dari apa yang mereka persekutukan.","hasanah_per_verse":850},{"text_madani":"ظَهَرَ الْفَسَادُ فِي الْبَرِّ وَالْبَحْرِ بِمَا كَسَبَتْ أَيْدِي النَّاسِ لِيُذِيقَهُم بَعْضَ الَّذِي عَمِلُوا لَعَلَّهُمْ يَرْجِعُونَ","text_tajweed":"ظَهَرَ [h:10497[ٱ]لْفَسَادُ فِى [h:4106[ٱ]لْبَرِّ وَ[h:4107[ٱ]لْبَحْرِ بِمَا كَسَبَتْ أَيْدِى [h:10498[ٱ][l[ل][g[نّ]َاسِ لِيُذِيقَه[c:10499[ُم ب]َعْضَ [h:1943[ٱ]لَّذِى عَمِلُو[s[اْ] لَعَلَّهُمْ يَرْجِع[p[ُو]نَ","translation_en":"Corruption has appeared in the land and the sea on account of what the hands of men have wrought, that He may make them taste a part of that which they have done, so that they may return.","translation_id":"Telah tampak kerusakan di darat dan di laut disebabkan karena perbuatan tangan manusia; Allah menghendaki agar mereka merasakan sebagian dari (akibat) perbuatan mereka, agar mereka kembali (ke jalan yang benar).","hasanah_per_verse":670},{"text_madani":"قُلْ سِيرُوا فِي الْأَرْضِ فَانظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِن قَبْلُ ۚ كَانَ أَكْثَرُهُم مُّشْرِكِينَ","text_tajweed":"قُلْ سِيرُو[s[اْ] فِى [h:44[ٱ]لْأَرْضِ فَ[h:2257[ٱ][f:2257[نظ]ُرُو[s[اْ] كَيْفَ كَانَ عَ[n[ـٰ]قِبَةُ [h:6854[ٱ]لَّذِينَ مِ[f:128[ن ق]َ[q:129[بْ]لُ‌ۚ كَانَ أَكْثَرُه[w:10500[ُم م]ُّشْرِك[p[ِي]نَ","translation_en":"Say: Travel in the land, then see how was the end of those before; most of them were polytheists.","translation_id":"Katakanlah (Muhammad), “Bepergianlah di bumi lalu lihatlah bagaimana kesudahan orang-orang dahulu. Kebanyakan dari mereka adalah orang-orang yang mempersekutukan (Allah).”","hasanah_per_verse":570},{"text_madani":"فَأَقِمْ وَجْهَكَ لِلدِّينِ الْقَيِّمِ مِن قَبْلِ أَن يَأْتِيَ يَوْمٌ لَّا مَرَدَّ لَهُ مِنَ اللَّهِ ۖ يَوْمَئِذٍ يَصَّدَّعُونَ","text_tajweed":"فَأَقِمْ وَ[q:749[جْ]هَكَ لِلدِّينِ [h:10501[ٱ]لْقَيِّمِ مِ[f:1346[ن ق]َ[q:1347[بْ]لِ أ[a:1462[َن ي]َأْتِىَ يَوْ[u:1463[مٌ ل]َّا مَرَدَّ لَهُ[n[ۥ] مِنَ [h:321[ٱ]للَّهِ‌ۖ يَوْمَئِ[a:10502[ذٍ ي]َصَّدَّع[p[ُو]نَ","translation_en":"Then turn thy face straight to the right religion before there come from Allah the day which cannot be averted; on that day they shall become separated.","translation_id":"Oleh karena itu, hadapkanlah wajahmu kepada agama yang lurus (Islam) sebelum datang dari Allah suatu hari (Kiamat) yang tidak dapat ditolak, pada hari itu mereka terpisah-pisah.","hasanah_per_verse":560},{"text_madani":"مَن كَفَرَ فَعَلَيْهِ كُفْرُهُ ۖ وَمَنْ عَمِلَ صَالِحًا فَلِأَنفُسِهِمْ يَمْهَدُونَ","text_tajweed":"مَ[f:1457[ن ك]َفَرَ فَعَلَيْهِ كُفْرُهُ[n[ۥ]‌ۖ وَمَنْ عَمِلَ صَ[n[ـٰ]لِ[f:10503[حًا ف]َلِأَ[f:10504[نف]ُسِهِمْ يَمْهَد[p[ُو]نَ","translation_en":"Whoever disbelieves, he shall be responsible for his disbelief, and whoever does good, they prepare (good) for their own souls,","translation_id":"Barangsiapa kafir maka dia sendirilah yang menanggung (akibat) kekafirannya itu; dan barangsiapa mengerjakan kebajikan maka mereka menyiapkan untuk diri mereka sendiri (tempat yang menyenangkan),","hasanah_per_verse":390},{"text_madani":"لِيَجْزِيَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ مِن فَضْلِهِ ۚ إِنَّهُ لَا يُحِبُّ الْكَافِرِينَ","text_tajweed":"لِيَ[q:5945[جْ]زِىَ [h:5946[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ مِ[f:475[ن ف]َضْلِه[o[ِۦٓ‌ۚ] إِ[g[نّ]َهُ[n[ۥ] لَا يُحِبُّ [h:1858[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"That He may reward those who believe and do good out of His grace; surely He does not love the unbelievers.","translation_id":"agar Allah memberi balasan (pahala) kepada orang-orang yang beriman dan mengerjakan kebajikan dari karunia-Nya. Sungguh, Dia tidak menyukai orang-orang yang ingkar (kafir).","hasanah_per_verse":510},{"text_madani":"وَمِنْ آيَاتِهِ أَن يُرْسِلَ الرِّيَاحَ مُبَشِّرَاتٍ وَلِيُذِيقَكُم مِّن رَّحْمَتِهِ وَلِتَجْرِيَ الْفُلْكُ بِأَمْرِهِ وَلِتَبْتَغُوا مِن فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ","text_tajweed":"وَمِنْ ءَايَ[n[ـٰ]تِه[o[ِۦٓ] أ[a:10505[َن ي]ُرْسِلَ [h:10506[ٱ][l[ل]رِّيَاحَ مُبَشِّر[n[َٲ][a:10507[تٍ و]َلِيُذِيقَك[w:10508[ُم م]ّ[u:7986[ِن ر]َّحْمَتِه[n[ِۦ] وَلِتَ[q:10509[جْ]رِىَ [h:10510[ٱ]لْفُلْكُ بِأَمْرِه[n[ِۦ] وَلِتَ[q:7353[بْ]تَغُو[s[اْ] مِ[f:475[ن ف]َضْلِه[n[ِۦ] وَلَعَلَّكُمْ تَشْكُر[p[ُو]نَ","translation_en":"And one of His signs is that He sends forth the winds bearing good news, and that He may make your taste of His mercy, and that the ships may run by His command, and that you may seek of His grace, and that you may be grateful.","translation_id":"Dan di antara tanda-tanda (kebesaran)-Nya adalah bahwa Dia mengirimkan angin sebagai pembawa berita gembira dan agar kamu merasakan sebagian dari rahmat-Nya dan agar kapal dapat berlayar dengan perintah-Nya dan (juga) agar kamu dapat mencari sebagian dari karunia-Nya, dan agar kamu bersyukur.","hasanah_per_verse":830},{"text_madani":"وَلَقَدْ أَرْسَلْنَا مِن قَبْلِكَ رُسُلًا إِلَىٰ قَوْمِهِمْ فَجَاءُوهُم بِالْبَيِّنَاتِ فَانتَقَمْنَا مِنَ الَّذِينَ أَجْرَمُوا ۖ وَكَانَ حَقًّا عَلَيْنَا نَصْرُ الْمُؤْمِنِينَ","text_tajweed":"وَلَقَ[q:341[دْ] أَرْسَلْنَا مِ[f:18[ن ق]َ[q:19[بْ]لِكَ رُسُلاً إِلَىٰ قَوْمِهِمْ فَج[o[َا]ٓءُوه[c:6138[ُم ب]ِ[h:484[ٱ]لْبَيِّنَ[n[ـٰ]تِ فَ[h:4969[ٱ][f:4969[نت]َقَمْنَا مِنَ [h:523[ٱ]لَّذِينَ أَ[q:4390[جْ]رَمُو[s[اْ‌ۖ] وَكَانَ حَقًّا عَلَيْنَا نَصْرُ [h:10511[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"And certainly We sent before you messengers to their people, so they came to them with clear arguments, then We gave the punishment to those who were guilty; and helping the believers is ever incumbent on Us.","translation_id":"Dan sungguh, Kami telah mengutus sebelum engkau (Muhammad) beberapa orang rasul kepada kaumnya, mereka datang kepadanya dengan membawa keterangan-keterangan (yang cukup), lalu Kami melakukan pembalasan terhadap orang-orang yang berdosa. Dan merupakan hak Kami untuk menolong orang-orang yang beriman.","hasanah_per_verse":870},{"text_madani":"اللَّهُ الَّذِي يُرْسِلُ الرِّيَاحَ فَتُثِيرُ سَحَابًا فَيَبْسُطُهُ فِي السَّمَاءِ كَيْفَ يَشَاءُ وَيَجْعَلُهُ كِسَفًا فَتَرَى الْوَدْقَ يَخْرُجُ مِنْ خِلَالِهِ ۖ فَإِذَا أَصَابَ بِهِ مَن يَشَاءُ مِنْ عِبَادِهِ إِذَا هُمْ يَسْتَبْشِرُونَ","text_tajweed":"ٱللَّهُ [h:4738[ٱ]لَّذِى يُرْسِلُ [h:4755[ٱ][l[ل]رِّيَ[n[ـٰ]حَ فَتُثِيرُ سَحَا[f:10512[بًا ف]َيَ[q:10513[بْ]سُطُهُ[n[ۥ] فِى [h:746[ٱ][l[ل]سَّم[o[َا]ٓءِ كَيْفَ يَش[o[َا]ٓءُ وَيَ[q:10514[جْ]عَلُهُ[n[ۥ] كِسَ[f:10515[فًا ف]َتَرَى [h:9469[ٱ]لْوَ[q:9470[دْ]قَ يَخْرُجُ مِنْ خِلَ[n[ـٰ]لِه[n[ِۦ]‌ۖ فَإِذ[o[َآ] أَصَابَ بِه[n[ِۦ] م[a:476[َن ي]َش[o[َا]ٓءُ مِنْ عِبَادِه[o[ِۦٓ] إِذَا هُمْ يَسْتَ[q:2415[بْ]شِر[p[ُو]نَ","translation_en":"Allah is he Who sends forth the winds so they raise a cloud, then He spreads it forth in the sky as He pleases, and He breaks it up so that you see the rain coming forth from inside it; then when He causes it to fall upon whom He pleases of His servants, lo! they are joyful","translation_id":"Allah-lah yang mengirimkan angin, lalu angin itu menggerakkan awan dan Allah membentangkannya di langit menurut yang Dia kehendaki, dan menjadikannya bergumpal-gumpal, lalu engkau lihat hujan keluar dari celah-celahnya, maka apabila Dia menurunkannya kepada hamba-hamba-Nya yang Dia kehendaki tiba-tiba mereka bergembira.","hasanah_per_verse":1150},{"text_madani":"وَإِن كَانُوا مِن قَبْلِ أَن يُنَزَّلَ عَلَيْهِم مِّن قَبْلِهِ لَمُبْلِسِينَ","text_tajweed":"وَإِ[f:2392[ن ك]َانُو[s[اْ] مِ[f:1346[ن ق]َ[q:1347[بْ]لِ أ[a:547[َن ي]ُنَزَّلَ عَلَيْه[w:4082[ِم م]ِّ[f:1097[ن ق]َ[q:1098[بْ]لِه[n[ِۦ] لَمُ[q:10516[بْ]لِس[p[ِي]نَ","translation_en":"Though they were before this, before it was sent down upon them, confounded in sure despair.","translation_id":"Padahal walaupun sebelum hujan diturunkan kepada mereka, mereka benar-benar telah berputus asa.","hasanah_per_verse":370},{"text_madani":"فَانظُرْ إِلَىٰ آثَارِ رَحْمَتِ اللَّهِ كَيْفَ يُحْيِي الْأَرْضَ بَعْدَ مَوْتِهَا ۚ إِنَّ ذَٰلِكَ لَمُحْيِي الْمَوْتَىٰ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","text_tajweed":"فَ[h:9999[ٱ][f:1513[نظ]ُرْ إِلَ[o[ىٰٓ] ءَاثَ[n[ـٰ]رِ رَحْمَتِ [h:10517[ٱ]للَّهِ كَيْفَ يُحْىِ [h:10518[ٱ]لْأَرْضَ بَعْدَ مَوْتِه[o[َآ‌ۚ] إِ[g[نّ]َ ذ[n[َٲ]لِكَ لَمُحْىِ [h:10519[ٱ]لْمَوْتَىٰ‌ۖ وَهُوَ عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َد[p[ِي]رٌ","translation_en":"Look then at the signs of Allah's mercy, how He gives life to the earth after its death, most surely He will raise the dead to life; and He has power over all things.","translation_id":"Maka perhatikanlah bekas-bekas rahmat Allah, bagaimana Allah menghidupkan bumi setelah mati (kering). Sungguh, itu berarti Dia pasti (berkuasa) menghidupkan yang telah mati. Dan Dia Mahakuasa atas segala sesuatu.","hasanah_per_verse":710},{"text_madani":"وَلَئِنْ أَرْسَلْنَا رِيحًا فَرَأَوْهُ مُصْفَرًّا لَّظَلُّوا مِن بَعْدِهِ يَكْفُرُونَ","text_tajweed":"وَلَئِنْ أَرْسَلْنَا رِي[f:10520[حًا ف]َرَأَوْهُ مُصْفَر[u:10521[ًّا ل]َّظَلُّو[s[اْ] م[i:254[ِنۢ ب]َعْدِه[n[ِۦ] يَكْفُر[p[ُو]نَ","translation_en":"And if We send a wind and they see it to be yellow, they would after that certainly continue to disbelieve","translation_id":"Dan sungguh, jika Kami mengirimkan angin lalu mereka melihat (tumbuh-tumbuhan itu) menjadi kuning (kering), niscaya setelah itu mereka tetap ingkar.","hasanah_per_verse":410},{"text_madani":"فَإِنَّكَ لَا تُسْمِعُ الْمَوْتَىٰ وَلَا تُسْمِعُ الصُّمَّ الدُّعَاءَ إِذَا وَلَّوْا مُدْبِرِينَ","text_tajweed":"فَإِ[g[نّ]َكَ لَا تُسْمِعُ [h:10033[ٱ]لْمَوْتَىٰ وَلَا تُسْمِعُ [h:6070[ٱ][l[ل]صُّ[g[مّ]َ [h:10034[ٱ][l[ل]دُّع[o[َا]ٓءَ إِذَا وَلَّوْ[s[اْ] مُ[q:5528[دْ]بِر[p[ِي]نَ","translation_en":"For surely you cannot, make the dead to hear and you cannot make the deaf to hear the call, when they turn back and","translation_id":"Maka sungguh, engkau tidak akan sanggup menjadikan orang-orang yang mati itu dapat mendengar, dan menjadikan orang-orang yang tuli dapat mendengar seruan, apabila mereka berpaling ke belakang.","hasanah_per_verse":460},{"text_madani":"وَمَا أَنتَ بِهَادِ الْعُمْيِ عَن ضَلَالَتِهِمْ ۖ إِن تُسْمِعُ إِلَّا مَن يُؤْمِنُ بِآيَاتِنَا فَهُم مُّسْلِمُونَ","text_tajweed":"وَم[o[َآ] أَ[f:169[نت]َ بِهَ[n[ـٰ]دِ [h:10522[ٱ]لْعُمْىِ عَ[f:10036[ن ض]َلَ[n[ـٰ]لَتِهِمْ‌ۖ إِ[f:10037[ن ت]ُسْمِعُ إِلَّا م[a:5799[َن ي]ُؤْمِنُ بِـَٔـايَ[n[ـٰ]تِنَا فَه[w:10038[ُم م]ُّسْلِم[p[ُو]نَ","translation_en":"Nor can you lead away the blind out of their error. You cannot make to hear any but those who believe in Our communications so they shall submit.","translation_id":"Dan engkau tidak akan dapat memberi petunjuk kepada orang-orang yang buta (mata hatinya) dari kesesatannya. Dan engkau tidak dapat memperdengarkan (petunjuk Tuhan) kecuali kepada orang-orang yang beriman dengan ayat-ayat Kami, maka mereka itulah orang-orang yang berserah diri (kepada Kami).","hasanah_per_verse":550},{"text_madani":"اللَّهُ الَّذِي خَلَقَكُم مِّن ضَعْفٍ ثُمَّ جَعَلَ مِن بَعْدِ ضَعْفٍ قُوَّةً ثُمَّ جَعَلَ مِن بَعْدِ قُوَّةٍ ضَعْفًا وَشَيْبَةً ۚ يَخْلُقُ مَا يَشَاءُ ۖ وَهُوَ الْعَلِيمُ الْقَدِيرُ","text_tajweed":"۞ ٱللَّهُ [h:4738[ٱ]لَّذِى خَلَقَك[w:2530[ُم م]ِّ[f:10523[ن ض]َعْ[f:10524[فٍ ث]ُ[g[مّ]َ جَعَلَ م[i:146[ِنۢ ب]َعْدِ ضَعْ[f:10525[فٍ ق]ُوَّ[f:10526[ةً ث]ُ[g[مّ]َ جَعَلَ م[i:146[ِنۢ ب]َعْدِ قُوَّ[f:10527[ةٍ ض]َعْ[a:10528[فًا و]َشَيْبَ[a:10529[ةً‌ۚ ي]َخْلُقُ مَا يَش[o[َا]ٓءُ‌ۖ وَهُوَ [h:10530[ٱ]لْعَلِيمُ [h:10531[ٱ]لْقَد[p[ِي]رُ","translation_en":"Allah is He Who created you from a state of weakness then He gave strength after weakness, then ordained weakness and hoary hair after strength; He creates what He pleases, and He is the Knowing, the Powerful.","translation_id":"Allah-lah yang menciptakan kamu dari keadaan lemah, kemudian Dia menjadikan (kamu) setelah keadaan lemah itu menjadi kuat, kemudian Dia menjadikan (kamu) setelah kuat itu lemah (kembali) dan beruban. Dia menciptakan apa yang Dia kehendaki. Dan Dia Maha Mengetahui, Mahakuasa.","hasanah_per_verse":810},{"text_madani":"وَيَوْمَ تَقُومُ السَّاعَةُ يُقْسِمُ الْمُجْرِمُونَ مَا لَبِثُوا غَيْرَ سَاعَةٍ ۚ كَذَٰلِكَ كَانُوا يُؤْفَكُونَ","text_tajweed":"وَيَوْمَ تَقُومُ [h:10435[ٱ][l[ل]سَّاعَةُ يُ[q:10532[قْ]سِمُ [h:10533[ٱ]لْمُ[q:5255[جْ]رِمُونَ مَا لَبِثُو[s[اْ] غَيْرَ سَاعَ[f:10534[ةٍ‌ۚ ك]َذ[n[َٲ]لِكَ كَانُو[s[اْ] يُؤْفَك[p[ُو]نَ","translation_en":"And at the time when the hour shall come, the guilty shall swear (that) they did not tarry but an hour; thus are they ever turned away.","translation_id":"Dan pada hari (ketika) terjadinya Kiamat, orang-orang yang berdosa bersumpah, bahwa mereka berdiam (dalam kubur) hanya sesaat (saja). Begitulah dahulu mereka dipalingkan (dari kebenaran).","hasanah_per_verse":550},{"text_madani":"وَقَالَ الَّذِينَ أُوتُوا الْعِلْمَ وَالْإِيمَانَ لَقَدْ لَبِثْتُمْ فِي كِتَابِ اللَّهِ إِلَىٰ يَوْمِ الْبَعْثِ ۖ فَهَٰذَا يَوْمُ الْبَعْثِ وَلَٰكِنَّكُمْ كُنتُمْ لَا تَعْلَمُونَ","text_tajweed":"وَقَالَ [h:614[ٱ]لَّذِينَ أُوتُو[s[اْ] [h:7379[ٱ]لْعِلْمَ وَ[h:10535[ٱ]لْإِيمَ[n[ـٰ]نَ لَقَ[q:2389[دْ] لَبِثْتُمْ فِى كِتَ[n[ـٰ]بِ [h:1816[ٱ]للَّهِ إِلَىٰ يَوْمِ [h:10536[ٱ]لْبَعْثِ‌ۖ فَهَ[n[ـٰ]ذَا يَوْمُ [h:10537[ٱ]لْبَعْثِ وَلَ[n[ـٰ]كِ[g[نّ]َكُمْ كُ[f:100[نت]ُمْ لَا تَعْلَم[p[ُو]نَ","translation_en":"And those who are given knowledge and faith will say: Certainly you tarried according to the ordinance of Allah till the day of resurrection, so this is the day of resurrection, but you did not know.","translation_id":"Dan orang-orang yang diberi ilmu dan keimanan berkata (kepada orang-orang kafir), “Sungguh, kamu telah berdiam (dalam kubur) menurut ketetapan Allah, sampai hari kebangkitan. Maka inilah hari kebangkitan itu, tetapi (dahulu) kamu tidak meyakini(nya).”","hasanah_per_verse":860},{"text_madani":"فَيَوْمَئِذٍ لَّا يَنفَعُ الَّذِينَ ظَلَمُوا مَعْذِرَتُهُمْ وَلَا هُمْ يُسْتَعْتَبُونَ","text_tajweed":"فَيَوْمَئِ[u:10538[ذٍ ل]َّا يَ[f:838[نف]َعُ [h:10539[ٱ]لَّذِينَ ظَلَمُو[s[اْ] مَعْذِرَتُهُمْ وَلَا هُمْ يُسْتَعْتَب[p[ُو]نَ","translation_en":"But on that day their excuse shall not profit those who were unjust, nor shall they be regarded with goodwill.","translation_id":"Maka pada hari itu tidak bermanfaat (lagi) permintaan maaf orang-orang yang zhalim, dan mereka tidak pula diberi kesempatan bertobat lagi.","hasanah_per_verse":420},{"text_madani":"وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِي هَٰذَا الْقُرْآنِ مِن كُلِّ مَثَلٍ ۚ وَلَئِن جِئْتَهُم بِآيَةٍ لَّيَقُولَنَّ الَّذِينَ كَفَرُوا إِنْ أَنتُمْ إِلَّا مُبْطِلُونَ","text_tajweed":"وَلَقَ[q:341[دْ] ضَرَ[q:9642[بْ]نَا لِل[g[نّ]َاسِ فِى هَ[n[ـٰ]ذَا [h:7765[ٱ]لْقُرْءَانِ مِ[f:843[ن ك]ُلِّ مَثَ[a:10540[لٍ‌ۚ و]َلَئِ[f:10541[ن ج]ِئْتَه[c:10542[ُم ب]ِـَٔـايَ[u:10543[ةٍ ل]َّيَقُولَ[g[نّ]َ [h:6248[ٱ]لَّذِينَ كَفَر[o[ُوٓ][s[اْ] إِنْ أَ[f:428[نت]ُمْ إِلَّا مُ[q:10544[بْ]طِل[p[ُو]نَ","translation_en":"And certainly We have set forth for men every kind of example in this Quran; and if you should bring them a communication, those who disbelieve would certainly say: You are naught but false claimants.","translation_id":"Dan sesungguhnya telah Kami jelaskan kepada manusia segala macam perumpamaan dalam Al-Qur'an ini. Dan jika engkau membawa suatu ayat kepada mereka, pastilah orang-orang kafir itu akan berkata, ”Kamu hanyalah orang-orang yang membuat kepalsuan belaka.”","hasanah_per_verse":760},{"text_madani":"كَذَٰلِكَ يَطْبَعُ اللَّهُ عَلَىٰ قُلُوبِ الَّذِينَ لَا يَعْلَمُونَ","text_tajweed":"كَذ[n[َٲ]لِكَ يَ[q:4901[طْ]بَعُ [h:4902[ٱ]للَّهُ عَلَىٰ قُلُوبِ [h:2312[ٱ]لَّذِينَ لَا يَعْلَم[p[ُو]نَ","translation_en":"Thus does Allah set a seal on the hearts of those who do not know.","translation_id":"Demikianlah Allah mengunci hati orang-orang yang tidak (mau) memahami.","hasanah_per_verse":320},{"text_madani":"فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۖ وَلَا يَسْتَخِفَّنَّكَ الَّذِينَ لَا يُوقِنُونَ","text_tajweed":"فَ[h:9999[ٱ]صْبِرْ إِ[g[نّ]َ وَعْدَ [h:3149[ٱ]للَّهِ حَ[a:10545[قٌّ‌ۖ و]َلَا يَسْتَخِفَّ[g[نّ]َكَ [h:10546[ٱ]لَّذِينَ لَا يُوقِن[p[ُو]نَ","translation_en":"Therefore be patient; surely the promise of Allah is true and let not those who have no certainty hold you in light estimation.","translation_id":"Maka bersabarlah engkau (Muhammad), sungguh, janji Allah itu benar dan sekali-kali jangan sampai orang-orang yang tidak meyakini (kebenaran ayat-ayat Allah) itu menggelisahkan engkau.","hasanah_per_verse":390}]}
