{"chapter_number":21,"name_simple":"Al-Anbya","name_meaning":{"text":"The Prophets","en":"The Prophets","id":"Para Nabi"},"verses_count":112,"hasanah":50940,"verses":[{"text_madani":"اقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِي غَفْلَةٍ مُّعْرِضُونَ","text_tajweed":"ٱ[q:5169[قْ]تَرَبَ لِل[g[نّ]َاسِ حِسَابُهُمْ وَهُمْ فِى غَفْلَ[a:8666[ةٍ م]ُّعْرِض[p[ُو]نَ","translation_en":"Their reckoning has drawn near to men, and in heedlessness are they turning aside.","translation_id":"Telah semakin dekat kepada manusia perhitungan amal mereka, sedang mereka dalam keadaan lalai (dengan dunia), berpaling (dari akhirat).","hasanah_per_verse":310},{"text_madani":"مَا يَأْتِيهِم مِّن ذِكْرٍ مِّن رَّبِّهِم مُّحْدَثٍ إِلَّا اسْتَمَعُوهُ وَهُمْ يَلْعَبُونَ","text_tajweed":"مَا يَأْتِيه[w:7205[ِم م]ِّ[f:8667[ن ذ]ِكْ[a:8668[رٍ م]ّ[u:22[ِن ر]َّبِّه[w:8669[ِم م]ُّحْدَثٍ إِلَّا [h:8670[ٱ]سْتَمَعُوهُ وَهُمْ يَلْعَب[p[ُو]نَ","translation_en":"There comes not to them a new reminder from their Lord but they hear it while they sport,","translation_id":"Setiap diturunkan kepada mereka ayat-ayat yang baru dari Tuhan, mereka mendengarkannya sambil bermain-main.","hasanah_per_verse":420},{"text_madani":"لَاهِيَةً قُلُوبُهُمْ ۗ وَأَسَرُّوا النَّجْوَى الَّذِينَ ظَلَمُوا هَلْ هَٰذَا إِلَّا بَشَرٌ مِّثْلُكُمْ ۖ أَفَتَأْتُونَ السِّحْرَ وَأَنتُمْ تُبْصِرُونَ","text_tajweed":"لَاهِيَ[f:8671[ةً ق]ُلُوبُهُمْ‌ۗ وَأَسَرُّو[s[اْ] [h:8518[ٱ][l[ل][g[نّ]َ[q:8519[جْ]وَى [h:8672[ٱ]لَّذِينَ ظَلَمُو[s[اْ] هَلْ هَ[n[ـٰ]ذ[o[َآ] إِلَّا بَشَ[a:7069[رٌ م]ِّثْلُكُمْ‌ۖ أَفَتَأْتُونَ [h:8673[ٱ][l[ل]سِّحْرَ وَأَ[f:98[نت]ُمْ تُ[q:8674[بْ]صِر[p[ُو]نَ","translation_en":"Their hearts trifling; and those who are unjust counsel together in secret: He is nothing but a mortal like yourselves; what! will you then yield to enchantment while you see?","translation_id":"Hati mereka dalam keadaan lalai. Dan orang-orang yang zhalim itu merahasiakan pembicaraan mereka, “(Orang) ini (Muhammad) tidak lain hanyalah seorang manusia (juga) seperti kamu. Apakah kamu menerima sihir itu padahal kamu menyaksikannya?”","hasanah_per_verse":720},{"text_madani":"قَالَ رَبِّي يَعْلَمُ الْقَوْلَ فِي السَّمَاءِ وَالْأَرْضِ ۖ وَهُوَ السَّمِيعُ الْعَلِيمُ","text_tajweed":"قَالَ رَبِّى يَعْلَمُ [h:8675[ٱ]لْقَوْلَ فِى [h:746[ٱ][l[ل]سَّم[o[َا]ٓءِ وَ[h:177[ٱ]لْأَرْضِ‌ۖ وَهُوَ [h:709[ٱ][l[ل]سَّمِيعُ [h:669[ٱ]لْعَل[p[ِي]مُ","translation_en":"He said: My Lord knows what is spoken in the heaven and the earth, and He is the Hearing, the Knowing.","translation_id":"Dia (Muhammad) berkata, “Tuhanku mengetahui (semua) perkataan di langit dan di bumi, dan Dia Maha Mendengar, Maha Mengetahui!”","hasanah_per_verse":440},{"text_madani":"بَلْ قَالُوا أَضْغَاثُ أَحْلَامٍ بَلِ افْتَرَاهُ بَلْ هُوَ شَاعِرٌ فَلْيَأْتِنَا بِآيَةٍ كَمَا أُرْسِلَ الْأَوَّلُونَ","text_tajweed":"بَلْ قَال[o[ُوٓ][s[اْ] أَضْغَ[n[ـٰ]ثُ أَحْلَ[n[ـٰ][i:8676[مِۭ ب]َلِ [h:8677[ٱ]فْتَرَ[n[ٮٰ]هُ بَلْ هُوَ شَاعِ[f:8678[رٌ ف]َلْيَأْتِنَا بِـَٔـايَ[f:8679[ةٍ ك]َم[o[َآ] أُرْسِلَ [h:8680[ٱ]لْأَوَّل[p[ُو]نَ","translation_en":"Nay! say they: Medleys of dreams; nay! he has forged it; nay! he is a poet; so let him bring to us a sign as the former (prophets) were sent (with).","translation_id":"Bahkan mereka mengatakan, “(Al-Qur'an itu buah) mimpi-mimpi yang kacau, atau hasil rekayasanya (Muhammad), atau bahkan dia hanya seorang penyair, cobalah dia datangkan kepada kita suatu tanda (bukti), seperti halnya rasul-rasul yang diutus terdahulu.”","hasanah_per_verse":580},{"text_madani":"مَا آمَنَتْ قَبْلَهُم مِّن قَرْيَةٍ أَهْلَكْنَاهَا ۖ أَفَهُمْ يُؤْمِنُونَ","text_tajweed":"م[o[َآ] ءَامَنَتْ قَ[q:8394[بْ]لَه[w:8395[ُم م]ِّ[f:4585[ن ق]َرْيَةٍ أَهْلَكْنَ[n[ـٰ]ه[o[َآ‌ۖ] أَفَهُمْ يُؤْمِن[p[ُو]نَ","translation_en":"There did not believe before them any town which We destroyed, will they then believe?","translation_id":"Penduduk suatu negeri sebelum mereka, yang telah Kami binasakan, mereka itu tidak beriman (padahal telah Kami kirimkan bukti). Apakah mereka akan beriman?","hasanah_per_verse":350},{"text_madani":"وَمَا أَرْسَلْنَا قَبْلَكَ إِلَّا رِجَالًا نُّوحِي إِلَيْهِمْ ۖ فَاسْأَلُوا أَهْلَ الذِّكْرِ إِن كُنتُمْ لَا تَعْلَمُونَ","text_tajweed":"وَم[o[َآ] أَرْسَلْنَا قَ[q:7849[بْ]لَكَ إِلَّا رِجَال[a:6851[اً ن]ُّوح[o[ِىٓ] إِلَيْهِمْ‌ۖ فَسْــَٔل[o[ُوٓ][s[اْ] أَهْلَ [h:7413[ٱ][l[ل]ذِّكْرِ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ لَا تَعْلَم[p[ُو]نَ","translation_en":"And We did not send before you any but men to whom We sent revelation, so ask the followers of the reminder if you do not","translation_id":"Dan Kami tidak mengutus (rasul-rasul) sebelum engkau (Muhammad), melainkan beberapa orang laki-laki yang Kami beri wahyu kepada mereka, maka tanyakanlah kepada orang yang berilmu, jika kamu tidak mengetahui.","hasanah_per_verse":590},{"text_madani":"وَمَا جَعَلْنَاهُمْ جَسَدًا لَّا يَأْكُلُونَ الطَّعَامَ وَمَا كَانُوا خَالِدِينَ","text_tajweed":"وَمَا جَعَلْنَ[n[ـٰ]هُمْ جَسَ[u:8681[دًا ل]َّا يَأْكُلُونَ [h:8682[ٱ][l[ل]طَّعَامَ وَمَا كَانُو[s[اْ] خَ[n[ـٰ]لِد[p[ِي]نَ","translation_en":"And We did not make them bodies not eating the food, and they were not to abide (forever).","translation_id":"Dan Kami tidak menjadikan mereka (rasul-rasul) suatu tubuh yang tidak memakan makanan dan mereka tidak (pula) hidup kekal.","hasanah_per_verse":420},{"text_madani":"ثُمَّ صَدَقْنَاهُمُ الْوَعْدَ فَأَنجَيْنَاهُمْ وَمَن نَّشَاءُ وَأَهْلَكْنَا الْمُسْرِفِينَ","text_tajweed":"ثُ[g[مّ]َ صَدَ[q:8683[قْ]نَ[n[ـٰ]هُمُ [h:8684[ٱ]لْوَعْدَ فَأَ[f:8685[نج]َيْنَ[n[ـٰ]هُمْ وَم[a:8686[َن ن]َّش[o[َا]ٓءُ وَأَهْلَكْنَا [h:8687[ٱ]لْمُسْرِف[p[ِي]نَ","translation_en":"Then We made Our promise good to them, so We delivered them and those whom We pleased, and We destroyed the extravagant.","translation_id":"Kemudian Kami tepati janji (yang telah Kami janjikan) kepada mereka. Maka Kami selamatkan mereka dan orang-orang yang Kami kehendaki, dan Kami binasakan orang-orang yang melampaui batas.","hasanah_per_verse":450},{"text_madani":"لَقَدْ أَنزَلْنَا إِلَيْكُمْ كِتَابًا فِيهِ ذِكْرُكُمْ ۖ أَفَلَا تَعْقِلُونَ","text_tajweed":"لَقَ[q:2389[دْ] أَ[f:515[نز]َلْن[o[َآ] إِلَيْكُمْ كِتَ[n[ـٰ][f:8688[بًا ف]ِيهِ ذِكْرُكُمْ‌ۖ أَفَلَا تَعْقِل[p[ُو]نَ","translation_en":"Certainly We have revealed to you a Book in which is your good remembrance; what! do you not then understand?","translation_id":"Sungguh, telah Kami turunkan kepadamu sebuah Kitab (Al-Qur'an) yang di dalamnya terdapat peringatan bagimu. Maka apakah kamu tidak mengerti?","hasanah_per_verse":370},{"text_madani":"وَكَمْ قَصَمْنَا مِن قَرْيَةٍ كَانَتْ ظَالِمَةً وَأَنشَأْنَا بَعْدَهَا قَوْمًا آخَرِينَ","text_tajweed":"وَكَمْ قَصَمْنَا مِ[f:4585[ن ق]َرْيَ[f:8689[ةٍ ك]َانَتْ ظَالِمَ[a:8690[ةً و]َأَ[f:3937[نش]َأْنَا بَعْدَهَا قَوْمًا ءَاخَر[p[ِي]نَ","translation_en":"And how many a town which was iniquitous did We demolish, and We raised up after it another people!","translation_id":"Dan berapa banyak (penduduk) negeri yang zhalim yang telah Kami binasakan, dan Kami jadikan generasi yang lain setelah mereka itu (sebagai penggantinya).","hasanah_per_verse":440},{"text_madani":"فَلَمَّا أَحَسُّوا بَأْسَنَا إِذَا هُم مِّنْهَا يَرْكُضُونَ","text_tajweed":"فَلَ[g[مّ][o[َآ] أَحَسُّو[s[اْ] بَأْسَن[o[َآ] إِذَا ه[w:7261[ُم م]ِّنْهَا يَرْكُض[p[ُو]نَ","translation_en":"So when they felt Our punishment, lo! they began to fly","translation_id":"Maka ketika mereka merasakan azab Kami, tiba-tiba mereka melarikan diri dari (negerinya) itu.","hasanah_per_verse":290},{"text_madani":"لَا تَرْكُضُوا وَارْجِعُوا إِلَىٰ مَا أُتْرِفْتُمْ فِيهِ وَمَسَاكِنِكُمْ لَعَلَّكُمْ تُسْأَلُونَ","text_tajweed":"لَا تَرْكُضُو[s[اْ] وَ[h:8691[ٱ]رْجِع[o[ُوٓ][s[اْ] إِلَىٰ م[o[َآ] أُتْرِفْتُمْ فِيهِ وَمَسَ[n[ـٰ]كِنِكُمْ لَعَلَّكُمْ تُسْــَٔل[p[ُو]نَ","translation_en":"Do not fly (now) and come back to what you were made to lead easy lives in and to your dwellings, haply you will be questioned.","translation_id":"Janganlah kamu lari tergesa-gesa; kembalilah kamu kepada kesenangan hidupmu dan tempat-tempat kediamanmu (yang baik), agar kamu dapat ditanya.","hasanah_per_verse":480},{"text_madani":"قَالُوا يَا وَيْلَنَا إِنَّا كُنَّا ظَالِمِينَ","text_tajweed":"قَالُو[s[اْ] يَ[n[ـٰ]وَيْلَن[o[َآ] إِ[g[نّ]َا كُ[g[نّ]َا ظَ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"They said: O woe to us! surely we were unjust.","translation_id":"Mereka berkata, “Betapa celaka kami, sungguh, kami orang-orang yang zhalim.”","hasanah_per_verse":240},{"text_madani":"فَمَا زَالَت تِّلْكَ دَعْوَاهُمْ حَتَّىٰ جَعَلْنَاهُمْ حَصِيدًا خَامِدِينَ","text_tajweed":"فَمَا زَالَت تِّلْكَ دَعْوَ[n[ٮٰ]هُمْ حَتَّىٰ جَعَلْنَ[n[ـٰ]هُمْ حَصِيدًا خَ[n[ـٰ]مِد[p[ِي]نَ","translation_en":"And this ceased not to be their cry till We made them cut off, extinct.","translation_id":"Maka demikianlah keluhan mereka berkepanjangan, sehingga mereka Kami jadikan sebagai tanaman yang telah dituai, yang tidak dapat hidup lagi.","hasanah_per_verse":370},{"text_madani":"وَمَا خَلَقْنَا السَّمَاءَ وَالْأَرْضَ وَمَا بَيْنَهُمَا لَاعِبِينَ","text_tajweed":"وَمَا خَلَ[q:5159[قْ]نَا [h:8692[ٱ][l[ل]سَّم[o[َا]ٓءَ وَ[h:1474[ٱ]لْأَرْضَ وَمَا بَيْنَهُمَا لَ[n[ـٰ]عِب[p[ِي]نَ","translation_en":"And We did not create the heaven and the earth and what is between them for sport.","translation_id":"Dan Kami tidak menciptakan langit dan bumi dan segala apa yang ada di antara keduanya dengan main-main.","hasanah_per_verse":350},{"text_madani":"لَوْ أَرَدْنَا أَن نَّتَّخِذَ لَهْوًا لَّاتَّخَذْنَاهُ مِن لَّدُنَّا إِن كُنَّا فَاعِلِينَ","text_tajweed":"لَوْ أَرَ[q:2878[دْ]ن[o[َآ] أ[a:8693[َن ن]َّتَّخِذَ لَهْ[u:8694[وًا ل]َّ[h:8695[ٱ]تَّخَذْنَ[n[ـٰ]هُ م[u:2897[ِن ل]َّدُ[g[نّ][o[َآ] إِ[f:4919[ن ك]ُ[g[نّ]َا فَ[n[ـٰ]عِل[p[ِي]نَ","translation_en":"Had We wished to make a diversion, We would have made it from before Ourselves: by no means would We do (it).","translation_id":"Seandainya Kami hendak membuat suatu permainan (istri dan anak), tentulah Kami membuatnya dari sisi Kami, jika Kami benar-benar menghendaki berbuat demikian.","hasanah_per_verse":420},{"text_madani":"بَلْ نَقْذِفُ بِالْحَقِّ عَلَى الْبَاطِلِ فَيَدْمَغُهُ فَإِذَا هُوَ زَاهِقٌ ۚ وَلَكُمُ الْوَيْلُ مِمَّا تَصِفُونَ","text_tajweed":"بَلْ نَ[q:8696[قْ]ذِفُ بِ[h:370[ٱ]لْحَقِّ عَلَى [h:8697[ٱ]لْبَ[n[ـٰ]طِلِ فَيَ[q:8698[دْ]مَغُهُ[n[ۥ] فَإِذَا هُوَ زَاهِ[a:8699[قٌ‌ۚ و]َلَكُمُ [h:8700[ٱ]لْوَيْلُ مِ[g[مّ]َا تَصِف[p[ُو]نَ","translation_en":"Nay! We cast the truth against the falsehood, so that it breaks its head, and lo! it vanishes; and woe to you for what you describe;","translation_id":"Sebenarnya Kami melemparkan yang hak (kebenaran) kepada yang batil (tidak benar) lalu yang hak itu menghancurkannya, maka seketika itu (yang batil) lenyap. Dan celaka kamu karena kamu menyifati (Allah dengan sifat-sifat yang tidak pantas bagi-Nya).","hasanah_per_verse":530},{"text_madani":"وَلَهُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ وَمَنْ عِندَهُ لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ وَلَا يَسْتَحْسِرُونَ","text_tajweed":"وَلَهُ[n[ۥ] مَ[f:2074[ن ف]ِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۚ وَمَنْ عِ[f:719[ند]َهُ[n[ۥ] لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِه[n[ِۦ] وَلَا يَسْتَحْسِر[p[ُو]نَ","translation_en":"And whoever is in the heavens and the earth is His; and those who are with Him are not proud to serve Him, nor do they grow weary.","translation_id":"Dan milik-Nya siapa yang di langit dan di bumi. Dan (malaikat-malaikat) yang di sisi-Nya, tidak mempunyai rasa angkuh untuk menyembah-Nya dan tidak (pula) merasa letih.","hasanah_per_verse":570},{"text_madani":"يُسَبِّحُونَ اللَّيْلَ وَالنَّهَارَ لَا يَفْتُرُونَ","text_tajweed":"يُسَبِّحُونَ [h:8701[ٱ]لَّيْلَ وَ[h:6117[ٱ][l[ل][g[نّ]َهَارَ لَا يَفْتُر[p[ُو]نَ","translation_en":"They glorify (Him) by night and day; they are never languid.","translation_id":"Mereka (malaikat-malaikat) bertasbih tidak henti-hentinya malam dan siang.","hasanah_per_verse":260},{"text_madani":"أَمِ اتَّخَذُوا آلِهَةً مِّنَ الْأَرْضِ هُمْ يُنشِرُونَ","text_tajweed":"أَمِ [h:8702[ٱ]تَّخَذ[o[ُوٓ][s[اْ] ءَالِهَ[a:8703[ةً م]ِّنَ [h:1579[ٱ]لْأَرْضِ هُمْ يُ[f:8704[نش]ِر[p[ُو]نَ","translation_en":"Or have they taken gods from the earth who raise (the dead).","translation_id":"Apakah mereka mengambil tuhan-tuhan dari bumi, yang dapat menghidupkan (orang-orang yang mati)?","hasanah_per_verse":270},{"text_madani":"لَوْ كَانَ فِيهِمَا آلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتَا ۚ فَسُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ عَمَّا يَصِفُونَ","text_tajweed":"لَوْ كَانَ فِيهِم[o[َآ] ءَالِهَةٌ إِلَّا [h:1742[ٱ]للَّهُ لَفَسَدَتَا‌ۚ فَسُ[q:8705[بْ]حَ[n[ـٰ]نَ [h:8706[ٱ]للَّهِ رَبِّ [h:8707[ٱ]لْعَرْشِ عَ[g[مّ]َا يَصِف[p[ُو]نَ","translation_en":"If there had been in them any gods except Allah, they would both have certainly been in a state of disorder; therefore glory be to Allah, the Lord of the dominion, above what they attribute (to Him).","translation_id":"Seandainya pada keduanya (di langit dan di bumi) ada tuhan-tuhan selain Allah, tentu keduanya telah binasa. Mahasuci Allah yang memiliki ‘Arsy, dari apa yang mereka sifatkan.","hasanah_per_verse":520},{"text_madani":"لَا يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ","text_tajweed":"لَا يُسْــَٔلُ عَ[g[مّ]َا يَفْعَلُ وَهُمْ يُسْــَٔل[p[ُو]نَ","translation_en":"He cannot be questioned concerning what He does and they shall be questioned.","translation_id":"Dia (Allah) tidak ditanya tentang apa yang dikerjakan, tetapi merekalah yang akan ditanya.","hasanah_per_verse":220},{"text_madani":"أَمِ اتَّخَذُوا مِن دُونِهِ آلِهَةً ۖ قُلْ هَاتُوا بُرْهَانَكُمْ ۖ هَٰذَا ذِكْرُ مَن مَّعِيَ وَذِكْرُ مَن قَبْلِي ۗ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ الْحَقَّ ۖ فَهُم مُّعْرِضُونَ","text_tajweed":"أَمِ [h:8702[ٱ]تَّخَذُو[s[اْ] مِ[f:3136[ن د]ُونِه[o[ِۦٓ] ءَالِهَ[f:8708[ةً‌ۖ ق]ُلْ هَاتُو[s[اْ] بُرْهَ[n[ـٰ]نَكُمْ‌ۖ هَ[n[ـٰ]ذَا ذِكْرُ م[a:8709[َن م]َّعِىَ وَذِكْرُ مَ[f:8710[ن ق]َ[q:2471[بْ]لِى‌ۗ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ [h:8711[ٱ]لْحَقَّ‌ۖ فَه[w:8712[ُم م]ُّعْرِض[p[ُو]نَ","translation_en":"Or, have they taken gods besides Him? Say: Bring your proof; this is the reminder of those with me and the reminder of those before me. Nay! most of them do not know the truth, so they turn aside.","translation_id":"Atau apakah mereka mengambil tuhan-tuhan selain Dia? Katakanlah (Muhammad), “Kemukakanlah alasan-alasanmu! (Al-Qur'an) ini adalah peringatan bagi orang yang bersamaku, dan peringatan bagi orang sebelumku.” Tetapi kebanyakan mereka tidak mengetahui yang hak (kebenaran), karena itu mereka berpaling.","hasanah_per_verse":820},{"text_madani":"وَمَا أَرْسَلْنَا مِن قَبْلِكَ مِن رَّسُولٍ إِلَّا نُوحِي إِلَيْهِ أَنَّهُ لَا إِلَٰهَ إِلَّا أَنَا فَاعْبُدُونِ","text_tajweed":"وَم[o[َآ] أَرْسَلْنَا مِ[f:18[ن ق]َ[q:19[بْ]لِكَ م[u:2882[ِن ر]َّسُولٍ إِلَّا نُوح[o[ِىٓ] إِلَيْهِ أَ[g[نّ]َهُ[n[ۥ] ل[o[َآ] إِلَ[n[ـٰ]هَ إِلّ[o[َآ] أَنَا۟ فَ[h:8713[ٱ]عْبُد[p[ُو]نِ","translation_en":"And We did not send before you any messenger but We revealed to him that there is no god but Me, therefore serve Me.","translation_id":"Dan Kami tidak mengutus seorang rasul pun sebelum engkau (Muhammad), melainkan Kami wahyukan kepadanya, bahwa tidak ada tuhan (yang berhak disembah) selain Aku, maka sembahlah Aku.","hasanah_per_verse":530},{"text_madani":"وَقَالُوا اتَّخَذَ الرَّحْمَٰنُ وَلَدًا ۗ سُبْحَانَهُ ۚ بَلْ عِبَادٌ مُّكْرَمُونَ","text_tajweed":"وَقَالُو[s[اْ] [h:605[ٱ]تَّخَذَ [h:8419[ٱ][l[ل]رَّحْمَ[n[ـٰ]نُ وَلَ[f:607[دًا‌ۗ س]ُ[q:608[بْ]حَ[n[ـٰ]نَهُ[n[ۥ]‌ۚ بَلْ عِبَا[a:8714[دٌ م]ُّكْرَم[p[ُو]نَ","translation_en":"And they say: The Beneficent Allah has taken to Himself a son. Glory be to Him. Nay! they are honored servants","translation_id":"Dan mereka berkata, “Tuhan Yang Maha Pengasih telah menjadikan (malaikat) sebagai anak.” Mahasuci Dia. Sebenarnya mereka (para malaikat itu) adalah hamba-hamba yang dimuliakan,","hasanah_per_verse":380},{"text_madani":"لَا يَسْبِقُونَهُ بِالْقَوْلِ وَهُم بِأَمْرِهِ يَعْمَلُونَ","text_tajweed":"لَا يَسْبِقُونَهُ[n[ۥ] بِ[h:7118[ٱ]لْقَوْلِ وَه[c:8715[ُم ب]ِأَمْرِه[n[ِۦ] يَعْمَل[p[ُو]نَ","translation_en":"They do not precede Him in speech and (only) according to His commandment do they act.","translation_id":"mereka tidak berbicara mendahului-Nya dan mereka mengerjakan perintah-perintah-Nya.","hasanah_per_verse":290},{"text_madani":"يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يَشْفَعُونَ إِلَّا لِمَنِ ارْتَضَىٰ وَهُم مِّنْ خَشْيَتِهِ مُشْفِقُونَ","text_tajweed":"يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يَشْفَعُونَ إِلَّا لِمَنِ [h:8716[ٱ]رْتَضَىٰ وَه[w:8717[ُم م]ِّنْ خَشْيَتِه[n[ِۦ] مُشْفِق[p[ُو]نَ","translation_en":"He knows what is before them and what is behind them, and they do not intercede except for him whom He approves and for fear of Him they tremble.","translation_id":"Dia (Allah) mengetahui segala sesuatu yang di hadapan mereka (malaikat) dan yang di belakang mereka, dan mereka tidak memberi syafaat melainkan kepada orang yang diridhai (Allah), dan mereka selalu berhati-hati karena takut kepada-Nya.","hasanah_per_verse":590},{"text_madani":"وَمَن يَقُلْ مِنْهُمْ إِنِّي إِلَٰهٌ مِّن دُونِهِ فَذَٰلِكَ نَجْزِيهِ جَهَنَّمَ ۚ كَذَٰلِكَ نَجْزِي الظَّالِمِينَ","text_tajweed":"۞ وَم[a:8718[َن ي]َقُلْ مِنْهُمْ إِ[g[نّ][o[ِىٓ] إِلَ[n[ـٰ][a:8719[هٌ م]ِّ[f:3136[ن د]ُونِه[n[ِۦ] فَذ[n[َٲ]لِكَ نَ[q:8720[جْ]زِيهِ جَهَ[g[نّ]َمَ‌ۚ كَذ[n[َٲ]لِكَ نَ[q:4214[جْ]زِى [h:4693[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And whoever of them should say: Surely I am a god besides Him, such a one do We recompense with hell; thus do, We recompense the unjust.","translation_id":"Dan barangsiapa di antara mereka berkata, “Sungguh, aku adalah tuhan selain Allah,” maka orang itu Kami beri balasan dengan Jahanam. Demikianlah Kami memberikan balasan kepada orang-orang yang zhalim.","hasanah_per_verse":510},{"text_madani":"أَوَلَمْ يَرَ الَّذِينَ كَفَرُوا أَنَّ السَّمَاوَاتِ وَالْأَرْضَ كَانَتَا رَتْقًا فَفَتَقْنَاهُمَا ۖ وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ ۖ أَفَلَا يُؤْمِنُونَ","text_tajweed":"أَوَلَمْ يَرَ [h:8721[ٱ]لَّذِينَ كَفَر[o[ُوٓ][s[اْ] أَ[g[نّ]َ [h:8722[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ كَانَتَا رَتْ[f:8723[قًا ف]َفَتَ[q:8724[قْ]نَ[n[ـٰ]هُمَا‌ۖ وَجَعَلْنَا مِنَ [h:4727[ٱ]لْم[o[َا]ٓءِ كُلَّ شَىْءٍ حَىٍّ‌ۖ أَفَلَا يُؤْمِن[p[ُو]نَ","translation_en":"Do not those who disbelieve see that the heavens and the earth were closed up, but We have opened them; and We have made of water everything living, will they not then believe?","translation_id":"Dan apakah orang-orang kafir tidak mengetahui bahwa langit dan bumi keduanya dahulunya menyatu, kemudian Kami pisahkan antara keduanya; dan Kami jadikan segala sesuatu yang hidup berasal dari air; maka mengapa mereka tidak beriman?","hasanah_per_verse":800},{"text_madani":"وَجَعَلْنَا فِي الْأَرْضِ رَوَاسِيَ أَن تَمِيدَ بِهِمْ وَجَعَلْنَا فِيهَا فِجَاجًا سُبُلًا لَّعَلَّهُمْ يَهْتَدُونَ","text_tajweed":"وَجَعَلْنَا فِى [h:44[ٱ]لْأَرْضِ رَو[n[َٲ]سِىَ أَ[f:7354[ن ت]َمِيدَ بِهِمْ وَجَعَلْنَا فِيهَا فِجَا[f:8725[جًا س]ُبُل[u:8726[اً ل]َّعَلَّهُمْ يَهْتَد[p[ُو]نَ","translation_en":"And We have made great mountains in the earth lest it might be convulsed with them, and We have made in it wide ways that they may follow a right direction.","translation_id":"Dan Kami telah menjadikan di bumi ini gunung-gunung yang kokoh agar ia (tidak) guncang bersama mereka, dan Kami jadikan (pula) di sana jalan-jalan yang luas, agar mereka mendapat petunjuk.","hasanah_per_verse":570},{"text_madani":"وَجَعَلْنَا السَّمَاءَ سَقْفًا مَّحْفُوظًا ۖ وَهُمْ عَنْ آيَاتِهَا مُعْرِضُونَ","text_tajweed":"وَجَعَلْنَا [h:8727[ٱ][l[ل]سَّم[o[َا]ٓءَ سَ[q:8728[قْ][a:8729[فًا م]َّحْفُو[a:8730[ظًا‌ۖ و]َهُمْ عَنْ ءَايَ[n[ـٰ]تِهَا مُعْرِض[p[ُو]نَ","translation_en":"And We have made the heaven a guarded canopy and (yet) they turn aside from its signs.","translation_id":"Dan Kami menjadikan langit sebagai atap yang terpelihara, namun mereka tetap berpaling dari tanda-tanda (kebesaran Allah) itu (matahari, bulan, angin, awan, dan lain-lain).","hasanah_per_verse":390},{"text_madani":"وَهُوَ الَّذِي خَلَقَ اللَّيْلَ وَالنَّهَارَ وَالشَّمْسَ وَالْقَمَرَ ۖ كُلٌّ فِي فَلَكٍ يَسْبَحُونَ","text_tajweed":"وَهُوَ [h:4114[ٱ]لَّذِى خَلَقَ [h:8731[ٱ]لَّيْلَ وَ[h:6117[ٱ][l[ل][g[نّ]َهَارَ وَ[h:4264[ٱ][l[ل]شَّمْسَ وَ[h:4265[ٱ]لْقَمَرَ‌ۖ كُ[f:6240[لٌّ ف]ِى فَلَ[a:8732[كٍ ي]َسْبَح[p[ُو]نَ","translation_en":"And He it is Who created the night and the day and the sun and the moon; all (orbs) travel along swiftly in their celestial spheres.","translation_id":"Dan Dialah yang telah menciptakan malam dan siang, matahari dan bulan. Masing-masing beredar pada garis edarnya.","hasanah_per_verse":470},{"text_madani":"وَمَا جَعَلْنَا لِبَشَرٍ مِّن قَبْلِكَ الْخُلْدَ ۖ أَفَإِن مِّتَّ فَهُمُ الْخَالِدُونَ","text_tajweed":"وَمَا جَعَلْنَا لِبَشَ[a:8733[رٍ م]ِّ[f:18[ن ق]َ[q:19[بْ]لِكَ [h:8734[ٱ]لْخُلْدَ‌ۖ أَفَإِ[s[يْ][a[ن م]ِّتَّ فَهُمُ [h:8735[ٱ]لْخَ[n[ـٰ]لِد[p[ُو]نَ","translation_en":"And We did not ordain abiding for any mortal before you. What! Then if you die, will they abide?","translation_id":"Dan Kami tidak menjadikan hidup abadi bagi seorang manusia sebelum engkau (Muhammad); maka jika engkau wafat, apakah mereka akan kekal?","hasanah_per_verse":400},{"text_madani":"كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ ۗ وَنَبْلُوكُم بِالشَّرِّ وَالْخَيْرِ فِتْنَةً ۖ وَإِلَيْنَا تُرْجَعُونَ","text_tajweed":"كُلُّ نَفْ[f:2476[سٍ ذ][o[َا]ٓئِقَةُ [h:2477[ٱ]لْمَوْتِ‌ۗ وَنَ[q:8736[بْ]لُوك[c:8737[ُم ب]ِ[h:7687[ٱ][l[ل]شَّرِّ وَ[h:8738[ٱ]لْخَيْرِ فِتْنَ[a:8739[ةً‌ۖ و]َإِلَيْنَا تُرْجَع[p[ُو]نَ","translation_en":"Every soul must taste of death and We try you by evil and good by way of probation; and to Us you shall be brought back.","translation_id":"Setiap yang bernyawa akan merasakan mati. Kami akan menguji kamu dengan keburukan dan kebaikan sebagai cobaan. Dan kamu akan dikembalikan hanya kepada Kami.","hasanah_per_verse":490},{"text_madani":"وَإِذَا رَآكَ الَّذِينَ كَفَرُوا إِن يَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَٰذَا الَّذِي يَذْكُرُ آلِهَتَكُمْ وَهُم بِذِكْرِ الرَّحْمَٰنِ هُمْ كَافِرُونَ","text_tajweed":"وَإِذَا رَءَاكَ [h:8740[ٱ]لَّذِينَ كَفَر[o[ُوٓ][s[اْ] إ[a:8741[ِن ي]َتَّخِذُونَكَ إِلَّا هُزُوًا أَهَ[n[ـٰ]ذَا [h:8742[ٱ]لَّذِى يَذْكُرُ ءَالِهَتَكُمْ وَه[c:8743[ُم ب]ِذِكْرِ [h:8744[ٱ][l[ل]رَّحْمَ[n[ـٰ]نِ هُمْ كَ[n[ـٰ]فِر[p[ُو]نَ","translation_en":"And when those who disbelieve see you, they do not take you but for one to be scoffed at: Is this he who speaks of your gods? And they are deniers at the mention of the Beneficent Allah.","translation_id":"Dan apabila orang-orang kafir itu melihat engkau (Muhammad), mereka hanya memperlakukan engkau menjadi bahan ejekan. (Mereka mengatakan), “Apakah ini orang yang mencela tuhan-tuhanmu?” Padahal mereka orang yang ingkar mengingat Allah Yang Maha Pengasih.","hasanah_per_verse":720},{"text_madani":"خُلِقَ الْإِنسَانُ مِنْ عَجَلٍ ۚ سَأُرِيكُمْ آيَاتِي فَلَا تَسْتَعْجِلُونِ","text_tajweed":"خُلِقَ [h:8745[ٱ]لْإِ[f:2732[نس]َ[n[ـٰ]نُ مِنْ عَجَ[f:8746[لٍ‌ۚ س]َأُ[s[وْ]رِيكُمْ ءَايَ[n[ـٰ]تِى فَلَا تَسْتَعْجِل[p[ُو]نِ","translation_en":"Man is created of haste; now will I show to you My signs, therefore do not ask Me to hasten (them) on.","translation_id":"Manusia diciptakan (bersifat) tergesa-gesa. Kelak akan Aku perlihatkan kepadamu tanda-tanda (kekuasaan)-Ku. Maka janganlah kamu meminta Aku menyegerakannya.","hasanah_per_verse":370},{"text_madani":"وَيَقُولُونَ مَتَىٰ هَٰذَا الْوَعْدُ إِن كُنتُمْ صَادِقِينَ","text_tajweed":"وَيَقُولُونَ مَتَىٰ هَ[n[ـٰ]ذَا [h:6081[ٱ]لْوَعْدُ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ صَ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"And they say: When will this threat come to pass if you are truthful?","translation_id":"Dan mereka berkata, “Kapankah janji itu (akan datang), jika kamu orang yang benar?”","hasanah_per_verse":300},{"text_madani":"لَوْ يَعْلَمُ الَّذِينَ كَفَرُوا حِينَ لَا يَكُفُّونَ عَن وُجُوهِهِمُ النَّارَ وَلَا عَن ظُهُورِهِمْ وَلَا هُمْ يُنصَرُونَ","text_tajweed":"لَوْ يَعْلَمُ [h:8747[ٱ]لَّذِينَ كَفَرُو[s[اْ] حِينَ لَا يَكُفُّونَ ع[a:8748[َن و]ُجُوهِهِمُ [h:8749[ٱ][l[ل][g[نّ]َارَ وَلَا عَ[f:8750[ن ظ]ُهُورِهِمْ وَلَا هُمْ يُ[f:237[نص]َر[p[ُو]نَ","translation_en":"Had those who disbelieve but known (of the time) when they shall not be able to ward off the fire from their faces nor from their backs, nor shall they be helped.","translation_id":"Seandainya orang kafir itu mengetahui, ketika mereka itu tidak mampu mengelakkan api neraka dari wajah dan punggung mereka, sedang mereka tidak mendapat pertolongan (tentulah mereka tidak meminta disegerakan).","hasanah_per_verse":610},{"text_madani":"بَلْ تَأْتِيهِم بَغْتَةً فَتَبْهَتُهُمْ فَلَا يَسْتَطِيعُونَ رَدَّهَا وَلَا هُمْ يُنظَرُونَ","text_tajweed":"بَلْ تَأْتِيه[c:8751[ِم ب]َغْتَ[f:8752[ةً ف]َتَ[q:8753[بْ]هَتُهُمْ فَلَا يَسْتَطِيعُونَ رَدَّهَا وَلَا هُمْ يُ[f:826[نظ]َر[p[ُو]نَ","translation_en":"Nay, it shall come on them all of a sudden and cause them to become confounded, so they shall not have the power to avert it, nor shall they be respited.","translation_id":"Sebenarnya (hari Kiamat) itu akan datang kepada mereka secara tiba-tiba, lalu mereka menjadi panik; maka mereka tidak sanggup menolaknya dan tidak (pula) diberi penangguhan (waktu).","hasanah_per_verse":450},{"text_madani":"وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِّن قَبْلِكَ فَحَاقَ بِالَّذِينَ سَخِرُوا مِنْهُم مَّا كَانُوا بِهِ يَسْتَهْزِئُونَ","text_tajweed":"وَلَقَدِ [h:3947[ٱ]سْتُهْزِئَ بِرُسُ[a:3948[لٍ م]ِّ[f:18[ن ق]َ[q:19[بْ]لِكَ فَحَاقَ بِ[h:2413[ٱ]لَّذِينَ سَخِرُو[s[اْ] مِنْه[w:3670[ُم م]َّا كَانُو[s[اْ] بِه[n[ِۦ] يَسْتَهْزِء[p[ُو]نَ","translation_en":"And certainly messengers before you were scoffed at, then there befell those of them who scoffed that at which they had scoffed.","translation_id":"Dan sungguh, rasul-rasul sebelum engkau (Muhammad) pun telah diperolok-olokkan, maka turunlah (siksaan) kepada orang-orang yang mencemoohkan apa (rasul-rasul) yang selalu mereka perolok-olokkan.","hasanah_per_verse":560},{"text_madani":"قُلْ مَن يَكْلَؤُكُم بِاللَّيْلِ وَالنَّهَارِ مِنَ الرَّحْمَٰنِ ۗ بَلْ هُمْ عَن ذِكْرِ رَبِّهِم مُّعْرِضُونَ","text_tajweed":"قُلْ م[a:8754[َن ي]َكْلَؤُك[c:8755[ُم ب]ِ[h:1622[ٱ]لَّيْلِ وَ[h:834[ٱ][l[ل][g[نّ]َهَارِ مِنَ [h:8351[ٱ][l[ل]رَّحْمَ[n[ـٰ]نِ‌ۗ بَلْ هُمْ عَ[f:3773[ن ذ]ِكْرِ رَبِّه[w:8756[ِم م]ُّعْرِض[p[ُو]نَ","translation_en":"Say: Who guards you by night and by day from the Beneficent Allah? Nay, they turn aside at the mention of their Lord.","translation_id":"Katakanlah, “Siapakah yang akan menjaga kamu pada waktu malam dan siang dari (siksaan) Allah Yang Maha Pengasih?” Tetapi mereka enggan mengingat Tuhan mereka.","hasanah_per_verse":500},{"text_madani":"أَمْ لَهُمْ آلِهَةٌ تَمْنَعُهُم مِّن دُونِنَا ۚ لَا يَسْتَطِيعُونَ نَصْرَ أَنفُسِهِمْ وَلَا هُم مِّنَّا يُصْحَبُونَ","text_tajweed":"أَمْ لَهُمْ ءَالِهَ[f:8757[ةٌ ت]َمْنَعُه[w:8758[ُم م]ِّ[f:8759[ن د]ُونِنَا‌ۚ لَا يَسْتَطِيعُونَ نَصْرَ أَ[f:568[نف]ُسِهِمْ وَلَا ه[w:8760[ُم م]ِّ[g[نّ]َا يُصْحَب[p[ُو]نَ","translation_en":"Or, have they gods who can defend them against Us? They shall not be able to assist themselves, nor shall they be defended from Us.","translation_id":"Ataukah mereka mempunyai tuhan-tuhan yang dapat memelihara mereka dari (azab) Kami? Tuhan-tuhan mereka itu tidak sanggup menolong diri mereka sendiri dan tidak (pula) mereka dilindungi dari (azab) Kami.","hasanah_per_verse":550},{"text_madani":"بَلْ مَتَّعْنَا هَٰؤُلَاءِ وَآبَاءَهُمْ حَتَّىٰ طَالَ عَلَيْهِمُ الْعُمُرُ ۗ أَفَلَا يَرَوْنَ أَنَّا نَأْتِي الْأَرْضَ نَنقُصُهَا مِنْ أَطْرَافِهَا ۚ أَفَهُمُ الْغَالِبُونَ","text_tajweed":"بَلْ مَتَّعْنَا هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ وَءَاب[o[َا]ٓءَهُمْ حَتَّىٰ طَالَ عَلَيْهِمُ [h:8761[ٱ]لْعُمُرُ‌ۗ أَفَلَا يَرَوْنَ أَ[g[نّ]َا نَأْتِى [h:7024[ٱ]لْأَرْضَ نَ[f:7025[نق]ُصُهَا مِنْ أَ[q:7026[طْ]رَافِه[o[َآ‌ۚ] أَفَهُمُ [h:8762[ٱ]لْغَ[n[ـٰ]لِب[p[ُو]نَ","translation_en":"Nay, We gave provision to these and their fathers until life was prolonged to them. Do they not then see that We are visiting the land, curtailing it of its sides? Shall they then prevail?","translation_id":"Sebenarnya Kami telah memberi mereka dan nenek moyang mereka kenikmatan (hidup di dunia) hingga panjang usia mereka. Maka apakah mereka tidak melihat bahwa Kami mendatangi negeri (yang berada di bawah kekuasaan orang kafir), lalu Kami kurangi luasnya dari ujung-ujung negeri. Apakah mereka yang menang?","hasanah_per_verse":820},{"text_madani":"قُلْ إِنَّمَا أُنذِرُكُم بِالْوَحْيِ ۚ وَلَا يَسْمَعُ الصُّمُّ الدُّعَاءَ إِذَا مَا يُنذَرُونَ","text_tajweed":"قُلْ إِ[g[نّ]َم[o[َآ] أُ[f:8763[نذ]ِرُك[c:8764[ُم ب]ِ[h:8765[ٱ]لْوَحْىِ‌ۚ وَلَا يَسْمَعُ [h:8766[ٱ][l[ل]صُّ[g[مّ]ُ [h:8767[ٱ][l[ل]دُّع[o[َا]ٓءَ إِذَا مَا يُ[f:8768[نذ]َر[p[ُو]نَ","translation_en":"Say: I warn you only by revelation; and the deaf do not hear the call whenever they are warned.","translation_id":"Katakanlah (Muhammad), “Sesungguhnya aku hanya memberimu peringatan sesuai dengan wahyu.” Tetapi orang tuli tidak mendengar seruan apa-bila mereka diberi peringatan.","hasanah_per_verse":460},{"text_madani":"وَلَئِن مَّسَّتْهُمْ نَفْحَةٌ مِّنْ عَذَابِ رَبِّكَ لَيَقُولُنَّ يَا وَيْلَنَا إِنَّا كُنَّا ظَالِمِينَ","text_tajweed":"وَلَئ[a:8769[ِن م]َّسَّتْهُمْ نَفْحَ[a:8770[ةٌ م]ِّنْ عَذَابِ رَبِّكَ لَيَقُولُ[g[نّ]َ يَ[n[ـٰ]وَيْلَن[o[َآ] إِ[g[نّ]َا كُ[g[نّ]َا ظَ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And if a blast of the chastisement of your Lord were to touch them, they will certainly say: O woe to us! surely we were unjust.","translation_id":"Dan jika mereka ditimpa sedikit saja azab Tuhanmu, pastilah mereka berkata, “Celakalah kami! Sesungguhnya kami termasuk orang yang selalu menzhalimi (diri sendiri).”","hasanah_per_verse":470},{"text_madani":"وَنَضَعُ الْمَوَازِينَ الْقِسْطَ لِيَوْمِ الْقِيَامَةِ فَلَا تُظْلَمُ نَفْسٌ شَيْئًا ۖ وَإِن كَانَ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ أَتَيْنَا بِهَا ۗ وَكَفَىٰ بِنَا حَاسِبِينَ","text_tajweed":"وَنَضَعُ [h:8771[ٱ]لْمَو[n[َٲ]زِينَ [h:8772[ٱ]لْقِسْطَ لِيَوْمِ [h:8773[ٱ]لْقِيَ[n[ـٰ]مَةِ فَلَا تُظْلَمُ نَفْ[f:8774[سٌ ش]َيْـ[a:3553[ـًٔا‌ۖ و]َإِ[f:1649[ن ك]َانَ مِثْقَالَ حَبَّ[a:8775[ةٍ م]ِّنْ خَرْدَلٍ أَتَيْنَا بِهَا‌ۗ وَكَفَىٰ بِنَا حَ[n[ـٰ]سِب[p[ِي]نَ","translation_en":"And We will set up a just balance on the day of resurrection, so no soul shall be dealt with unjustly in the least; and though there be the weight of a grain of mustard seed, (yet) will We bring it, and sufficient are We to take account.","translation_id":"Dan Kami akan memasang timbangan yang tepat pada hari Kiamat, maka tidak seorang pun dirugikan walau sedikit; sekalipun hanya seberat biji sawi, pasti Kami mendatangkannya (pahala). Dan cukuplah Kami yang membuat perhitungan.","hasanah_per_verse":830},{"text_madani":"وَلَقَدْ آتَيْنَا مُوسَىٰ وَهَارُونَ الْفُرْقَانَ وَضِيَاءً وَذِكْرًا لِّلْمُتَّقِينَ","text_tajweed":"وَلَقَ[q:341[دْ] ءَاتَيْنَا مُوسَىٰ وَهَ[n[ـٰ]رُونَ [h:8776[ٱ]لْفُرْقَانَ وَضِي[o[َا]ٓ[a:8777[ءً و]َذِكْ[u:8778[رًا ل]ِّلْمُتَّق[p[ِي]نَ","translation_en":"And certainly We gave to Musa and Haroun the Furqan and a light and a reminder for those who would guard (against evil).","translation_id":"Dan sungguh, Kami telah memberikan kepada Musa dan Harun, Furqan (Kitab Taurat) dan penerangan serta pelajaran bagi orang-orang yang bertakwa.","hasanah_per_verse":430},{"text_madani":"الَّذِينَ يَخْشَوْنَ رَبَّهُم بِالْغَيْبِ وَهُم مِّنَ السَّاعَةِ مُشْفِقُونَ","text_tajweed":"ٱلَّذِينَ يَخْشَوْنَ رَبَّه[c:8779[ُم ب]ِ[h:13[ٱ]لْغَيْبِ وَه[w:8780[ُم م]ِّنَ [h:8781[ٱ][l[ل]سَّاعَةِ مُشْفِق[p[ُو]نَ","translation_en":"(For) those who fear their Lord in secret and they are fearful of the hour.","translation_id":"(Yaitu) orang-orang yang takut (azab) Tuhannya, sekalipun mereka tidak melihat-Nya, dan mereka merasa takut akan (tibanya) hari Kiamat.","hasanah_per_verse":370},{"text_madani":"وَهَٰذَا ذِكْرٌ مُّبَارَكٌ أَنزَلْنَاهُ ۚ أَفَأَنتُمْ لَهُ مُنكِرُونَ","text_tajweed":"وَهَ[n[ـٰ]ذَا ذِكْ[a:8782[رٌ م]ُّبَارَكٌ أَ[f:4236[نز]َلْنَ[n[ـٰ]هُ‌ۚ أَفَأَ[f:8783[نت]ُمْ لَهُ[n[ۥ] مُ[f:6721[نك]ِر[p[ُو]نَ","translation_en":"And this is a blessed Reminder which We have revealed; will you then deny it?","translation_id":"Dan ini (Al-Qur'an) adalah suatu peringatan yang mempunyai berkah yang telah Kami turunkan. Maka apakah kamu mengingkarinya?","hasanah_per_verse":330},{"text_madani":"وَلَقَدْ آتَيْنَا إِبْرَاهِيمَ رُشْدَهُ مِن قَبْلُ وَكُنَّا بِهِ عَالِمِينَ","text_tajweed":"۞ وَلَقَ[q:341[دْ] ءَاتَيْن[o[َآ] إِ[q:1860[بْ]ر[n[َٲ]هِيمَ رُشْدَهُ[n[ۥ] مِ[f:128[ن ق]َ[q:129[بْ]لُ وَكُ[g[نّ]َا بِه[n[ِۦ] عَ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And certainly We gave to Ibrahim his rectitude before, and We knew him fully well.","translation_id":"Dan sungguh, sebelum dia (Musa dan Harun) telah Kami berikan kepada Ibrahim petunjuk, dan Kami telah mengetahui dia.","hasanah_per_verse":370},{"text_madani":"إِذْ قَالَ لِأَبِيهِ وَقَوْمِهِ مَا هَٰذِهِ التَّمَاثِيلُ الَّتِي أَنتُمْ لَهَا عَاكِفُونَ","text_tajweed":"إِذْ قَالَ لِأَبِيهِ وَقَوْمِه[n[ِۦ] مَا هَ[n[ـٰ]ذِهِ [h:8784[ٱ][l[ل]تَّمَاثِيلُ [h:8785[ٱ]لَّت[o[ِىٓ] أَ[f:428[نت]ُمْ لَهَا عَ[n[ـٰ]كِف[p[ُو]نَ","translation_en":"When he said to his father and his people: What are these images to whose worship you cleave?","translation_id":"(Ingatlah), ketika dia (Ibrahim) berkata kepada ayahnya dan kaumnya, “Patung-patung apakah ini yang kamu tekun menyembahnya?”","hasanah_per_verse":450},{"text_madani":"قَالُوا وَجَدْنَا آبَاءَنَا لَهَا عَابِدِينَ","text_tajweed":"قَالُو[s[اْ] وَجَ[q:3834[دْ]ن[o[َآ] ءَاب[o[َا]ٓءَنَا لَهَا عَ[n[ـٰ]بِد[p[ِي]نَ","translation_en":"They said: We found our fathers worshipping them.","translation_id":"Mereka menjawab, “Kami mendapati nenek moyang kami menyembahnya.”","hasanah_per_verse":250},{"text_madani":"قَالَ لَقَدْ كُنتُمْ أَنتُمْ وَآبَاؤُكُمْ فِي ضَلَالٍ مُّبِينٍ","text_tajweed":"قَالَ لَقَ[q:2389[دْ] كُ[f:100[نت]ُمْ أَ[f:428[نت]ُمْ وَءَاب[o[َا]ٓؤُكُمْ فِى ضَلَ[n[ـٰ][a:2393[لٍ م]ُّب[p[ِي]نٍ","translation_en":"He said: Certainly you have been, (both) you and your fathers, in manifest error.","translation_id":"Dia (Ibrahim) berkata, “Sesungguhnya kamu dan nenek moyang kamu berada dalam kesesatan yang nyata.”","hasanah_per_verse":310},{"text_madani":"قَالُوا أَجِئْتَنَا بِالْحَقِّ أَمْ أَنتَ مِنَ اللَّاعِبِينَ","text_tajweed":"قَال[o[ُوٓ][s[اْ] أَجِئْتَنَا بِ[h:370[ٱ]لْحَقِّ أَمْ أَ[f:169[نت]َ مِنَ [h:8786[ٱ][l[ل]لَّ[n[ـٰ]عِب[p[ِي]نَ","translation_en":"They said: Have you brought to us the truth, or are you one of the triflers?","translation_id":"Mereka berkata, “Apakah engkau da-tang kepada kami membawa kebenaran atau engkau main-main?”","hasanah_per_verse":310},{"text_madani":"قَالَ بَل رَّبُّكُمْ رَبُّ السَّمَاوَاتِ وَالْأَرْضِ الَّذِي فَطَرَهُنَّ وَأَنَا عَلَىٰ ذَٰلِكُم مِّنَ الشَّاهِدِينَ","text_tajweed":"قَالَ بَ[b:8787[ل] رَّبُّكُمْ رَبُّ [h:6926[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ [h:8788[ٱ]لَّذِى فَطَرَهُ[g[نّ]َ وَأَنَا۟ عَلَىٰ ذ[n[َٲ]لِك[w:8789[ُم م]ِّنَ [h:2069[ٱ][l[ل]شَّ[n[ـٰ]هِد[p[ِي]نَ","translation_en":"He said: Nay! your Lord is the Lord of the heavens and the earth, Who brought them into existence, and I am of those who bear witness to this:","translation_id":"Dia (Ibrahim) menjawab, “Sebenarnya Tuhan kamu ialah Tuhan (pemilik) langit dan bumi; (Dialah) yang telah menciptakannya; dan aku termasuk orang yang dapat bersaksi atas itu.”","hasanah_per_verse":550},{"text_madani":"وَتَاللَّهِ لَأَكِيدَنَّ أَصْنَامَكُم بَعْدَ أَن تُوَلُّوا مُدْبِرِينَ","text_tajweed":"وَتَ[h:9999[ٱ]للَّهِ لَأَكِيدَ[g[نّ]َ أَصْنَ[n[ـٰ]مَك[c:8790[ُم ب]َعْدَ أَ[f:902[ن ت]ُوَلُّو[s[اْ] مُ[q:5528[دْ]بِر[p[ِي]نَ","translation_en":"And, by Allah! I will certainly do something against your idols after you go away, turning back.","translation_id":"Dan demi Allah, sungguh, aku akan melakukan tipu daya terhadap berhala-berhalamu setelah kamu pergi meninggalkannya.","hasanah_per_verse":350},{"text_madani":"فَجَعَلَهُمْ جُذَاذًا إِلَّا كَبِيرًا لَّهُمْ لَعَلَّهُمْ إِلَيْهِ يَرْجِعُونَ","text_tajweed":"فَجَعَلَهُمْ جُذ[n[َٲ]ذًا إِلَّا كَبِي[u:8791[رًا ل]َّهُمْ لَعَلَّهُمْ إِلَيْهِ يَرْجِع[p[ُو]نَ","translation_en":"So he broke them into pieces, except the chief of them, that haply they may return to it.","translation_id":"Maka dia (Ibrahim) menghancurkan (berhala-berhala itu) berkeping-keping, kecuali yang terbesar (induknya); agar mereka kembali (untuk bertanya) kepadanya.","hasanah_per_verse":370},{"text_madani":"قَالُوا مَن فَعَلَ هَٰذَا بِآلِهَتِنَا إِنَّهُ لَمِنَ الظَّالِمِينَ","text_tajweed":"قَالُو[s[اْ] مَ[f:8792[ن ف]َعَلَ هَ[n[ـٰ]ذَا بِـَٔـالِهَتِن[o[َآ] إِ[g[نّ]َهُ[n[ۥ] لَمِنَ [h:766[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"They said: Who has done this to our gods? Most surely he is one of the unjust.","translation_id":"Mereka berkata, “Siapakah yang melakukan (perbuatan) ini terhadap tuhan-tuhan kami? Sungguh, dia termasuk orang yang zhalim.”","hasanah_per_verse":340},{"text_madani":"قَالُوا سَمِعْنَا فَتًى يَذْكُرُهُمْ يُقَالُ لَهُ إِبْرَاهِيمُ","text_tajweed":"قَالُو[s[اْ] سَمِعْنَا فَ[a:8793[تًى ي]َذْكُرُهُمْ يُقَالُ لَهُ[o[ۥٓ] إِ[q:2003[بْ]ر[n[َٲ]ه[p[ِي]مُ","translation_en":"They said: We heard a youth called Ibrahim speak of them.","translation_id":"Mereka (yang lain) berkata, “Kami mendengar ada seorang pemuda yang mencela (berhala-berhala ini), namanya Ibrahim.”","hasanah_per_verse":320},{"text_madani":"قَالُوا فَأْتُوا بِهِ عَلَىٰ أَعْيُنِ النَّاسِ لَعَلَّهُمْ يَشْهَدُونَ","text_tajweed":"قَالُو[s[اْ] فَأْتُو[s[اْ] بِه[n[ِۦ] عَلَ[o[ىٰٓ] أَعْيُنِ [h:8794[ٱ][l[ل][g[نّ]َاسِ لَعَلَّهُمْ يَشْهَد[p[ُو]نَ","translation_en":"Said they: Then bring him before the eyes of the people, perhaps they may bear witness.","translation_id":"Mereka berkata, “(Kalau demikian) bawalah dia dengan diperlihatkan kepada orang banyak, agar mereka menyaksikan.”","hasanah_per_verse":350},{"text_madani":"قَالُوا أَأَنتَ فَعَلْتَ هَٰذَا بِآلِهَتِنَا يَا إِبْرَاهِيمُ","text_tajweed":"قَال[o[ُوٓ][s[اْ] ءَأَ[f:3896[نت]َ فَعَلْتَ هَ[n[ـٰ]ذَا بِـَٔـالِهَتِنَا يَ[o[ـٰٓ]إِ[q:6429[بْ]ر[n[َٲ]ه[p[ِي]مُ","translation_en":"They said: Have you done this to our gods, O Ibrahim?","translation_id":"Mereka bertanya, “Apakah engkau yang melakukan (perbuatan) ini terhadap tuhan-tuhan kami, wahai Ibrahim?”","hasanah_per_verse":320},{"text_madani":"قَالَ بَلْ فَعَلَهُ كَبِيرُهُمْ هَٰذَا فَاسْأَلُوهُمْ إِن كَانُوا يَنطِقُونَ","text_tajweed":"قَالَ بَلْ فَعَلَهُ[n[ۥ] كَبِيرُهُمْ هَ[n[ـٰ]ذَا فَسْــَٔلُوهُمْ إِ[f:5674[ن ك]َانُو[s[اْ] يَ[f:8795[نط]ِق[p[ُو]نَ","translation_en":"He said: Surely (some doer) has done it; the chief of them is this, therefore ask them, if they can speak.","translation_id":"Dia (Ibrahim) menjawab, “Sebenarnya (patung) besar itu yang melakukannya, maka tanyakanlah kepada mereka, jika mereka dapat berbicara.”","hasanah_per_verse":390},{"text_madani":"فَرَجَعُوا إِلَىٰ أَنفُسِهِمْ فَقَالُوا إِنَّكُمْ أَنتُمُ الظَّالِمُونَ","text_tajweed":"فَرَجَع[o[ُوٓ][s[اْ] إِلَ[o[ىٰٓ] أَ[f:568[نف]ُسِهِمْ فَقَال[o[ُوٓ][s[اْ] إِ[g[نّ]َكُمْ أَ[f:8796[نت]ُمُ [h:8797[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ُو]نَ","translation_en":"Then they turned to themselves and said: Surely you yourselves are the unjust;","translation_id":"Maka mereka kembali kepada kesadaran mereka dan berkata, “Sesungguhnya kamulah yang menzhalimi (diri sendiri).”","hasanah_per_verse":370},{"text_madani":"ثُمَّ نُكِسُوا عَلَىٰ رُءُوسِهِمْ لَقَدْ عَلِمْتَ مَا هَٰؤُلَاءِ يَنطِقُونَ","text_tajweed":"ثُ[g[مّ]َ نُكِسُو[s[اْ] عَلَىٰ رُءُوسِهِمْ لَقَ[q:2389[دْ] عَلِمْتَ مَا هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ يَ[f:8795[نط]ِق[p[ُو]نَ","translation_en":"Then they were made to hang down their heads: Certainly you know that they do not speak.","translation_id":"Kemudian mereka menundukkan kepala (lalu berkata), “Engkau (Ibrahim) pasti tahu bahwa (berhala-berhala) itu tidak dapat berbicara.”","hasanah_per_verse":360},{"text_madani":"قَالَ أَفَتَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَا يَنفَعُكُمْ شَيْئًا وَلَا يَضُرُّكُمْ","text_tajweed":"قَالَ أَفَتَعْبُدُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ مَا لَا يَ[f:6307[نف]َعُكُمْ شَيْـ[a:232[ـًٔا و]َلَا يَضُرُّكُمْ","translation_en":"He said: What! do you then serve besides Allah what brings you not any benefit at all, nor does it harm you?","translation_id":"Dia (Ibrahim) berkata, “Mengapa kamu menyembah selain Allah, sesuatu yang tidak dapat memberi manfaat sedikit pun, dan tidak (pula) mendatangkan mudarat kepada kamu?","hasanah_per_verse":420},{"text_madani":"أُفٍّ لَّكُمْ وَلِمَا تَعْبُدُونَ مِن دُونِ اللَّهِ ۖ أَفَلَا تَعْقِلُونَ","text_tajweed":"أُ[u:8798[فٍّ ل]َّكُمْ وَلِمَا تَعْبُدُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ‌ۖ أَفَلَا تَعْقِل[p[ُو]نَ","translation_en":"Fie on you and on what you serve besides Allah; what! do you not then understand?","translation_id":"Celakalah kamu dan apa yang kamu sembah selain Allah! Tidakkah kamu mengerti?”","hasanah_per_verse":340},{"text_madani":"قَالُوا حَرِّقُوهُ وَانصُرُوا آلِهَتَكُمْ إِن كُنتُمْ فَاعِلِينَ","text_tajweed":"قَالُو[s[اْ] حَرِّقُوهُ وَ[h:8799[ٱ][f:8799[نص]ُر[o[ُوٓ][s[اْ] ءَالِهَتَكُمْ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ فَ[n[ـٰ]عِل[p[ِي]نَ","translation_en":"They said: Burn him and help your gods, if you are going to do (anything).","translation_id":"Mereka berkata, “Bakarlah dia dan bantulah tuhan-tuhan kamu, jika kamu benar-benar hendak berbuat.”","hasanah_per_verse":350},{"text_madani":"قُلْنَا يَا نَارُ كُونِي بَرْدًا وَسَلَامًا عَلَىٰ إِبْرَاهِيمَ","text_tajweed":"قُلْنَا يَ[n[ـٰ]نَارُ كُونِى بَرْ[a:8800[دًا و]َسَلَ[n[ـٰ]مًا عَلَ[o[ىٰٓ] إِ[q:1860[بْ]ر[n[َٲ]ه[p[ِي]مَ","translation_en":"We said: O fire! be a comfort and peace to Ibrahim;","translation_id":"Kami (Allah) berfirman, “Wahai api! Jadilah kamu dingin, dan penyelamat bagi Ibrahim!”","hasanah_per_verse":330},{"text_madani":"وَأَرَادُوا بِهِ كَيْدًا فَجَعَلْنَاهُمُ الْأَخْسَرِينَ","text_tajweed":"وَأَرَادُو[s[اْ] بِه[n[ِۦ] كَيْ[f:8801[دًا ف]َجَعَلْنَ[n[ـٰ]هُمُ [h:8802[ٱ]لْأَخْسَر[p[ِي]نَ","translation_en":"And they desired a war on him, but We made them the greatest losers.","translation_id":"Dan mereka hendak berbuat jahat terhadap Ibrahim, maka Kami menjadikan mereka itu orang-orang yang paling rugi.","hasanah_per_verse":290},{"text_madani":"وَنَجَّيْنَاهُ وَلُوطًا إِلَى الْأَرْضِ الَّتِي بَارَكْنَا فِيهَا لِلْعَالَمِينَ","text_tajweed":"وَنَجَّيْنَ[n[ـٰ]هُ وَلُوطًا إِلَى [h:5136[ٱ]لْأَرْضِ [h:8803[ٱ]لَّتِى بَ[n[ـٰ]رَكْنَا فِيهَا لِلْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"And We delivered him as well as Lut (removing them) to the land which We had blessed for all people.","translation_id":"Dan Kami selamatkan dia (Ibrahim) dan Luth ke sebuah negeri yang telah Kami berkahi untuk seluruh alam.","hasanah_per_verse":420},{"text_madani":"وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ نَافِلَةً ۖ وَكُلًّا جَعَلْنَا صَالِحِينَ","text_tajweed":"وَوَهَ[q:4212[بْ]نَا لَهُ[o[ۥٓ] إِسْحَ[n[ـٰ]قَ وَيَعْقُوبَ نَافِلَ[a:8804[ةً‌ۖ و]َكُل[f:8357[اًّ ج]َعَلْنَا صَ[n[ـٰ]لِح[p[ِي]نَ","translation_en":"And We gave him Ishaq and Yaqoub, a son's son, and We made (them) all good.","translation_id":"Dan Kami menganugerahkan kepadanya (Ibrahim) Ishak dan Yakub, sebagai suatu anugerah. Dan masing-masing Kami jadikan orang yang shalih.","hasanah_per_verse":390},{"text_madani":"وَجَعَلْنَاهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا وَأَوْحَيْنَا إِلَيْهِمْ فِعْلَ الْخَيْرَاتِ وَإِقَامَ الصَّلَاةِ وَإِيتَاءَ الزَّكَاةِ ۖ وَكَانُوا لَنَا عَابِدِينَ","text_tajweed":"وَجَعَلْنَ[n[ـٰ]هُمْ أَئِ[g[مّ]َ[a:8805[ةً ي]َهْدُونَ بِأَمْرِنَا وَأَوْحَيْن[o[َآ] إِلَيْهِمْ فِعْلَ [h:8806[ٱ]لْخَيْر[n[َٲ]تِ وَإِقَامَ [h:8807[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةِ وَإِيت[o[َا]ٓءَ [h:8808[ٱ][l[ل]زَّكَ[s[و][n[ٲ]ةِ‌ۖ وَكَانُو[s[اْ] لَنَا عَ[n[ـٰ]بِد[p[ِي]نَ","translation_en":"And We made them Imams who guided (people) by Our command, and We revealed to them the doing of good and the keeping up of prayer and the giving of the alms, and Us (alone) did they serve;","translation_id":"Dan Kami menjadikan mereka itu sebagai pemimpin-pemimpin yang memberi petunjuk dengan perintah Kami dan Kami wahyukan kepada mereka agar berbuat kebaikan, melaksanakan shalat dan menunaikan zakat, dan hanya kepada Kami mereka menyembah.","hasanah_per_verse":830},{"text_madani":"وَلُوطًا آتَيْنَاهُ حُكْمًا وَعِلْمًا وَنَجَّيْنَاهُ مِنَ الْقَرْيَةِ الَّتِي كَانَت تَّعْمَلُ الْخَبَائِثَ ۗ إِنَّهُمْ كَانُوا قَوْمَ سَوْءٍ فَاسِقِينَ","text_tajweed":"وَلُوطًا ءَاتَيْنَ[n[ـٰ]هُ حُكْ[a:6600[مًا و]َعِلْ[a:8809[مًا و]َنَجَّيْنَ[n[ـٰ]هُ مِنَ [h:8810[ٱ]لْقَرْيَةِ [h:5089[ٱ]لَّتِى كَانَت تَّعْمَلُ [h:8811[ٱ]لْخَبَ[o[ـٰٓ]ئِثَ‌ۗ إِ[g[نّ]َهُمْ كَانُو[s[اْ] قَوْمَ سَوْ[f:8812[ءٍ ف]َ[n[ـٰ]سِق[p[ِي]نَ","translation_en":"And (as for) Lut, We gave him wisdom and knowledge, and We delivered him from the town which wrought abominations; surely they were an evil people, transgressors;","translation_id":"Kepada Luth, Kami berikan hikmah dan ilmu, dan Kami selamatkan dia dari (azab yang telah menimpa penduduk) kota yang melakukan perbuatan keji. Sungguh, mereka orang-orang yang jahat lagi fasik.","hasanah_per_verse":750},{"text_madani":"وَأَدْخَلْنَاهُ فِي رَحْمَتِنَا ۖ إِنَّهُ مِنَ الصَّالِحِينَ","text_tajweed":"وَأَ[q:8813[دْ]خَلْنَ[n[ـٰ]هُ فِى رَحْمَتِن[o[َآ‌ۖ] إِ[g[نّ]َهُ[n[ۥ] مِنَ [h:1889[ٱ][l[ل]صَّ[n[ـٰ]لِح[p[ِي]نَ","translation_en":"And We took him into Our mercy; surely he was of the good.","translation_id":"Dan Kami masukkan dia ke dalam rahmat Kami; sesungguhnya dia termasuk golongan orang yang shalih.","hasanah_per_verse":290},{"text_madani":"وَنُوحًا إِذْ نَادَىٰ مِن قَبْلُ فَاسْتَجَبْنَا لَهُ فَنَجَّيْنَاهُ وَأَهْلَهُ مِنَ الْكَرْبِ الْعَظِيمِ","text_tajweed":"وَنُوحًا إِذْ نَادَىٰ مِ[f:128[ن ق]َ[q:129[بْ]لُ فَ[h:8814[ٱ]سْتَجَ[q:8814[بْ]نَا لَهُ[n[ۥ] فَنَجَّيْنَ[n[ـٰ]هُ وَأَهْلَهُ[n[ۥ] مِنَ [h:8815[ٱ]لْكَرْبِ [h:8816[ٱ]لْعَظ[p[ِي]مِ","translation_en":"And Nuh, when he cried aforetime, so We answered him, and delivered him and his followers from the great calamity.","translation_id":"Dan (ingatlah kisah) Nuh, sebelum itu, ketika dia berdoa. Kami perkenankan (doa)nya, lalu Kami selamatkan dia bersama pengikutnya dari bencana yang besar.","hasanah_per_verse":510},{"text_madani":"وَنَصَرْنَاهُ مِنَ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِنَا ۚ إِنَّهُمْ كَانُوا قَوْمَ سَوْءٍ فَأَغْرَقْنَاهُمْ أَجْمَعِينَ","text_tajweed":"وَنَصَرْنَ[n[ـٰ]هُ مِنَ [h:4196[ٱ]لْقَوْمِ [h:4053[ٱ]لَّذِينَ كَذَّبُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِن[o[َآ‌ۚ] إِ[g[نّ]َهُمْ كَانُو[s[اْ] قَوْمَ سَوْ[f:8817[ءٍ ف]َأَغْرَ[q:4970[قْ]نَ[n[ـٰ]هُمْ أَ[q:825[جْ]مَع[p[ِي]نَ","translation_en":"And We helped him against the people who rejected Our communications; surely they were an evil people, so We drowned them all.","translation_id":"Dan Kami menolongnya dari orang-orang yang telah mendustakan ayat-ayat Kami. Sesungguhnya mereka adalah orang-orang yang jahat, maka Kami tenggelamkan mereka semuanya.","hasanah_per_verse":610},{"text_madani":"وَدَاوُودَ وَسُلَيْمَانَ إِذْ يَحْكُمَانِ فِي الْحَرْثِ إِذْ نَفَشَتْ فِيهِ غَنَمُ الْقَوْمِ وَكُنَّا لِحُكْمِهِمْ شَاهِدِينَ","text_tajweed":"وَدَاوُ[n[ۥ]دَ وَسُلَيْمَ[n[ـٰ]نَ إِذْ يَحْكُمَانِ فِى [h:8818[ٱ]لْحَرْثِ إِذْ نَفَشَتْ فِيهِ غَنَمُ [h:8819[ٱ]لْقَوْمِ وَكُ[g[نّ]َا لِحُكْمِهِمْ شَ[n[ـٰ]هِد[p[ِي]نَ","translation_en":"And Dawood and Sulaiman when they gave judgment concerning the field when the people's sheep pastured therein by night, and We were bearers of witness to their judgment.","translation_id":"Dan (ingatlah kisah) Dawud dan Sulaiman, ketika keduanya memberikan keputusan mengenai ladang, karena (ladang itu) dirusak oleh kambing-kambing milik kaumnya. Dan Kami menyaksikan keputusan (yang diberikan) oleh mereka itu.","hasanah_per_verse":610},{"text_madani":"فَفَهَّمْنَاهَا سُلَيْمَانَ ۚ وَكُلًّا آتَيْنَا حُكْمًا وَعِلْمًا ۚ وَسَخَّرْنَا مَعَ دَاوُودَ الْجِبَالَ يُسَبِّحْنَ وَالطَّيْرَ ۚ وَكُنَّا فَاعِلِينَ","text_tajweed":"فَفَهَّمْنَ[n[ـٰ]هَا سُلَيْمَ[n[ـٰ]نَ‌ۚ وَكُلاًّ ءَاتَيْنَا حُكْ[a:6600[مًا و]َعِلْ[a:8820[مًا‌ۚ و]َسَخَّرْنَا مَعَ دَاوُ[n[ۥ]دَ [h:8821[ٱ]لْجِبَالَ يُسَبِّحْنَ وَ[h:8822[ٱ][l[ل]طَّيْرَ‌ۚ وَكُ[g[نّ]َا فَ[n[ـٰ]عِل[p[ِي]نَ","translation_en":"So We made Sulaiman to understand it; and to each one We gave wisdom and knowledge; and We made the mountains, and the birds to celebrate Our praise with Dawood; and We were the doers.","translation_id":"Dan Kami memberikan pengertian kepada Sulaiman (tentang hukum yang lebih tepat); dan kepada masing-masing Kami berikan hikmah dan ilmu, dan Kami tundukkan gunung-gunung dan burung-burung, semua bertasbih bersama Dawud. Dan Kamilah yang melakukannya.","hasanah_per_verse":720},{"text_madani":"وَعَلَّمْنَاهُ صَنْعَةَ لَبُوسٍ لَّكُمْ لِتُحْصِنَكُم مِّن بَأْسِكُمْ ۖ فَهَلْ أَنتُمْ شَاكِرُونَ","text_tajweed":"وَعَلَّمْنَ[n[ـٰ]هُ صَنْعَةَ لَبُو[u:8823[سٍ ل]َّكُمْ لِتُحْصِنَك[w:8824[ُم م]ّ[i:8825[ِنۢ ب]َأْسِكُمْ‌ۖ فَهَلْ أَ[f:428[نت]ُمْ شَ[n[ـٰ]كِر[p[ُو]نَ","translation_en":"And We taught him the making of coats of mail for you, that they might protect you in your wars; will you then be grateful?","translation_id":"Dan Kami ajarkan (pula) kepada Dawud cara membuat baju besi untukmu, guna melindungi kamu dalam peperangan. Apakah kamu bersyukur (kepada Allah)?","hasanah_per_verse":450},{"text_madani":"وَلِسُلَيْمَانَ الرِّيحَ عَاصِفَةً تَجْرِي بِأَمْرِهِ إِلَى الْأَرْضِ الَّتِي بَارَكْنَا فِيهَا ۚ وَكُنَّا بِكُلِّ شَيْءٍ عَالِمِينَ","text_tajweed":"وَلِسُلَيْمَ[n[ـٰ]نَ [h:8826[ٱ][l[ل]رِّيحَ عَاصِفَ[f:8827[ةً ت]َ[q:120[جْ]رِى بِأَمْرِه[o[ِۦٓ] إِلَى [h:5136[ٱ]لْأَرْضِ [h:8803[ٱ]لَّتِى بَ[n[ـٰ]رَكْنَا فِيهَا‌ۚ وَكُ[g[نّ]َا بِكُلِّ شَىْءٍ عَ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And (We made subservient) to Sulaiman the wind blowing violent, pursuing its course by his command to the land which We had blessed, and We are knower of ail things.","translation_id":"Dan (Kami tundukkan) untuk Sulaiman angin yang sangat kencang tiupannya yang berhembus dengan perintahnya ke negeri yang Kami beri berkah padanya. Dan Kami Maha Mengetahui segala sesuatu.","hasanah_per_verse":650},{"text_madani":"وَمِنَ الشَّيَاطِينِ مَن يَغُوصُونَ لَهُ وَيَعْمَلُونَ عَمَلًا دُونَ ذَٰلِكَ ۖ وَكُنَّا لَهُمْ حَافِظِينَ","text_tajweed":"وَمِنَ [h:8828[ٱ][l[ل]شَّيَ[n[ـٰ]طِينِ م[a:8829[َن ي]َغُوصُونَ لَهُ[n[ۥ] وَيَعْمَلُونَ عَمَل[f:8830[اً د]ُونَ ذ[n[َٲ]لِكَ‌ۖ وَكُ[g[نّ]َا لَهُمْ حَ[n[ـٰ]فِظ[p[ِي]نَ","translation_en":"And of the rebellious people there were those who dived for him and did other work besides that, and We kept guard over them;","translation_id":"Dan (Kami tundukkan pula kepada Sulaiman) segolongan setan-setan yang menyelam (ke dalam laut) untuknya dan mereka mengerjakan pekerjaan selain itu; dan Kami yang memelihara mereka itu.","hasanah_per_verse":510},{"text_madani":"وَأَيُّوبَ إِذْ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ","text_tajweed":"۞ وَأَيُّوبَ إِذْ نَادَىٰ رَبَّهُ[o[ۥٓ] أَ[g[نّ]ِى مَسَّنِىَ [h:8831[ٱ][l[ل]ضُّرُّ وَأَ[f:3893[نت]َ أَرْحَمُ [h:5034[ٱ][l[ل]رّ[n[َٲ]حِم[p[ِي]نَ","translation_en":"And Ayub, when he cried to his Lord, (saying): Harm has afflicted me, and Thou art the most Merciful of the merciful.","translation_id":"Dan (ingatlah kisah) Ayub, ketika dia berdoa kepada Tuhannya, “(Ya Tuhanku), sungguh, aku telah ditimpa penyakit, padahal Engkau Tuhan Yang Maha Penyayang dari semua yang penyayang.”","hasanah_per_verse":410},{"text_madani":"فَاسْتَجَبْنَا لَهُ فَكَشَفْنَا مَا بِهِ مِن ضُرٍّ ۖ وَآتَيْنَاهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنْ عِندِنَا وَذِكْرَىٰ لِلْعَابِدِينَ","text_tajweed":"فَ[h:9999[ٱ]سْتَجَ[q:8814[بْ]نَا لَهُ[n[ۥ] فَكَشَفْنَا مَا بِه[n[ِۦ] مِ[f:8832[ن ض]ُ[a:8833[رٍّ‌ۖ و]َءَاتَيْنَ[n[ـٰ]هُ أَهْلَهُ[n[ۥ] وَمِثْلَه[w:8834[ُم م]َّعَهُمْ رَحْمَ[a:5993[ةً م]ِّنْ عِ[f:6142[ند]ِنَا وَذِكْرَىٰ لِلْعَ[n[ـٰ]بِد[p[ِي]نَ","translation_en":"Therefore We responded to him and took off what harm he had, and We gave him his family and the like of them with them: a mercy from Us and a reminder to the worshippers.","translation_id":"Maka Kami kabulkan (doa)nya, lalu Kami lenyapkan penyakit yang ada padanya dan Kami kembalikan keluarganya kepadanya, dan (Kami lipat gandakan jumlah mereka) sebagai suatu rahmat dari Kami, dan untuk menjadi peringatan bagi semua yang menyembah Kami.","hasanah_per_verse":690},{"text_madani":"وَإِسْمَاعِيلَ وَإِدْرِيسَ وَذَا الْكِفْلِ ۖ كُلٌّ مِّنَ الصَّابِرِينَ","text_tajweed":"وَإِسْمَ[n[ـٰ]عِيلَ وَإِ[q:8835[دْ]رِيسَ وَذَا [h:8836[ٱ]لْكِفْلِ‌ۖ كُ[a:4216[لٌّ م]ِّنَ [h:8837[ٱ][l[ل]صَّ[n[ـٰ]بِر[p[ِي]نَ","translation_en":"And Ismail and Idris and Zulkifl; all were of the patient ones;","translation_id":"Dan (ingatlah kisah) Ismail, Idris dan Zulkifli. Mereka semua termasuk orang-orang yang sabar.","hasanah_per_verse":340},{"text_madani":"وَأَدْخَلْنَاهُمْ فِي رَحْمَتِنَا ۖ إِنَّهُم مِّنَ الصَّالِحِينَ","text_tajweed":"وَأَ[q:8838[دْ]خَلْنَ[n[ـٰ]هُمْ فِى رَحْمَتِن[o[َآ‌ۖ] إِ[g[نّ]َه[w:8839[ُم م]ِّنَ [h:1889[ٱ][l[ل]صَّ[n[ـٰ]لِح[p[ِي]نَ","translation_en":"And We caused them to enter into Our mercy, surely they were of the good ones.","translation_id":"Dan Kami masukkan mereka ke dalam rahmat Kami. Sungguh, mereka termasuk orang-orang yang shalih.","hasanah_per_verse":310},{"text_madani":"وَذَا النُّونِ إِذ ذَّهَبَ مُغَاضِبًا فَظَنَّ أَن لَّن نَّقْدِرَ عَلَيْهِ فَنَادَىٰ فِي الظُّلُمَاتِ أَن لَّا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ","text_tajweed":"وَذَا [h:8840[ٱ][l[ل][g[نّ]ُونِ إِذ ذَّهَبَ مُغَ[n[ـٰ]ضِ[f:8841[بًا ف]َظَ[g[نّ]َ أ[u:8842[َن ل]ّ[a:8843[َن ن]َّ[q:8844[قْ]دِرَ عَلَيْهِ فَنَادَىٰ فِى [h:4033[ٱ][l[ل]ظُّلُمَ[n[ـٰ]تِ أ[u:4908[َن ل]ّ[o[َآ] إِلَ[n[ـٰ]هَ إِلّ[o[َآ] أَ[f:169[نت]َ سُ[q:168[بْ]حَ[n[ـٰ]نَكَ إِ[g[نّ]ِى كُ[f:2917[نت]ُ مِنَ [h:187[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And Yunus, when he went away in wrath, so he thought that We would not straiten him, so he called out among afflictions: There is no god but Thou, glory be to Thee; surely I am of those who make themselves to suffer loss.","translation_id":"Dan (ingatlah kisah) Zun Nun (Yunus), ketika dia pergi dalam keadaan marah, lalu dia menyangka bahwa Kami tidak akan menyulitkannya, maka dia berdoa dalam keadaan yang sangat gelap, ”Tidak ada tuhan selain Engkau, Mahasuci Engkau. Sungguh, aku termasuk orang-orang yang zhalim.”","hasanah_per_verse":830},{"text_madani":"فَاسْتَجَبْنَا لَهُ وَنَجَّيْنَاهُ مِنَ الْغَمِّ ۚ وَكَذَٰلِكَ نُنجِي الْمُؤْمِنِينَ","text_tajweed":"فَ[h:9999[ٱ]سْتَجَ[q:8814[بْ]نَا لَهُ[n[ۥ] وَنَجَّيْنَ[n[ـٰ]هُ مِنَ [h:8482[ٱ]لْغَ[g[مّ]ِ‌ۚ وَكَذ[n[َٲ]لِكَ نُـۨجِى [h:8845[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"So We responded to him and delivered him from the grief and thus do We deliver the believers.","translation_id":"Maka Kami kabulkan (doa)nya dan Kami selamatkan dia dari kedukaan. Dan demikianlah Kami menyelamatkan orang-orang yang beriman.","hasanah_per_verse":400},{"text_madani":"وَزَكَرِيَّا إِذْ نَادَىٰ رَبَّهُ رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ","text_tajweed":"وَزَكَرِيّ[o[َآ] إِذْ نَادَىٰ رَبَّهُ[n[ۥ] رَبِّ لَا تَذَرْنِى فَرْ[a:8846[دًا و]َأَ[f:3893[نت]َ خَيْرُ [h:8847[ٱ]لْو[n[َٲ]رِث[p[ِي]نَ","translation_en":"And Zakariya, when he cried to his Lord: O my Lord leave me not alone; and Thou art the best of inheritors.","translation_id":"Dan (ingatlah kisah) Zakaria, ketika dia berdoa kepada Tuhannya, “Ya Tuhanku, janganlah Engkau biarkan aku hidup seorang diri (tanpa keturunan) dan Engkaulah ahli waris yang terbaik.","hasanah_per_verse":430},{"text_madani":"فَاسْتَجَبْنَا لَهُ وَوَهَبْنَا لَهُ يَحْيَىٰ وَأَصْلَحْنَا لَهُ زَوْجَهُ ۚ إِنَّهُمْ كَانُوا يُسَارِعُونَ فِي الْخَيْرَاتِ وَيَدْعُونَنَا رَغَبًا وَرَهَبًا ۖ وَكَانُوا لَنَا خَاشِعِينَ","text_tajweed":"فَ[h:9999[ٱ]سْتَجَ[q:8814[بْ]نَا لَهُ[n[ۥ] وَوَهَ[q:4212[بْ]نَا لَهُ[n[ۥ] يَحْيَىٰ وَأَصْلَحْنَا لَهُ[n[ۥ] زَوْجَهُ[o[ۥٓ‌ۚ] إِ[g[نّ]َهُمْ كَانُو[s[اْ] يُسَ[n[ـٰ]رِعُونَ فِى [h:2181[ٱ]لْخَيْر[n[َٲ]تِ وَيَ[q:8848[دْ]عُونَنَا رَغَ[a:8849[بًا و]َرَهَ[a:8850[بًا‌ۖ و]َكَانُو[s[اْ] لَنَا خَ[n[ـٰ]شِع[p[ِي]نَ","translation_en":"So We responded to him and gave him Yahya and made his wife fit for him; surely they used to hasten, one with another In deeds of goodness and to call upon Us, hoping and fearing and they were humble before Us.","translation_id":"Maka Kami kabulkan (doa)nya, dan Kami anugerahkan kepadanya Yahya, dan Kami jadikan istrinya (dapat mengandung). Sungguh, mereka selalu bersegera dalam (mengerjakan) kebaikan, dan mereka berdoa kepada Kami dengan penuh harap dan cemas. Dan mereka orang-orang yang khusyuk kepada Kami.","hasanah_per_verse":920},{"text_madani":"وَالَّتِي أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهَا مِن رُّوحِنَا وَجَعَلْنَاهَا وَابْنَهَا آيَةً لِّلْعَالَمِينَ","text_tajweed":"وَ[h:9999[ٱ]لَّت[o[ِىٓ] أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهَا م[u:8851[ِن ر]ُّوحِنَا وَجَعَلْنَ[n[ـٰ]هَا وَ[h:8852[ٱ][q:8852[بْ]نَه[o[َآ] ءَايَ[u:8853[ةً ل]ِّلْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"And she who guarded her chastity, so We breathed into her of Our inspiration and made her and her son a sign for the nations.","translation_id":"Dan (ingatlah kisah Maryam) yang memelihara kehormatannya, lalu Kami tiupkan (roh) dari Kami ke dalam (tubuh)nya; Kami jadikan dia dan anaknya sebagai tanda (kebesaran Allah) bagi seluruh alam.","hasanah_per_verse":570},{"text_madani":"إِنَّ هَٰذِهِ أُمَّتُكُمْ أُمَّةً وَاحِدَةً وَأَنَا رَبُّكُمْ فَاعْبُدُونِ","text_tajweed":"إِ[g[نّ]َ هَ[n[ـٰ]ذِه[o[ِۦٓ] أُ[g[مّ]َتُكُمْ أُ[g[مّ]َ[a:1159[ةً و][n[َٲ]حِدَ[a:8854[ةً و]َأَنَا۟ رَبُّكُمْ فَ[h:8713[ٱ]عْبُد[p[ُو]نِ","translation_en":"Surely this Islam is your religion, one religion (only), and I am your Lord, therefore serve Me.","translation_id":"Sungguh, (agama tauhid) inilah agama kamu, agama yang satu, dan Aku adalah Tuhanmu, maka sembahlah Aku.","hasanah_per_verse":330},{"text_madani":"وَتَقَطَّعُوا أَمْرَهُم بَيْنَهُمْ ۖ كُلٌّ إِلَيْنَا رَاجِعُونَ","text_tajweed":"وَتَقَطَّع[o[ُوٓ][s[اْ] أَمْرَه[c:8517[ُم ب]َيْنَهُمْ‌ۖ كُلٌّ إِلَيْنَا ر[n[َٲ]جِع[p[ُو]نَ","translation_en":"And they broke their religion (into sects) between them: to Us shall all come back.","translation_id":"Tetapi mereka terpecah belah dalam urusan (agama) mereka di antara mereka. Masing-masing (golongan itu semua) akan kembali kepada Kami.","hasanah_per_verse":300},{"text_madani":"فَمَن يَعْمَلْ مِنَ الصَّالِحَاتِ وَهُوَ مُؤْمِنٌ فَلَا كُفْرَانَ لِسَعْيِهِ وَإِنَّا لَهُ كَاتِبُونَ","text_tajweed":"فَم[a:8855[َن ي]َعْمَلْ مِنَ [h:3154[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ وَهُوَ مُؤْمِ[f:8617[نٌ ف]َلَا كُفْرَانَ لِسَعْيِه[n[ِۦ] وَإِ[g[نّ]َا لَهُ[n[ۥ] كَ[n[ـٰ]تِب[p[ُو]نَ","translation_en":"Therefore whoever shall do of good deeds and he is a believer, there shall be no denying of his exertion, and surely We will write (It) down for him.","translation_id":"Barangsiapa mengerjakan kebajikan, dan dia beriman, maka usahanya tidak akan diingkari (disia-siakan), dan sungguh, Kamilah yang mencatat untuknya.","hasanah_per_verse":490},{"text_madani":"وَحَرَامٌ عَلَىٰ قَرْيَةٍ أَهْلَكْنَاهَا أَنَّهُمْ لَا يَرْجِعُونَ","text_tajweed":"وَحَر[n[َٲ]مٌ عَلَىٰ قَرْيَةٍ أَهْلَكْنَ[n[ـٰ]ه[o[َآ] أَ[g[نّ]َهُمْ لَا يَرْجِع[p[ُو]نَ","translation_en":"And it is binding on a town which We destroy that they shall not return.","translation_id":"Dan tidak mungkin bagi (penduduk) suatu negeri yang telah Kami binasakan, bahwa mereka tidak akan kembali (kepada Kami).","hasanah_per_verse":320},{"text_madani":"حَتَّىٰ إِذَا فُتِحَتْ يَأْجُوجُ وَمَأْجُوجُ وَهُم مِّن كُلِّ حَدَبٍ يَنسِلُونَ","text_tajweed":"حَتَّ[o[ىٰٓ] إِذَا فُتِحَتْ يَأْجُوجُ وَمَأْجُوجُ وَه[w:8717[ُم م]ِّ[f:843[ن ك]ُلِّ حَدَ[a:8856[بٍ ي]َ[f:8857[نس]ِل[p[ُو]نَ","translation_en":"Even when Gog and Magog are let loose and they shall break forth from every elevated place.","translation_id":"Hingga apabila (tembok) Yakjuj dan Makjuj dibukakan dan mereka turun dengan cepat dari seluruh tempat yang tinggi.","hasanah_per_verse":370},{"text_madani":"وَاقْتَرَبَ الْوَعْدُ الْحَقُّ فَإِذَا هِيَ شَاخِصَةٌ أَبْصَارُ الَّذِينَ كَفَرُوا يَا وَيْلَنَا قَدْ كُنَّا فِي غَفْلَةٍ مِّنْ هَٰذَا بَلْ كُنَّا ظَالِمِينَ","text_tajweed":"وَ[h:9999[ٱ][q:8858[قْ]تَرَبَ [h:8859[ٱ]لْوَعْدُ [h:8860[ٱ]لْحَقُّ فَإِذَا هِىَ شَ[n[ـٰ]خِصَةٌ أَ[q:8861[بْ]صَ[n[ـٰ]رُ [h:8862[ٱ]لَّذِينَ كَفَرُو[s[اْ] يَ[n[ـٰ]وَيْلَنَا قَ[q:298[دْ] كُ[g[نّ]َا فِى غَفْلَ[a:8863[ةٍ م]ِّنْ هَ[n[ـٰ]ذَا بَلْ كُ[g[نّ]َا ظَ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And the true promise shall draw nigh, then lo! the eyes of those who disbelieved shall be fixedly open: O woe to us! surely we were in a state of heedlessness as to this; nay, we were unjust.","translation_id":"Dan (apabila) janji yang benar (hari berbangkit) telah dekat, maka tiba-tiba mata orang-orang yang kafir terbelalak. (Mereka berkata), ”Alangkah celakanya kami! Kami benar-benar lengah tentang ini, bahkan kami benar-benar orang yang zhalim.”","hasanah_per_verse":750},{"text_madani":"إِنَّكُمْ وَمَا تَعْبُدُونَ مِن دُونِ اللَّهِ حَصَبُ جَهَنَّمَ أَنتُمْ لَهَا وَارِدُونَ","text_tajweed":"إِ[g[نّ]َكُمْ وَمَا تَعْبُدُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ حَصَبُ جَهَ[g[نّ]َمَ أَ[f:428[نت]ُمْ لَهَا و[n[َٲ]رِد[p[ُو]نَ","translation_en":"Surely you and what you worship besides Allah are the firewood of hell; to it you shall come.","translation_id":"Sungguh, kamu (orang kafir) dan apa yang kamu sembah selain Allah, adalah bahan bakar Jahanam. Kamu (pasti) masuk ke dalamnya.","hasanah_per_verse":420},{"text_madani":"لَوْ كَانَ هَٰؤُلَاءِ آلِهَةً مَّا وَرَدُوهَا ۖ وَكُلٌّ فِيهَا خَالِدُونَ","text_tajweed":"لَوْ كَانَ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ ءَالِهَ[a:8864[ةً م]َّا وَرَدُوهَا‌ۖ وَكُ[f:8865[لٌّ ف]ِيهَا خَ[n[ـٰ]لِد[p[ُو]نَ","translation_en":"Had these been gods, they would not have come to it and all shall abide therein.","translation_id":"Seandainya (berhala-berhala) itu tuhan, tentu mereka tidak akan memasukinya (neraka). Tetapi semuanya akan kekal di dalamnya.","hasanah_per_verse":350},{"text_madani":"لَهُمْ فِيهَا زَفِيرٌ وَهُمْ فِيهَا لَا يَسْمَعُونَ","text_tajweed":"لَهُمْ فِيهَا زَفِي[a:8866[رٌ و]َهُمْ فِيهَا لَا يَسْمَع[p[ُو]نَ","translation_en":"For them therein shall be groaning and therein they shall not hear.","translation_id":"Mereka merintih dan menjerit di dalamnya (neraka), dan mereka di dalamnya tidak dapat mendengar.","hasanah_per_verse":260},{"text_madani":"إِنَّ الَّذِينَ سَبَقَتْ لَهُم مِّنَّا الْحُسْنَىٰ أُولَٰئِكَ عَنْهَا مُبْعَدُونَ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ سَبَقَتْ لَه[w:8867[ُم م]ِّ[g[نّ]َا [h:8868[ٱ]لْحُسْنَ[o[ىٰٓ] أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ عَنْهَا مُ[q:8869[بْ]عَد[p[ُو]نَ","translation_en":"Surely (as for) those for whom the good has already gone forth from Us, they shall be kept far off from it;","translation_id":"Sungguh, sejak dahulu bagi orang-orang yang telah ada (ketetapan) yang baik dari Kami, mereka itu akan dijauhkan (dari neraka).","hasanah_per_verse":380},{"text_madani":"لَا يَسْمَعُونَ حَسِيسَهَا ۖ وَهُمْ فِي مَا اشْتَهَتْ أَنفُسُهُمْ خَالِدُونَ","text_tajweed":"لَا يَسْمَعُونَ حَسِيسَهَا‌ۖ وَهُمْ فِى مَا [h:8870[ٱ]شْتَهَتْ أَ[f:2341[نف]ُسُهُمْ خَ[n[ـٰ]لِد[p[ُو]نَ","translation_en":"They will not hear its faintest sound, and they shall abide in that which their souls long for.","translation_id":"Mereka tidak mendengar bunyi desis (api neraka), dan mereka kekal dalam (menikmati) semua yang mereka ingini.","hasanah_per_verse":380},{"text_madani":"لَا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ وَتَتَلَقَّاهُمُ الْمَلَائِكَةُ هَٰذَا يَوْمُكُمُ الَّذِي كُنتُمْ تُوعَدُونَ","text_tajweed":"لَا يَحْزُنُهُمُ [h:8871[ٱ]لْفَزَعُ [h:8872[ٱ]لْأَكْبَرُ وَتَتَلَقَّ[n[ـٰ]هُمُ [h:8873[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ هَ[n[ـٰ]ذَا يَوْمُكُمُ [h:8874[ٱ]لَّذِى كُ[f:100[نت]ُمْ تُوعَد[p[ُو]نَ","translation_en":"The great fearful event shall not grieve them, and the angels shall meet them: This is your day which you were promised.","translation_id":"Kejutan yang dahsyat tidak membuat mereka merasa sedih, dan para malaikat akan menyambut mereka (dengan ucapan), “Inilah harimu yang telah dijanjikan kepadamu.”","hasanah_per_verse":570},{"text_madani":"يَوْمَ نَطْوِي السَّمَاءَ كَطَيِّ السِّجِلِّ لِلْكُتُبِ ۚ كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُّعِيدُهُ ۚ وَعْدًا عَلَيْنَا ۚ إِنَّا كُنَّا فَاعِلِينَ","text_tajweed":"يَوْمَ نَ[q:8875[طْ]وِى [h:8876[ٱ][l[ل]سَّم[o[َا]ٓءَ كَطَىِّ [h:8877[ٱ][l[ل]سِّجِلِّ لِلْكُتُبِ‌ۚ كَمَا بَدَأْن[o[َآ] أَوَّلَ خَلْ[a:8878[قٍ ن]ُّعِيدُهُ[n[ۥ]‌ۚ وَعْدًا عَلَيْن[o[َآ‌ۚ] إِ[g[نّ]َا كُ[g[نّ]َا فَ[n[ـٰ]عِل[p[ِي]نَ","translation_en":"On the day when We will roll up heaven like the rolling up of the scroll for writings, as We originated the first creation, (so) We shall reproduce it; a promise (binding on Us); surely We will bring it about.","translation_id":"(Ingatlah) pada hari langit Kami gulung seperti menggulung lembaran-lembaran kertas. Sebagaimana Kami telah memulai penciptaan pertama, begitulah Kami akan mengulanginya lagi. (Suatu) janji yang pasti Kami tepati; sungguh, Kami akan melaksanakannya.","hasanah_per_verse":660},{"text_madani":"وَلَقَدْ كَتَبْنَا فِي الزَّبُورِ مِن بَعْدِ الذِّكْرِ أَنَّ الْأَرْضَ يَرِثُهَا عِبَادِيَ الصَّالِحُونَ","text_tajweed":"وَلَقَ[q:341[دْ] كَتَ[q:2889[بْ]نَا فِى [h:8879[ٱ][l[ل]زَّبُورِ م[i:146[ِنۢ ب]َعْدِ [h:8880[ٱ][l[ل]ذِّكْرِ أَ[g[نّ]َ [h:8881[ٱ]لْأَرْضَ يَرِثُهَا عِبَادِىَ [h:8882[ٱ][l[ل]صَّ[n[ـٰ]لِح[p[ُو]نَ","translation_en":"And certainly We wrote in the Book after the reminder that (as for) the land, My righteous servants shall inherit it.","translation_id":"Dan sungguh, telah Kami tulis di dalam Zabur setelah (tertulis) di dalam Adz-Dzikr (Lauh Mahfuzh), bahwa bumi ini akan diwarisi oleh hamba-hamba-Ku yang shalih.","hasanah_per_verse":520},{"text_madani":"إِنَّ فِي هَٰذَا لَبَلَاغًا لِّقَوْمٍ عَابِدِينَ","text_tajweed":"إِ[g[نّ]َ فِى هَ[n[ـٰ]ذَا لَبَلَ[n[ـٰ][u:8883[غًا ل]ِّقَوْمٍ عَ[n[ـٰ]بِد[p[ِي]نَ","translation_en":"Most surely in this is a message to a people who serve","translation_id":"Sungguh, (apa yang disebutkan) di dalam (Al-Qur'an) ini, benar-benar menjadi petunjuk (yang lengkap) bagi orang-orang yang menyembah (Allah).","hasanah_per_verse":230},{"text_madani":"وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِّلْعَالَمِينَ","text_tajweed":"وَم[o[َآ] أَرْسَلْنَ[n[ـٰ]كَ إِلَّا رَحْمَ[u:8884[ةً ل]ِّلْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"And We have not sent you but as a mercy to the worlds.","translation_id":"Dan Kami tidak mengutus engkau (Muhammad) melainkan untuk (menjadi) rahmat bagi seluruh alam.","hasanah_per_verse":250},{"text_madani":"قُلْ إِنَّمَا يُوحَىٰ إِلَيَّ أَنَّمَا إِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ ۖ فَهَلْ أَنتُم مُّسْلِمُونَ","text_tajweed":"قُلْ إِ[g[نّ]َمَا يُوحَ[o[ىٰٓ] إِلَىَّ أَ[g[نّ]َم[o[َآ] إِلَ[n[ـٰ]هُكُمْ إِلَ[n[ـٰ][a:827[هٌ و][n[َٲ]حِ[f:8885[دٌ‌ۖ ف]َهَلْ أَ[f:428[نت][w:2056[ُم م]ُّسْلِم[p[ُو]نَ","translation_en":"Say: It is only revealed to me that your Allah is one Allah; will you then submit?","translation_id":"Katakanlah (Muhammad), “Sungguh, apa yang diwahyukan kepadaku ialah bahwa Tuhanmu adalah Tuhan Yang Esa, maka apakah kamu telah berserah diri (kepada-Nya)?”","hasanah_per_verse":420},{"text_madani":"فَإِن تَوَلَّوْا فَقُلْ آذَنتُكُمْ عَلَىٰ سَوَاءٍ ۖ وَإِنْ أَدْرِي أَقَرِيبٌ أَم بَعِيدٌ مَّا تُوعَدُونَ","text_tajweed":"فَإِ[f:1857[ن ت]َوَلَّوْ[s[اْ] فَقُلْ ءَاذَ[f:8886[نت]ُكُمْ عَلَىٰ سَو[o[َا]ٓ[a:8887[ءٍ‌ۖ و]َإِنْ أَ[q:8888[دْ]ر[o[ِىٓ] أَقَرِيبٌ أ[c:8889[َم ب]َعِي[a:8890[دٌ م]َّا تُوعَد[p[ُو]نَ","translation_en":"But if they turn back, say: I have given you warning in fairness and I do not know whether what you are threatened with is near or far;","translation_id":"Maka jika mereka berpaling, maka katakanlah (Muhammad), “Aku telah menyampaikan kepadamu (ajaran) yang sama (antara kita) dan aku tidak tahu apakah yang diancamkan kepadamu itu sudah dekat atau masih jauh.”","hasanah_per_verse":500},{"text_madani":"إِنَّهُ يَعْلَمُ الْجَهْرَ مِنَ الْقَوْلِ وَيَعْلَمُ مَا تَكْتُمُونَ","text_tajweed":"إِ[g[نّ]َهُ[n[ۥ] يَعْلَمُ [h:8891[ٱ]لْجَهْرَ مِنَ [h:3107[ٱ]لْقَوْلِ وَيَعْلَمُ مَا تَكْتُم[p[ُو]نَ","translation_en":"Surely He knows what is spoken openly and He knows what you hide;","translation_id":"Sungguh, Dia (Allah) mengetahui perkataan (yang kamu ucapkan) dengan terang-terangan, dan mengetahui (pula) apa yang kamu rahasiakan.","hasanah_per_verse":320},{"text_madani":"وَإِنْ أَدْرِي لَعَلَّهُ فِتْنَةٌ لَّكُمْ وَمَتَاعٌ إِلَىٰ حِينٍ","text_tajweed":"وَإِنْ أَ[q:8888[دْ]رِى لَعَلَّهُ[n[ۥ] فِتْنَ[u:8892[ةٌ ل]َّكُمْ وَمَتَ[n[ـٰ]عٌ إِلَىٰ ح[p[ِي]نٍ","translation_en":"And I do not know if this may be a trial for you and a provision till a time.","translation_id":"Dan aku tidak tahu, boleh jadi hal itu cobaan bagi kamu dan kesenangan sampai waktu yang ditentukan.","hasanah_per_verse":290},{"text_madani":"قَالَ رَبِّ احْكُم بِالْحَقِّ ۗ وَرَبُّنَا الرَّحْمَٰنُ الْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ","text_tajweed":"قَ[n[ـٰ]لَ رَبِّ [h:8893[ٱ]حْك[c:8894[ُم ب]ِ[h:370[ٱ]لْحَقِّ‌ۗ وَرَبُّنَا [h:8895[ٱ][l[ل]رَّحْمَ[n[ـٰ]نُ [h:8896[ٱ]لْمُسْتَعَانُ عَلَىٰ مَا تَصِف[p[ُو]نَ","translation_en":"He said: O my Lord! judge Thou with truth; and our Lord is the Beneficent Allah, Whose help is sought against what you ascribe (to Him).","translation_id":"Dia (Muhammad) berkata, “Ya Tuhanku, berilah keputusan dengan adil. Dan Tuhan kami Maha Pengasih, tempat memohon segala pertolongan atas semua yang kamu katakan.”","hasanah_per_verse":430}]}
