{"chapter_number":8,"name_simple":"Al-Anfal","name_meaning":{"text":"The Spoils of War","en":"The Spoils of War","id":"Rampasan Perang"},"verses_count":75,"hasanah":53920,"verses":[{"text_madani":"يَسْأَلُونَكَ عَنِ الْأَنفَالِ ۖ قُلِ الْأَنفَالُ لِلَّهِ وَالرَّسُولِ ۖ فَاتَّقُوا اللَّهَ وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ ۖ وَأَطِيعُوا اللَّهَ وَرَسُولَهُ إِن كُنتُم مُّؤْمِنِينَ","text_tajweed":"يَسْــَٔلُونَكَ عَنِ [h:5228[ٱ]لْأَ[f:5229[نف]َالِ‌ۖ قُلِ [h:5230[ٱ]لْأَ[f:5231[نف]َالُ لِلَّهِ وَ[h:2421[ٱ][l[ل]رَّسُولِ‌ۖ فَ[h:112[ٱ]تَّقُو[s[اْ] [h:1945[ٱ]للَّهَ وَأَصْلِحُو[s[اْ] ذَاتَ بَيْنِكُمْ‌ۖ وَأَطِيعُو[s[اْ] [h:2238[ٱ]للَّهَ وَرَسُولَهُ[o[ۥٓ] إِ[f:109[ن ك]ُ[f:100[نت][w:482[ُم م]ُّؤْمِن[p[ِي]نَ","translation_en":"They ask you about the windfalls. Say: The windfalls are for Allah and the Messenger. So be careful of (your duty to) Allah and set aright matters of your difference, and obey Allah and His Messenger if you are believers.","translation_id":"Mereka menanyakan kepadamu (Muhammad) tentang (pembagian) harta rampasan perang. Katakanlah, “Harta rampasan perang itu milik Allah dan Rasul (menurut ketentuan Allah dan Rasul-Nya), maka bertakwalah kepada Allah dan perbaikilah hubungan di antara sesamamu, dan taatlah kepada Allah dan Rasul-Nya jika kamu orang-orang yang beriman.”","hasanah_per_verse":890},{"text_madani":"إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَإِذَا تُلِيَتْ عَلَيْهِمْ آيَاتُهُ زَادَتْهُمْ إِيمَانًا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ","text_tajweed":"إِ[g[نّ]َمَا [h:5232[ٱ]لْمُؤْمِنُونَ [h:5233[ٱ]لَّذِينَ إِذَا ذُكِرَ [h:5234[ٱ]للَّهُ وَجِلَتْ قُلُوبُهُمْ وَإِذَا تُلِيَتْ عَلَيْهِمْ ءَايَ[n[ـٰ]تُهُ[n[ۥ] زَادَتْهُمْ إِيمَ[n[ـٰ][a:5235[نًا و]َعَلَىٰ رَبِّهِمْ يَتَوَكَّل[p[ُو]نَ","translation_en":"Those only are believers whose hearts become full of fear when Allah is mentioned, and when His communications are recited to them they increase them in faith, and in their Lord do they trust.","translation_id":"Sesungguhnya orang-orang yang beriman adalah mereka yang apabila disebut nama Allah gemetar hatinya, dan apabila dibacakan ayat-ayat-Nya kepada mereka, bertambah (kuat) imannya dan hanya kepada Tuhan mereka bertawakal,","hasanah_per_verse":820},{"text_madani":"الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ","text_tajweed":"ٱلَّذِينَ يُقِيمُونَ [h:3638[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ وَمِ[g[مّ]َا رَزَ[q:15[قْ]نَ[n[ـٰ]هُمْ يُ[f:16[نف]ِق[p[ُو]نَ","translation_en":"Those who keep up prayer and spend (benevolently) out of what We have given them.","translation_id":"(Yaitu) orang-orang yang melaksanakan shalat dan yang menginfakkan sebagian dari rezeki yang Kami berikan kepada mereka.","hasanah_per_verse":340},{"text_madani":"أُولَٰئِكَ هُمُ الْمُؤْمِنُونَ حَقًّا ۚ لَّهُمْ دَرَجَاتٌ عِندَ رَبِّهِمْ وَمَغْفِرَةٌ وَرِزْقٌ كَرِيمٌ","text_tajweed":"أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:5236[ٱ]لْمُؤْمِنُونَ حَق[u:5237[ًّا‌ۚ ل]َّهُمْ دَرَجَ[n[ـٰ]تٌ عِ[f:264[ند]َ رَبِّهِمْ وَمَغْفِرَ[a:5238[ةٌ و]َرِزْ[f:5239[قٌ ك]َر[p[ِي]مٌ","translation_en":"These are the believers in truth; they shall have from their Lord exalted grades and forgiveness and an honorable sustenance.","translation_id":"Mereka itulah orang-orang yang benar-benar beriman. Mereka akan memperoleh derajat (tinggi) di sisi Tuhannya dan ampunan serta rezeki (nikmat) yang mulia.","hasanah_per_verse":470},{"text_madani":"كَمَا أَخْرَجَكَ رَبُّكَ مِن بَيْتِكَ بِالْحَقِّ وَإِنَّ فَرِيقًا مِّنَ الْمُؤْمِنِينَ لَكَارِهُونَ","text_tajweed":"كَم[o[َآ] أَخْرَجَكَ رَبُّكَ م[i:5240[ِنۢ ب]َيْتِكَ بِ[h:370[ٱ]لْحَقِّ وَإِ[g[نّ]َ فَرِي[a:2128[قًا م]ِّنَ [h:3047[ٱ]لْمُؤْمِنِينَ لَكَ[n[ـٰ]رِه[p[ُو]نَ","translation_en":"Even as your Lord caused you to go forth from your house with the truth, though a party of the believers were surely averse;","translation_id":"Sebagaimana Tuhanmu menyuruhmu pergi dari rumahmu dengan kebenaran, meskipun sesungguhnya sebagian dari orang-orang yang beriman itu tidak menyukainya,","hasanah_per_verse":470},{"text_madani":"يُجَادِلُونَكَ فِي الْحَقِّ بَعْدَمَا تَبَيَّنَ كَأَنَّمَا يُسَاقُونَ إِلَى الْمَوْتِ وَهُمْ يَنظُرُونَ","text_tajweed":"يُجَ[n[ـٰ]دِلُونَكَ فِى [h:5241[ٱ]لْحَقِّ بَعْدَ مَا تَبَيَّنَ كَأَ[g[نّ]َمَا يُسَاقُونَ إِلَى [h:5242[ٱ]لْمَوْتِ وَهُمْ يَ[f:1141[نظ]ُر[p[ُو]نَ","translation_en":"They disputed with you about the truth after it had become clear, (and they went forth) as if they were being driven to death while they saw (it).","translation_id":"mereka membantahmu (Muhammad) tentang kebenaran setelah nyata (bahwa mereka pasti menang), seakan-akan mereka dihalau kepada kematian, sedang mereka melihat (sebab kematian itu).","hasanah_per_verse":560},{"text_madani":"وَإِذْ يَعِدُكُمُ اللَّهُ إِحْدَى الطَّائِفَتَيْنِ أَنَّهَا لَكُمْ وَتَوَدُّونَ أَنَّ غَيْرَ ذَاتِ الشَّوْكَةِ تَكُونُ لَكُمْ وَيُرِيدُ اللَّهُ أَن يُحِقَّ الْحَقَّ بِكَلِمَاتِهِ وَيَقْطَعَ دَابِرَ الْكَافِرِينَ","text_tajweed":"وَإِذْ يَعِدُكُمُ [h:5243[ٱ]للَّهُ إِحْدَى [h:5244[ٱ][l[ل]طّ[o[َا]ٓئِفَتَيْنِ أَ[g[نّ]َهَا لَكُمْ وَتَوَدُّونَ أَ[g[نّ]َ غَيْرَ ذَاتِ [h:5245[ٱ][l[ل]شَّوْكَةِ تَكُونُ لَكُمْ وَيُرِيدُ [h:5246[ٱ]للَّهُ أ[a:5247[َن ي]ُحِقَّ [h:5248[ٱ]لْحَقَّ بِكَلِمَ[n[ـٰ]تِه[n[ِۦ] وَيَ[q:5249[قْ]طَعَ دَابِرَ [h:5250[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"And when Allah promised you one of the two parties that it shall be yours and you loved that the one not armed should he yours and Allah desired to manifest the truth of what was true by His words and to cut off the root of the unbelievers.","translation_id":"Dan (ingatlah) ketika Allah menjanjikan kepadamu bahwa salah satu dari dua golongan (yang kamu hadapi) adalah untukmu, sedang kamu menginginkan bahwa yang tidak mempunyai kekuatan senjatalah untukmu. Tetapi Allah hendak membenarkan yang benar dengan ayat-ayat-Nya dan memusnahkan orang-orang kafir sampai ke akar-akarnya,","hasanah_per_verse":1010},{"text_madani":"لِيُحِقَّ الْحَقَّ وَيُبْطِلَ الْبَاطِلَ وَلَوْ كَرِهَ الْمُجْرِمُونَ","text_tajweed":"لِيُحِقَّ [h:5251[ٱ]لْحَقَّ وَيُ[q:5252[بْ]طِلَ [h:5253[ٱ]لْبَ[n[ـٰ]طِلَ وَلَوْ كَرِهَ [h:5254[ٱ]لْمُ[q:5255[جْ]رِم[p[ُو]نَ","translation_en":"That He may manifest the truth of what was true and show the falsehood of what was false, though the guilty disliked.","translation_id":"agar Allah memperkuat yang hak (Islam) dan menghilangkan yang batil (syirik) walaupun orang-orang yang berdosa (musyrik) itu tidak menyukainya.","hasanah_per_verse":330},{"text_madani":"إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ أَنِّي مُمِدُّكُم بِأَلْفٍ مِّنَ الْمَلَائِكَةِ مُرْدِفِينَ","text_tajweed":"إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَ[h:5256[ٱ]سْتَجَابَ لَكُمْ أَ[g[نّ]ِى مُمِدُّك[c:5257[ُم ب]ِأَلْ[a:5258[فٍ م]ِّنَ [h:2217[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةِ مُرْدِف[p[ِي]نَ","translation_en":"When you sought aid from your Lord, so He answered you: I will assist you with a thousand of the angels following one another.","translation_id":"(Ingatlah), ketika kamu memohon pertolongan kepada Tuhanmu, lalu diperkenankan-Nya bagimu, “Sungguh, Aku akan mendatangkan bala bantuan kepadamu dengan seribu malaikat yang datang berturut-turut.”","hasanah_per_verse":520},{"text_madani":"وَمَا جَعَلَهُ اللَّهُ إِلَّا بُشْرَىٰ وَلِتَطْمَئِنَّ بِهِ قُلُوبُكُمْ ۚ وَمَا النَّصْرُ إِلَّا مِنْ عِندِ اللَّهِ ۚ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ","text_tajweed":"وَمَا جَعَلَهُ [h:2224[ٱ]للَّهُ إِلَّا بُشْرَىٰ وَلِتَ[q:2225[طْ]مَئِ[g[نّ]َ بِه[n[ِۦ] قُلُوبُكُمْ‌ۚ وَمَا [h:2227[ٱ][l[ل][g[نّ]َصْرُ إِلَّا مِنْ عِ[f:398[ند]ِ [h:399[ٱ]للَّهِ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَزِيزٌ حَك[p[ِي]مٌ","translation_en":"And Allah only gave it as a good news and that your hearts might be at ease thereby; and victory is only from Allah; surely Allah is Mighty, Wise.","translation_id":"Dan tidaklah Allah menjadikannya melainkan sebagai kabar gembira agar hatimu menjadi tenteram karenanya. Dan kemenangan itu hanyalah dari sisi Allah. Sungguh, Allah Mahaperkasa, Mahabijaksana.","hasanah_per_verse":670},{"text_madani":"إِذْ يُغَشِّيكُمُ النُّعَاسَ أَمَنَةً مِّنْهُ وَيُنَزِّلُ عَلَيْكُم مِّنَ السَّمَاءِ مَاءً لِّيُطَهِّرَكُم بِهِ وَيُذْهِبَ عَنكُمْ رِجْزَ الشَّيْطَانِ وَلِيَرْبِطَ عَلَىٰ قُلُوبِكُمْ وَيُثَبِّتَ بِهِ الْأَقْدَامَ","text_tajweed":"إِذْ يُغَشِّيكُمُ [h:5259[ٱ][l[ل][g[نّ]ُعَاسَ أَمَنَ[a:5260[ةً م]ِّنْهُ وَيُنَزِّلُ عَلَيْك[w:1301[ُم م]ِّنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ م[o[َا]ٓ[u:5261[ءً ل]ِّيُطَهِّرَك[c:5262[ُم ب]ِه[n[ِۦ] وَيُذْهِبَ عَ[f:255[نك]ُمْ رِ[q:5263[جْ]زَ [h:5264[ٱ][l[ل]شَّيْطَ[n[ـٰ]نِ وَلِيَرْبِطَ عَلَىٰ قُلُوبِكُمْ وَيُثَبِّتَ بِهِ [h:5265[ٱ]لْأَ[q:5266[قْ]د[p[َا]مَ","translation_en":"When He caused calm to fall on you as a security from Him and sent down upon you water from the cloud that He might thereby purify you, and take away from you the uncleanness of the Shaitan, and that He might fortify your hearts and steady (your) footsteps thereby.","translation_id":"(Ingatlah), ketika Allah membuat kamu mengantuk untuk memberi ketenteraman dari-Nya, dan Allah menurunkan air (hujan) dari langit kepadamu untuk menyucikan kamu dengan (hujan) itu dan menghilangkan gangguan-gangguan setan dari dirimu dan untuk menguatkan hatimu serta memperteguh telapak kakimu (teguh pendirian).","hasanah_per_verse":990},{"text_madani":"إِذْ يُوحِي رَبُّكَ إِلَى الْمَلَائِكَةِ أَنِّي مَعَكُمْ فَثَبِّتُوا الَّذِينَ آمَنُوا ۚ سَأُلْقِي فِي قُلُوبِ الَّذِينَ كَفَرُوا الرُّعْبَ فَاضْرِبُوا فَوْقَ الْأَعْنَاقِ وَاضْرِبُوا مِنْهُمْ كُلَّ بَنَانٍ","text_tajweed":"إِذْ يُوحِى رَبُّكَ إِلَى [h:5267[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةِ أَ[g[نّ]ِى مَعَكُمْ فَثَبِّتُو[s[اْ] [h:5268[ٱ]لَّذِينَ ءَامَنُو[s[اْ‌ۚ] سَأُلْقِى فِى قُلُوبِ [h:2312[ٱ]لَّذِينَ كَفَرُو[s[اْ] [h:2313[ٱ][l[ل]رُّعْبَ فَ[h:5269[ٱ]ضْرِبُو[s[اْ] فَوْقَ [h:5270[ٱ]لْأَعْنَاقِ وَ[h:5271[ٱ]ضْرِبُو[s[اْ] مِنْهُمْ كُلَّ بَن[p[َا]نٍ","translation_en":"When your Lord revealed to the angels: I am with you, therefore make firm those who believe. I will cast terror into the hearts of those who disbelieve. Therefore strike off their heads and strike off every fingertip of them.","translation_id":"(Ingatlah), ketika Tuhanmu mewahyukan kepada para malaikat, “Sesungguhnya Aku bersama kamu, maka teguhkanlah (pendirian) orang-orang yang telah beriman.” Kelak akan Aku berikan rasa ketakutan ke dalam hati orang-orang kafir, maka pukullah di atas leher mereka dan pukullah tiap-tiap ujung jari mereka.","hasanah_per_verse":1030},{"text_madani":"ذَٰلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ ۚ وَمَن يُشَاقِقِ اللَّهَ وَرَسُولَهُ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ","text_tajweed":"ذ[n[َٲ]لِكَ بِأَ[g[نّ]َهُمْ ش[m[َا]ٓقُّو[s[اْ] [h:5272[ٱ]للَّهَ وَرَسُولَهُ[n[ۥ]‌ۚ وَم[a:3131[َن ي]ُشَاقِقِ [h:5273[ٱ]للَّهَ وَرَسُولَهُ[n[ۥ] فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ شَدِيدُ [h:1075[ٱ]لْعِق[p[َا][q[ب]ِ","translation_en":"This is because they acted adversely to Allah and His Messenger; and whoever acts adversely to Allah and His Messenger-- then surely Allah is severe in requiting (evil).","translation_id":"(Ketentuan) yang demikian itu adalah karena sesungguhnya mereka menentang Allah dan Rasul-Nya; dan barangsiapa menentang Allah dan Rasul-Nya, sungguh, Allah sangat keras siksa-Nya.","hasanah_per_verse":580},{"text_madani":"ذَٰلِكُمْ فَذُوقُوهُ وَأَنَّ لِلْكَافِرِينَ عَذَابَ النَّارِ","text_tajweed":"ذ[n[َٲ]لِكُمْ فَذُوقُوهُ وَأَ[g[نّ]َ لِلْكَ[n[ـٰ]فِرِينَ عَذَابَ [h:1110[ٱ][l[ل][g[نّ][p[َا]رِ","translation_en":"This-- taste it, and (know) that for the unbelievers is the chastisement of fire.","translation_id":"Demikianlah (hukuman dunia yang ditimpakan atasmu), maka rasakanlah hukuman itu. Sesungguhnya bagi orang-orang kafir ada (lagi) azab neraka.","hasanah_per_verse":300},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا لَقِيتُمُ الَّذِينَ كَفَرُوا زَحْفًا فَلَا تُوَلُّوهُمُ الْأَدْبَارَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِذَا لَقِيتُمُ [h:5274[ٱ]لَّذِينَ كَفَرُو[s[اْ] زَحْ[f:5275[فًا ف]َلَا تُوَلُّوهُمُ [h:5276[ٱ]لْأَ[q:2168[دْ]ب[p[َا]رَ","translation_en":"O you who believe! when you meet those who disbelieve marching for war, then turn not your backs to them.","translation_id":"Wahai orang yang beriman! Apabila kamu bertemu dengan orang-orang kafir yang akan menyerangmu, maka janganlah kamu berbalik membelakangi mereka (mundur).","hasanah_per_verse":540},{"text_madani":"وَمَن يُوَلِّهِمْ يَوْمَئِذٍ دُبُرَهُ إِلَّا مُتَحَرِّفًا لِّقِتَالٍ أَوْ مُتَحَيِّزًا إِلَىٰ فِئَةٍ فَقَدْ بَاءَ بِغَضَبٍ مِّنَ اللَّهِ وَمَأْوَاهُ جَهَنَّمُ ۖ وَبِئْسَ الْمَصِيرُ","text_tajweed":"وَم[a:5277[َن ي]ُوَلِّهِمْ يَوْمَئِ[f:5278[ذٍ د]ُبُرَهُ[o[ۥٓ] إِلَّا مُتَحَرِّ[u:5279[فًا ل]ِّقِتَالٍ أَوْ مُتَحَيِّزًا إِلَىٰ فِئَ[f:5280[ةٍ ف]َقَ[q:563[دْ] ب[o[َا]ٓءَ بِغَضَ[a:320[بٍ م]ِّنَ [h:321[ٱ]للَّهِ وَمَأْوَ[n[ٮٰ]هُ جَهَ[g[نّ]َمُ‌ۖ وَبِئْسَ [h:665[ٱ]لْمَص[p[ِي]رُ","translation_en":"And whoever shall turn his back to them on that day-- unless he turn aside for the sake of fighting or withdraws to a company-- then he, indeed, becomes deserving of Allah's wrath, and his abode is hell; and an evil destination shall it be.","translation_id":"Dan barangsiapa mundur pada waktu itu, kecuali berbelok untuk (siasat) perang atau hendak menggabungkan diri dengan pasukan yang lain, maka sungguh, orang itu kembali dengan membawa kemurkaan dari Allah, dan tempatnya ialah neraka Jahanam, seburuk-buruk tempat kembali.","hasanah_per_verse":810},{"text_madani":"فَلَمْ تَقْتُلُوهُمْ وَلَٰكِنَّ اللَّهَ قَتَلَهُمْ ۚ وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَٰكِنَّ اللَّهَ رَمَىٰ ۚ وَلِيُبْلِيَ الْمُؤْمِنِينَ مِنْهُ بَلَاءً حَسَنًا ۚ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ","text_tajweed":"فَلَمْ تَ[q:5281[قْ]تُلُوهُمْ وَلَ[n[ـٰ]كِ[g[نّ]َ [h:1441[ٱ]للَّهَ قَتَلَهُمْ‌ۚ وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَ[n[ـٰ]كِ[g[نّ]َ [h:1441[ٱ]للَّهَ رَمَىٰ‌ۚ وَلِيُ[q:5282[بْ]لِىَ [h:5283[ٱ]لْمُؤْمِنِينَ مِنْهُ بَل[o[َا]ٓءً حَسَنًا‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ سَمِيعٌ عَل[p[ِي]مٌ","translation_en":"So you did not slay them, but it was Allah Who slew them, and you did not smite when you smote (the enemy), but it was Allah Who smote, and that He might confer upon the believers a good gift from Himself; surely Allah is Hearing, Knowing.","translation_id":"Maka (sebenarnya) bukan kamu yang membunuh mereka, melainkan Allah yang membunuh mereka, dan bukan engkau yang melempar ketika engkau melempar, tetapi Allah yang melempar. (Allah berbuat demikian untuk membinasakan mereka) dan untuk memberi kemenangan kepada orang-orang mukmin, dengan kemenangan yang baik. Sungguh, Allah Maha Mendengar, Maha Mengetahui.","hasanah_per_verse":860},{"text_madani":"ذَٰلِكُمْ وَأَنَّ اللَّهَ مُوهِنُ كَيْدِ الْكَافِرِينَ","text_tajweed":"ذ[n[َٲ]لِكُمْ وَأَ[g[نّ]َ [h:859[ٱ]للَّهَ مُوهِنُ كَيْدِ [h:5284[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"This, and that Allah is the weakener of the struggle of the unbelievers.","translation_id":"Demikianlah (karunia Allah yang dilimpahkan kepadamu), dan sungguh, Allah melemahkan tipu daya orang-orang kafir.","hasanah_per_verse":260},{"text_madani":"إِن تَسْتَفْتِحُوا فَقَدْ جَاءَكُمُ الْفَتْحُ ۖ وَإِن تَنتَهُوا فَهُوَ خَيْرٌ لَّكُمْ ۖ وَإِن تَعُودُوا نَعُدْ وَلَن تُغْنِيَ عَنكُمْ فِئَتُكُمْ شَيْئًا وَلَوْ كَثُرَتْ وَأَنَّ اللَّهَ مَعَ الْمُؤْمِنِينَ","text_tajweed":"إِ[f:5285[ن ت]َسْتَفْتِحُو[s[اْ] فَقَ[q:563[دْ] ج[o[َا]ٓءَكُمُ [h:5286[ٱ]لْفَتْحُ‌ۖ وَإِ[f:5287[ن ت]َ[f:5288[نت]َهُو[s[اْ] فَهُوَ خَيْ[u:263[رٌ ل]َّكُمْ‌ۖ وَإِ[f:5289[ن ت]َعُودُو[s[اْ] نَعُ[q:5290[دْ] وَلَ[f:5291[ن ت]ُغْنِىَ عَ[f:255[نك]ُمْ فِئَتُكُمْ شَيْـ[a:5292[ـًٔا و]َلَوْ كَثُرَتْ وَأَ[g[نّ]َ [h:859[ٱ]للَّهَ مَعَ [h:3234[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"If you demanded a judgment, the judgment has then indeed come to you; and if you desist, it will be better for you; and if you turn back (to fight), We (too) shall turn back, and your forces shall avail you nothing, though they may be many, and (know) that Allah is with the believers.","translation_id":"Jika kamu meminta keputusan, maka sesungguhnya keputusan telah datang kepadamu; dan jika kamu berhenti (memusuhi Rasul), maka itulah yang lebih baik bagimu; dan jika kamu kembali, niscaya Kami kembali (memberi pertolongan); dan pasukanmu tidak akan dapat menolak sesuatu bahaya sedikit pun darimu, biarpun dia jumlahnya (pasukan) banyak. Sungguh, Allah beserta orang-orang beriman.","hasanah_per_verse":970},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَوَلَّوْا عَنْهُ وَأَنتُمْ تَسْمَعُونَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] أَطِيعُو[s[اْ] [h:1855[ٱ]للَّهَ وَرَسُولَهُ[n[ۥ] وَلَا تَوَلَّوْ[s[اْ] عَنْهُ وَأَ[f:98[نت]ُمْ تَسْمَع[p[ُو]نَ","translation_en":"O you who believe! obey Allah and His Messenger and do not turn back from Him while you hear.","translation_id":"Wahai orang-orang yang beriman! Taatlah kepada Allah dan Rasul-Nya, dan janganlah kamu berpaling dari-Nya, padahal kamu mendengar (perintah-perintah-Nya),","hasanah_per_verse":540},{"text_madani":"وَلَا تَكُونُوا كَالَّذِينَ قَالُوا سَمِعْنَا وَهُمْ لَا يَسْمَعُونَ","text_tajweed":"وَلَا تَكُونُو[s[اْ] كَ[h:2146[ٱ]لَّذِينَ قَالُو[s[اْ] سَمِعْنَا وَهُمْ لَا يَسْمَع[p[ُو]نَ","translation_en":"And be not like those who said, We hear, and they did not obey.","translation_id":"dan janganlah kamu menjadi seperti orang-orang (munafik) yang berkata, “Kami mendengarkan,” padahal mereka tidak mendengarkan (karena hati mereka mengingkarinya).","hasanah_per_verse":360},{"text_madani":"إِنَّ شَرَّ الدَّوَابِّ عِندَ اللَّهِ الصُّمُّ الْبُكْمُ الَّذِينَ لَا يَعْقِلُونَ","text_tajweed":"۞ إِ[g[نّ]َ شَرَّ [h:5293[ٱ][l[ل]دَّو[m[َا]ٓبِّ عِ[f:264[ند]َ [h:408[ٱ]للَّهِ [h:5294[ٱ][l[ل]صُّ[g[مّ]ُ [h:5295[ٱ]لْبُكْمُ [h:5296[ٱ]لَّذِينَ لَا يَعْقِل[p[ُو]نَ","translation_en":"Surely the vilest of animals, in Allah's sight, are the deaf, the dumb, who do not understand.","translation_id":"Sesungguhnya makhluk bergerak yang bernyawa yang paling buruk dalam pandangan Allah ialah mereka yang tuli dan bisu (tidak mendengar dan memahami kebenaran) yaitu orang-orang yang tidak mengerti.","hasanah_per_verse":390},{"text_madani":"وَلَوْ عَلِمَ اللَّهُ فِيهِمْ خَيْرًا لَّأَسْمَعَهُمْ ۖ وَلَوْ أَسْمَعَهُمْ لَتَوَلَّوا وَّهُم مُّعْرِضُونَ","text_tajweed":"وَلَوْ عَلِمَ [h:986[ٱ]للَّهُ فِيهِمْ خَيْ[u:5297[رًا ل]َّأَسْمَعَهُمْ‌ۖ وَلَوْ أَسْمَعَهُمْ لَتَوَلَّو[s[اْ] وَّه[w:1817[ُم م]ُّعْرِض[p[ُو]نَ","translation_en":"And if Allah had known any good in them He would have made them hear, and if He makes them hear they would turn back while they withdraw.","translation_id":"Dan sekiranya Allah mengetahui ada kebaikan pada mereka, tentu Dia jadikan mereka dapat mendengar. Dan jika Allah menjadikan mereka dapat mendengar, niscaya mereka berpaling, sedang mereka memalingkan diri.","hasanah_per_verse":490},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ ۖ وَاعْلَمُوا أَنَّ اللَّهَ يَحُولُ بَيْنَ الْمَرْءِ وَقَلْبِهِ وَأَنَّهُ إِلَيْهِ تُحْشَرُونَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] [h:5298[ٱ]سْتَجِيبُو[s[اْ] لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ‌ۖ وَ[h:1043[ٱ]عْلَم[o[ُوٓ][s[اْ] أَ[g[نّ]َ [h:394[ٱ]للَّهَ يَحُولُ بَيْنَ [h:532[ٱ]لْمَرْءِ وَقَلْبِه[n[ِۦ] وَأَ[g[نّ]َهُ[o[ۥٓ] إِلَيْهِ تُحْشَر[p[ُو]نَ","translation_en":"O you who believe! answer (the call of) Allah and His Messenger when he calls you to that which gives you life; and know that Allah intervenes between man and his heart, and that to Him you shall be gathered.","translation_id":"Wahai orang-orang yang beriman! Penuhilah seruan Allah dan Rasul, apabila dia menyerumu kepada sesuatu yang memberi kehidupan kepadamu, dan ketahuilah bahwa sesungguhnya Allah membatasi antara manusia dan hatinya dan sesungguhnya kepada-Nyalah kamu akan dikumpulkan.","hasanah_per_verse":950},{"text_madani":"وَاتَّقُوا فِتْنَةً لَّا تُصِيبَنَّ الَّذِينَ ظَلَمُوا مِنكُمْ خَاصَّةً ۖ وَاعْلَمُوا أَنَّ اللَّهَ شَدِيدُ الْعِقَابِ","text_tajweed":"وَ[h:9999[ٱ]تَّقُو[s[اْ] فِتْنَ[u:5299[ةً ل]َّا تُصِيبَ[g[نّ]َ [h:5300[ٱ]لَّذِينَ ظَلَمُو[s[اْ] مِ[f:344[نك]ُمْ خ[m[َا]ٓصَّ[a:5301[ةً‌ۖ و]َ[h:1043[ٱ]عْلَم[o[ُوٓ][s[اْ] أَ[g[نّ]َ [h:394[ٱ]للَّهَ شَدِيدُ [h:1075[ٱ]لْعِق[p[َا][q[ب]ِ","translation_en":"And fear an affliction which may not smite those of you in particular who are unjust; and know that Allah is severe in requiting (evil).","translation_id":"Dan peliharalah dirimu dari siksaan yang tidak hanya menimpa orang-orang yang zhalim saja di antara kamu. Ketahuilah bahwa Allah sangat keras siksa-Nya.","hasanah_per_verse":580},{"text_madani":"وَاذْكُرُوا إِذْ أَنتُمْ قَلِيلٌ مُّسْتَضْعَفُونَ فِي الْأَرْضِ تَخَافُونَ أَن يَتَخَطَّفَكُمُ النَّاسُ فَآوَاكُمْ وَأَيَّدَكُم بِنَصْرِهِ وَرَزَقَكُم مِّنَ الطَّيِّبَاتِ لَعَلَّكُمْ تَشْكُرُونَ","text_tajweed":"وَ[h:9999[ٱ]ذْكُر[o[ُوٓ][s[اْ] إِذْ أَ[f:428[نت]ُمْ قَلِي[a:5302[لٌ م]ُّسْتَضْعَفُونَ فِى [h:44[ٱ]لْأَرْضِ تَخَافُونَ أ[a:5303[َن ي]َتَخَطَّفَكُمُ [h:5304[ٱ][l[ل][g[نّ]َاسُ فَـَٔـاوَ[n[ٮٰ]كُمْ وَأَيَّدَك[c:5305[ُم ب]ِنَصْرِه[n[ِۦ] وَرَزَقَك[w:5306[ُم م]ِّنَ [h:5307[ٱ][l[ل]طَّيِّبَ[n[ـٰ]تِ لَعَلَّكُمْ تَشْكُر[p[ُو]نَ","translation_en":"And remember when you were few, deemed weak in the land, fearing lest people might carry you off by force, but He sheltered you and strengthened you with His aid and gave you of the good things that you may give thanks.","translation_id":"Dan ingatlah ketika kamu (para Muhajirin) masih (berjumlah) sedikit, lagi tertindas di bumi (Mekah), dan kamu takut orang-orang (Mekah) akan menculik kamu, maka Dia memberi kamu tempat menetap (Madinah) dan dijadikan-Nya kamu kuat dengan pertolongan-Nya dan diberi-Nya kamu rezeki yang baik agar kamu bersyukur.","hasanah_per_verse":950},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَخُونُوا اللَّهَ وَالرَّسُولَ وَتَخُونُوا أَمَانَاتِكُمْ وَأَنتُمْ تَعْلَمُونَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] لَا تَخُونُو[s[اْ] [h:5308[ٱ]للَّهَ وَ[h:1856[ٱ][l[ل]رَّسُولَ وَتَخُون[o[ُوٓ][s[اْ] أَمَ[n[ـٰ]نَ[n[ـٰ]تِكُمْ وَأَ[f:98[نت]ُمْ تَعْلَم[p[ُو]نَ","translation_en":"O you who believe! be not unfaithful to Allah and the Messenger, nor be unfaithful to your trusts while you know.","translation_id":"Wahai orang-orang yang beriman! Janganlah kamu mengkhianati Allah dan Rasul dan (juga) janganlah kamu mengkhianati amanat yang dipercayakan kepadamu, sedang kamu mengetahui.","hasanah_per_verse":610},{"text_madani":"وَاعْلَمُوا أَنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ وَأَنَّ اللَّهَ عِندَهُ أَجْرٌ عَظِيمٌ","text_tajweed":"وَ[h:9999[ٱ]عْلَم[o[ُوٓ][s[اْ] أَ[g[نّ]َم[o[َآ] أَمْو[n[َٲ]لُكُمْ وَأَوْلَ[n[ـٰ]دُكُمْ فِتْنَ[a:5309[ةٌ و]َأَ[g[نّ]َ [h:859[ٱ]للَّهَ عِ[f:719[ند]َهُ[o[ۥٓ] أَ[q:2423[جْ]رٌ عَظ[p[ِي]مٌ","translation_en":"And know that your property and your children are a temptation, and that Allah is He with Whom there is a mighty reward.","translation_id":"Dan ketahuilah bahwa hartamu dan anak-anakmu itu hanyalah sebagai cobaan dan sesungguhnya di sisi Allah ada pahala yang besar.","hasanah_per_verse":480},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِن تَتَّقُوا اللَّهَ يَجْعَل لَّكُمْ فُرْقَانًا وَيُكَفِّرْ عَنكُمْ سَيِّئَاتِكُمْ وَيَغْفِرْ لَكُمْ ۗ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِ[f:5310[ن ت]َتَّقُو[s[اْ] [h:5311[ٱ]للَّهَ يَ[q:4397[جْ]عَل لَّكُمْ فُرْقَا[a:5312[نًا و]َيُكَفِّرْ عَ[f:255[نك]ُمْ سَيِّـَٔـاتِكُمْ وَيَغْفِرْ لَكُمْ‌ۗ وَ[h:72[ٱ]للَّهُ ذُو [h:550[ٱ]لْفَضْلِ [h:551[ٱ]لْعَظ[p[ِي]مِ","translation_en":"O you who believe! If you are careful of (your duty to) Allah, He will grant you a distinction and do away with your evils and forgive you; and Allah is the Lord of mighty grace.","translation_id":"Wahai orang-orang yang beriman! Jika kamu bertakwa kepada Allah, niscaya Dia akan memberikan furqan (kemampuan membedakan antara yang hak dan batil) kepadamu dan menghapus segala kesalahanmu dan mengampuni (dosa-dosa)mu. Allah memiliki karunia yang besar.","hasanah_per_verse":820},{"text_madani":"وَإِذْ يَمْكُرُ بِكَ الَّذِينَ كَفَرُوا لِيُثْبِتُوكَ أَوْ يَقْتُلُوكَ أَوْ يُخْرِجُوكَ ۚ وَيَمْكُرُونَ وَيَمْكُرُ اللَّهُ ۖ وَاللَّهُ خَيْرُ الْمَاكِرِينَ","text_tajweed":"وَإِذْ يَمْكُرُ بِكَ [h:5313[ٱ]لَّذِينَ كَفَرُو[s[اْ] لِيُثْبِتُوكَ أَوْ يَ[q:5314[قْ]تُلُوكَ أَوْ يُخْرِجُوكَ‌ۚ وَيَمْكُرُونَ وَيَمْكُرُ [h:5315[ٱ]للَّهُ‌ۖ وَ[h:72[ٱ]للَّهُ خَيْرُ [h:1960[ٱ]لْمَ[n[ـٰ]كِر[p[ِي]نَ","translation_en":"And when those who disbelieved devised plans against you that they might confine you or slay you or drive you away; and they devised plans and Allah too had arranged a plan; and Allah is the best of planners.","translation_id":"Dan (ingatlah), ketika orang-orang kafir (Quraisy) memikirkan tipu daya terhadapmu (Muhammad) untuk menangkap dan memenjarakanmu atau membunuhmu, atau mengusirmu. Mereka membuat tipu daya dan Allah menggagalkan tipu daya itu. Allah adalah sebaik-baik pembalas tipu daya.","hasanah_per_verse":740},{"text_madani":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا قَالُوا قَدْ سَمِعْنَا لَوْ نَشَاءُ لَقُلْنَا مِثْلَ هَٰذَا ۙ إِنْ هَٰذَا إِلَّا أَسَاطِيرُ الْأَوَّلِينَ","text_tajweed":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ ءَايَ[n[ـٰ]تُنَا قَالُو[s[اْ] قَ[q:298[دْ] سَمِعْنَا لَوْ نَش[o[َا]ٓءُ لَقُلْنَا مِثْلَ هَ[n[ـٰ]ذ[o[َآ‌ۙ] إِنْ هَ[n[ـٰ]ذ[o[َآ] إِلّ[o[َآ] أَسَ[n[ـٰ]طِيرُ [h:3993[ٱ]لْأَوَّل[p[ِي]نَ","translation_en":"And when Our communications are recited to them, they say: We have heard indeed; if we pleased we could say the like of it; this is nothing but the stories of the ancients.","translation_id":"Dan apabila ayat-ayat Kami dibacakan kepada mereka, mereka berkata, “Sesungguhnya kami telah mendengar (ayat-ayat seperti ini), jika kami menghendaki niscaya kami dapat membacakan yang seperti ini. (Al-Qur'an) ini tidak lain hanyalah dongeng orang-orang terdahulu.”","hasanah_per_verse":690},{"text_madani":"وَإِذْ قَالُوا اللَّهُمَّ إِن كَانَ هَٰذَا هُوَ الْحَقَّ مِنْ عِندِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِّنَ السَّمَاءِ أَوِ ائْتِنَا بِعَذَابٍ أَلِيمٍ","text_tajweed":"وَإِذْ قَالُو[s[اْ] [h:5316[ٱ][l[ل]لَّهُ[g[مّ]َ إِ[f:2594[ن ك]َانَ هَ[n[ـٰ]ذَا هُوَ [h:5317[ٱ]لْحَقَّ مِنْ عِ[f:2954[ند]ِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَ[a:5318[ةً م]ِّنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ أَوِ [h:5319[ٱ]ئْتِنَا بِعَذَابٍ أَل[p[ِي]مٍ","translation_en":"And when they said: O Allah! if this is the truth from Thee, then rain upon us stones from heaven or inflict on us a painful punishment.","translation_id":"Dan (ingatlah), ketika mereka (orang-orang musyrik) berkata, “Ya Allah, jika (Al-Qur'an) ini benar (wahyu) dari Engkau, maka hujanilah kami dengan batu dari langit, atau datangkanlah kepada kami azab yang pedih.”","hasanah_per_verse":720},{"text_madani":"وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنتَ فِيهِمْ ۚ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ","text_tajweed":"وَمَا كَانَ [h:742[ٱ]للَّهُ لِيُعَذِّبَهُمْ وَأَ[f:3893[نت]َ فِيهِمْ‌ۚ وَمَا كَانَ [h:742[ٱ]للَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِر[p[ُو]نَ","translation_en":"But Allah was not going to chastise them while you were among them, nor is Allah going to chastise them while yet they ask for forgiveness.","translation_id":"Tetapi Allah tidak akan menghukum mereka, selama engkau (Muhammad) berada di antara mereka. Dan tidaklah (pula) Allah akan menghukum mereka, sedang mereka (masih) memohon ampunan.","hasanah_per_verse":520},{"text_madani":"وَمَا لَهُمْ أَلَّا يُعَذِّبَهُمُ اللَّهُ وَهُمْ يَصُدُّونَ عَنِ الْمَسْجِدِ الْحَرَامِ وَمَا كَانُوا أَوْلِيَاءَهُ ۚ إِنْ أَوْلِيَاؤُهُ إِلَّا الْمُتَّقُونَ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ","text_tajweed":"وَمَا لَهُمْ أَلَّا يُعَذِّبَهُمُ [h:5320[ٱ]للَّهُ وَهُمْ يَصُدُّونَ عَنِ [h:3362[ٱ]لْمَسْجِدِ [h:752[ٱ]لْحَرَامِ وَمَا كَان[o[ُوٓ][s[اْ] أَوْلِي[o[َا]ٓءَهُ[o[ۥٓ‌ۚ] إِنْ أَوْلِي[o[َا]ٓؤُهُ[o[ۥٓ] إِلَّا [h:5321[ٱ]لْمُتَّقُونَ وَلَ[n[ـٰ]كِ[g[نّ]َ أَكْثَرَهُمْ لَا يَعْلَم[p[ُو]نَ","translation_en":"And what (excuse) have they that Allah should not chastise them while they hinder (men) from the Sacred Mosque and they are not (fit to be) guardians of it; its guardians are only those who guard (against evil), but most of them do not know.","translation_id":"Dan mengapa Allah tidak menghukum mereka padahal mereka menghalang-halangi (orang) untuk (mendatangi) Masjidilharam dan mereka bukanlah orang-orang yang berhak menguasainya? Orang yang berhak menguasai(nya), hanyalah orang-orang yang bertakwa, tetapi kebanyakan mereka tidak mengetahui.","hasanah_per_verse":930},{"text_madani":"وَمَا كَانَ صَلَاتُهُمْ عِندَ الْبَيْتِ إِلَّا مُكَاءً وَتَصْدِيَةً ۚ فَذُوقُوا الْعَذَابَ بِمَا كُنتُمْ تَكْفُرُونَ","text_tajweed":"وَمَا كَانَ صَلَاتُهُمْ عِ[f:264[ند]َ [h:5322[ٱ]لْبَيْتِ إِلَّا مُك[o[َا]ٓ[a:5323[ءً و]َتَصْدِيَ[f:5324[ةً‌ۚ ف]َذُوقُو[s[اْ] [h:2154[ٱ]لْعَذَابَ بِمَا كُ[f:100[نت]ُمْ تَكْفُر[p[ُو]نَ","translation_en":"And their prayer before the House is nothing but whistling and clapping of hands; taste then the chastisement, for you disbelieved.","translation_id":"Dan shalat mereka di sekitar Baitullah itu, tidak lain hanyalah siulan dan tepuk tangan. Maka rasakanlah azab disebabkan kekafiranmu itu.","hasanah_per_verse":580},{"text_madani":"إِنَّ الَّذِينَ كَفَرُوا يُنفِقُونَ أَمْوَالَهُمْ لِيَصُدُّوا عَن سَبِيلِ اللَّهِ ۚ فَسَيُنفِقُونَهَا ثُمَّ تَكُونُ عَلَيْهِمْ حَسْرَةً ثُمَّ يُغْلَبُونَ ۗ وَالَّذِينَ كَفَرُوا إِلَىٰ جَهَنَّمَ يُحْشَرُونَ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ كَفَرُو[s[اْ] يُ[f:16[نف]ِقُونَ أَمْو[n[َٲ]لَهُمْ لِيَصُدُّو[s[اْ] عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ‌ۚ فَسَيُ[f:5325[نف]ِقُونَهَا ثُ[g[مّ]َ تَكُونُ عَلَيْهِمْ حَسْرَ[f:5326[ةً ث]ُ[g[مّ]َ يُغْلَبُونَ‌ۗ وَ[h:37[ٱ]لَّذِينَ كَفَر[o[ُوٓ][s[اْ] إِلَىٰ جَهَ[g[نّ]َمَ يُحْشَر[p[ُو]نَ","translation_en":"Surely those who disbelieve spend their wealth to hinder (people) from the way of Allah; so they shall spend it, then it shall be to them an intense regret, then they shall be overcome; and those who disbelieve shall be driven together to hell.","translation_id":"Sesungguhnya orang-orang yang kafir itu, menginfakkan harta mereka untuk menghalang-halangi (orang) dari jalan Allah. Mereka akan (terus) menginfakkan harta itu, kemudian mereka akan menyesal sendiri, dan akhirnya mereka akan dikalahkan. Ke dalam neraka Jahanamlah orang-orang kafir itu akan dikumpulkan,","hasanah_per_verse":980},{"text_madani":"لِيَمِيزَ اللَّهُ الْخَبِيثَ مِنَ الطَّيِّبِ وَيَجْعَلَ الْخَبِيثَ بَعْضَهُ عَلَىٰ بَعْضٍ فَيَرْكُمَهُ جَمِيعًا فَيَجْعَلَهُ فِي جَهَنَّمَ ۚ أُولَٰئِكَ هُمُ الْخَاسِرُونَ","text_tajweed":"لِيَمِيزَ [h:5327[ٱ]للَّهُ [h:5328[ٱ]لْخَبِيثَ مِنَ [h:2451[ٱ][l[ل]طَّيِّبِ وَيَ[q:2669[جْ]عَلَ [h:5329[ٱ]لْخَبِيثَ بَعْضَهُ[n[ۥ] عَلَىٰ بَعْ[f:5330[ضٍ ف]َيَرْكُمَهُ[n[ۥ] جَمِي[f:5331[عًا ف]َيَ[q:5332[جْ]عَلَهُ[n[ۥ] فِى جَهَ[g[نّ]َمَ‌ۚ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:150[ٱ]لْخَ[n[ـٰ]سِر[p[ُو]نَ","translation_en":"That Allah might separate the impure from the good, and put the impure, some of it upon the other, and pile it up together, then cast it into hell; these it is that are the losers.","translation_id":"agar Allah memisahkan (golongan) yang buruk dari yang baik dan menjadikan (golongan) yang buruk itu sebagiannya di atas yang lain, lalu kesemuanya ditumpukkan-Nya, dan dimasukkan-Nya ke dalam neraka Jahanam. Mereka itulah orang-orang yang rugi.","hasanah_per_verse":810},{"text_madani":"قُل لِّلَّذِينَ كَفَرُوا إِن يَنتَهُوا يُغْفَرْ لَهُم مَّا قَدْ سَلَفَ وَإِن يَعُودُوا فَقَدْ مَضَتْ سُنَّتُ الْأَوَّلِينَ","text_tajweed":"قُل لِّلَّذِينَ كَفَر[o[ُوٓ][s[اْ] إ[a:5333[ِن ي]َ[f:3711[نت]َهُو[s[اْ] يُغْفَرْ لَه[w:3531[ُم م]َّا قَ[q:298[دْ] سَلَفَ وَإ[a:5334[ِن ي]َعُودُو[s[اْ] فَقَ[q:563[دْ] مَضَتْ سُ[g[نّ]َتُ [h:5335[ٱ]لْأَوَّل[p[ِي]نَ","translation_en":"Say to those who disbelieve, if they desist, that which is past shall be forgiven to them; and if they return, then what happened to the ancients has already passed.","translation_id":"Katakanlah kepada orang-orang yang kafir itu (Abu Sufyan dan kawan-kawannya), “Jika mereka berhenti (dari kekafirannya), niscaya Allah akan mengampuni dosa-dosa mereka yang telah lalu; dan jika mereka kembali lagi (memerangi Nabi) sungguh, berlaku (kepada mereka) sunnah (Allah terhadap) orang-orang dahulu (dibinasakan).”","hasanah_per_verse":590},{"text_madani":"وَقَاتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ كُلُّهُ لِلَّهِ ۚ فَإِنِ انتَهَوْا فَإِنَّ اللَّهَ بِمَا يَعْمَلُونَ بَصِيرٌ","text_tajweed":"وَقَ[n[ـٰ]تِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَ[a:1032[ةٌ و]َيَكُونَ [h:1033[ٱ][l[ل]دِّينُ كُلُّهُ[n[ۥ] لِلَّهِ‌ۚ فَإِنِ [h:1030[ٱ][f:1031[نت]َهَوْ[s[اْ] فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ بِمَا يَعْمَلُونَ بَص[p[ِي]رٌ","translation_en":"And fight with them until there is no more persecution and religion should be only for Allah; but if they desist, then surely Allah sees what they do.","translation_id":"Dan perangilah mereka itu sampai tidak ada lagi fitnah, dan agama hanya bagi Allah semata. Jika mereka berhenti (dari kekafiran), maka sesungguhnya Allah Maha Melihat apa yang mereka kerjakan.","hasanah_per_verse":660},{"text_madani":"وَإِن تَوَلَّوْا فَاعْلَمُوا أَنَّ اللَّهَ مَوْلَاكُمْ ۚ نِعْمَ الْمَوْلَىٰ وَنِعْمَ النَّصِيرُ","text_tajweed":"وَإِ[f:706[ن ت]َوَلَّوْ[s[اْ] فَ[h:1140[ٱ]عْلَم[o[ُوٓ][s[اْ] أَ[g[نّ]َ [h:394[ٱ]للَّهَ مَوْلَ[n[ـٰ]كُمْ‌ۚ نِعْمَ [h:5336[ٱ]لْمَوْلَىٰ وَنِعْمَ [h:5337[ٱ][l[ل][g[نّ]َص[p[ِي]رُ","translation_en":"And if they turn back, then know that Allah is your Patron; most excellent is the Patron and most excellent the Helper.","translation_id":"Dan jika mereka berpaling, maka ketahuilah bahwa sesungguhnya Allah pelindungmu. Dia adalah sebaik-baik pelindung dan sebaik-baik penolong.","hasanah_per_verse":460},{"text_madani":"وَاعْلَمُوا أَنَّمَا غَنِمْتُم مِّن شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ إِن كُنتُمْ آمَنتُم بِاللَّهِ وَمَا أَنزَلْنَا عَلَىٰ عَبْدِنَا يَوْمَ الْفُرْقَانِ يَوْمَ الْتَقَى الْجَمْعَانِ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","text_tajweed":"۞ وَ[h:9999[ٱ]عْلَم[o[ُوٓ][s[اْ] أَ[g[نّ]َمَا غَنِمْت[w:5338[ُم م]ِّ[f:2103[ن ش][f:5339[َىْءٍ ف]َأَ[g[نّ]َ لِلَّهِ خُمُسَهُ[n[ۥ] وَلِلرَّسُولِ وَلِذِى [h:5340[ٱ]لْقُرْبَىٰ وَ[h:420[ٱ]لْيَتَ[n[ـٰ]مَىٰ وَ[h:421[ٱ]لْمَسَ[n[ـٰ]كِينِ وَ[h:1189[ٱ][q:1189[بْ]نِ [h:1190[ٱ][l[ل]سَّبِيلِ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ ءَامَ[f:703[نت][c:5341[ُم ب]ِ[h:32[ٱ]للَّهِ وَم[o[َآ] أَ[f:515[نز]َلْنَا عَلَىٰ عَ[q:102[بْ]دِنَا يَوْمَ [h:5342[ٱ]لْفُرْقَانِ يَوْمَ [h:2353[ٱ][l[ل]ْتَقَى [h:2354[ٱ]لْجَمْعَانِ‌ۗ وَ[h:72[ٱ]للَّهُ عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َد[p[ِي]رٌ","translation_en":"And know that whatever thing you gain, a fifth of it is for Allah and for the Messenger and for the near of kin and the orphans and the needy and the wayfarer, if you believe in Allah and in that which We revealed to Our servant, on the day of distinction, the day on which the two parties met; and Allah has power over all things.","translation_id":"Dan ketahuilah, sesungguhnya segala yang kamu peroleh sebagai rampasan perang, maka seperlima untuk Allah, Rasul, kerabat Rasul, anak yatim, orang miskin dan ibnu sabil, (demikian) jika kamu beriman kepada Allah dan kepada apa yang Kami turunkan kepada hamba Kami (Muhammad) di hari Furqan, yaitu pada hari bertemunya dua pasukan. Allah Mahakuasa atas segala sesuatu.","hasanah_per_verse":1500},{"text_madani":"إِذْ أَنتُم بِالْعُدْوَةِ الدُّنْيَا وَهُم بِالْعُدْوَةِ الْقُصْوَىٰ وَالرَّكْبُ أَسْفَلَ مِنكُمْ ۚ وَلَوْ تَوَاعَدتُّمْ لَاخْتَلَفْتُمْ فِي الْمِيعَادِ ۙ وَلَٰكِن لِّيَقْضِيَ اللَّهُ أَمْرًا كَانَ مَفْعُولًا لِّيَهْلِكَ مَنْ هَلَكَ عَن بَيِّنَةٍ وَيَحْيَىٰ مَنْ حَيَّ عَن بَيِّنَةٍ ۗ وَإِنَّ اللَّهَ لَسَمِيعٌ عَلِيمٌ","text_tajweed":"إِذْ أَ[f:428[نت][c:5343[ُم ب]ِ[h:5344[ٱ]لْعُ[q:5344[دْ]وَةِ [h:5345[ٱ][l[ل]دُّنْيَا وَه[c:5346[ُم ب]ِ[h:5344[ٱ]لْعُ[q:5344[دْ]وَةِ [h:5347[ٱ]لْقُصْوَىٰ وَ[h:5348[ٱ][l[ل]رَّكْبُ أَسْفَلَ مِ[f:344[نك]ُمْ‌ۚ وَلَوْ تَوَاعَ[d:5349[د]تُّمْ لَ[h:5350[ٱ]خْتَلَفْتُمْ فِى [h:5351[ٱ]لْمِيعَ[n[ـٰ]دِ‌ۙ وَلَ[n[ـٰ]ك[u:5352[ِن ل]ِّيَ[q:5353[قْ]ضِىَ [h:5354[ٱ]للَّهُ أَمْ[f:5355[رًا ك]َانَ مَفْعُول[u:5356[اً ل]ِّيَهْلِكَ مَنْ هَلَكَ ع[i:5357[َنۢ ب]َيِّنَ[a:5358[ةٍ و]َيَحْيَىٰ مَنْ حَىَّ ع[i:5357[َنۢ ب]َيِّنَ[a:5359[ةٍ‌ۗ و]َإِ[g[نّ]َ [h:1986[ٱ]للَّهَ لَسَمِيعٌ عَل[p[ِي]مٌ","translation_en":"When you were on the nearer side (of the valley) and they were on the farthest side, while the caravan was in a lower place than you; and if you had mutually made an appointment, you would certainly have broken away from the appointment, but-- in order that Allah might bring about a matter which was to be done, that he who would perish might perish by clear proof, and he who would live might live by clear proof; and most surely Allah is Hearing, Knowing;","translation_id":"(Yaitu) ketika kamu berada di pinggir lembah yang dekat dan mereka berada di pinggir lembah yang jauh sedang kafilah itu berada lebih rendah dari kamu. Sekiranya kamu mengadakan persetujuan (untuk menentukan hari pertempuran), niscaya kamu berbeda pendapat dalam menentukan (hari pertempuran itu), tetapi Allah berkehendak melaksanakan suatu urusan yang harus dilaksanakan, yaitu agar orang yang binasa itu binasa dengan bukti yang nyata dan agar orang yang hidup itu hidup dengan bukti yang nyata. Sungguh, Allah Maha Mendengar, Maha Mengetahui.","hasanah_per_verse":1490},{"text_madani":"إِذْ يُرِيكَهُمُ اللَّهُ فِي مَنَامِكَ قَلِيلًا ۖ وَلَوْ أَرَاكَهُمْ كَثِيرًا لَّفَشِلْتُمْ وَلَتَنَازَعْتُمْ فِي الْأَمْرِ وَلَٰكِنَّ اللَّهَ سَلَّمَ ۗ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","text_tajweed":"إِذْ يُرِيكَهُمُ [h:5360[ٱ]للَّهُ فِى مَنَامِكَ قَلِيل[a:5361[اً‌ۖ و]َلَوْ أَرَ[n[ٮٰ]كَهُمْ كَثِي[u:5362[رًا ل]َّفَشِلْتُمْ وَلَتَنَ[n[ـٰ]زَعْتُمْ فِى [h:2319[ٱ]لْأَمْرِ وَلَ[n[ـٰ]كِ[g[نّ]َ [h:1441[ٱ]للَّهَ سَلَّمَ‌ۗ إِ[g[نّ]َهُ[n[ۥ] عَلِي[i:2196[مُۢ ب]ِذَاتِ [h:2197[ٱ][l[ل]صُّد[p[ُو]رِ","translation_en":"When Allah showed them to you in your dream as few; and if He had shown them to you as many you would certainly have become weak-hearted and you would have disputed about the matter, but Allah saved (you); surely He is the Knower of what is in the breasts.","translation_id":"(Ingatlah) ketika Allah memperlihatkan mereka di dalam mimpimu (berjumlah) sedikit. Dan sekiranya Allah memperlihatkan mereka (berjumlah) banyak tentu kamu menjadi gentar dan tentu kamu akan berbantah-bantahan dalam urusan itu, tetapi Allah telah menyelamatkan kamu. Sungguh, Allah Maha Mengetahui apa yang ada dalam hatimu.","hasanah_per_verse":880},{"text_madani":"وَإِذْ يُرِيكُمُوهُمْ إِذِ الْتَقَيْتُمْ فِي أَعْيُنِكُمْ قَلِيلًا وَيُقَلِّلُكُمْ فِي أَعْيُنِهِمْ لِيَقْضِيَ اللَّهُ أَمْرًا كَانَ مَفْعُولًا ۗ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ","text_tajweed":"وَإِذْ يُرِيكُمُوهُمْ إِذِ [h:5363[ٱ][l[ل]ْتَقَيْتُمْ ف[o[ِىٓ] أَعْيُنِكُمْ قَلِيل[a:5364[اً و]َيُقَلِّلُكُمْ ف[o[ِىٓ] أَعْيُنِهِمْ لِيَ[q:5353[قْ]ضِىَ [h:5354[ٱ]للَّهُ أَمْ[f:5355[رًا ك]َانَ مَفْعُول[a:5365[اً‌ۗ و]َإِلَى [h:1148[ٱ]للَّهِ تُرْجَعُ [h:1149[ٱ]لْأُم[p[ُو]رُ","translation_en":"And when He showed them to you, when you met, as few in your eyes and He made you to appear little in their eyes, in order that Allah might bring about a matter which was to be done, and to Allah are all affairs returned.","translation_id":"Dan ketika Allah memperlihatkan mereka kepadamu, ketika kamu berjumpa dengan mereka berjumlah sedikit menurut penglihatan matamu dan kamu diperlihatkan-Nya berjumlah sedikit menurut penglihatan mereka, itu karena Allah berkehendak melaksanakan suatu urusan yang harus dilaksanakan. Hanya kepada Allah segala urusan dikembalikan.","hasanah_per_verse":880},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا لَقِيتُمْ فِئَةً فَاثْبُتُوا وَاذْكُرُوا اللَّهَ كَثِيرًا لَّعَلَّكُمْ تُفْلِحُونَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِذَا لَقِيتُمْ فِئَ[f:5366[ةً ف]َ[h:5367[ٱ]ثْبُتُو[s[اْ] وَ[h:335[ٱ]ذْكُرُو[s[اْ] [h:1113[ٱ]للَّهَ كَثِي[u:5368[رًا ل]َّعَلَّكُمْ تُفْلِح[p[ُو]نَ","translation_en":"O you who believe! when you meet a party, then be firm, and remember Allah much, that you may be successful.","translation_id":"Wahai orang-orang yang beriman! Apabila kamu bertemu pasukan (musuh), maka berteguh hatilah dan sebutlah (nama) Allah banyak-banyak (berdzikir dan berdoa) agar kamu beruntung.","hasanah_per_verse":610},{"text_madani":"وَأَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَنَازَعُوا فَتَفْشَلُوا وَتَذْهَبَ رِيحُكُمْ ۖ وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ","text_tajweed":"وَأَطِيعُو[s[اْ] [h:2238[ٱ]للَّهَ وَرَسُولَهُ[n[ۥ] وَلَا تَنَ[n[ـٰ]زَعُو[s[اْ] فَتَفْشَلُو[s[اْ] وَتَذْهَبَ رِيحُكُمْ‌ۖ وَ[h:4939[ٱ]صْبِر[o[ُوٓ[s[اْ]‌ۚ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ مَعَ [h:785[ٱ][l[ل]صَّ[n[ـٰ]بِر[p[ِي]نَ","translation_en":"And obey Allah and His Messenger and do not quarrel for then you will be weak in hearts and your power will depart, and be patient; surely Allah is with the patient.","translation_id":"Dan taatilah Allah dan Rasul-Nya dan janganlah kamu berselisih, yang menyebabkan kamu menjadi gentar dan kekuatanmu hilang dan bersabarlah. Sungguh, Allah beserta orang-orang sabar.","hasanah_per_verse":670},{"text_madani":"وَلَا تَكُونُوا كَالَّذِينَ خَرَجُوا مِن دِيَارِهِم بَطَرًا وَرِئَاءَ النَّاسِ وَيَصُدُّونَ عَن سَبِيلِ اللَّهِ ۚ وَاللَّهُ بِمَا يَعْمَلُونَ مُحِيطٌ","text_tajweed":"وَلَا تَكُونُو[s[اْ] كَ[h:2146[ٱ]لَّذِينَ خَرَجُو[s[اْ] مِ[f:432[ن د]ِيَ[n[ـٰ]رِه[c:5369[ِم ب]َطَ[a:5370[رًا و]َرِئ[o[َا]ٓءَ [h:5371[ٱ][l[ل][g[نّ]َاسِ وَيَصُدُّونَ عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ‌ۚ وَ[h:72[ٱ]للَّهُ بِمَا يَعْمَلُونَ مُح[p[ِي][q[ط]ٌ","translation_en":"And be not like those who came forth from their homes in great exultation and to be seen of men, and (who) turn away from the way of Allah, and Allah comprehends what they do.","translation_id":"Dan janganlah kamu seperti orang-orang yang keluar dari kampung halamannya dengan rasa angkuh dan ingin dipuji orang (ria) serta menghalang-halangi (orang) dari jalan Allah. Allah meliputi segala yang mereka kerjakan.","hasanah_per_verse":760},{"text_madani":"وَإِذْ زَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ وَقَالَ لَا غَالِبَ لَكُمُ الْيَوْمَ مِنَ النَّاسِ وَإِنِّي جَارٌ لَّكُمْ ۖ فَلَمَّا تَرَاءَتِ الْفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيْهِ وَقَالَ إِنِّي بَرِيءٌ مِّنكُمْ إِنِّي أَرَىٰ مَا لَا تَرَوْنَ إِنِّي أَخَافُ اللَّهَ ۚ وَاللَّهُ شَدِيدُ الْعِقَابِ","text_tajweed":"وَإِذْ زَيَّنَ لَهُمُ [h:4046[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ أَعْمَ[n[ـٰ]لَهُمْ وَقَالَ لَا غَالِبَ لَكُمُ [h:5372[ٱ]لْيَوْمَ مِنَ [h:721[ٱ][l[ل][g[نّ]َاسِ وَإِ[g[نّ]ِى جَا[u:5373[رٌ ل]َّكُمْ‌ۖ فَلَ[g[مّ]َا تَر[o[َا]ٓءَتِ [h:5374[ٱ]لْفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيْهِ وَقَالَ إِ[g[نّ]ِى بَر[o[ِى]ٓ[a:5375[ءٌ م]ِّ[f:344[نك]ُمْ إِ[g[نّ][o[ِىٓ] أَرَىٰ مَا لَا تَرَوْنَ إِ[g[نّ][o[ِىٓ] أَخَافُ [h:3504[ٱ]للَّهَ‌ۚ وَ[h:72[ٱ]للَّهُ شَدِيدُ [h:1075[ٱ]لْعِق[p[َا][q[ب]ِ","translation_en":"And when the Shaitan made their works fair seeming to them, and said: No one can overcome you this day, and surely I am your protector: but when the two parties came in sight of each other he turned upon his heels, and said: Surely I am clear of you, surely I see what you do not see, surely I fear Allah; and Allah is severe in requiting (evil).","translation_id":"Dan (ingatlah) ketika setan menjadikan terasa indah bagi mereka perbuatan (dosa) mereka dan mengatakan, “Tidak ada (orang) yang dapat mengalahkan kamu pada hari ini, dan sungguh, aku adalah penolongmu.” Maka ketika kedua pasukan itu telah saling melihat (berhadapan), setan balik ke belakang seraya berkata, “Sesungguhnya aku berlepas diri dari kamu; aku dapat melihat apa yang kamu tidak dapat melihat; sesungguhnya aku takut kepada Allah.” Allah sangat keras siksa-Nya.","hasanah_per_verse":1400},{"text_madani":"إِذْ يَقُولُ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِم مَّرَضٌ غَرَّ هَٰؤُلَاءِ دِينُهُمْ ۗ وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَإِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ","text_tajweed":"إِذْ يَقُولُ [h:5376[ٱ]لْمُنَ[n[ـٰ]فِقُونَ وَ[h:37[ٱ]لَّذِينَ فِى قُلُوبِه[w:39[ِم م]َّرَضٌ غَرَّ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ دِينُهُمْ‌ۗ وَم[a:5377[َن ي]َتَوَكَّلْ عَلَى [h:412[ٱ]للَّهِ فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ عَزِيزٌ حَك[p[ِي]مٌ","translation_en":"When the hypocrites and those in whose hearts was disease said: Their religion has deceived them; and whoever trusts in Allah, then surely Allah is Mighty, Wise.","translation_id":"(Ingatlah), ketika orang-orang munafik dan orang-orang yang ada penyakit di dalam hatinya berkata, “Mereka itu (orang mukmin) ditipu agamanya.” (Allah berfirman), “Barangsiapa bertawakal kepada Allah, ketahuilah bahwa Allah Mahaperkasa, Mahabijaksana.”","hasanah_per_verse":740},{"text_madani":"وَلَوْ تَرَىٰ إِذْ يَتَوَفَّى الَّذِينَ كَفَرُوا ۙ الْمَلَائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ وَذُوقُوا عَذَابَ الْحَرِيقِ","text_tajweed":"وَلَوْ تَرَ[o[ىٰٓ] إِذْ يَتَوَفَّى [h:5378[ٱ]لَّذِينَ كَفَرُو[s[اْ‌ۙ] [h:5379[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَ[q:5380[دْ]بَ[n[ـٰ]رَهُمْ وَذُوقُو[s[اْ] عَذَابَ [h:2465[ٱ]لْحَر[p[ِي][q[ق]ِ","translation_en":"And had you seen when the angels will cause to die those who disbelieve, smiting their faces and their backs, and (saying): Taste the punishment of burning.","translation_id":"Dan sekiranya kamu melihat ketika para malaikat mencabut nyawa orang-orang yang kafir sambil memukul wajah dan punggung mereka (dan berkata), “Rasakanlah olehmu siksa neraka yang membakar.”","hasanah_per_verse":670},{"text_madani":"ذَٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيدِ","text_tajweed":"ذ[n[َٲ]لِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَ[g[نّ]َ [h:859[ٱ]للَّهَ لَيْسَ بِظَلَّ[n[ـٰ][u:2466[مٍ ل]ِّلْعَب[p[ِي][q[د]ِ","translation_en":"This is for what your own hands have sent on before, and because Allah is not in the least unjust to the servants;","translation_id":"Demikian itu disebabkan oleh perbuatan tanganmu sendiri. Dan sesungguhnya Allah tidak menzhalimi hamba-hamba-Nya,","hasanah_per_verse":370},{"text_madani":"كَدَأْبِ آلِ فِرْعَوْنَ ۙ وَالَّذِينَ مِن قَبْلِهِمْ ۚ كَفَرُوا بِآيَاتِ اللَّهِ فَأَخَذَهُمُ اللَّهُ بِذُنُوبِهِمْ ۗ إِنَّ اللَّهَ قَوِيٌّ شَدِيدُ الْعِقَابِ","text_tajweed":"كَدَأْبِ ءَالِ فِرْعَوْنَ‌ۙ وَ[h:37[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ‌ۚ كَفَرُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ فَأَخَذَهُمُ [h:1756[ٱ]للَّهُ بِذُنُوبِهِمْ‌ۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ قَوِ[f:5381[ىٌّ ش]َدِيدُ [h:1075[ٱ]لْعِق[p[َا][q[ب]ِ","translation_en":"In the manner of the people of Firon and those before them; they disbelieved in Allah's communications, therefore Allah destroyed them on account of their faults; surely Allah is strong, severe in requiting (evil).","translation_id":"(Keadaan mereka) serupa dengan keadaan pengikut Fir‘aun dan orang-orang yang sebelum mereka. Mereka mengingkari ayat-ayat Allah, maka Allah menyiksa mereka disebabkan dosa-dosanya. Sungguh, Allah Mahakuat lagi sangat keras siksa-Nya.","hasanah_per_verse":740},{"text_madani":"ذَٰلِكَ بِأَنَّ اللَّهَ لَمْ يَكُ مُغَيِّرًا نِّعْمَةً أَنْعَمَهَا عَلَىٰ قَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنفُسِهِمْ ۙ وَأَنَّ اللَّهَ سَمِيعٌ عَلِيمٌ","text_tajweed":"ذ[n[َٲ]لِكَ بِأَ[g[نّ]َ [h:897[ٱ]للَّهَ لَمْ يَكُ مُغَيِّ[a:5382[رًا ن]ِّعْمَةً أَنْعَمَهَا عَلَىٰ قَوْمٍ حَتَّىٰ يُغَيِّرُو[s[اْ] مَا بِأَ[f:4384[نف]ُسِهِمْ‌ۙ وَأَ[g[نّ]َ [h:859[ٱ]للَّهَ سَمِيعٌ عَل[p[ِي]مٌ","translation_en":"This is because Allah has never changed a favor which He has conferred upon a people until they change their own condition; and because Allah is Hearing, Knowing;","translation_id":"Yang demikian itu karena sesungguhnya Allah tidak akan mengubah suatu nikmat yang telah diberikan-Nya kepada suatu kaum, hingga kaum itu mengubah apa yang ada pada diri mereka sendiri. Sungguh, Allah Maha Mendengar, Maha Mengetahui,","hasanah_per_verse":680},{"text_madani":"كَدَأْبِ آلِ فِرْعَوْنَ ۙ وَالَّذِينَ مِن قَبْلِهِمْ ۚ كَذَّبُوا بِآيَاتِ رَبِّهِمْ فَأَهْلَكْنَاهُم بِذُنُوبِهِمْ وَأَغْرَقْنَا آلَ فِرْعَوْنَ ۚ وَكُلٌّ كَانُوا ظَالِمِينَ","text_tajweed":"كَدَأْبِ ءَالِ فِرْعَوْنَ‌ۙ وَ[h:37[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ‌ۚ كَذَّبُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِ رَبِّهِمْ فَأَهْلَكْنَ[n[ـٰ]ه[c:3936[ُم ب]ِذُنُوبِهِمْ وَأَغْرَ[q:247[قْ]ن[o[َآ] ءَالَ فِرْعَوْنَ‌ۚ وَكُ[f:5383[لٌّ ك]َانُو[s[اْ] ظَ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"In the manner of the people of Firon and those before them; they rejected the communications of their Lord, therefore We destroyed them on account of their faults and We drowned Firon's people, and they were all unjust.","translation_id":"(Keadaan mereka) serupa dengan keadaan pengikut Fir‘aun dan orang-orang yang sebelum mereka. Mereka mendustakan ayat-ayat Tuhannya, maka Kami membinasakan mereka disebabkan oleh dosa-dosanya dan Kami tenggelamkan Fir‘aun dan pengikut-pengikutnya; karena mereka adalah orang-orang yang zhalim.","hasanah_per_verse":820},{"text_madani":"إِنَّ شَرَّ الدَّوَابِّ عِندَ اللَّهِ الَّذِينَ كَفَرُوا فَهُمْ لَا يُؤْمِنُونَ","text_tajweed":"إِ[g[نّ]َ شَرَّ [h:5293[ٱ][l[ل]دَّو[m[َا]ٓبِّ عِ[f:264[ند]َ [h:408[ٱ]للَّهِ [h:5384[ٱ]لَّذِينَ كَفَرُو[s[اْ] فَهُمْ لَا يُؤْمِن[p[ُو]نَ","translation_en":"Surely the vilest of animals in Allah's sight are those who disbelieve, then they would not believe.","translation_id":"Sesungguhnya makhluk bergerak yang bernyawa yang paling buruk dalam pandangan Allah ialah orang-orang kafir, karena mereka tidak beriman.","hasanah_per_verse":380},{"text_madani":"الَّذِينَ عَاهَدتَّ مِنْهُمْ ثُمَّ يَنقُضُونَ عَهْدَهُمْ فِي كُلِّ مَرَّةٍ وَهُمْ لَا يَتَّقُونَ","text_tajweed":"ٱلَّذِينَ عَ[n[ـٰ]هَ[d:5385[د]تَّ مِنْهُمْ ثُ[g[مّ]َ يَ[f:144[نق]ُضُونَ عَهْدَهُمْ فِى كُلِّ مَرَّ[a:5386[ةٍ و]َهُمْ لَا يَتَّق[p[ُو]نَ","translation_en":"Those with whom you make an agreement, then they break their agreement every time and they do not guard (against punishment).","translation_id":"(Yaitu) orang-orang yang terikat perjanjian dengan kamu, kemudian setiap kali berjanji mereka mengkhianati janjinya, sedang mereka tidak takut (kepada Allah).","hasanah_per_verse":440},{"text_madani":"فَإِمَّا تَثْقَفَنَّهُمْ فِي الْحَرْبِ فَشَرِّدْ بِهِم مَّنْ خَلْفَهُمْ لَعَلَّهُمْ يَذَّكَّرُونَ","text_tajweed":"فَإِ[g[مّ]َا تَثْقَفَ[g[نّ]َهُمْ فِى [h:5387[ٱ]لْحَرْبِ فَشَرِّ[q:5388[دْ] بِه[w:5389[ِم م]َّنْ خَلْفَهُمْ لَعَلَّهُمْ يَذَّكَّر[p[ُو]نَ","translation_en":"Therefore if you overtake them in fighting, then scatter by (making an example of) them those who are in their rear, that they may be mindful.","translation_id":"Maka jika engkau (Muhammad) mengungguli mereka dalam peperangan, maka cerai-beraikanlah orang-orang yang di belakang mereka dengan (menumpas) mereka, agar mereka mengambil pelajaran.","hasanah_per_verse":430},{"text_madani":"وَإِمَّا تَخَافَنَّ مِن قَوْمٍ خِيَانَةً فَانبِذْ إِلَيْهِمْ عَلَىٰ سَوَاءٍ ۚ إِنَّ اللَّهَ لَا يُحِبُّ الْخَائِنِينَ","text_tajweed":"وَإِ[g[مّ]َا تَخَافَ[g[نّ]َ مِ[f:3024[ن ق]َوْمٍ خِيَانَ[f:5390[ةً ف]َ[h:5391[ٱ][i:5391[نۢب]ِذْ إِلَيْهِمْ عَلَىٰ سَو[o[َا]ٓءٍ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَا يُحِبُّ [h:5392[ٱ]لْخ[o[َا]ٓئِن[p[ِي]نَ","translation_en":"And if you fear treachery on the part of a people, then throw back to them on terms of equality; surely Allah does not love the treacherous.","translation_id":"Dan jika engkau (Muhammad) khawatir akan (terjadinya) pengkhianatan dari suatu golongan, maka kembalikanlah perjanjian itu kepada mereka dengan cara yang jujur. Sungguh, Allah tidak menyukai orang yang berkhianat.","hasanah_per_verse":550},{"text_madani":"وَلَا يَحْسَبَنَّ الَّذِينَ كَفَرُوا سَبَقُوا ۚ إِنَّهُمْ لَا يُعْجِزُونَ","text_tajweed":"وَلَا يَحْسَبَ[g[نّ]َ [h:2445[ٱ]لَّذِينَ كَفَرُو[s[اْ] سَبَق[o[ُوٓ[s[اْ]‌ۚ] إِ[g[نّ]َهُمْ لَا يُعْجِز[p[ُو]نَ","translation_en":"And let not those who disbelieve think that they shall come in first; surely they will not escape.","translation_id":"Dan janganlah orang-orang kafir mengira, bahwa mereka akan dapat lolos (dari kekuasaan Allah). Sungguh, mereka tidak dapat melemahkan (Allah).","hasanah_per_verse":350},{"text_madani":"وَأَعِدُّوا لَهُم مَّا اسْتَطَعْتُم مِّن قُوَّةٍ وَمِن رِّبَاطِ الْخَيْلِ تُرْهِبُونَ بِهِ عَدُوَّ اللَّهِ وَعَدُوَّكُمْ وَآخَرِينَ مِن دُونِهِمْ لَا تَعْلَمُونَهُمُ اللَّهُ يَعْلَمُهُمْ ۚ وَمَا تُنفِقُوا مِن شَيْءٍ فِي سَبِيلِ اللَّهِ يُوَفَّ إِلَيْكُمْ وَأَنتُمْ لَا تُظْلَمُونَ","text_tajweed":"وَأَعِدُّو[s[اْ] لَه[w:3531[ُم م]َّا [h:5393[ٱ]سْتَطَعْت[w:5394[ُم م]ِّ[f:5395[ن ق]ُوَّ[a:5396[ةٍ و]َم[u:5397[ِن ر]ِّبَاطِ [h:5398[ٱ]لْخَيْلِ تُرْهِبُونَ بِه[n[ِۦ] عَدُوَّ [h:5399[ٱ]للَّهِ وَعَدُوَّكُمْ وَءَاخَرِينَ مِ[f:5400[ن د]ُونِهِمْ لَا تَعْلَمُونَهُمُ [h:5401[ٱ]للَّهُ يَعْلَمُهُمْ‌ۚ وَمَا تُ[f:1607[نف]ِقُو[s[اْ] مِ[f:2103[ن ش][f:5402[َىْءٍ ف]ِى سَبِيلِ [h:788[ٱ]للَّهِ يُوَفَّ إِلَيْكُمْ وَأَ[f:98[نت]ُمْ لَا تُظْلَم[p[ُو]نَ","translation_en":"And prepare against them what force you can and horses tied at the frontier, to frighten thereby the enemy of Allah and your enemy and others besides them, whom you do not know (but) Allah knows them; and whatever thing you will spend in Allah's way, it will be paid back to you fully and you shall not be dealt with unjustly.","translation_id":"Dan persiapkanlah dengan segala kemampuan untuk menghadapi mereka dengan kekuatan yang kamu miliki dan dari pasukan berkuda yang dapat menggentarkan musuh Allah, musuhmu dan orang-orang selain mereka yang kamu tidak mengetahuinya; tetapi Allah mengetahuinya. Apa saja yang kamu infakkan di jalan Allah niscaya akan dibalas dengan cukup kepadamu dan kamu tidak akan dizhalimi (dirugikan).","hasanah_per_verse":1340},{"text_madani":"وَإِن جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَهَا وَتَوَكَّلْ عَلَى اللَّهِ ۚ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ","text_tajweed":"۞ وَإِ[f:5403[ن ج]َنَحُو[s[اْ] لِلسَّلْمِ فَ[h:5404[ٱ][q:5404[جْ]نَحْ لَهَا وَتَوَكَّلْ عَلَى [h:412[ٱ]للَّهِ‌ۚ إِ[g[نّ]َهُ[n[ۥ] هُوَ [h:3721[ٱ][l[ل]سَّمِيعُ [h:669[ٱ]لْعَل[p[ِي]مُ","translation_en":"And if they incline to peace, then incline to it and trust in Allah; surely He is the Hearing, the Knowing.","translation_id":"Tetapi jika mereka condong kepada perdamaian, maka terimalah dan bertawakallah kepada Allah. Sungguh, Dia Maha Mendengar, Maha Mengetahui.","hasanah_per_verse":500},{"text_madani":"وَإِن يُرِيدُوا أَن يَخْدَعُوكَ فَإِنَّ حَسْبَكَ اللَّهُ ۚ هُوَ الَّذِي أَيَّدَكَ بِنَصْرِهِ وَبِالْمُؤْمِنِينَ","text_tajweed":"وَإ[a:5405[ِن ي]ُرِيد[o[ُوٓ][s[اْ] أ[a:5406[َن ي]َخْدَعُوكَ فَإِ[g[نّ]َ حَسْبَكَ [h:5407[ٱ]للَّهُ‌ۚ هُوَ [h:153[ٱ]لَّذ[o[ِىٓ] أَيَّدَكَ بِنَصْرِه[n[ِۦ] وَبِ[h:5408[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"And if they intend to deceive you-- then surely Allah is sufficient for you; He it is Who strengthened you with His help and with the believers","translation_id":"Dan jika mereka hendak menipumu, maka sesungguhnya cukuplah Allah (menjadi pelindung) bagimu. Dialah yang memberikan kekuatan kepadamu dengan pertolongan-Nya dan dengan (dukungan) orang-orang mukmin,","hasanah_per_verse":530},{"text_madani":"وَأَلَّفَ بَيْنَ قُلُوبِهِمْ ۚ لَوْ أَنفَقْتَ مَا فِي الْأَرْضِ جَمِيعًا مَّا أَلَّفْتَ بَيْنَ قُلُوبِهِمْ وَلَٰكِنَّ اللَّهَ أَلَّفَ بَيْنَهُمْ ۚ إِنَّهُ عَزِيزٌ حَكِيمٌ","text_tajweed":"وَأَلَّفَ بَيْنَ قُلُوبِهِمْ‌ۚ لَوْ أَ[f:5409[نف]َ[q:5409[قْ]تَ مَا فِى [h:44[ٱ]لْأَرْضِ جَمِي[a:5410[عًا م]ّ[o[َآ] أَلَّفْتَ بَيْنَ قُلُوبِهِمْ وَلَ[n[ـٰ]كِ[g[نّ]َ [h:1441[ٱ]للَّهَ أَلَّفَ بَيْنَهُمْ‌ۚ إِ[g[نّ]َهُ[n[ۥ] عَزِيزٌ حَك[p[ِي]مٌ","translation_en":"And united their hearts; had you spent all that is in the earth, you could not have united their hearts, but Allah united them; surely He is Mighty, Wise.","translation_id":"dan Dia (Allah) yang mempersatukan hati mereka (orang yang beriman). Walaupun kamu menginfakkan semua (kekayaan) yang berada di bumi, niscaya kamu tidak dapat mempersatukan hati mereka, tetapi Allah telah mempersatukan hati mereka. Sungguh, Dia Mahaperkasa, Mahabijaksana.","hasanah_per_verse":760},{"text_madani":"يَا أَيُّهَا النَّبِيُّ حَسْبُكَ اللَّهُ وَمَنِ اتَّبَعَكَ مِنَ الْمُؤْمِنِينَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:5411[ٱ][l[ل][g[نّ]َبِىُّ حَسْبُكَ [h:5412[ٱ]للَّهُ وَمَنِ [h:5413[ٱ]تَّبَعَكَ مِنَ [h:3047[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"O Prophet! Allah is sufficient for you and (for) such of the believers as follow you.","translation_id":"Wahai Nabi (Muhammad)! Cukuplah Allah (menjadi pelindung) bagimu dan bagi orang-orang mukmin yang mengikutimu.","hasanah_per_verse":370},{"text_madani":"يَا أَيُّهَا النَّبِيُّ حَرِّضِ الْمُؤْمِنِينَ عَلَى الْقِتَالِ ۚ إِن يَكُن مِّنكُمْ عِشْرُونَ صَابِرُونَ يَغْلِبُوا مِائَتَيْنِ ۚ وَإِن يَكُن مِّنكُم مِّائَةٌ يَغْلِبُوا أَلْفًا مِّنَ الَّذِينَ كَفَرُوا بِأَنَّهُمْ قَوْمٌ لَّا يَفْقَهُونَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:5411[ٱ][l[ل][g[نّ]َبِىُّ حَرِّضِ [h:5414[ٱ]لْمُؤْمِنِينَ عَلَى [h:5415[ٱ]لْقِتَالِ‌ۚ إ[a:3202[ِن ي]َك[a:5416[ُن م]ِّ[f:344[نك]ُمْ عِشْرُونَ صَ[n[ـٰ]بِرُونَ يَغْلِبُو[s[اْ] مِ[s[اْ]ئَتَيْنِ‌ۚ وَإ[a:4454[ِن ي]َك[a:5416[ُن م]ِّ[f:344[نك][w:5417[ُم م]ِّ[s[اْ]ئَ[a:5418[ةٌ ي]َغْلِب[o[ُوٓ][s[اْ] أَلْ[a:5419[فًا م]ِّنَ [h:523[ٱ]لَّذِينَ كَفَرُو[s[اْ] بِأَ[g[نّ]َهُمْ قَوْ[u:3651[مٌ ل]َّا يَفْقَه[p[ُو]نَ","translation_en":"O Prophet! urge the believers to war; if there are twenty patient ones of you they shall overcome two hundred, and if there are a hundred of you they shall overcome a thousand of those who disbelieve, because they are a people who do not understand.","translation_id":"Wahai Nabi (Muhammad)! Kobarkanlah semangat para mukmin untuk berperang. Jika ada dua puluh orang yang sabar di antara kamu, niscaya mereka dapat mengalahkan dua ratus orang musuh. Dan jika ada seratus orang (yang sabar) di antara kamu, niscaya mereka dapat mengalahkan seribu orang kafir, karena orang-orang kafir itu adalah kaum yang tidak mengerti.","hasanah_per_verse":1150},{"text_madani":"الْآنَ خَفَّفَ اللَّهُ عَنكُمْ وَعَلِمَ أَنَّ فِيكُمْ ضَعْفًا ۚ فَإِن يَكُن مِّنكُم مِّائَةٌ صَابِرَةٌ يَغْلِبُوا مِائَتَيْنِ ۚ وَإِن يَكُن مِّنكُمْ أَلْفٌ يَغْلِبُوا أَلْفَيْنِ بِإِذْنِ اللَّهِ ۗ وَاللَّهُ مَعَ الصَّابِرِينَ","text_tajweed":"ٱلْـَٔ[n[ـٰ]نَ خَفَّفَ [h:5420[ٱ]للَّهُ عَ[f:255[نك]ُمْ وَعَلِمَ أَ[g[نّ]َ فِيكُمْ ضَعْ[f:5421[فًا‌ۚ ف]َإ[a:5422[ِن ي]َك[a:5416[ُن م]ِّ[f:344[نك][w:5417[ُم م]ِّ[s[اْ]ئَ[f:5423[ةٌ ص]َابِرَ[a:5424[ةٌ ي]َغْلِبُو[s[اْ] مِ[s[اْ]ئَتَيْنِ‌ۚ وَإ[a:4454[ِن ي]َك[a:5416[ُن م]ِّ[f:344[نك]ُمْ أَلْ[a:5425[فٌ ي]َغْلِب[o[ُوٓ][s[اْ] أَلْفَيْنِ بِإِذْنِ [h:509[ٱ]للَّهِ‌ۗ وَ[h:72[ٱ]للَّهُ مَعَ [h:785[ٱ][l[ل]صَّ[n[ـٰ]بِر[p[ِي]نَ","translation_en":"For the present Allah has made light your burden, and He knows that there is weakness in you; so if there are a hundred patient ones of you they shall overcome two hundred, and if there are a thousand they shall overcome two thousand by Allah's permission, and Allah is with the patient.","translation_id":"Sekarang Allah telah meringankan kamu karena Dia mengetahui bahwa ada kelemahan padamu. Maka jika di antara kamu ada seratus orang yang sabar, niscaya mereka dapat mengalahkan dua ratus (orang musuh); dan jika di antara kamu ada seribu orang (yang sabar), niscaya mereka dapat mengalahkan dua ribu orang dengan seizin Allah. Allah beserta orang-orang yang sabar.","hasanah_per_verse":1070},{"text_madani":"مَا كَانَ لِنَبِيٍّ أَن يَكُونَ لَهُ أَسْرَىٰ حَتَّىٰ يُثْخِنَ فِي الْأَرْضِ ۚ تُرِيدُونَ عَرَضَ الدُّنْيَا وَاللَّهُ يُرِيدُ الْآخِرَةَ ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ","text_tajweed":"مَا كَانَ لِنَبِىٍّ أ[a:3312[َن ي]َكُونَ لَهُ[o[ۥٓ] أَسْرَىٰ حَتَّىٰ يُثْخِنَ فِى [h:44[ٱ]لْأَرْضِ‌ۚ تُرِيدُونَ عَرَضَ [h:5426[ٱ][l[ل]دُّنْيَا وَ[h:72[ٱ]للَّهُ يُرِيدُ [h:2327[ٱ]لْأَخِرَةَ‌ۗ وَ[h:72[ٱ]للَّهُ عَزِيزٌ حَك[p[ِي]مٌ","translation_en":"It is not fit for a prophet that he should take captives unless he has fought and triumphed in the land; you desire the frail goods of this world, while Allah desires (for you) the hereafter; and Allah is Mighty, Wise.","translation_id":"Tidaklah pantas, bagi seorang nabi mempunyai tawanan sebelum dia dapat melumpuhkan musuhnya di bumi. Kamu menghendaki harta benda duniawi sedangkan Allah menghendaki (pahala) akhirat (untukmu). Allah Mahaperkasa, Mahabijaksana.","hasanah_per_verse":780},{"text_madani":"لَّوْلَا كِتَابٌ مِّنَ اللَّهِ سَبَقَ لَمَسَّكُمْ فِيمَا أَخَذْتُمْ عَذَابٌ عَظِيمٌ","text_tajweed":"لَّوْلَا كِتَ[n[ـٰ][a:5427[بٌ م]ِّنَ [h:321[ٱ]للَّهِ سَبَقَ لَمَسَّكُمْ فِيم[o[َآ] أَخَذْتُمْ عَذَابٌ عَظ[p[ِي]مٌ","translation_en":"Were it not for an ordinance from Allah that had already gone forth, surely there would have befallen you a great chastisement for what you had taken to.","translation_id":"Sekiranya tidak ada ketetapan terdahulu dari Allah, niscaya kamu ditimpa siksaan yang besar karena (tebusan) yang kamu ambil.","hasanah_per_verse":390},{"text_madani":"فَكُلُوا مِمَّا غَنِمْتُمْ حَلَالًا طَيِّبًا ۚ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ","text_tajweed":"فَكُلُو[s[اْ] مِ[g[مّ]َا غَنِمْتُمْ حَلَ[n[ـٰ]ل[f:870[اً ط]َيِّ[a:3752[بًا‌ۚ و]َ[h:1018[ٱ]تَّقُو[s[اْ] [h:1019[ٱ]للَّهَ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ غَفُو[u:890[رٌ ر]َّح[p[ِي]مٌ","translation_en":"Eat then of the lawful and good (things) which you have acquired in war, and be careful of (your duty to) Allah; surely Allah is Forgiving, Merciful.","translation_id":"Maka makanlah dari sebagian rampasan perang yang telah kamu peroleh itu, sebagai makanan yang halal lagi baik, dan bertakwalah kepada Allah. Sungguh, Allah Maha Pengampun, Maha Penyayang.","hasanah_per_verse":460},{"text_madani":"يَا أَيُّهَا النَّبِيُّ قُل لِّمَن فِي أَيْدِيكُم مِّنَ الْأَسْرَىٰ إِن يَعْلَمِ اللَّهُ فِي قُلُوبِكُمْ خَيْرًا يُؤْتِكُمْ خَيْرًا مِّمَّا أُخِذَ مِنكُمْ وَيَغْفِرْ لَكُمْ ۗ وَاللَّهُ غَفُورٌ رَّحِيمٌ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:5411[ٱ][l[ل][g[نّ]َبِىُّ قُل لِّمَ[f:5428[ن ف][o[ِىٓ] أَيْدِيك[w:5429[ُم م]ِّنَ [h:5430[ٱ]لْأَسْرَ[o[ىٰٓ] إ[a:5431[ِن ي]َعْلَمِ [h:2272[ٱ]للَّهُ فِى قُلُوبِكُمْ خَيْ[a:5432[رًا ي]ُؤْتِكُمْ خَيْ[a:5433[رًا م]ِّ[g[مّ][o[َآ] أُخِذَ مِ[f:344[نك]ُمْ وَيَغْفِرْ لَكُمْ‌ۗ وَ[h:72[ٱ]للَّهُ غَفُو[u:890[رٌ ر]َّح[p[ِي]مٌ","translation_en":"O Prophet! say to those of the captives who are in your hands: If Allah knows anything good in your hearts, He will give to you better than that which has been taken away from you and will forgive you, and Allah is Forgiving, Merciful.","translation_id":"Wahai Nabi (Muhammad)! Katakanlah kepada para tawanan perang yang ada di tanganmu, “Jika Allah mengetahui ada kebaikan di dalam hatimu, niscaya Dia akan memberikan yang lebih baik dari apa yang telah diambil darimu dan Dia akan mengampuni kamu.” Allah Maha Pengampun, Maha Penyayang.","hasanah_per_verse":940},{"text_madani":"وَإِن يُرِيدُوا خِيَانَتَكَ فَقَدْ خَانُوا اللَّهَ مِن قَبْلُ فَأَمْكَنَ مِنْهُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","text_tajweed":"وَإ[a:5405[ِن ي]ُرِيدُو[s[اْ] خِيَانَتَكَ فَقَ[q:563[دْ] خَانُو[s[اْ] [h:5434[ٱ]للَّهَ مِ[f:128[ن ق]َ[q:129[بْ]لُ فَأَمْكَنَ مِنْهُمْ‌ۗ وَ[h:72[ٱ]للَّهُ عَلِيمٌ حَك[p[ِي]مٌ","translation_en":"And if they intend to act unfaithfully towards you, so indeed they acted unfaithfully towards Allah before, but He gave (you) mastery over them; and Allah is Knowing, Wise.","translation_id":"Tetapi jika mereka (tawanan itu) hendak mengkhianatimu (Muhammad) maka sesungguhnya sebelum itu pun mereka telah berkhianat kepada Allah, maka Dia memberikan kekuasaan kepadamu atas mereka. Allah Maha Mengetahui, Mahabijaksana.","hasanah_per_verse":540},{"text_madani":"إِنَّ الَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا بِأَمْوَالِهِمْ وَأَنفُسِهِمْ فِي سَبِيلِ اللَّهِ وَالَّذِينَ آوَوا وَّنَصَرُوا أُولَٰئِكَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ وَالَّذِينَ آمَنُوا وَلَمْ يُهَاجِرُوا مَا لَكُم مِّن وَلَايَتِهِم مِّن شَيْءٍ حَتَّىٰ يُهَاجِرُوا ۚ وَإِنِ اسْتَنصَرُوكُمْ فِي الدِّينِ فَعَلَيْكُمُ النَّصْرُ إِلَّا عَلَىٰ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُم مِّيثَاقٌ ۗ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَهَاجَرُو[s[اْ] وَجَ[n[ـٰ]هَدُو[s[اْ] بِأَمْو[n[َٲ]لِهِمْ وَأَ[f:3050[نف]ُسِهِمْ فِى سَبِيلِ [h:788[ٱ]للَّهِ وَ[h:37[ٱ]لَّذِينَ ءَاوَو[s[اْ] وَّنَصَر[o[ُوٓ][s[اْ] أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ بَعْضُهُمْ أَوْلِي[o[َا]ٓءُ بَعْ[a:5435[ضٍ‌ۚ و]َ[h:37[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَلَمْ يُهَاجِرُو[s[اْ] مَا لَك[w:556[ُم م]ّ[a:5436[ِن و]َلَ[n[ـٰ]يَتِه[w:5437[ِم م]ِّ[f:2103[ن ش]َىْءٍ حَتَّىٰ يُهَاجِرُو[s[اْ‌ۚ] وَإِنِ [h:5438[ٱ]سْتَ[f:5439[نص]َرُوكُمْ فِى [h:1477[ٱ][l[ل]دِّينِ فَعَلَيْكُمُ [h:5440[ٱ][l[ل][g[نّ]َصْرُ إِلَّا عَلَىٰ قَوْ[i:3007[مِۭ ب]َيْنَكُمْ وَبَيْنَه[w:3008[ُم م]ِّيثَ[n[ـٰ][a:5441[قٌ‌ۗ و]َ[h:72[ٱ]للَّهُ بِمَا تَعْمَلُونَ بَص[p[ِي]رٌ","translation_en":"Surely those who believed and fled (their homes) and struggled hard in Allah's way with their property and their souls, and those who gave shelter and helped-- these are guardians of each other; and (as for) those who believed and did not fly, not yours is their guardianship until they fly; and if they seek aid from you in the matter of religion, aid is incumbent on you except against a people between whom and you there is a treaty, and Allah sees what you do.","translation_id":"Sesungguhnya orang-orang yang beriman dan berhijrah serta berjihad dengan harta dan jiwanya pada jalan Allah dan orang-orang yang memberikan tempat kediaman dan memberi pertolongan (kepada Muhajirin), mereka itu satu sama lain saling melindungi. Dan (terhadap) orang-orang yang beriman tetapi belum berhijrah, maka tidak ada kewajiban sedikit pun bagimu melindungi mereka, sampai mereka berhijrah. (Tetapi) jika mereka meminta pertolongan kepadamu dalam (urusan pembelaan) agama, maka kamu wajib memberikan pertolongan kecuali terhadap kaum yang telah terikat perjanjian antara kamu dengan mereka. Dan Allah Maha Melihat apa yang kamu kerjakan.","hasanah_per_verse":2090},{"text_madani":"وَالَّذِينَ كَفَرُوا بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ إِلَّا تَفْعَلُوهُ تَكُن فِتْنَةٌ فِي الْأَرْضِ وَفَسَادٌ كَبِيرٌ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ كَفَرُو[s[اْ] بَعْضُهُمْ أَوْلِي[o[َا]ٓءُ بَعْضٍ‌ۚ إِلَّا تَفْعَلُوهُ تَكُ[f:5442[ن ف]ِتْنَ[f:5443[ةٌ ف]ِى [h:44[ٱ]لْأَرْضِ وَفَسَا[f:5444[دٌ ك]َب[p[ِي]رٌ","translation_en":"And (as for) those who disbelieve, some of them are the guardians of others; if you will not do it, there will be in the land persecution and great mischief.","translation_id":"Dan orang-orang yang kafir, sebagian mereka melindungi sebagian yang lain. Jika kamu tidak melaksanakan apa yang telah diperintahkan Allah (saling melindungi), niscaya akan terjadi kekacauan di bumi dan kerusakan yang besar.","hasanah_per_verse":570},{"text_madani":"وَالَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ وَالَّذِينَ آوَوا وَّنَصَرُوا أُولَٰئِكَ هُمُ الْمُؤْمِنُونَ حَقًّا ۚ لَّهُم مَّغْفِرَةٌ وَرِزْقٌ كَرِيمٌ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَهَاجَرُو[s[اْ] وَجَ[n[ـٰ]هَدُو[s[اْ] فِى سَبِيلِ [h:788[ٱ]للَّهِ وَ[h:37[ٱ]لَّذِينَ ءَاوَو[s[اْ] وَّنَصَر[o[ُوٓ][s[اْ] أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:5236[ٱ]لْمُؤْمِنُونَ حَق[u:5237[ًّا‌ۚ ل]َّه[w:3412[ُم م]َّغْفِرَ[a:5445[ةٌ و]َرِزْ[f:5239[قٌ ك]َر[p[ِي]مٌ","translation_en":"And (as for) those who believed and fled and struggled hard in Allah's way, and those who gave shelter and helped, these are the believers truly; they shall have forgiveness and honorable provision.","translation_id":"Dan orang-orang yang beriman dan berhijrah serta berjihad di jalan Allah, dan orang-orang yang memberi tempat kediaman dan memberi pertolongan (kepada orang Muhajirin), mereka itulah orang yang benar-benar beriman. Mereka memperoleh ampunan dan rezeki (nikmat) yang mulia.","hasanah_per_verse":850},{"text_madani":"وَالَّذِينَ آمَنُوا مِن بَعْدُ وَهَاجَرُوا وَجَاهَدُوا مَعَكُمْ فَأُولَٰئِكَ مِنكُمْ ۚ وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ فِي كِتَابِ اللَّهِ ۗ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ ءَامَنُو[s[اْ] م[i:1287[ِنۢ ب]َعْدُ وَهَاجَرُو[s[اْ] وَجَ[n[ـٰ]هَدُو[s[اْ] مَعَكُمْ فَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ مِ[f:344[نك]ُمْ‌ۚ وَأُ[s[وْ]لُو[s[اْ] [h:5446[ٱ]لْأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْ[f:5447[ضٍ ف]ِى كِتَ[n[ـٰ]بِ [h:1816[ٱ]للَّهِ‌ۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ بِكُلِّ شَىْءٍ عَل[p[ِي]مُۢ","translation_en":"And (as for) those who believed afterwards and fled and struggled hard along with you, they are of you; and the possessors of relationships are nearer to each other in the ordinance of Allah; surely Allah knows all things.","translation_id":"Dan orang-orang yang beriman setelah itu, kemudian berhijrah dan berjihad bersamamu maka mereka termasuk golonganmu. Orang-orang yang mempunyai hubungan kerabat itu sebagiannya lebih berhak terhadap sesamanya (daripada yang bukan kerabat) menurut Kitab Allah. Sungguh, Allah Maha Mengetahui segala sesuatu.","hasanah_per_verse":950}]}
