{"chapter_number":43,"name_simple":"Az-Zukhruf","name_meaning":{"text":"The Ornaments of Gold","en":"The Ornaments of Gold","id":"Perhiasan"},"verses_count":89,"hasanah":36090,"verses":[{"text_madani":"حم","text_tajweed":"ح[m[مٓ]","translation_en":"Ha Mim.","translation_id":"Haa Mim","hasanah_per_verse":20},{"text_madani":"وَالْكِتَابِ الْمُبِينِ","text_tajweed":"وَ[h:9999[ٱ]لْكِتَ[n[ـٰ]بِ [h:12190[ٱ]لْمُب[p[ِي]نِ","translation_en":"I swear by the Book that makes things clear:","translation_id":"Demi Kitab (Al-Qur'an) yang jelas.","hasanah_per_verse":130},{"text_madani":"إِنَّا جَعَلْنَاهُ قُرْآنًا عَرَبِيًّا لَّعَلَّكُمْ تَعْقِلُونَ","text_tajweed":"إِ[g[نّ]َا جَعَلْنَ[n[ـٰ]هُ قُرْء[n[َٲ]نًا عَرَبِي[u:6542[ًّا ل]َّعَلَّكُمْ تَعْقِل[p[ُو]نَ","translation_en":"Surely We have made it an Arabic Quran that you may understand.","translation_id":"Kami menjadikan Al-Qur'an dalam bahasa Arab agar kamu mengerti.","hasanah_per_verse":300},{"text_madani":"وَإِنَّهُ فِي أُمِّ الْكِتَابِ لَدَيْنَا لَعَلِيٌّ حَكِيمٌ","text_tajweed":"وَإِ[g[نّ]َهُ[n[ۥ] ف[o[ِىٓ] أُ[g[مّ]ِ [h:12191[ٱ]لْكِتَ[n[ـٰ]بِ لَدَيْنَا لَعَلِىٌّ حَك[p[ِي]مٌ","translation_en":"And surely it is in the original of the Book with Us, truly elevated, full of wisdom.","translation_id":"Dan sesungguhnya Al-Qur'an itu dalam Ummul Kitab (Lauh Mahfuzhh) di sisi Kami, benar-benar (bernilai) tinggi dan penuh hikmah.","hasanah_per_verse":270},{"text_madani":"أَفَنَضْرِبُ عَنكُمُ الذِّكْرَ صَفْحًا أَن كُنتُمْ قَوْمًا مُّسْرِفِينَ","text_tajweed":"أَفَنَضْرِبُ عَ[f:10796[نك]ُمُ [h:12192[ٱ][l[ل]ذِّكْرَ صَفْحًا أَ[f:12193[ن ك]ُ[f:100[نت]ُمْ قَوْ[a:12194[مًا م]ُّسْرِف[p[ِي]نَ","translation_en":"What! shall We then turn away the reminder from you altogether because you are an extravagant people?","translation_id":"Maka apakah Kami akan berhenti menurunkan ayat-ayat (sebagai peringatan) Al-Qur'an kepadamu, karena kamu kaum yang melampaui batas?","hasanah_per_verse":350},{"text_madani":"وَكَمْ أَرْسَلْنَا مِن نَّبِيٍّ فِي الْأَوَّلِينَ","text_tajweed":"وَكَمْ أَرْسَلْنَا م[a:2299[ِن ن]َّبِ[f:12195[ىٍّ ف]ِى [h:12196[ٱ]لْأَوَّل[p[ِي]نَ","translation_en":"And how many a prophet have We sent among the ancients.","translation_id":"Dan betapa banyak nabi-nabi yang telah Kami utus kepada umat-umat yang terdahulu.","hasanah_per_verse":230},{"text_madani":"وَمَا يَأْتِيهِم مِّن نَّبِيٍّ إِلَّا كَانُوا بِهِ يَسْتَهْزِئُونَ","text_tajweed":"وَمَا يَأْتِيه[w:7205[ِم م]ّ[a:2299[ِن ن]َّبِىٍّ إِلَّا كَانُو[s[اْ] بِه[n[ِۦ] يَسْتَهْزِء[p[ُو]نَ","translation_en":"And there came not to them a prophet but they mocked at him.","translation_id":"Dan setiap kali seorang nabi datang kepada mereka, mereka selalu memperolok-olokkannya.","hasanah_per_verse":320},{"text_madani":"فَأَهْلَكْنَا أَشَدَّ مِنْهُم بَطْشًا وَمَضَىٰ مَثَلُ الْأَوَّلِينَ","text_tajweed":"فَأَهْلَكْن[o[َآ] أَشَدَّ مِنْه[c:12197[ُم ب]َ[q:12198[طْ][a:12199[شًا و]َمَضَىٰ مَثَلُ [h:12200[ٱ]لْأَوَّل[p[ِي]نَ","translation_en":"Then We destroyed those who were stronger than these in prowess, and the case of the ancients has gone before,","translation_id":"Karena itu Kami binasakan orang-orang yang lebih besar kekuatannya di antara mereka dan telah berlalu contoh umat-umat terdahulu.","hasanah_per_verse":320},{"text_madani":"وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ خَلَقَهُنَّ الْعَزِيزُ الْعَلِيمُ","text_tajweed":"وَلَئِ[f:5683[ن س]َأَلْتَه[w:10403[ُم م]َّنْ خَلَقَ [h:3913[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ لَيَقُولُ[g[نّ]َ خَلَقَهُ[g[نّ]َ [h:12201[ٱ]لْعَزِيزُ [h:10030[ٱ]لْعَل[p[ِي]مُ","translation_en":"And if you should ask them, Who created the heavens and the earth? they would most certainly say: The Mighty, the Knowing One, has created them;","translation_id":"Dan jika kamu tanyakan kepada mereka, “Siapakah yang menciptakan langit dan bumi?” Pastilah mereka akan menjawab, “Semuanya diciptakan oleh Yang Mahaperkasa, Maha Mengetahui.”","hasanah_per_verse":520},{"text_madani":"الَّذِي جَعَلَ لَكُمُ الْأَرْضَ مَهْدًا وَجَعَلَ لَكُمْ فِيهَا سُبُلًا لَّعَلَّكُمْ تَهْتَدُونَ","text_tajweed":"ٱلَّذِى جَعَلَ لَكُمُ [h:87[ٱ]لْأَرْضَ مَهْ[a:12202[دًا و]َجَعَلَ لَكُمْ فِيهَا سُبُل[u:12203[اً ل]َّعَلَّكُمْ تَهْتَد[p[ُو]نَ","translation_en":"He Who made the earth a resting-place for you, and made in it ways for you that you may go aright;","translation_id":"Yang menjadikan bumi sebagai tempat menetap bagimu dan Dia menjadikan jalan-jalan di atas bumi untukmu agar kamu mendapat petunjuk.","hasanah_per_verse":450},{"text_madani":"وَالَّذِي نَزَّلَ مِنَ السَّمَاءِ مَاءً بِقَدَرٍ فَأَنشَرْنَا بِهِ بَلْدَةً مَّيْتًا ۚ كَذَٰلِكَ تُخْرَجُونَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِى نَزَّلَ مِنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ م[o[َا]ٓ[i:9165[ءَۢ ب]ِقَدَ[f:12204[رٍ ف]َأَ[f:12205[نش]َرْنَا بِه[n[ِۦ] بَلْدَ[a:9661[ةً م]َّيْ[f:12206[تًا‌ۚ ك]َذ[n[َٲ]لِكَ تُخْرَج[p[ُو]نَ","translation_en":"And He Who sends down water from the cloud according to a measure, then We raise to life thereby a dead country, even thus shall you be brought forth;","translation_id":"Dan yang menurunkan air dari langit menurut ukuran (yang diperlukan) lalu dengan air itu Kami hidupkan negeri yang mati (tandus). Seperti itulah kamu akan dikeluarkan (dari kubur).","hasanah_per_verse":500},{"text_madani":"وَالَّذِي خَلَقَ الْأَزْوَاجَ كُلَّهَا وَجَعَلَ لَكُم مِّنَ الْفُلْكِ وَالْأَنْعَامِ مَا تَرْكَبُونَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِى خَلَقَ [h:11235[ٱ]لْأَزْو[n[َٲ]جَ كُلَّهَا وَجَعَلَ لَك[w:1578[ُم م]ِّنَ [h:12207[ٱ]لْفُلْكِ وَ[h:1778[ٱ]لْأَنْعَ[n[ـٰ]مِ مَا تَرْكَب[p[ُو]نَ","translation_en":"And He Who created pairs of all things, and made for you of the ships and the cattle what you ride on,","translation_id":"Dan yang menciptakan semua berpasang-pasangan dan menjadikan kapal untukmu dan hewan ternak yang kamu tunggangi.","hasanah_per_verse":490},{"text_madani":"لِتَسْتَوُوا عَلَىٰ ظُهُورِهِ ثُمَّ تَذْكُرُوا نِعْمَةَ رَبِّكُمْ إِذَا اسْتَوَيْتُمْ عَلَيْهِ وَتَقُولُوا سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ","text_tajweed":"لِتَسْتَوُ[n[ۥ]اْ عَلَىٰ ظُهُورِه[n[ِۦ] ثُ[g[مّ]َ تَذْكُرُو[s[اْ] نِعْمَةَ رَبِّكُمْ إِذَا [h:12208[ٱ]سْتَوَيْتُمْ عَلَيْهِ وَتَقُولُو[s[اْ] سُ[q:7648[بْ]حَ[n[ـٰ]نَ [h:7649[ٱ]لَّذِى سَخَّرَ لَنَا هَ[n[ـٰ]ذَا وَمَا كُ[g[نّ]َا لَهُ[n[ۥ] مُ[q:12209[قْ]رِن[p[ِي]نَ","translation_en":"That you may firmly sit on their backs, then remember the favor of your Lord when you are firmly seated thereon, and say: Glory be to Him Who made this subservient to us and we were not able to do it","translation_id":"Agar kamu duduk di atas punggungnya kemudian kamu ingat nikmat Tuhanmu apabila kamu telah duduk di atasnya; dan agar kamu mengucapkan, “Maha-suci (Allah) yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya,","hasanah_per_verse":840},{"text_madani":"وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ","text_tajweed":"وَإِ[g[نّ][o[َآ] إِلَىٰ رَبِّنَا لَمُ[f:12210[نق]َلِب[p[ُو]نَ","translation_en":"And surely to our Lord we must return.","translation_id":"dan sesungguhnya kami akan kembali kepada Tuhan kami.”","hasanah_per_verse":190},{"text_madani":"وَجَعَلُوا لَهُ مِنْ عِبَادِهِ جُزْءًا ۚ إِنَّ الْإِنسَانَ لَكَفُورٌ مُّبِينٌ","text_tajweed":"وَجَعَلُو[s[اْ] لَهُ[n[ۥ] مِنْ عِبَادِه[n[ِۦ] جُزْءًا‌ۚ إِ[g[نّ]َ [h:7137[ٱ]لْإِ[f:5969[نس]َ[n[ـٰ]نَ لَكَفُو[a:12211[رٌ م]ُّب[p[ِي]نٌ","translation_en":"And they assign to Him a part of His servants; man, to be sure, is clearly ungrateful.","translation_id":"Dan mereka menjadikan sebagian dari hamba-hamba-Nya sebagai bagian dari-Nya. Sungguh, manusia itu pengingkar (nikmat Tuhan) yang nyata.","hasanah_per_verse":370},{"text_madani":"أَمِ اتَّخَذَ مِمَّا يَخْلُقُ بَنَاتٍ وَأَصْفَاكُم بِالْبَنِينَ","text_tajweed":"أَمِ [h:8410[ٱ]تَّخَذَ مِ[g[مّ]َا يَخْلُقُ بَنَا[a:12212[تٍ و]َأَصْفَ[n[ـٰ]ك[c:12213[ُم ب]ِ[h:7764[ٱ]لْبَن[p[ِي]نَ","translation_en":"What! has He taken daughters to Himself of what He Himself creates and chosen you to have sons?","translation_id":"Pantaskah Dia mengambil anak perempuan dari yang diciptakan-Nya dan memberikan anak laki-laki kepadamu?","hasanah_per_verse":310},{"text_madani":"وَإِذَا بُشِّرَ أَحَدُهُم بِمَا ضَرَبَ لِلرَّحْمَٰنِ مَثَلًا ظَلَّ وَجْهُهُ مُسْوَدًّا وَهُوَ كَظِيمٌ","text_tajweed":"وَإِذَا بُشِّرَ أَحَدُه[c:12214[ُم ب]ِمَا ضَرَبَ لِلرَّحْمَ[n[ـٰ]نِ مَثَل[f:12215[اً ظ]َلَّ وَ[q:7445[جْ]هُهُ[n[ۥ] مُسْوَد[a:7446[ًّا و]َهُوَ كَظ[p[ِي]مٌ","translation_en":"And when one of them is given news of that of which he sets up as a likeness for the Beneficent Allah, his face becomes black and he is full of rage.","translation_id":"Dan apabila salah seorang di antara mereka diberi kabar gembira dengan apa (kelahiran anak perempuan) yang dijadikan sebagai perumpamaan bagi (Allah) Yang Maha Pengasih, jadilah wajahnya hitam pekat, karena menahan sedih (dan marah).","hasanah_per_verse":460},{"text_madani":"أَوَمَن يُنَشَّأُ فِي الْحِلْيَةِ وَهُوَ فِي الْخِصَامِ غَيْرُ مُبِينٍ","text_tajweed":"أَوَم[a:12216[َن ي]ُنَشَّؤُ[s[اْ] فِى [h:12217[ٱ]لْحِلْيَةِ وَهُوَ فِى [h:12218[ٱ]لْخِصَامِ غَيْرُ مُب[p[ِي]نٍ","translation_en":"What! that which is made in ornaments and which in contention is unable to make plain speech!","translation_id":"Dan apakah patut (menjadi anak Allah) orang yang dibesarkan sebagai perhiasan sedang dia tidak mampu memberi alasan yang tegas dan jelas dalam pertengkaran.","hasanah_per_verse":340},{"text_madani":"وَجَعَلُوا الْمَلَائِكَةَ الَّذِينَ هُمْ عِبَادُ الرَّحْمَٰنِ إِنَاثًا ۚ أَشَهِدُوا خَلْقَهُمْ ۚ سَتُكْتَبُ شَهَادَتُهُمْ وَيُسْأَلُونَ","text_tajweed":"وَجَعَلُو[s[اْ] [h:12219[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةَ [h:12220[ٱ]لَّذِينَ هُمْ عِبَ[n[ـٰ]دُ [h:12221[ٱ][l[ل]رَّحْمَ[n[ـٰ]نِ إِنَ[n[ـٰ]ثًا‌ۚ أَشَهِدُو[s[اْ] خَلْقَهُمْ‌ۚ سَتُكْتَبُ شَهَ[n[ـٰ]دَتُهُمْ وَيُسْــَٔل[p[ُو]نَ","translation_en":"And they make the angels-- them who are the servants of the Beneficent Allah-- female (divinities). What! did they witness their creation? Their evidence shall be written down and they shall be questioned.","translation_id":"Dan mereka menjadikan malaikat-malaikat hamba-hamba (Allah) Yang Maha Pengasih itu sebagai jenis perempuan. Apakah mereka menyaksikan penciptaan (malaikat-malaikat itu)? Kelak akan dituliskan kesaksian mereka dan akan dimintakan pertanggungjawaban.","hasanah_per_verse":660},{"text_madani":"وَقَالُوا لَوْ شَاءَ الرَّحْمَٰنُ مَا عَبَدْنَاهُم ۗ مَّا لَهُم بِذَٰلِكَ مِنْ عِلْمٍ ۖ إِنْ هُمْ إِلَّا يَخْرُصُونَ","text_tajweed":"وَقَالُو[s[اْ] لَوْ ش[o[َا]ٓءَ [h:12222[ٱ][l[ل]رَّحْمَ[n[ـٰ]نُ مَا عَبَ[q:12223[دْ]نَ[n[ـٰ]ه[w:12224[ُم‌ۗ م]َّا لَه[c:12225[ُم ب]ِذ[n[َٲ]لِكَ مِنْ عِلْمٍ‌ۖ إِنْ هُمْ إِلَّا يَخْرُص[p[ُو]نَ","translation_en":"And they say: If the Beneficent Allah had pleased, we should never have worshipped them. They have no knowledge of this; they only lie.","translation_id":"Dan mereka berkata, “Sekiranya (Allah) Yang Maha Pengasih menghendaki, tentulah kami tidak menyembah mereka (malaikat).” Mereka tidak mempunyai ilmu sedikit pun tentang itu. Tidak lain mereka hanyalah menduga-duga belaka.","hasanah_per_verse":530},{"text_madani":"أَمْ آتَيْنَاهُمْ كِتَابًا مِّن قَبْلِهِ فَهُم بِهِ مُسْتَمْسِكُونَ","text_tajweed":"أَمْ ءَاتَيْنَ[n[ـٰ]هُمْ كِتَ[n[ـٰ][a:12226[بًا م]ِّ[f:1097[ن ق]َ[q:1098[بْ]لِه[n[ِۦ] فَه[c:12227[ُم ب]ِه[n[ِۦ] مُسْتَمْسِك[p[ُو]نَ","translation_en":"Or have We given them a book before it so that they hold fast to it?","translation_id":"Atau apakah pernah Kami berikan sebuah kitab kepada mereka sebelumnya, lalu mereka berpegang (pada kitab itu)?","hasanah_per_verse":330},{"text_madani":"بَلْ قَالُوا إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِم مُّهْتَدُونَ","text_tajweed":"بَلْ قَال[o[ُوٓ][s[اْ] إِ[g[نّ]َا وَجَ[q:3834[دْ]ن[o[َآ] ءَاب[o[َا]ٓءَنَا عَلَ[o[ىٰٓ] أُ[g[مّ]َ[a:12228[ةٍ و]َإِ[g[نّ]َا عَلَ[o[ىٰٓ] ءَاثَ[n[ـٰ]رِه[w:12229[ِم م]ُّهْتَد[p[ُو]نَ","translation_en":"Nay! they say: We found our fathers on a course, and surely we are guided by their footsteps.","translation_id":"Bahkan mereka berkata, “Sesungguhnya kami mendapati nenek moyang kami menganut suatu agama, dan kami mendapat petunjuk untuk mengikuti jejak mereka.”","hasanah_per_verse":460},{"text_madani":"وَكَذَٰلِكَ مَا أَرْسَلْنَا مِن قَبْلِكَ فِي قَرْيَةٍ مِّن نَّذِيرٍ إِلَّا قَالَ مُتْرَفُوهَا إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِم مُّقْتَدُونَ","text_tajweed":"وَكَذ[n[َٲ]لِكَ م[o[َآ] أَرْسَلْنَا مِ[f:18[ن ق]َ[q:19[بْ]لِكَ فِى قَرْيَ[a:4874[ةٍ م]ّ[a:10183[ِن ن]َّذِيرٍ إِلَّا قَالَ مُتْرَفُوه[o[َآ] إِ[g[نّ]َا وَجَ[q:3834[دْ]ن[o[َآ] ءَاب[o[َا]ٓءَنَا عَلَ[o[ىٰٓ] أُ[g[مّ]َ[a:12228[ةٍ و]َإِ[g[نّ]َا عَلَ[o[ىٰٓ] ءَاثَ[n[ـٰ]رِه[w:12230[ِم م]ُّ[q:12231[قْ]تَد[p[ُو]نَ","translation_en":"And thus, We did not send before you any warner in a town, but those who led easy lives in it said: Surely we found our fathers on a course, and surely we are followers of their footsteps.","translation_id":"Dan demikian juga ketika Kami mengutus seorang pemberi peringatan sebelum engkau (Muhammad) dalam suatu negeri, orang-orang yang hidup mewah (di negeri itu) selalu berkata, “Sesungguhnya kami mendapati nenek moyang kami menganut suatu (agama) dan sesungguhnya kami sekedar pengikut jejak-jejak mereka.”","hasanah_per_verse":830},{"text_madani":"قَالَ أَوَلَوْ جِئْتُكُم بِأَهْدَىٰ مِمَّا وَجَدتُّمْ عَلَيْهِ آبَاءَكُمْ ۖ قَالُوا إِنَّا بِمَا أُرْسِلْتُم بِهِ كَافِرُونَ","text_tajweed":"۞ قَ[n[ـٰ]لَ أَوَلَوْ جِئْتُك[c:12232[ُم ب]ِأَهْدَىٰ مِ[g[مّ]َا وَجَ[d:4703[د]تُّمْ عَلَيْهِ ءَاب[o[َا]ٓءَكُمْ‌ۖ قَال[o[ُوٓ][s[اْ] إِ[g[نّ]َا بِم[o[َآ] أُرْسِلْت[c:7059[ُم ب]ِه[n[ِۦ] كَ[n[ـٰ]فِر[p[ُو]نَ","translation_en":"(The warner) said: What! even if I bring to you a better guide than that on which you found your fathers? They said: Surely we are unbelievers in that with which you are sent.","translation_id":"(Rasul itu) berkata, “Apakah (kamu akan mengikutinya juga) sekalipun aku membawa untukmu (agama) yang lebih baik daripada apa yang kamu peroleh dari (agama) yang dianut nenek moyangmu.” Mereka menjawab, “Sesungguhnya kami mengingkari (agama) yang kamu diperintahkan untuk menyampaikannya.”","hasanah_per_verse":600},{"text_madani":"فَانتَقَمْنَا مِنْهُمْ ۖ فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِينَ","text_tajweed":"فَ[h:9999[ٱ][f:4969[نت]َقَمْنَا مِنْهُمْ‌ۖ فَ[h:1513[ٱ][f:1513[نظ]ُرْ كَيْفَ كَانَ عَ[n[ـٰ]قِبَةُ [h:2258[ٱ]لْمُكَذِّب[p[ِي]نَ","translation_en":"So We inflicted retribution on them, then see how was the end of the rejecters.","translation_id":"Lalu Kami binasakan mereka, maka perhatikanlah bagaimana kesudahan orang-orang yang mendustakan (kebenaran).","hasanah_per_verse":360},{"text_madani":"وَإِذْ قَالَ إِبْرَاهِيمُ لِأَبِيهِ وَقَوْمِهِ إِنَّنِي بَرَاءٌ مِّمَّا تَعْبُدُونَ","text_tajweed":"وَإِذْ قَالَ إِ[q:2003[بْ]ر[n[َٲ]هِيمُ لِأَبِيهِ وَقَوْمِه[o[ِۦٓ] إِ[g[نّ]َنِى بَر[o[َا]ٓ[a:12233[ءٌ م]ِّ[g[مّ]َا تَعْبُد[p[ُو]نَ","translation_en":"And when Ibrahim said to his father and his people: Surely I am clear of what you worship,","translation_id":"Dan (ingatlah) ketika Ibrahim berkata kepada ayahnya dan kaumnya, “Sesungguhnya aku berlepas diri dari apa yang kamu sembah,","hasanah_per_verse":400},{"text_madani":"إِلَّا الَّذِي فَطَرَنِي فَإِنَّهُ سَيَهْدِينِ","text_tajweed":"إِلَّا [h:6186[ٱ]لَّذِى فَطَرَنِى فَإِ[g[نّ]َهُ[n[ۥ] سَيَهْد[p[ِي]نِ","translation_en":"Save Him Who created me, for surely He will guide me.","translation_id":"kecuali (kamu menyembah) Allah yang menciptakanku; karena sungguh, Dia akan memberi petunjuk kepadaku.”","hasanah_per_verse":220},{"text_madani":"وَجَعَلَهَا كَلِمَةً بَاقِيَةً فِي عَقِبِهِ لَعَلَّهُمْ يَرْجِعُونَ","text_tajweed":"وَجَعَلَهَا كَلِمَ[i:12234[ةَۢ ب]َاقِيَ[f:12235[ةً ف]ِى عَقِبِه[n[ِۦ] لَعَلَّهُمْ يَرْجِع[p[ُو]نَ","translation_en":"And he made it a word to continue in his posterity that they may return.","translation_id":"Dan (Ibrahim) menjadikan (kalimat tauhid) itu kalimat yang kekal pada keturunannya agar mereka kembali (kepada kalimat tauhid itu).","hasanah_per_verse":320},{"text_madani":"بَلْ مَتَّعْتُ هَٰؤُلَاءِ وَآبَاءَهُمْ حَتَّىٰ جَاءَهُمُ الْحَقُّ وَرَسُولٌ مُّبِينٌ","text_tajweed":"بَلْ مَتَّعْتُ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ وَءَاب[o[َا]ٓءَهُمْ حَتَّىٰ ج[o[َا]ٓءَهُمُ [h:6141[ٱ]لْحَقُّ وَرَسُو[a:12236[لٌ م]ُّب[p[ِي]نٌ","translation_en":"Nay! I gave them and their fathers to enjoy until there came to them the truth and a Messenger making manifest (the truth).","translation_id":"Bahkan Aku telah memberikan kenikmatan hidup kepada mereka dan nenek moyang mereka sampai kebenaran (Al-Qur'an) datang kepada mereka beserta seorang Rasul yang memberi penjelasan.","hasanah_per_verse":390},{"text_madani":"وَلَمَّا جَاءَهُمُ الْحَقُّ قَالُوا هَٰذَا سِحْرٌ وَإِنَّا بِهِ كَافِرُونَ","text_tajweed":"وَلَ[g[مّ]َا ج[o[َا]ٓءَهُمُ [h:6141[ٱ]لْحَقُّ قَالُو[s[اْ] هَ[n[ـٰ]ذَا سِحْ[a:12237[رٌ و]َإِ[g[نّ]َا بِه[n[ِۦ] كَ[n[ـٰ]فِر[p[ُو]نَ","translation_en":"And when there came to them the truth they said: This is magic, and surely we are disbelievers in it.","translation_id":"Tetapi ketika kebenaran (Al-Qur'an) itu datang kepada mereka, mereka berkata, “Ini adalah sihir dan sesungguhnya kami mengingkarinya.”","hasanah_per_verse":360},{"text_madani":"وَقَالُوا لَوْلَا نُزِّلَ هَٰذَا الْقُرْآنُ عَلَىٰ رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيمٍ","text_tajweed":"وَقَالُو[s[اْ] لَوْلَا نُزِّلَ هَ[n[ـٰ]ذَا [h:3971[ٱ]لْقُرْءَانُ عَلَىٰ رَجُ[a:12238[لٍ م]ِّنَ [h:12239[ٱ]لْقَرْيَتَيْنِ عَظ[p[ِي]مٍ","translation_en":"And they say: Why was not this Quran revealed to a man of importance in the two towns?","translation_id":"Dan mereka (juga) berkata, “Mengapa Al-Qur'an ini tidak diturunkan kepada orang besar (kaya dan berpengaruh) dari salah satu dua negeri ini (Mekah dan Taif)?”","hasanah_per_verse":420},{"text_madani":"أَهُمْ يَقْسِمُونَ رَحْمَتَ رَبِّكَ ۚ نَحْنُ قَسَمْنَا بَيْنَهُم مَّعِيشَتَهُمْ فِي الْحَيَاةِ الدُّنْيَا ۚ وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِّيَتَّخِذَ بَعْضُهُم بَعْضًا سُخْرِيًّا ۗ وَرَحْمَتُ رَبِّكَ خَيْرٌ مِّمَّا يَجْمَعُونَ","text_tajweed":"أَهُمْ يَ[q:12240[قْ]سِمُونَ رَحْمَتَ رَبِّكَ‌ۚ نَحْنُ قَسَمْنَا بَيْنَه[w:12241[ُم م]َّعِيشَتَهُمْ فِى [h:441[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا‌ۚ وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْ[f:4575[ضٍ د]َرَجَ[n[ـٰ][u:12242[تٍ ل]ِّيَتَّخِذَ بَعْضُه[c:11159[ُم ب]َعْ[f:12243[ضًا س]ُخْرِي[a:12244[ًّا‌ۗ و]َرَحْمَتُ رَبِّكَ خَيْ[a:2365[رٌ م]ِّ[g[مّ]َا يَ[q:2366[جْ]مَع[p[ُو]نَ","translation_en":"Will they distribute the mercy of your Lord? We distribute among them their livelihood in the life of this world, and We j have exalted some of them above others in degrees, that some of them may take others in subjection; and the mercy of your Lord is better than what they amass.","translation_id":"Apakah mereka yang membagi-bagi rahmat Tuhanmu? Kamilah yang menentukan penghidupan mereka dalam kehidupan dunia, dan Kami telah meninggikan sebagian mereka atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat memanfaatkan sebagian yang lain. Dan rahmat Tuhanmu lebih baik dari apa yang mereka kumpulkan.","hasanah_per_verse":1110},{"text_madani":"وَلَوْلَا أَن يَكُونَ النَّاسُ أُمَّةً وَاحِدَةً لَّجَعَلْنَا لِمَن يَكْفُرُ بِالرَّحْمَٰنِ لِبُيُوتِهِمْ سُقُفًا مِّن فِضَّةٍ وَمَعَارِجَ عَلَيْهَا يَظْهَرُونَ","text_tajweed":"وَلَوْل[o[َآ] أ[a:3312[َن ي]َكُونَ [h:12245[ٱ][l[ل][g[نّ]َاسُ أُ[g[مّ]َ[a:1159[ةً و][n[َٲ]حِدَ[u:12246[ةً ل]َّجَعَلْنَا لِم[a:12247[َن ي]َكْفُرُ بِ[h:6981[ٱ][l[ل]رَّحْمَ[n[ـٰ]نِ لِبُيُوتِهِمْ سُقُ[a:12248[فًا م]ِّ[f:12249[ن ف]ِضَّ[a:12250[ةٍ و]َمَعَارِجَ عَلَيْهَا يَظْهَر[p[ُو]نَ","translation_en":"And were it not that all people had been a single nation, We would certainly have assigned to those who disbelieve in the Beneficent Allah (to make) of silver the roofs of their houses and the stairs by which they ascend.","translation_id":"Dan sekiranya bukan karena menghindarkan manusia menjadi umat yang satu (dalam kekafiran), pastilah sudah Kami buatkan bagi orang-orang yang kafir kepada (Allah) Yang Maha Pengasih, loteng-loteng rumah mereka dari perak, demikian pula tangga-tangga yang mereka naiki,","hasanah_per_verse":770},{"text_madani":"وَلِبُيُوتِهِمْ أَبْوَابًا وَسُرُرًا عَلَيْهَا يَتَّكِئُونَ","text_tajweed":"وَلِبُيُوتِهِمْ أَ[q:12251[بْ]و[n[َٲ][a:12252[بًا و]َسُرُرًا عَلَيْهَا يَتَّكِــٔ[p[ُو]نَ","translation_en":"And the doors of their houses and the couches on which they recline,","translation_id":"dan (Kami buatkan pula) pintu-pintu (perak) bagi rumah-rumah mereka, dan (begitu pula) dipan-dipan tempat mereka bersandar,","hasanah_per_verse":300},{"text_madani":"وَزُخْرُفًا ۚ وَإِن كُلُّ ذَٰلِكَ لَمَّا مَتَاعُ الْحَيَاةِ الدُّنْيَا ۚ وَالْآخِرَةُ عِندَ رَبِّكَ لِلْمُتَّقِينَ","text_tajweed":"وَزُخْرُ[a:12253[فًا‌ۚ و]َإِ[f:12254[ن ك]ُلُّ ذ[n[َٲ]لِكَ لَ[g[مّ]َا مَتَ[n[ـٰ]عُ [h:1780[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا‌ۚ وَ[h:2944[ٱ]لْأَخِرَةُ عِ[f:264[ند]َ رَبِّكَ لِلْمُتَّق[p[ِي]نَ","translation_en":"And (other) embellishments of gold; and all this is naught but provision of this world's life, and the hereafter is with your Lord only for those who guard (against evil).","translation_id":"dan (Kami buatkan pula) perhiasan-perhiasan dari emas. Dan semuanya itu tidak lain hanyalah kesenangan kehidupan dunia, sedangkan kehidupan akhirat di sisi Tuhanmu disediakan bagi orang-orang yang bertakwa.","hasanah_per_verse":530},{"text_madani":"وَمَن يَعْشُ عَن ذِكْرِ الرَّحْمَٰنِ نُقَيِّضْ لَهُ شَيْطَانًا فَهُوَ لَهُ قَرِينٌ","text_tajweed":"وَم[a:12255[َن ي]َعْشُ عَ[f:3773[ن ذ]ِكْرِ [h:12256[ٱ][l[ل]رَّحْمَ[n[ـٰ]نِ نُقَيِّضْ لَهُ[n[ۥ] شَيْطَ[n[ـٰ][f:12257[نًا ف]َهُوَ لَهُ[n[ۥ] قَر[p[ِي]نٌ","translation_en":"And whoever turns himself away from the remembrance of the Beneficent Allah, We appoint for him a Shaitan, so he becomes his associate.","translation_id":"Dan barangsiapa berpaling dari pengajaran Allah Yang Maha Pengasih (Al-Qur'an), Kami biarkan setan (menyesatkannya) dan menjadi teman karibnya.","hasanah_per_verse":380},{"text_madani":"وَإِنَّهُمْ لَيَصُدُّونَهُمْ عَنِ السَّبِيلِ وَيَحْسَبُونَ أَنَّهُم مُّهْتَدُونَ","text_tajweed":"وَإِ[g[نّ]َهُمْ لَيَصُدُّونَهُمْ عَنِ [h:6998[ٱ][l[ل]سَّبِيلِ وَيَحْسَبُونَ أَ[g[نّ]َه[w:4653[ُم م]ُّهْتَد[p[ُو]نَ","translation_en":"And most surely they turn them away from the path, and they think that they are guided aright:","translation_id":"Dan sungguh, mereka (setan-setan itu) benar-benar menghalang-halangi mereka dari jalan yang benar, sedang mereka menyangka bahwa mereka mendapat petunjuk.","hasanah_per_verse":380},{"text_madani":"حَتَّىٰ إِذَا جَاءَنَا قَالَ يَا لَيْتَ بَيْنِي وَبَيْنَكَ بُعْدَ الْمَشْرِقَيْنِ فَبِئْسَ الْقَرِينُ","text_tajweed":"حَتَّ[o[ىٰٓ] إِذَا ج[o[َا]ٓءَنَا قَالَ يَ[n[ـٰ]لَيْتَ بَيْنِى وَبَيْنَكَ بُعْدَ [h:12258[ٱ]لْمَشْرِقَيْنِ فَبِئْسَ [h:12259[ٱ]لْقَر[p[ِي]نُ","translation_en":"Until when he comes to Us, he says: O would that between me and you there were the distance of the East and the West; so evil is the associate!","translation_id":"Sehingga apabila orang–orang yang berpaling itu datang kepada Kami (pada hari Kiamat) dia berkata, “Wahai! Sekiranya (jarak) antara aku dan kamu seperti jarak antara timur dan barat! Memang (setan itu) teman yang paling jahat (bagi manusia).”","hasanah_per_verse":490},{"text_madani":"وَلَن يَنفَعَكُمُ الْيَوْمَ إِذ ظَّلَمْتُمْ أَنَّكُمْ فِي الْعَذَابِ مُشْتَرِكُونَ","text_tajweed":"وَل[a:12260[َن ي]َ[f:10716[نف]َعَكُمُ [h:12261[ٱ]لْيَوْمَ إِ[d:12262[ذ] ظَّلَمْتُمْ أَ[g[نّ]َكُمْ فِى [h:10442[ٱ]لْعَذَابِ مُشْتَرِك[p[ُو]نَ","translation_en":"And since you were unjust, it will not profit you this day that you are sharers in the chastisement.","translation_id":"Dan (harapanmu itu) sekali-kali tidak akan memberi manfaat kepadamu pada hari itu karena kamu telah menzhalimi (dirimu sendiri). Sesungguhnya kamu pantas bersama-sama dalam azab itu.","hasanah_per_verse":400},{"text_madani":"أَفَأَنتَ تُسْمِعُ الصُّمَّ أَوْ تَهْدِي الْعُمْيَ وَمَن كَانَ فِي ضَلَالٍ مُّبِينٍ","text_tajweed":"أَفَأَ[f:6069[نت]َ تُسْمِعُ [h:6070[ٱ][l[ل]صُّ[g[مّ]َ أَوْ تَهْدِى [h:6072[ٱ]لْعُمْىَ وَمَ[f:975[ن ك]َانَ فِى ضَلَ[n[ـٰ][a:2393[لٍ م]ُّب[p[ِي]نٍ","translation_en":"What! can you then make the deaf to hear or guide the blind and him who is in clear error?","translation_id":"Maka apakah engkau (Muhammad) dapat menjadikan orang yang tuli bisa mendengar, atau (dapatkah) engkau memberi petunjuk kepada orang yang buta (hatinya) dan kepada orang yang tetap dalam kesesatan yang nyata?","hasanah_per_verse":400},{"text_madani":"فَإِمَّا نَذْهَبَنَّ بِكَ فَإِنَّا مِنْهُم مُّنتَقِمُونَ","text_tajweed":"فَإِ[g[مّ]َا نَذْهَبَ[g[نّ]َ بِكَ فَإِ[g[نّ]َا مِنْه[w:12263[ُم م]ُّ[f:10659[نت]َقِم[p[ُو]نَ","translation_en":"But if We should take you away, still We shall inflict retribution on them;","translation_id":"Maka sungguh, sekiranya Kami mewafatkanmu (sebelum engkau mencapai kemenangan), maka sesungguhnya Kami akan tetap memberikan azab kepada mereka (di akhirat),","hasanah_per_verse":260},{"text_madani":"أَوْ نُرِيَنَّكَ الَّذِي وَعَدْنَاهُمْ فَإِنَّا عَلَيْهِم مُّقْتَدِرُونَ","text_tajweed":"أَوْ نُرِيَ[g[نّ]َكَ [h:12264[ٱ]لَّذِى وَعَ[q:12265[دْ]نَ[n[ـٰ]هُمْ فَإِ[g[نّ]َا عَلَيْه[w:12266[ِم م]ُّ[q:12267[قْ]تَدِر[p[ُو]نَ","translation_en":"Rather We will certainly show you that which We have promised them; for surely We are the possessors of full power over them.","translation_id":"atau Kami perlihatkan kepadamu (azab) yang telah Kami ancamkan kepada mereka. Maka sungguh, Kami berkuasa atas mereka.","hasanah_per_verse":340},{"text_madani":"فَاسْتَمْسِكْ بِالَّذِي أُوحِيَ إِلَيْكَ ۖ إِنَّكَ عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ","text_tajweed":"فَ[h:9999[ٱ]سْتَمْسِكْ بِ[h:315[ٱ]لَّذ[o[ِىٓ] أُوحِىَ إِلَيْكَ‌ۖ إِ[g[نّ]َكَ عَلَىٰ صِر[n[َٲ][a:726[طٍ م]ُّسْتَق[p[ِي]مٍ","translation_en":"Therefore hold fast to that which has been revealed to you; surely you are on the right path.","translation_id":"Maka berpegang teguhlah engkau kepada (agama) yang telah diwahyukan kepadamu. Sungguh, engkau berada di jalan yang lurus.","hasanah_per_verse":360},{"text_madani":"وَإِنَّهُ لَذِكْرٌ لَّكَ وَلِقَوْمِكَ ۖ وَسَوْفَ تُسْأَلُونَ","text_tajweed":"وَإِ[g[نّ]َهُ[n[ۥ] لَذِكْ[u:12268[رٌ ل]َّكَ وَلِقَوْمِكَ‌ۖ وَسَوْفَ تُسْــَٔل[p[ُو]نَ","translation_en":"And most surely it is a reminder for you and your people, and you shall soon be questioned.","translation_id":"Dan sungguh, Al-Qur'an itu benar-benar suatu peringatan bagimu dan bagi kaummu, dan kelak kamu akan diminta pertanggungjawaban.","hasanah_per_verse":260},{"text_madani":"وَاسْأَلْ مَنْ أَرْسَلْنَا مِن قَبْلِكَ مِن رُّسُلِنَا أَجَعَلْنَا مِن دُونِ الرَّحْمَٰنِ آلِهَةً يُعْبَدُونَ","text_tajweed":"وَسْــَٔلْ مَنْ أَرْسَلْنَا مِ[f:18[ن ق]َ[q:19[بْ]لِكَ م[u:7850[ِن ر]ُّسُلِن[o[َآ] أَجَعَلْنَا مِ[f:107[ن د]ُونِ [h:12269[ٱ][l[ل]رَّحْمَ[n[ـٰ]نِ ءَالِهَ[a:12270[ةً ي]ُعْبَد[p[ُو]نَ","translation_en":"And ask those of Our messengers whom We sent before you: Did We ever appoint gods to be worshipped besides the Beneficent Allah?","translation_id":"Dan tanyakanlah (Muhammad) kepada rasul-rasul Kami yang telah Kami utus sebelum engkau, “Apakah Kami menentukan tuhan-tuhan selain (Allah) Yang Maha Pengasih untuk disembah?”","hasanah_per_verse":530},{"text_madani":"وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِآيَاتِنَا إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ فَقَالَ إِنِّي رَسُولُ رَبِّ الْعَالَمِينَ","text_tajweed":"وَلَقَ[q:341[دْ] أَرْسَلْنَا مُوسَىٰ بِـَٔـايَ[n[ـٰ]تِن[o[َآ] إِلَىٰ فِرْعَوْنَ وَمَلَإِ[s[يْ]ه[n[ِۦ] فَقَالَ إِ[g[نّ]ِى رَسُولُ رَبِّ [h:4[ٱ]لْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"And certainly We sent Musa with Our communications to Firon and his chiefs, so he said: Surely I am the messenger of the Lord of the worlds.","translation_id":"Dan sungguh, Kami telah mengutus Musa dengan membawa mukjizat-mukjizat Kami kepada Fir’aun dan pemuka-pemuka kaumnya. Maka dia (Musa) berkata, “Sesungguhnya aku adalah utusan dari Tuhan seluruh alam.”","hasanah_per_verse":550},{"text_madani":"فَلَمَّا جَاءَهُم بِآيَاتِنَا إِذَا هُم مِّنْهَا يَضْحَكُونَ","text_tajweed":"فَلَ[g[مّ]َا ج[o[َا]ٓءَه[c:12271[ُم ب]ِـَٔـايَ[n[ـٰ]تِن[o[َآ] إِذَا ه[w:7261[ُم م]ِّنْهَا يَضْحَك[p[ُو]نَ","translation_en":"But when he came to them with Our signs, lo! they laughed at them.","translation_id":"Maka ketika dia (Musa) datang kepada mereka membawa mukjizat-mukjizat Kami, seketika itu mereka menertawakannya.","hasanah_per_verse":310},{"text_madani":"وَمَا نُرِيهِم مِّنْ آيَةٍ إِلَّا هِيَ أَكْبَرُ مِنْ أُخْتِهَا ۖ وَأَخَذْنَاهُم بِالْعَذَابِ لَعَلَّهُمْ يَرْجِعُونَ","text_tajweed":"وَمَا نُرِيه[w:12272[ِم م]ِّنْ ءَايَةٍ إِلَّا هِىَ أَكْبَرُ مِنْ أُخْتِهَا‌ۖ وَأَخَذْنَ[n[ـٰ]ه[c:12273[ُم ب]ِ[h:9060[ٱ]لْعَذَابِ لَعَلَّهُمْ يَرْجِع[p[ُو]نَ","translation_en":"And We did not show them a sign but it was greater than its like, and We overtook them with chastisement that they may turn.","translation_id":"Dan tidaklah Kami perlihatkan suatu mukjizat kepada mereka kecuali (mukjizat itu) lebih besar dari mukjizat-mukjizat (yang sebelumnya). Dan Kami timpakan kepada mereka azab agar mereka kembali (ke jalan yang benar).","hasanah_per_verse":550},{"text_madani":"وَقَالُوا يَا أَيُّهَ السَّاحِرُ ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِندَكَ إِنَّنَا لَمُهْتَدُونَ","text_tajweed":"وَقَالُو[s[اْ] يَ[o[ـٰٓ]أَيُّهَ [h:12274[ٱ][l[ل]سَّاحِرُ [h:12275[ٱ][q:354[دْ]عُ لَنَا رَبَّكَ بِمَا عَهِدَ عِ[f:4962[ند]َكَ إِ[g[نّ]َنَا لَمُهْتَد[p[ُو]نَ","translation_en":"And they said: O magician! call on your Lord for our sake, as He has made the covenant with you; we shall surely be the followers of the right way.","translation_id":"Dan mereka berkata, “Wahai pesihir! Berdoalah kepada Tuhanmu untuk (melepaskan) kami sesuai dengan apa yang telah dijanjikan-Nya kepadamu; sesungguhnya kami (jika doamu dikabulkan) akan menjadi orang yang mendapat petunjuk.”","hasanah_per_verse":470},{"text_madani":"فَلَمَّا كَشَفْنَا عَنْهُمُ الْعَذَابَ إِذَا هُمْ يَنكُثُونَ","text_tajweed":"فَلَ[g[مّ]َا كَشَفْنَا عَنْهُمُ [h:6249[ٱ]لْعَذَابَ إِذَا هُمْ يَ[f:4968[نك]ُث[p[ُو]نَ","translation_en":"But when We removed from them the chastisement, lo! they broke the pledge.","translation_id":"Maka ketika Kami hilangkan azab itu dari mereka, seketika itu (juga) mereka ingkar janji.","hasanah_per_verse":300},{"text_madani":"وَنَادَىٰ فِرْعَوْنُ فِي قَوْمِهِ قَالَ يَا قَوْمِ أَلَيْسَ لِي مُلْكُ مِصْرَ وَهَٰذِهِ الْأَنْهَارُ تَجْرِي مِن تَحْتِي ۖ أَفَلَا تُبْصِرُونَ","text_tajweed":"وَنَادَىٰ فِرْعَوْنُ فِى قَوْمِه[n[ِۦ] قَالَ يَ[n[ـٰ]قَوْمِ أَلَيْسَ لِى مُلْكُ مِصْرَ وَهَ[n[ـٰ]ذِهِ [h:12276[ٱ]لْأَنْهَ[n[ـٰ]رُ تَ[q:120[جْ]رِى مِ[f:12277[ن ت]َحْت[o[ِىٓ‌ۖ] أَفَلَا تُ[q:8674[بْ]صِر[p[ُو]نَ","translation_en":"And Firon proclaimed amongst his people: O my people! is not the kingdom of Egypt mine? And these rivers flow beneath me; do you not then see?","translation_id":"Dan Fir‘aun berseru kepada kaumnya (seraya) berkata, “Wahai kaumku! Bukankah kerajaan Mesir itu milikku dan (bukankah) sungai-sungai ini mengalir di bawahku; apakah kamu tidak melihat?","hasanah_per_verse":670},{"text_madani":"أَمْ أَنَا خَيْرٌ مِّنْ هَٰذَا الَّذِي هُوَ مَهِينٌ وَلَا يَكَادُ يُبِينُ","text_tajweed":"أَمْ أَنَا۟ خَيْ[a:1231[رٌ م]ِّنْ هَ[n[ـٰ]ذَا [h:126[ٱ]لَّذِى هُوَ مَهِي[a:12278[نٌ و]َلَا يَكَادُ يُب[p[ِي]نُ","translation_en":"Nay! I am better than this fellow, who is contemptible, and who can hardly speak distinctly:","translation_id":"Bukankah aku lebih baik dari orang (Musa) yang hina ini dan yang hampir tidak dapat menjelaskan (perkataannya)?","hasanah_per_verse":340},{"text_madani":"فَلَوْلَا أُلْقِيَ عَلَيْهِ أَسْوِرَةٌ مِّن ذَهَبٍ أَوْ جَاءَ مَعَهُ الْمَلَائِكَةُ مُقْتَرِنِينَ","text_tajweed":"فَلَوْل[o[َآ] أُلْقِىَ عَلَيْهِ أَسْوِرَ[a:12279[ةٌ م]ِّ[f:8050[ن ذ]َهَبٍ أَوْ ج[o[َا]ٓءَ مَعَهُ [h:12280[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ مُ[q:12281[قْ]تَرِن[p[ِي]نَ","translation_en":"But why have not bracelets of gold been put upon him, or why have there not come with him angels as companions?","translation_id":"Maka mengapa dia (Musa) tidak dipakaikan gelang dari emas atau malaikat datang bersama-sama dia untuk mengiringkannya?”","hasanah_per_verse":460},{"text_madani":"فَاسْتَخَفَّ قَوْمَهُ فَأَطَاعُوهُ ۚ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ","text_tajweed":"فَ[h:9999[ٱ]سْتَخَفَّ قَوْمَهُ[n[ۥ] فَأَطَاعُوهُ‌ۚ إِ[g[نّ]َهُمْ كَانُو[s[اْ] قَوْ[f:5652[مًا ف]َ[n[ـٰ]سِق[p[ِي]نَ","translation_en":"So he incited his people to levity and they obeyed him: surely they were a transgressing people.","translation_id":"Maka (Fir‘aun) dengan perkataan itu telah mempengaruhi kaumnya, sehingga mereka patuh kepadanya. Sungguh, mereka adalah kaum yang fasik.","hasanah_per_verse":360},{"text_madani":"فَلَمَّا آسَفُونَا انتَقَمْنَا مِنْهُمْ فَأَغْرَقْنَاهُمْ أَجْمَعِينَ","text_tajweed":"فَلَ[g[مّ][o[َآ] ءَاسَفُونَا [h:12282[ٱ][f:12283[نت]َقَمْنَا مِنْهُمْ فَأَغْرَ[q:4970[قْ]نَ[n[ـٰ]هُمْ أَ[q:825[جْ]مَع[p[ِي]نَ","translation_en":"Then when they displeased Us, We inflicted a retribution on them, so We drowned them all together,","translation_id":"Maka ketika mereka membuat Kami murka, Kami hukum mereka, lalu Kami tenggelamkan mereka semuanya (di laut),","hasanah_per_verse":360},{"text_madani":"فَجَعَلْنَاهُمْ سَلَفًا وَمَثَلًا لِّلْآخِرِينَ","text_tajweed":"فَجَعَلْنَ[n[ـٰ]هُمْ سَلَ[a:12284[فًا و]َمَثَل[u:12285[اً ل]ِّلْأَخِر[p[ِي]نَ","translation_en":"And We made them a precedent and example to the later generations.","translation_id":"maka Kami jadikan mereka sebagai (kaum) terdahulu dan pelajaran bagi orang-orang yang kemudian.","hasanah_per_verse":240},{"text_madani":"وَلَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا إِذَا قَوْمُكَ مِنْهُ يَصِدُّونَ","text_tajweed":"۞ وَلَ[g[مّ]َا ضُرِبَ [h:12286[ٱ][q:1917[بْ]نُ مَرْيَمَ مَثَلاً إِذَا قَوْمُكَ مِنْهُ يَصِدّ[p[ُو]نَ","translation_en":"And when a description of the son of Marium is given, lo! your people raise a clamor thereat.","translation_id":"Dan ketika putra Maryam (Isa) dijadikan perumpamaan, tiba-tiba kaummu (Suku Quraisy) bersorak karenanya.","hasanah_per_verse":330},{"text_madani":"وَقَالُوا أَآلِهَتُنَا خَيْرٌ أَمْ هُوَ ۚ مَا ضَرَبُوهُ لَكَ إِلَّا جَدَلًا ۚ بَلْ هُمْ قَوْمٌ خَصِمُونَ","text_tajweed":"وَقَال[o[ُوٓ][s[اْ] ءَأ[n[َٲ]لِهَتُنَا خَيْرٌ أَمْ هُوَ‌ۚ مَا ضَرَبُوهُ لَكَ إِلَّا جَدَل[i:12287[اَۢ‌ۚ ب]َلْ هُمْ قَوْمٌ خَصِم[p[ُو]نَ","translation_en":"And they say: Are our gods better, or is he? They do not set it forth to you save by way of disputation; nay, they are a contentious people.","translation_id":"Dan mereka berkata, “Manakah yang lebih baik tuhan-tuhan kami atau dia (Isa)?” Mereka tidak memberikan (perumpamaan itu) kepadamu melainkan dengan maksud membantah saja, sebenarnya mereka adalah kaum yang suka bertengkar.","hasanah_per_verse":480},{"text_madani":"إِنْ هُوَ إِلَّا عَبْدٌ أَنْعَمْنَا عَلَيْهِ وَجَعَلْنَاهُ مَثَلًا لِّبَنِي إِسْرَائِيلَ","text_tajweed":"إِنْ هُوَ إِلَّا عَ[q:12288[بْ]دٌ أَنْعَمْنَا عَلَيْهِ وَجَعَلْنَ[n[ـٰ]هُ مَثَل[u:12289[اً ل]ِّبَن[o[ِىٓ] إِسْر[o[َٲ]ٓء[p[ِي]لَ","translation_en":"He was naught but a servant on whom We bestowed favor, and We made him an example for the children of Israel.","translation_id":"Dia (Isa) tidak lain hanyalah seorang hamba yang Kami berikan nikmat (kenabian) kepadanya dan Kami jadikan dia sebagai contoh pelajaran bagi Bani Israil.","hasanah_per_verse":420},{"text_madani":"وَلَوْ نَشَاءُ لَجَعَلْنَا مِنكُم مَّلَائِكَةً فِي الْأَرْضِ يَخْلُفُونَ","text_tajweed":"وَلَوْ نَش[o[َا]ٓءُ لَجَعَلْنَا مِ[f:344[نك][w:12290[ُم م]َّلَ[o[ـٰٓ]ئِكَ[f:12291[ةً ف]ِى [h:44[ٱ]لْأَرْضِ يَخْلُف[p[ُو]نَ","translation_en":"And if We please, We could make among you angels to be successors in the land.","translation_id":"Dan sekiranya Kami menghendaki, niscaya ada di antara kamu yang Kami jadikan malaikat-malaikat (yang turun temurun) sebagai pengganti kamu di bumi.","hasanah_per_verse":360},{"text_madani":"وَإِنَّهُ لَعِلْمٌ لِّلسَّاعَةِ فَلَا تَمْتَرُنَّ بِهَا وَاتَّبِعُونِ ۚ هَٰذَا صِرَاطٌ مُّسْتَقِيمٌ","text_tajweed":"وَإِ[g[نّ]َهُ[n[ۥ] لَعِلْ[u:12292[مٌ ل]ِّلسَّاعَةِ فَلَا تَمْتَرُ[g[نّ]َ بِهَا وَ[h:12293[ٱ]تَّبِعُونِ‌ۚ هَ[n[ـٰ]ذَا صِر[n[َٲ][a:1947[طٌ م]ُّسْتَق[p[ِي]مٌ","translation_en":"And most surely it is a knowledge of the hour, therefore have no doubt about it and follow me: this is the right path.","translation_id":"Dan sungguh, dia (Isa) itu benar-benar menjadi pertanda akan datangnya hari Kiamat. Karena itu, janganlah kamu ragu-ragu tentang (Kiamat) itu dan ikutilah Aku. Inilah jalan yang lurus.","hasanah_per_verse":450},{"text_madani":"وَلَا يَصُدَّنَّكُمُ الشَّيْطَانُ ۖ إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ","text_tajweed":"وَلَا يَصُدَّ[g[نّ]َكُمُ [h:12294[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ‌ۖ إِ[g[نّ]َهُ[n[ۥ] لَكُمْ عَدُ[a:873[وٌّ م]ُّب[p[ِي]نٌ","translation_en":"And let not the Shaitan prevent you; surely he is your j open enemy.","translation_id":"Dan janganlah kamu sekali-kali dipalingkan oleh setan; sungguh, setan itu musuh yang nyata bagimu.","hasanah_per_verse":290},{"text_madani":"وَلَمَّا جَاءَ عِيسَىٰ بِالْبَيِّنَاتِ قَالَ قَدْ جِئْتُكُم بِالْحِكْمَةِ وَلِأُبَيِّنَ لَكُم بَعْضَ الَّذِي تَخْتَلِفُونَ فِيهِ ۖ فَاتَّقُوا اللَّهَ وَأَطِيعُونِ","text_tajweed":"وَلَ[g[مّ]َا ج[o[َا]ٓءَ عِيسَىٰ بِ[h:484[ٱ]لْبَيِّنَ[n[ـٰ]تِ قَالَ قَ[q:298[دْ] جِئْتُك[c:12295[ُم ب]ِ[h:7635[ٱ]لْحِكْمَةِ وَلِأُبَيِّنَ لَك[c:1942[ُم ب]َعْضَ [h:1943[ٱ]لَّذِى تَخْتَلِفُونَ فِيهِ‌ۖ فَ[h:112[ٱ]تَّقُو[s[اْ] [h:1945[ٱ]للَّهَ وَأَطِيع[p[ُو]نِ","translation_en":"And when Isa came with clear arguments he said: I have come to you indeed with wisdom, and that I may make clear to you part of what you differ in; so be careful of (your duty to) Allah and obey me:","translation_id":"Dan ketika Isa datang membawa keterangan, dia berkata, “Sungguh, aku datang kepadamu dengan membawa hikmah dan untuk menjelaskan kepadamu sebagian dari apa yang kamu perselisihkan, maka bertakwalah kepada Allah dan taatlah kepadaku.","hasanah_per_verse":790},{"text_madani":"إِنَّ اللَّهَ هُوَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ ۚ هَٰذَا صِرَاطٌ مُّسْتَقِيمٌ","text_tajweed":"إِ[g[نّ]َ [h:80[ٱ]للَّهَ هُوَ رَبِّى وَرَبُّكُمْ فَ[h:1946[ٱ]عْبُدُوهُ‌ۚ هَ[n[ـٰ]ذَا صِر[n[َٲ][a:1947[طٌ م]ُّسْتَق[p[ِي]مٌ","translation_en":"Surely Allah is my Lord and your Lord, therefore serve Him; this is the right path:","translation_id":"Sungguh Allah, Dia Tuhanku dan Tuhanmu, maka sembahlah Dia. Ini adalah jalan yang lurus.”","hasanah_per_verse":360},{"text_madani":"فَاخْتَلَفَ الْأَحْزَابُ مِن بَيْنِهِمْ ۖ فَوَيْلٌ لِّلَّذِينَ ظَلَمُوا مِنْ عَذَابِ يَوْمٍ أَلِيمٍ","text_tajweed":"فَ[h:9999[ٱ]خْتَلَفَ [h:8334[ٱ]لْأَحْزَابُ م[i:8335[ِنۢ ب]َيْنِهِمْ‌ۖ فَوَيْ[u:396[لٌ ل]ِّلَّذِينَ ظَلَمُو[s[اْ] مِنْ عَذَابِ يَوْمٍ أَل[p[ِي]مٍ","translation_en":"But parties from among them differed, so woe to those who were unjust because of the chastisement of a painful day.","translation_id":"Tetapi golongan-golongan (yang ada) saling berselisih di antara mereka; maka celakalah orang-orang yang zhalim karena azab pada hari yang pedih (Kiamat).","hasanah_per_verse":470},{"text_madani":"هَلْ يَنظُرُونَ إِلَّا السَّاعَةَ أَن تَأْتِيَهُم بَغْتَةً وَهُمْ لَا يَشْعُرُونَ","text_tajweed":"هَلْ يَ[f:1141[نظ]ُرُونَ إِلَّا [h:12296[ٱ][l[ل]سَّاعَةَ أَ[f:6843[ن ت]َأْتِيَه[c:12297[ُم ب]َغْتَ[a:4880[ةً و]َهُمْ لَا يَشْعُر[p[ُو]نَ","translation_en":"Do they wait for aught but the hour, that it should come! upon them all of a sudden while they do not perceive?","translation_id":"Apakah mereka hanya menunggu saja kedatangan hari Kiamat yang datang kepada mereka secara mendadak sedang mereka tidak menyadarinya?","hasanah_per_verse":400},{"text_madani":"الْأَخِلَّاءُ يَوْمَئِذٍ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلَّا الْمُتَّقِينَ","text_tajweed":"ٱلْأَخِلّ[o[َا]ٓءُ يَوْمَئِ[i:12298[ذِۭ ب]َعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلَّا [h:12299[ٱ]لْمُتَّق[p[ِي]نَ","translation_en":"The friends shall on that day be enemies one to another, except those who guard (against evil).","translation_id":"Teman-teman karib pada hari itu saling bermusuhan satu sama lain, kecuali mereka yang bertakwa.","hasanah_per_verse":340},{"text_madani":"يَا عِبَادِ لَا خَوْفٌ عَلَيْكُمُ الْيَوْمَ وَلَا أَنتُمْ تَحْزَنُونَ","text_tajweed":"يَ[n[ـٰ]عِبَادِ لَا خَوْفٌ عَلَيْكُمُ [h:6811[ٱ]لْيَوْمَ وَل[o[َآ] أَ[f:428[نت]ُمْ تَحْزَن[p[ُو]نَ","translation_en":"O My servants! there is no fear for you this day, nor shall you grieve.","translation_id":"”Wahai hamba-hamba-Ku! Tidak ada ketakutan bagimu pada hari itu dan tidak pula kamu bersedih hati.","hasanah_per_verse":340},{"text_madani":"الَّذِينَ آمَنُوا بِآيَاتِنَا وَكَانُوا مُسْلِمِينَ","text_tajweed":"ٱلَّذِينَ ءَامَنُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِنَا وَكَانُو[s[اْ] مُسْلِم[p[ِي]نَ","translation_en":"Those who believed in Our communications and were submissive:","translation_id":"(Yaitu) orang-orang yang beriman kepada ayat-ayat Kami dan mereka berserah diri.","hasanah_per_verse":290},{"text_madani":"ادْخُلُوا الْجَنَّةَ أَنتُمْ وَأَزْوَاجُكُمْ تُحْبَرُونَ","text_tajweed":"ٱ[q:278[دْ]خُلُو[s[اْ] [h:4726[ٱ]لْجَ[g[نّ]َةَ أَ[f:428[نت]ُمْ وَأَزْو[n[َٲ]جُكُمْ تُحْبَر[p[ُو]نَ","translation_en":"Enter the garden, you and your wives; you shall be made happy.","translation_id":"Masuklah kamu ke dalam surga, kamu dan pasanganmu akan digembirakan.”","hasanah_per_verse":290},{"text_madani":"يُطَافُ عَلَيْهِم بِصِحَافٍ مِّن ذَهَبٍ وَأَكْوَابٍ ۖ وَفِيهَا مَا تَشْتَهِيهِ الْأَنفُسُ وَتَلَذُّ الْأَعْيُنُ ۖ وَأَنتُمْ فِيهَا خَالِدُونَ","text_tajweed":"يُطَافُ عَلَيْه[c:12300[ِم ب]ِصِحَا[a:12301[فٍ م]ِّ[f:8050[ن ذ]َهَ[a:12302[بٍ و]َأَكْوَا[a:12303[بٍ‌ۖ و]َفِيهَا مَا تَشْتَهِيهِ [h:12304[ٱ]لْأَ[f:3181[نف]ُسُ وَتَلَذُّ [h:12305[ٱ]لْأَعْيُنُ‌ۖ وَأَ[f:98[نت]ُمْ فِيهَا خَ[n[ـٰ]لِد[p[ُو]نَ","translation_en":"There shall be sent round to them golden bowls and drinking-cups and therein shall be what their souls yearn after and (wherein) the eyes shall delight, and you shall abide therein.","translation_id":"Kepada mereka diedarkan piring-piring dan gelas-gelas dari emas, dan di dalam surga itu terdapat apa yang diingini oleh hati dan segala yang sedap (dipandang) mata. Dan kamu kekal di dalamnya.","hasanah_per_verse":690},{"text_madani":"وَتِلْكَ الْجَنَّةُ الَّتِي أُورِثْتُمُوهَا بِمَا كُنتُمْ تَعْمَلُونَ","text_tajweed":"وَتِلْكَ [h:12306[ٱ]لْجَ[g[نّ]َةُ [h:8380[ٱ]لَّت[o[ِىٓ] أُورِثْتُمُوهَا بِمَا كُ[f:100[نت]ُمْ تَعْمَل[p[ُو]نَ","translation_en":"And this is the garden which you are given as an inheritance on account of what you did.","translation_id":"Dan itulah surga yang diwariskan kepada kamu disebabkan amal perbuatan yang telah kamu kerjakan.","hasanah_per_verse":350},{"text_madani":"لَكُمْ فِيهَا فَاكِهَةٌ كَثِيرَةٌ مِّنْهَا تَأْكُلُونَ","text_tajweed":"لَكُمْ فِيهَا فَ[n[ـٰ]كِهَ[f:12307[ةٌ ك]َثِيرَ[a:12308[ةٌ م]ِّنْهَا تَأْكُل[p[ُو]نَ","translation_en":"For you therein are many fruits of which you shall eat.","translation_id":"Di dalam surga itu terdapat banyak buah-buahan untukmu yang sebagiannya kamu makan.","hasanah_per_verse":270},{"text_madani":"إِنَّ الْمُجْرِمِينَ فِي عَذَابِ جَهَنَّمَ خَالِدُونَ","text_tajweed":"إِ[g[نّ]َ [h:12309[ٱ]لْمُ[q:4093[جْ]رِمِينَ فِى عَذَابِ جَهَ[g[نّ]َمَ خَ[n[ـٰ]لِد[p[ُو]نَ","translation_en":"Surely the guilty shall abide in the chastisement of hell.","translation_id":"Sungguh, orang-orang yang berdosa itu kekal di dalam azab neraka Jahanam.","hasanah_per_verse":260},{"text_madani":"لَا يُفَتَّرُ عَنْهُمْ وَهُمْ فِيهِ مُبْلِسُونَ","text_tajweed":"لَا يُفَتَّرُ عَنْهُمْ وَهُمْ فِيهِ مُ[q:4051[بْ]لِس[p[ُو]نَ","translation_en":"It shall not be abated from them and they shall therein be despairing.","translation_id":"Tidak diringankan (azab) itu dari mereka, dan mereka berputus asa di dalamnya.","hasanah_per_verse":220},{"text_madani":"وَمَا ظَلَمْنَاهُمْ وَلَٰكِن كَانُوا هُمُ الظَّالِمِينَ","text_tajweed":"وَمَا ظَلَمْنَ[n[ـٰ]هُمْ وَلَ[n[ـٰ]كِ[f:276[ن ك]َانُو[s[اْ] هُمُ [h:12310[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And We are not unjust to them, but they themselves were unjust.","translation_id":"Dan tidaklah Kami menzhalimi mereka, tetapi merekalah yang menzhalimi diri mereka sendiri.","hasanah_per_verse":290},{"text_madani":"وَنَادَوْا يَا مَالِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ ۖ قَالَ إِنَّكُم مَّاكِثُونَ","text_tajweed":"وَنَادَوْ[s[اْ] يَ[n[ـٰ]مَ[n[ـٰ]لِكُ لِيَ[q:12311[قْ]ضِ عَلَيْنَا رَبُّكَ‌ۖ قَالَ إِ[g[نّ]َك[w:12312[ُم م]َّ[n[ـٰ]كِث[p[ُو]نَ","translation_en":"And they shall call out: O Malik! let your Lord make an end of us. He shall say: Surely you shall tarry.","translation_id":"Dan mereka berseru, “Wahai (Malaikat) Malik! Biarlah Tuhanmu mematikan kami saja.” Dia menjawab, “Sungguh, kamu akan tetap tinggal (di neraka ini).”","hasanah_per_verse":370},{"text_madani":"لَقَدْ جِئْنَاكُم بِالْحَقِّ وَلَٰكِنَّ أَكْثَرَكُمْ لِلْحَقِّ كَارِهُونَ","text_tajweed":"لَقَ[q:2389[دْ] جِئْنَ[n[ـٰ]ك[c:12313[ُم ب]ِ[h:370[ٱ]لْحَقِّ وَلَ[n[ـٰ]كِ[g[نّ]َ أَكْثَرَكُمْ لِلْحَقِّ كَ[n[ـٰ]رِه[p[ُو]نَ","translation_en":"Certainly We have brought you the truth, but most of you are averse to the truth.","translation_id":"Sungguh, Kami telah datang membawa kebenaran kepada kamu tetapi kebanyakan di antara kamu benci pada kebenaran itu.","hasanah_per_verse":340},{"text_madani":"أَمْ أَبْرَمُوا أَمْرًا فَإِنَّا مُبْرِمُونَ","text_tajweed":"أَمْ أَ[q:12314[بْ]رَم[o[ُوٓ][s[اْ] أَمْ[f:12315[رًا ف]َإِ[g[نّ]َا مُ[q:12316[بْ]رِم[p[ُو]نَ","translation_en":"Or have they settled an affair? Then surely We are the settlers.","translation_id":"Ataukah mereka telah merencanakan suatu tipu daya (jahat), maka sesungguhnya Kami telah berencana (mengatasi tipu daya mereka).","hasanah_per_verse":220},{"text_madani":"أَمْ يَحْسَبُونَ أَنَّا لَا نَسْمَعُ سِرَّهُمْ وَنَجْوَاهُم ۚ بَلَىٰ وَرُسُلُنَا لَدَيْهِمْ يَكْتُبُونَ","text_tajweed":"أَمْ يَحْسَبُونَ أَ[g[نّ]َا لَا نَسْمَعُ سِرَّهُمْ وَنَ[q:5735[جْ]وَ[n[ٮٰ]ه[c:12317[ُم‌ۚ ب]َلَىٰ وَرُسُلُنَا لَدَيْهِمْ يَكْتُب[p[ُو]نَ","translation_en":"Or do they think that We do not hear what they conceal and their secret discourses? Aye! and Our messengers with them write down.","translation_id":"Ataukah mereka mengira, bahwa Kami tidak mendengar rahasia dan bisikan-bisikan mereka? Sebenarnya (Kami mendengar), dan utusan-utusan Kami (malaikat) selalu mencatat di sisi mereka.","hasanah_per_verse":480},{"text_madani":"قُلْ إِن كَانَ لِلرَّحْمَٰنِ وَلَدٌ فَأَنَا أَوَّلُ الْعَابِدِينَ","text_tajweed":"قُلْ إِ[f:2594[ن ك]َانَ لِلرَّحْمَ[n[ـٰ]نِ وَلَ[f:12318[دٌ ف]َأَنَا۟ أَوَّلُ [h:12319[ٱ]لْعَ[n[ـٰ]بِد[p[ِي]نَ","translation_en":"Say: If the Beneficent Allah has a son, I am the foremost of those who serve.","translation_id":"Katakanlah (Muhammad), “Jika benar Tuhan Yang Maha Pengasih mempunyai anak, maka akulah orang yang mula-mula memuliakan (anak itu).","hasanah_per_verse":310},{"text_madani":"سُبْحَانَ رَبِّ السَّمَاوَاتِ وَالْأَرْضِ رَبِّ الْعَرْشِ عَمَّا يَصِفُونَ","text_tajweed":"سُ[q:7648[بْ]حَ[n[ـٰ]نَ رَبِّ [h:12320[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ رَبِّ [h:8707[ٱ]لْعَرْشِ عَ[g[مّ]َا يَصِف[p[ُو]نَ","translation_en":"Glory to the Lord of the heavens and the earth, the Lord of power, from what they describe.","translation_id":"Mahasuci Tuhan pemilik langit dan bumi, Tuhan pemilik ‘Arsy, dari apa yang mereka sifatkan itu.”","hasanah_per_verse":360},{"text_madani":"فَذَرْهُمْ يَخُوضُوا وَيَلْعَبُوا حَتَّىٰ يُلَاقُوا يَوْمَهُمُ الَّذِي يُوعَدُونَ","text_tajweed":"فَذَرْهُمْ يَخُوضُو[s[اْ] وَيَلْعَبُو[s[اْ] حَتَّىٰ يُلَ[n[ـٰ]قُو[s[اْ] يَوْمَهُمُ [h:12321[ٱ]لَّذِى يُوعَد[p[ُو]نَ","translation_en":"So leave them plunging into false discourses and sporting until they meet their day which they are threatened with.","translation_id":"Maka biarkanlah mereka tenggelam (dalam kesesatan) dan bermain-main sampai mereka menemui hari yang dijanjikan kepada mereka.","hasanah_per_verse":420},{"text_madani":"وَهُوَ الَّذِي فِي السَّمَاءِ إِلَٰهٌ وَفِي الْأَرْضِ إِلَٰهٌ ۚ وَهُوَ الْحَكِيمُ الْعَلِيمُ","text_tajweed":"وَهُوَ [h:4114[ٱ]لَّذِى فِى [h:746[ٱ][l[ل]سَّم[o[َا]ٓءِ إِلَ[n[ـٰ][a:12322[هٌ و]َفِى [h:3922[ٱ]لْأَرْضِ إِلَ[n[ـٰ][a:12323[هٌ‌ۚ و]َهُوَ [h:3967[ٱ]لْحَكِيمُ [h:12324[ٱ]لْعَل[p[ِي]مُ","translation_en":"And He it is Who is Allah in the heavens and Allah in the earth; and He is the Wise, the Knowing.","translation_id":"Dan Dialah Tuhan (yang disembah) di langit dan Tuhan (yang disembah) di bumi dan Dialah Yang Mahabijaksana, Maha Mengetahui.","hasanah_per_verse":440},{"text_madani":"وَتَبَارَكَ الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَعِندَهُ عِلْمُ السَّاعَةِ وَإِلَيْهِ تُرْجَعُونَ","text_tajweed":"وَتَبَارَكَ [h:12325[ٱ]لَّذِى لَهُ[n[ۥ] مُلْكُ [h:555[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ وَمَا بَيْنَهُمَا وَعِ[f:4104[ند]َهُ[n[ۥ] عِلْمُ [h:10616[ٱ][l[ل]سَّاعَةِ وَإِلَيْهِ تُرْجَع[p[ُو]نَ","translation_en":"And blessed is He Whose is the kingdom of the heavens and the earth and what is between them, and with Him is the knowledge of the hour, and to Him shall you be brought back.","translation_id":"Dan Mahasuci (Allah) yang memiliki kerajaan langit dan bumi, dan apa yang ada di antara keduanya; dan di sisi-Nyalah ilmu tentang hari Kiamat dan hanya kepada-Nyalah kamu dikembalikan.","hasanah_per_verse":630},{"text_madani":"وَلَا يَمْلِكُ الَّذِينَ يَدْعُونَ مِن دُونِهِ الشَّفَاعَةَ إِلَّا مَن شَهِدَ بِالْحَقِّ وَهُمْ يَعْلَمُونَ","text_tajweed":"وَلَا يَمْلِكُ [h:12326[ٱ]لَّذِينَ يَ[q:1240[دْ]عُونَ مِ[f:3136[ن د]ُونِهِ [h:12327[ٱ][l[ل]شَّفَ[n[ـٰ]عَةَ إِلَّا مَ[f:12328[ن ش]َهِدَ بِ[h:370[ٱ]لْحَقِّ وَهُمْ يَعْلَم[p[ُو]نَ","translation_en":"And those whom they call upon besides Him have no authority for intercession, but he who bears witness of the truth and they know (him).","translation_id":"Dan orang-orang yang menyeru kepada selain Allah tidak mendapat syafaat (pertolongan di akhirat); kecuali orang yang mengakui yang hak (tauhid) dan mereka meyakini.","hasanah_per_verse":520},{"text_madani":"وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ ۖ فَأَنَّىٰ يُؤْفَكُونَ","text_tajweed":"وَلَئِ[f:5683[ن س]َأَلْتَه[w:10403[ُم م]َّنْ خَلَقَهُمْ لَيَقُولُ[g[نّ]َ [h:10404[ٱ]للَّهُ‌ۖ فَأَ[g[نّ]َىٰ يُؤْفَك[p[ُو]نَ","translation_en":"And if you should ask them who created them, they would certainly say: Allah. Whence are they then turned back?","translation_id":"Dan jika engkau bertanya kepada mereka, “Siapakah yang menciptakan mereka, niscaya mereka menjawab, “Allah,” jadi bagaimana mereka dapat dipalingkan (dari menyembah Allah),”","hasanah_per_verse":370},{"text_madani":"وَقِيلِهِ يَا رَبِّ إِنَّ هَٰؤُلَاءِ قَوْمٌ لَّا يُؤْمِنُونَ","text_tajweed":"وَقِيلِه[n[ِۦ] يَ[n[ـٰ]رَبِّ إِ[g[نّ]َ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ قَوْ[u:3651[مٌ ل]َّا يُؤْمِن[p[ُو]نَ","translation_en":"Consider his cry: O my Lord! surely they are a people who do not believe.","translation_id":"dan (Allah mengetahui) ucapannya (Muhammad), “Ya Tuhanku, sesungguhnya mereka itu adalah kaum yang tidak beriman.”","hasanah_per_verse":270},{"text_madani":"فَاصْفَحْ عَنْهُمْ وَقُلْ سَلَامٌ ۚ فَسَوْفَ يَعْلَمُونَ","text_tajweed":"فَ[h:9999[ٱ]صْفَحْ عَنْهُمْ وَقُلْ سَلَ[n[ـٰ][f:12329[مٌ‌ۚ ف]َسَوْفَ يَعْلَم[p[ُو]نَ","translation_en":"So turn away from them and say, Peace, for they shall soon come to know.","translation_id":"Maka berpalinglah dari mereka dan katakanlah, “Salam (selamat tinggal).” Kelak mereka akan mengetahui (nasib mereka yang buruk).","hasanah_per_verse":260}]}
