{"chapter_number":36,"name_simple":"Ya-Sin","name_meaning":{"text":"Ya Sin","en":"Ya Sin","id":"Yas Sin"},"verses_count":83,"hasanah":30680,"verses":[{"text_madani":"يس","text_tajweed":"ي[m[سٓ]","translation_en":"Ya Seen.","translation_id":"Yasin","hasanah_per_verse":20},{"text_madani":"وَالْقُرْآنِ الْحَكِيمِ","text_tajweed":"وَ[h:9999[ٱ]لْقُرْءَانِ [h:11176[ٱ]لْحَك[p[ِي]مِ","translation_en":"I swear by the Quran full of wisdom","translation_id":"Demi Al-Qur'an yang penuh hikmah,","hasanah_per_verse":130},{"text_madani":"إِنَّكَ لَمِنَ الْمُرْسَلِينَ","text_tajweed":"إِ[g[نّ]َكَ لَمِنَ [h:1443[ٱ]لْمُرْسَل[p[ِي]نَ","translation_en":"Most surely you are one of the messengers","translation_id":"sungguh, engkau (Muhammad) adalah salah seorang dari rasul-rasul,","hasanah_per_verse":140},{"text_madani":"عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ","text_tajweed":"عَلَىٰ صِر[n[َٲ][a:726[طٍ م]ُّسْتَق[p[ِي]مٍ","translation_en":"On a right way.","translation_id":"(yang berada) di atas jalan yang lurus,","hasanah_per_verse":130},{"text_madani":"تَنزِيلَ الْعَزِيزِ الرَّحِيمِ","text_tajweed":"تَ[f:11177[نز]ِيلَ [h:11178[ٱ]لْعَزِيزِ [h:9869[ٱ][l[ل]رَّح[p[ِي]مِ","translation_en":"A revelation of the Mighty, the Merciful.","translation_id":"(sebagai wahyu) yang diturunkan oleh (Allah) Yang Mahaperkasa, Maha Penyayang,","hasanah_per_verse":170},{"text_madani":"لِتُنذِرَ قَوْمًا مَّا أُنذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ","text_tajweed":"لِتُ[f:4582[نذ]ِرَ قَوْ[a:10181[مًا م]ّ[o[َآ] أُ[f:11179[نذ]ِرَ ءَاب[o[َا]ٓؤُهُمْ فَهُمْ غَ[n[ـٰ]فِل[p[ُو]نَ","translation_en":"That you may warn a people whose fathers were not warned, so they are heedless.","translation_id":"agar engkau memberi peringatan kepada suatu kaum yang nenek moyangnya belum pernah diberi peringatan, karena itu mereka lalai.","hasanah_per_verse":300},{"text_madani":"لَقَدْ حَقَّ الْقَوْلُ عَلَىٰ أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ","text_tajweed":"لَقَ[q:2389[دْ] حَقَّ [h:10639[ٱ]لْقَوْلُ عَلَ[o[ىٰٓ] أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِن[p[ُو]نَ","translation_en":"Certainly the word has proved true of most of them, so they do not believe.","translation_id":"Sungguh, pasti berlaku perkataan (hukuman) terhadap kebanyakan mereka, karena mereka tidak beriman.","hasanah_per_verse":300},{"text_madani":"إِنَّا جَعَلْنَا فِي أَعْنَاقِهِمْ أَغْلَالًا فَهِيَ إِلَى الْأَذْقَانِ فَهُم مُّقْمَحُونَ","text_tajweed":"إِ[g[نّ]َا جَعَلْنَا ف[o[ِىٓ] أَعْنَ[n[ـٰ]قِهِمْ أَغْلَ[n[ـٰ]ل[f:11180[اً ف]َهِىَ إِلَى [h:11181[ٱ]لْأَذْقَانِ فَه[w:11182[ُم م]ُّ[q:11183[قْ]مَح[p[ُو]نَ","translation_en":"Surely We have placed chains on their necks, and these reach up to their chins, so they have their heads raised aloft.","translation_id":"Sungguh, Kami telah memasang belenggu di leher mereka, lalu tangan mereka (diangkat) ke dagu, karena itu mereka tertengadah.","hasanah_per_verse":450},{"text_madani":"وَجَعَلْنَا مِن بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لَا يُبْصِرُونَ","text_tajweed":"وَجَعَلْنَا م[i:4612[ِنۢ ب]َيْنِ أَيْدِيهِمْ سَد[a:11184[ًّا و]َمِنْ خَلْفِهِمْ سَد[f:11185[ًّا ف]َأَغْشَيْنَ[n[ـٰ]هُمْ فَهُمْ لَا يُ[q:60[بْ]صِر[p[ُو]نَ","translation_en":"And We have made before them a barrier and a barrier behind them, then We have covered them over so that they do not see.","translation_id":"Dan Kami jadikan di hadapan mereka sekat (dinding) dan di belakang mereka juga sekat, dan Kami tutup (mata) mereka sehingga mereka tidak dapat melihat.","hasanah_per_verse":510},{"text_madani":"وَسَوَاءٌ عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ","text_tajweed":"وَسَو[o[َا]ٓءٌ عَلَيْهِمْ ءَأَ[f:25[نذ]َرْتَهُمْ أَمْ لَمْ تُ[f:26[نذ]ِرْهُمْ لَا يُؤْمِن[p[ُو]نَ","translation_en":"And it is alike to them whether you warn them or warn them not: they do not believe.","translation_id":"Dan sama saja bagi mereka, apakah engkau memberi peringatan kepada mereka atau engkau tidak memberi peringatan kepada mereka, mereka tidak akan beriman juga.","hasanah_per_verse":360},{"text_madani":"إِنَّمَا تُنذِرُ مَنِ اتَّبَعَ الذِّكْرَ وَخَشِيَ الرَّحْمَٰنَ بِالْغَيْبِ ۖ فَبَشِّرْهُ بِمَغْفِرَةٍ وَأَجْرٍ كَرِيمٍ","text_tajweed":"إِ[g[نّ]َمَا تُ[f:11105[نذ]ِرُ مَنِ [h:3443[ٱ]تَّبَعَ [h:11186[ٱ][l[ل]ذِّكْرَ وَخَشِىَ [h:11187[ٱ][l[ل]رَّحْمَ[n[ـٰ]نَ بِ[h:13[ٱ]لْغَيْبِۖ فَبَشِّرْهُ بِمَغْفِرَ[a:11188[ةٍ و]َأَ[q:11189[جْ][f:11190[رٍ ك]َر[p[ِي]مٍ","translation_en":"You can only warn him who follows the reminder and fears the Beneficent Allah in secret; so announce to him forgiveness and an honorable reward.","translation_id":"Sesungguhnya engkau hanya memberi peringatan kepada orang-orang yang mau mengikuti peringatan dan yang takut kepada Tuhan Yang Maha Pengasih, walaupun mereka tidak melihat-Nya. Maka berilah mereka kabar gembira dengan ampunan dan pahala yang mulia.","hasanah_per_verse":540},{"text_madani":"إِنَّا نَحْنُ نُحْيِي الْمَوْتَىٰ وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ ۚ وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ فِي إِمَامٍ مُّبِينٍ","text_tajweed":"إِ[g[نّ]َا نَحْنُ نُحْىِ [h:11191[ٱ]لْمَوْتَىٰ وَنَكْتُبُ مَا قَدَّمُو[s[اْ] وَءَاثَ[n[ـٰ]رَهُمْۚ وَكُلَّ شَىْءٍ أَحْصَيْنَ[n[ـٰ]هُ ف[o[ِىٓ] إِمَا[a:11192[مٍ م]ُّب[p[ِي]نٍ","translation_en":"Surely We give life to the dead, and We write down what they have sent before and their footprints, and We have recorded everything in a clear writing.","translation_id":"Sungguh, Kamilah yang menghidupkan orang-orang yang mati, dan Kamilah yang mencatat apa yang telah mereka kerjakan dan bekas-bekas yang mereka (tinggalkan). Dan segala sesuatu Kami kumpulkan dalam Kitab yang jelas (Lauh Mahfuzh).","hasanah_per_verse":580},{"text_madani":"وَاضْرِبْ لَهُم مَّثَلًا أَصْحَابَ الْقَرْيَةِ إِذْ جَاءَهَا الْمُرْسَلُونَ","text_tajweed":"وَ[h:9999[ٱ]ضْرِ[q:8060[بْ] لَه[w:8061[ُم م]َّثَلاً أَصْحَ[n[ـٰ]بَ [h:11193[ٱ]لْقَرْيَةِ إِذْ ج[o[َا]ٓءَهَا [h:11194[ٱ]لْمُرْسَل[p[ُو]نَ","translation_en":"And set out to them an example of the people of the town, when the messengers came to it.","translation_id":"Dan buatlah suatu perumpamaan bagi mereka, yaitu penduduk suatu negeri, ketika utusan-utusan datang kepada mereka;","hasanah_per_verse":380},{"text_madani":"إِذْ أَرْسَلْنَا إِلَيْهِمُ اثْنَيْنِ فَكَذَّبُوهُمَا فَعَزَّزْنَا بِثَالِثٍ فَقَالُوا إِنَّا إِلَيْكُم مُّرْسَلُونَ","text_tajweed":"إِذْ أَرْسَلْن[o[َآ] إِلَيْهِمُ [h:11195[ٱ]ثْنَيْنِ فَكَذَّبُوهُمَا فَعَزَّزْنَا بِثَالِ[f:11196[ثٍ ف]َقَال[o[ُوٓ][s[اْ] إِ[g[نّ][o[َآ] إِلَيْك[w:11197[ُم م]ُّرْسَل[p[ُو]نَ","translation_en":"When We sent to them two, they rejected both of them, then We strengthened (them) with a third, so they said: Surely we are messengers to you.","translation_id":"(yaitu) ketika Kami mengutus kepada mereka dua orang utusan, lalu mereka mendustakan keduanya; kemudian Kami kuatkan dengan (utusan) yang ketiga, maka ketiga (utusan itu) berkata, “Sungguh, kami adalah orang-orang yang diutus kepadamu.”","hasanah_per_verse":570},{"text_madani":"قَالُوا مَا أَنتُمْ إِلَّا بَشَرٌ مِّثْلُنَا وَمَا أَنزَلَ الرَّحْمَٰنُ مِن شَيْءٍ إِنْ أَنتُمْ إِلَّا تَكْذِبُونَ","text_tajweed":"قَالُو[s[اْ] م[o[َآ] أَ[f:428[نت]ُمْ إِلَّا بَشَ[a:7065[رٌ م]ِّثْلُنَا وَم[o[َآ] أَ[f:471[نز]َلَ [h:11198[ٱ][l[ل]رَّحْمَ[n[ـٰ]نُ مِ[f:2103[ن ش]َىْءٍ إِنْ أَ[f:428[نت]ُمْ إِلَّا تَكْذِب[p[ُو]نَ","translation_en":"They said: You are naught but mortals like ourselves, nor has the Beneficent Allah revealed anything; you only lie.","translation_id":"Mereka (penduduk negeri) menjawab, “Kamu ini hanyalah manusia seperti kami, dan (Allah) Yang Maha Pengasih tidak menurunkan sesuatu apa pun; kamu hanyalah pendusta belaka.”","hasanah_per_verse":550},{"text_madani":"قَالُوا رَبُّنَا يَعْلَمُ إِنَّا إِلَيْكُمْ لَمُرْسَلُونَ","text_tajweed":"قَالُو[s[اْ] رَبُّنَا يَعْلَمُ إِ[g[نّ][o[َآ] إِلَيْكُمْ لَمُرْسَل[p[ُو]نَ","translation_en":"They said: Our Lord knows that we are most surely messengers to you.","translation_id":"Mereka berkata, “Tuhan kami mengetahui sesungguhnya kami adalah utusan-utusan(-Nya) kepada kamu.","hasanah_per_verse":280},{"text_madani":"وَمَا عَلَيْنَا إِلَّا الْبَلَاغُ الْمُبِينُ","text_tajweed":"وَمَا عَلَيْن[o[َآ] إِلَّا [h:3819[ٱ]لْبَلَ[n[ـٰ]غُ [h:3781[ٱ]لْمُب[p[ِي]نُ","translation_en":"And nothing devolves on us but a clear deliverance (of the message).","translation_id":"Dan kewajiban kami hanyalah menyampaikan (perintah Allah) dengan jelas.”","hasanah_per_verse":230},{"text_madani":"قَالُوا إِنَّا تَطَيَّرْنَا بِكُمْ ۖ لَئِن لَّمْ تَنتَهُوا لَنَرْجُمَنَّكُمْ وَلَيَمَسَّنَّكُم مِّنَّا عَذَابٌ أَلِيمٌ","text_tajweed":"قَال[o[ُوٓ][s[اْ] إِ[g[نّ]َا تَطَيَّرْنَا بِكُمْۖ لَئ[u:4195[ِن ل]َّمْ تَ[f:5288[نت]َهُو[s[اْ] لَنَرْجُمَ[g[نّ]َكُمْ وَلَيَمَسَّ[g[نّ]َك[w:11199[ُم م]ِّ[g[نّ]َا عَذَابٌ أَل[p[ِي]مٌ","translation_en":"They said: Surely we augur evil from you; if you do not desist, we will certainly stone you, and there shall certainly afflict vou a painful chastisement from us.","translation_id":"Mereka menjawab, “Sesungguhnya kami bernasib malang karena kamu. Sungguh, jika kamu tidak berhenti (menyeru kami), niscaya kami rajam kamu dan kamu pasti akan merasakan siksaan yang pedih dari kami.”","hasanah_per_verse":550},{"text_madani":"قَالُوا طَائِرُكُم مَّعَكُمْ ۚ أَئِن ذُكِّرْتُم ۚ بَلْ أَنتُمْ قَوْمٌ مُّسْرِفُونَ","text_tajweed":"قَالُو[s[اْ] طَ[o[ـٰٓ]ئِرُك[w:11200[ُم م]َّعَكُمْۚ أَئِ[f:11201[ن ذ]ُكِّرْت[c:11202[ُمۚ ب]َلْ أَ[f:428[نت]ُمْ قَوْ[a:4833[مٌ م]ُّسْرِف[p[ُو]نَ","translation_en":"They said: Your evil fortune is with you; what! if you are reminded! Nay, you are an extravagant people.","translation_id":"Mereka (utusan-utusan) itu berkata, “Kemalangan kamu itu adalah karena kamu sendiri. Apakah karena kamu diberi peringatan? Sebenarnya kamu adalah kaum yang melampaui batas.”","hasanah_per_verse":380},{"text_madani":"وَجَاءَ مِنْ أَقْصَى الْمَدِينَةِ رَجُلٌ يَسْعَىٰ قَالَ يَا قَوْمِ اتَّبِعُوا الْمُرْسَلِينَ","text_tajweed":"وَج[o[َا]ٓءَ مِنْ أَ[q:10108[قْ]صَا [h:10109[ٱ]لْمَدِينَةِ رَجُ[a:11203[لٌ ي]َسْعَىٰ قَالَ يَ[n[ـٰ]قَوْمِ [h:11204[ٱ]تَّبِعُو[s[اْ] [h:11205[ٱ]لْمُرْسَل[p[ِي]نَ","translation_en":"And from the remote part of the city there came a man running, he said: O my people! follow the messengers;","translation_id":"Dan datanglah dari ujung kota, seorang laki-laki dengan bergegas dia berkata, “Wahai kaumku! Ikutilah utusan-utusan itu.","hasanah_per_verse":460},{"text_madani":"اتَّبِعُوا مَن لَّا يَسْأَلُكُمْ أَجْرًا وَهُم مُّهْتَدُونَ","text_tajweed":"ٱتَّبِعُو[s[اْ] م[u:6065[َن ل]َّا يَسْــَٔلُكُمْ أَ[q:2795[جْ][a:11206[رًا و]َه[w:4209[ُم م]ُّهْتَد[p[ُو]نَ","translation_en":"Follow him who does not ask you for reward, and they are the followers of the right course;","translation_id":"Ikutilah orang yang tidak meminta imbalan kepadamu; dan mereka adalah orang-orang yang mendapat petunjuk.","hasanah_per_verse":290},{"text_madani":"وَمَا لِيَ لَا أَعْبُدُ الَّذِي فَطَرَنِي وَإِلَيْهِ تُرْجَعُونَ","text_tajweed":"وَمَا لِىَ ل[o[َآ] أَعْبُدُ [h:11207[ٱ]لَّذِى فَطَرَنِى وَإِلَيْهِ تُرْجَع[p[ُو]نَ","translation_en":"And what reason have I that I should not serve Him Who brought me into existence? And to Him you shall be brought back;","translation_id":"Dan tidak ada alasan bagiku untuk tidak menyembah (Allah) yang telah menciptakanku dan hanya kepada-Nyalah kamu akan dikembalikan.","hasanah_per_verse":310},{"text_madani":"أَأَتَّخِذُ مِن دُونِهِ آلِهَةً إِن يُرِدْنِ الرَّحْمَٰنُ بِضُرٍّ لَّا تُغْنِ عَنِّي شَفَاعَتُهُمْ شَيْئًا وَلَا يُنقِذُونِ","text_tajweed":"ءَأَتَّخِذُ مِ[f:3136[ن د]ُونِه[o[ِۦٓ] ءَالِهَةً إ[a:11208[ِن ي]ُرِ[q:11209[دْ]نِ [h:11210[ٱ][l[ل]رَّحْمَ[n[ـٰ]نُ بِضُ[u:11211[رٍّ ل]َّا تُغْنِ عَ[g[نّ]ِى شَفَ[n[ـٰ]عَتُهُمْ شَيْـ[a:232[ـًٔا و]َلَا يُ[f:11212[نق]ِذ[p[ُو]نِ","translation_en":"What! shall I take besides Him gods whose intercession, If the Beneficent Allah should desire to afflict me with a harm, shall not avail me aught, nor shall they be able to deliver me?","translation_id":"Mengapa aku akan menyembah tuhan-tuhan selain-Nya? Jika (Allah) Yang Maha Pengasih menghendaki bencana terhadapku, pasti pertolongan mereka tidak berguna sama sekali bagi diriku dan mereka (juga) tidak dapat menyelamatkanku.","hasanah_per_verse":580},{"text_madani":"إِنِّي إِذًا لَّفِي ضَلَالٍ مُّبِينٍ","text_tajweed":"إِ[g[نّ][o[ِىٓ] إِ[u:11213[ذًا ل]َّفِى ضَلَ[n[ـٰ][a:2393[لٍ م]ُّب[p[ِي]نٍ","translation_en":"In that case I shall most surely be in clear error:","translation_id":"Sesungguhnya jika aku (berbuat) begitu, pasti aku berada dalam kesesatan yang nyata.","hasanah_per_verse":170},{"text_madani":"إِنِّي آمَنتُ بِرَبِّكُمْ فَاسْمَعُونِ","text_tajweed":"إِ[g[نّ][o[ِىٓ] ءَامَ[f:6185[نت]ُ بِرَبِّكُمْ فَ[h:11214[ٱ]سْمَع[p[ُو]نِ","translation_en":"Surely I believe in your Lord, therefore hear me.","translation_id":"Sesungguhnya aku telah beriman kepada Tuhanmu; maka dengarkanlah (pengakuan keimanan)-ku.”","hasanah_per_verse":190},{"text_madani":"قِيلَ ادْخُلِ الْجَنَّةَ ۖ قَالَ يَا لَيْتَ قَوْمِي يَعْلَمُونَ","text_tajweed":"قِيلَ [h:11215[ٱ][q:11216[دْ]خُلِ [h:11217[ٱ]لْجَ[g[نّ]َةَۖ قَالَ يَ[n[ـٰ]لَيْتَ قَوْمِى يَعْلَم[p[ُو]نَ","translation_en":"It was said: Enter the garden. He said: O would that my people had known","translation_id":"Dikatakan (kepadanya), “Masuklah ke surga.” Dia (laki-laki itu) berkata, “Alangkah baiknya sekiranya kaumku mengetahui,","hasanah_per_verse":300},{"text_madani":"بِمَا غَفَرَ لِي رَبِّي وَجَعَلَنِي مِنَ الْمُكْرَمِينَ","text_tajweed":"بِمَا غَفَرَ لِى رَبِّى وَجَعَلَنِى مِنَ [h:11218[ٱ]لْمُكْرَم[p[ِي]نَ","translation_en":"Of that on account of which my Lord has forgiven me and made me of the honored ones!","translation_id":"apa yang menyebabkan Tuhanku memberi ampun kepadaku dan menjadikan aku termasuk orang-orang yang telah dimuliakan.”","hasanah_per_verse":270},{"text_madani":"وَمَا أَنزَلْنَا عَلَىٰ قَوْمِهِ مِن بَعْدِهِ مِن جُندٍ مِّنَ السَّمَاءِ وَمَا كُنَّا مُنزِلِينَ","text_tajweed":"۞ وَم[o[َآ] أَ[f:515[نز]َلْنَا عَلَىٰ قَوْمِه[n[ِۦ] م[i:254[ِنۢ ب]َعْدِه[n[ِۦ] مِ[f:11219[ن ج]ُن[a:11220[دٍ م]ِّنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ وَمَا كُ[g[نّ]َا مُ[f:11221[نز]ِل[p[ِي]نَ","translation_en":"And We did not send down upon his people after him any hosts from heaven, nor do We ever send down.","translation_id":"Dan setelah dia (meninggal), Kami tidak menurunkan suatu pasukan pun dari langit kepada kaumnya, dan Kami tidak perlu menurunkannya.","hasanah_per_verse":470},{"text_madani":"إِن كَانَتْ إِلَّا صَيْحَةً وَاحِدَةً فَإِذَا هُمْ خَامِدُونَ","text_tajweed":"إِ[f:489[ن ك]َانَتْ إِلَّا صَيْحَ[a:11222[ةً و][n[َٲ]حِدَ[f:11223[ةً ف]َإِذَا هُمْ خَ[n[ـٰ]مِد[p[ُو]نَ","translation_en":"It was naught but a single cry, and lo! they were still.","translation_id":"Tidak ada siksaan terhadap mereka melainkan dengan satu teriakan saja; maka seketika itu mereka mati.","hasanah_per_verse":300},{"text_madani":"يَا حَسْرَةً عَلَى الْعِبَادِ ۚ مَا يَأْتِيهِم مِّن رَّسُولٍ إِلَّا كَانُوا بِهِ يَسْتَهْزِئُونَ","text_tajweed":"يَ[n[ـٰ]حَسْرَةً عَلَى [h:11224[ٱ]لْعِبَادِ‌ۚ مَا يَأْتِيه[w:7205[ِم م]ّ[u:2882[ِن ر]َّسُولٍ إِلَّا كَانُو[s[اْ] بِه[n[ِۦ] يَسْتَهْزِء[p[ُو]نَ","translation_en":"Alas for the servants! there comes not to them an messenger but they mock at him.","translation_id":"Alangkah besar penyesalan terhadap hamba-hamba itu, setiap datang seorang rasul kepada mereka, mereka selalu memperolok-olokkannya.","hasanah_per_verse":470},{"text_madani":"أَلَمْ يَرَوْا كَمْ أَهْلَكْنَا قَبْلَهُم مِّنَ الْقُرُونِ أَنَّهُمْ إِلَيْهِمْ لَا يَرْجِعُونَ","text_tajweed":"أَلَمْ يَرَوْ[s[اْ] كَمْ أَهْلَكْنَا قَ[q:8394[بْ]لَه[w:8646[ُم م]ِّنَ [h:6524[ٱ]لْقُرُونِ أَ[g[نّ]َهُمْ إِلَيْهِمْ لَا يَرْجِع[p[ُو]نَ","translation_en":"Do they not consider how many of the generations have We destroyed before them, because they do not turn to them?","translation_id":"Tidakkah mereka mengetahui berapa banyak umat-umat sebelum mereka yang telah Kami binasakan. Orang-orang (yang telah Kami binasakan) itu tidak ada yang kembali kepada mereka.","hasanah_per_verse":450},{"text_madani":"وَإِن كُلٌّ لَّمَّا جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ","text_tajweed":"وَإِ[f:11225[ن ك]ُ[u:11226[لٌّ ل]َّ[g[مّ]َا جَمِي[u:11227[عٌ ل]َّدَيْنَا مُحْضَر[p[ُو]نَ","translation_en":"And all of them shall surely be brought before Us.","translation_id":"Dan setiap (umat), semuanya akan dihadapkan kepada Kami.","hasanah_per_verse":230},{"text_madani":"وَآيَةٌ لَّهُمُ الْأَرْضُ الْمَيْتَةُ أَحْيَيْنَاهَا وَأَخْرَجْنَا مِنْهَا حَبًّا فَمِنْهُ يَأْكُلُونَ","text_tajweed":"وَءَايَ[u:11228[ةٌ ل]َّهُمُ [h:11229[ٱ]لْأَرْضُ [h:11230[ٱ]لْمَيْتَةُ أَحْيَيْنَ[n[ـٰ]هَا وَأَخْرَ[q:11231[جْ]نَا مِنْهَا حَب[f:11232[ًّا ف]َمِنْهُ يَأْكُل[p[ُو]نَ","translation_en":"And a sign to them is the dead earth: We give life to it and bring forth from it grain SQ they eat of it.","translation_id":"Dan suatu tanda (kebesaran Allah) bagi mereka adalah bumi yang mati (tandus). Kami hidupkan bumi itu dan Kami keluarkan darinya biji-bijian, maka dari (biji-bijian) itu mereka makan.","hasanah_per_verse":500},{"text_madani":"وَجَعَلْنَا فِيهَا جَنَّاتٍ مِّن نَّخِيلٍ وَأَعْنَابٍ وَفَجَّرْنَا فِيهَا مِنَ الْعُيُونِ","text_tajweed":"وَجَعَلْنَا فِيهَا جَ[g[نّ]َ[n[ـٰ][a:9169[تٍ م]ّ[a:1568[ِن ن]َّخِي[a:1569[لٍ و]َأَعْنَ[n[ـٰ][a:11233[بٍ و]َفَجَّرْنَا فِيهَا مِنَ [h:11234[ٱ]لْعُي[p[ُو]نِ","translation_en":"And We make therein gardens of palms and grapevines and We make springs to flow forth in it,","translation_id":"Dan Kami jadikan padanya di bumi itu kebun-kebun kurma dan anggur dan Kami pancarkan padanya beberapa mata air,","hasanah_per_verse":440},{"text_madani":"لِيَأْكُلُوا مِن ثَمَرِهِ وَمَا عَمِلَتْهُ أَيْدِيهِمْ ۖ أَفَلَا يَشْكُرُونَ","text_tajweed":"لِيَأْكُلُو[s[اْ] مِ[f:4468[ن ث]َمَرِه[n[ِۦ] وَمَا عَمِلَتْهُ أَيْدِيهِمْ‌ۖ أَفَلَا يَشْكُر[p[ُو]نَ","translation_en":"That they may eat of the fruit thereof, and their hands did not make it; will they not then be grateful?","translation_id":"agar mereka dapat makan dari buahnya, dan dari hasil usaha tangan mereka. Maka mengapa mereka tidak bersyukur?","hasanah_per_verse":370},{"text_madani":"سُبْحَانَ الَّذِي خَلَقَ الْأَزْوَاجَ كُلَّهَا مِمَّا تُنبِتُ الْأَرْضُ وَمِنْ أَنفُسِهِمْ وَمِمَّا لَا يَعْلَمُونَ","text_tajweed":"سُ[q:7648[بْ]حَ[n[ـٰ]نَ [h:7649[ٱ]لَّذِى خَلَقَ [h:11235[ٱ]لْأَزْو[n[َٲ]جَ كُلَّهَا مِ[g[مّ]َا تُ[i:308[نۢب]ِتُ [h:309[ٱ]لْأَرْضُ وَمِنْ أَ[f:568[نف]ُسِهِمْ وَمِ[g[مّ]َا لَا يَعْلَم[p[ُو]نَ","translation_en":"Glory be to Him Who created pairs of all things, of what the earth grows, and of their kind and of what they do not know.","translation_id":"Mahasuci (Allah) yang telah menciptakan semuanya berpasang-pasangan, baik dari apa yang ditumbuhkan oleh bumi dan dari diri mereka sendiri, maupun dari apa yang tidak mereka ketahui.","hasanah_per_verse":560},{"text_madani":"وَآيَةٌ لَّهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهَارَ فَإِذَا هُم مُّظْلِمُونَ","text_tajweed":"وَءَايَ[u:11228[ةٌ ل]َّهُمُ [h:11236[ٱ]لَّيْلُ نَسْلَخُ مِنْهُ [h:11237[ٱ][l[ل][g[نّ]َهَارَ فَإِذَا ه[w:11238[ُم م]ُّظْلِم[p[ُو]نَ","translation_en":"And a sign to them is the night: We draw forth from it the day, then lo! they are in the dark;","translation_id":"Dan suatu tanda (kebesaran Allah) bagi mereka adalah malam; Kami tanggalkan siang dari (malam) itu, maka seketika itu mereka (berada dalam) kegelapan,","hasanah_per_verse":370},{"text_madani":"وَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَّهَا ۚ ذَٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ","text_tajweed":"وَ[h:9999[ٱ][l[ل]شَّمْسُ تَ[q:120[جْ]رِى لِمُسْتَقَ[u:11239[رٍّ ل]َّهَا‌ۚ ذ[n[َٲ]لِكَ تَ[q:4267[قْ]دِيرُ [h:4268[ٱ]لْعَزِيزِ [h:4269[ٱ]لْعَل[p[ِي]مِ","translation_en":"And the sun runs on to a term appointed for it; that is the ordinance of the Mighty, the Knowing.","translation_id":"dan matahari berjalan di tempat peredarannya. Demikianlah ketetapan (Allah) Yang Mahaperkasa, Maha Mengetahui.","hasanah_per_verse":390},{"text_madani":"وَالْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ حَتَّىٰ عَادَ كَالْعُرْجُونِ الْقَدِيمِ","text_tajweed":"وَ[h:9999[ٱ]لْقَمَرَ قَدَّرْنَ[n[ـٰ]هُ مَنَازِلَ حَتَّىٰ عَادَ كَ[h:11240[ٱ]لْعُرْجُونِ [h:11241[ٱ]لْقَد[p[ِي]مِ","translation_en":"And (as for) the moon, We have ordained for it stages till it becomes again as an old dry palm branch.","translation_id":"Dan telah Kami tetapkan tempat peredaran bagi bulan, sehingga (setelah ia sampai ke tempat peredaran yang terakhir) kembalilah ia seperti bentuk tandan yang tua.","hasanah_per_verse":370},{"text_madani":"لَا الشَّمْسُ يَنبَغِي لَهَا أَن تُدْرِكَ الْقَمَرَ وَلَا اللَّيْلُ سَابِقُ النَّهَارِ ۚ وَكُلٌّ فِي فَلَكٍ يَسْبَحُونَ","text_tajweed":"لَا [h:11242[ٱ][l[ل]شَّمْسُ يَ[i:8425[نۢب]َغِى لَه[o[َآ] أَ[f:11243[ن ت]ُ[q:11244[دْ]رِكَ [h:11245[ٱ]لْقَمَرَ وَلَا [h:11246[ٱ]لَّيْلُ سَابِقُ [h:11247[ٱ][l[ل][g[نّ]َهَارِ‌ۚ وَكُ[f:11248[لٌّ ف]ِى فَلَ[a:8732[كٍ ي]َسْبَح[p[ُو]نَ","translation_en":"Neither is it allowable to the sun that it should overtake the moon, nor can the night outstrip the day; and all float on in a sphere.","translation_id":"Tidaklah mungkin bagi matahari mengejar bulan dan malam pun tidak dapat mendahului siang. Masing-masing beredar pada garis edarnya.","hasanah_per_verse":580},{"text_madani":"وَآيَةٌ لَّهُمْ أَنَّا حَمَلْنَا ذُرِّيَّتَهُمْ فِي الْفُلْكِ الْمَشْحُونِ","text_tajweed":"وَءَايَ[u:11249[ةٌ ل]َّهُمْ أَ[g[نّ]َا حَمَلْنَا ذُرِّيَّتَهُمْ فِى [h:4780[ٱ]لْفُلْكِ [h:9808[ٱ]لْمَشْح[p[ُو]نِ","translation_en":"And a sign to them is that We bear their offspring in the laden ship.","translation_id":"Dan suatu tanda (kebesaran Allah) bagi mereka adalah bahwa Kami angkut keturunan mereka dalam kapal yang penuh muatan,","hasanah_per_verse":350},{"text_madani":"وَخَلَقْنَا لَهُم مِّن مِّثْلِهِ مَا يَرْكَبُونَ","text_tajweed":"وَخَلَ[q:11250[قْ]نَا لَه[w:1812[ُم م]ّ[a:104[ِن م]ِّثْلِه[n[ِۦ] مَا يَرْكَب[p[ُو]نَ","translation_en":"And We have created for them the like of it, what they will ride on.","translation_id":"dan Kami ciptakan (juga) untuk mereka (angkutan lain) seperti apa yang mereka kendarai.","hasanah_per_verse":230},{"text_madani":"وَإِن نَّشَأْ نُغْرِقْهُمْ فَلَا صَرِيخَ لَهُمْ وَلَا هُمْ يُنقَذُونَ","text_tajweed":"وَإ[a:11251[ِن ن]َّشَأْ نُغْرِ[q:11252[قْ]هُمْ فَلَا صَرِيخَ لَهُمْ وَلَا هُمْ يُ[f:11253[نق]َذ[p[ُو]نَ","translation_en":"And if We please, We can drown them, then there shall be no succorer for them, nor shall they be rescued","translation_id":"Dan jika Kami menghendaki, Kami tenggelamkan mereka. Maka tidak ada penolong bagi mereka dan tidak (pula) mereka diselamatkan,","hasanah_per_verse":330},{"text_madani":"إِلَّا رَحْمَةً مِّنَّا وَمَتَاعًا إِلَىٰ حِينٍ","text_tajweed":"إِلَّا رَحْمَ[a:11254[ةً م]ِّ[g[نّ]َا وَمَتَ[n[ـٰ]عًا إِلَىٰ ح[p[ِي]نٍ","translation_en":"But (by) mercy from Us and for enjoyment till a time.","translation_id":"melainkan (Kami selamatkan mereka) karena rahmat yang besar dari Kami dan untuk memberikan kesenangan hidup sampai waktu tertentu.","hasanah_per_verse":220},{"text_madani":"وَإِذَا قِيلَ لَهُمُ اتَّقُوا مَا بَيْنَ أَيْدِيكُمْ وَمَا خَلْفَكُمْ لَعَلَّكُمْ تُرْحَمُونَ","text_tajweed":"وَإِذَا قِيلَ لَهُمُ [h:11255[ٱ]تَّقُو[s[اْ] مَا بَيْنَ أَيْدِيكُمْ وَمَا خَلْفَكُمْ لَعَلَّكُمْ تُرْحَم[p[ُو]نَ","translation_en":"And when it is said to them: Guard against what is before you and what is behind you, that mercy may be had on you.","translation_id":"Dan apabila dikatakan kepada mereka, “Takutlah kamu akan siksa yang di hadapanmu (di dunia) dan azab yang akan datang (akhirat) agar kamu mendapat rahmat.”","hasanah_per_verse":450},{"text_madani":"وَمَا تَأْتِيهِم مِّنْ آيَةٍ مِّنْ آيَاتِ رَبِّهِمْ إِلَّا كَانُوا عَنْهَا مُعْرِضِينَ","text_tajweed":"وَمَا تَأْتِيه[w:3923[ِم م]ِّنْ ءَايَ[a:3924[ةٍ م]ِّنْ ءَايَ[n[ـٰ]تِ رَبِّهِمْ إِلَّا كَانُو[s[اْ] عَنْهَا مُعْرِض[p[ِي]نَ","translation_en":"And there comes not to them a communication of the communications of their Lord but they turn aside from it.","translation_id":"Dan setiap kali suatu tanda dari tanda-tanda (kebesaran) Tuhan datang kepada mereka, mereka selalu berpaling darinya.","hasanah_per_verse":420},{"text_madani":"وَإِذَا قِيلَ لَهُمْ أَنفِقُوا مِمَّا رَزَقَكُمُ اللَّهُ قَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا أَنُطْعِمُ مَن لَّوْ يَشَاءُ اللَّهُ أَطْعَمَهُ إِنْ أَنتُمْ إِلَّا فِي ضَلَالٍ مُّبِينٍ","text_tajweed":"وَإِذَا قِيلَ لَهُمْ أَ[f:1460[نف]ِقُو[s[اْ] مِ[g[مّ]َا رَزَقَكُمُ [h:3751[ٱ]للَّهُ قَالَ [h:590[ٱ]لَّذِينَ كَفَرُو[s[اْ] لِلَّذِينَ ءَامَن[o[ُوٓ][s[اْ] أَنُ[q:11256[طْ]عِمُ م[u:11257[َن ل]َّوْ يَش[o[َا]ٓءُ [h:6988[ٱ]للَّهُ أَ[q:11258[طْ]عَمَهُ[o[ۥٓ] إِنْ أَ[f:428[نت]ُمْ إِلَّا فِى ضَلَ[n[ـٰ][a:2393[لٍ م]ُّب[p[ِي]نٍ","translation_en":"And when it is said to them: Spend out of what Allah has given you, those who disbelieve say to those who believe: Shall we feed him whom, if Allah please, He could feed? You are in naught but clear error.","translation_id":"Dan apabila dikatakan kepada mereka, “Infakkanlah sebagian rezeki yang diberikan Allah kepadamu,” orang-orang yang kafir itu berkata kepada orang-orang yang beriman, “Apakah pantas kami memberi makan kepada orang-orang yang jika Allah menghendaki Dia akan memberinya makan? Kamu benar-benar dalam kesesatan yang nyata.”","hasanah_per_verse":920},{"text_madani":"وَيَقُولُونَ مَتَىٰ هَٰذَا الْوَعْدُ إِن كُنتُمْ صَادِقِينَ","text_tajweed":"وَيَقُولُونَ مَتَىٰ هَ[n[ـٰ]ذَا [h:6081[ٱ]لْوَعْدُ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ صَ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"And they say: When will this threat come to pass, if you are truthful?","translation_id":"Dan mereka (orang-orang kafir) berkata, “Kapan janji (hari berbangkit) itu (terjadi) jika kamu orang yang benar?”","hasanah_per_verse":300},{"text_madani":"مَا يَنظُرُونَ إِلَّا صَيْحَةً وَاحِدَةً تَأْخُذُهُمْ وَهُمْ يَخِصِّمُونَ","text_tajweed":"مَا يَ[f:1141[نظ]ُرُونَ إِلَّا صَيْحَ[a:11222[ةً و][n[َٲ]حِدَ[f:11259[ةً ت]َأْخُذُهُمْ وَهُمْ يَخِصِّم[p[ُو]نَ","translation_en":"They wait not for aught but a single cry which will overtake them while they yet contend with one another.","translation_id":"Mereka hanya menunggu satu teriakan, yang akan membinasakan mereka ketika mereka sedang bertengkar.","hasanah_per_verse":350},{"text_madani":"فَلَا يَسْتَطِيعُونَ تَوْصِيَةً وَلَا إِلَىٰ أَهْلِهِمْ يَرْجِعُونَ","text_tajweed":"فَلَا يَسْتَطِيعُونَ تَوْصِيَ[a:11260[ةً و]َل[o[َآ] إِلَ[o[ىٰٓ] أَهْلِهِمْ يَرْجِع[p[ُو]نَ","translation_en":"So they shall not be able to make a bequest, nor shall they return to their families.","translation_id":"Sehingga mereka tidak mampu membuat suatu wasiat dan mereka (juga) tidak dapat kembali kepada keluarganya.","hasanah_per_verse":330},{"text_madani":"وَنُفِخَ فِي الصُّورِ فَإِذَا هُم مِّنَ الْأَجْدَاثِ إِلَىٰ رَبِّهِمْ يَنسِلُونَ","text_tajweed":"وَنُفِخَ فِى [h:4185[ٱ][l[ل]صُّورِ فَإِذَا ه[w:10171[ُم م]ِّنَ [h:11261[ٱ]لْأَ[q:11262[جْ]دَاثِ إِلَىٰ رَبِّهِمْ يَ[f:8857[نس]ِل[p[ُو]نَ","translation_en":"And the trumpet shall be blown, when lo! from their graves they shall hasten on to their Lord.","translation_id":"Lalu ditiuplah sangkakala, maka seketika itu mereka keluar dari kuburnya (dalam keadaan hidup), menuju kepada Tuhannya.","hasanah_per_verse":390},{"text_madani":"قَالُوا يَا وَيْلَنَا مَن بَعَثَنَا مِن مَّرْقَدِنَا ۜ ۗ هَٰذَا مَا وَعَدَ الرَّحْمَٰنُ وَصَدَقَ الْمُرْسَلُونَ","text_tajweed":"قَالُو[s[اْ] يَ[n[ـٰ]وَيْلَنَا م[i:11263[َنۢ ب]َعَثَنَا م[a:11264[ِن م]َّرْقَدِنَاۜ‌ۗ هَ[n[ـٰ]ذَا مَا وَعَدَ [h:8377[ٱ][l[ل]رَّحْمَ[n[ـٰ]نُ وَصَدَقَ [h:11265[ٱ]لْمُرْسَل[p[ُو]نَ","translation_en":"They shall say: O woe to us! who has raised us up from our sleeping-place? This is what the Beneficent Allah promised and the messengers told the truth.","translation_id":"Mereka berkata, “Celakalah kami! Siapakah yang membangkitkan kami dari tempat tidur kami (kubur)?” Inilah yang dijanjikan (Allah) Yang Maha Pengasih dan benarlah rasul-rasul(-Nya).","hasanah_per_verse":530},{"text_madani":"إِن كَانَتْ إِلَّا صَيْحَةً وَاحِدَةً فَإِذَا هُمْ جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ","text_tajweed":"إِ[f:489[ن ك]َانَتْ إِلَّا صَيْحَ[a:11222[ةً و][n[َٲ]حِدَ[f:11223[ةً ف]َإِذَا هُمْ جَمِي[u:11227[عٌ ل]َّدَيْنَا مُحْضَر[p[ُو]نَ","translation_en":"There would be naught but a single cry, when lo! they shall all be brought before Us;","translation_id":"Teriakan itu hanya sekali saja, maka seketika itu mereka semua dihadapkan kepada Kami (untuk dihisab).","hasanah_per_verse":390},{"text_madani":"فَالْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْئًا وَلَا تُجْزَوْنَ إِلَّا مَا كُنتُمْ تَعْمَلُونَ","text_tajweed":"فَ[h:9999[ٱ]لْيَوْمَ لَا تُظْلَمُ نَفْ[f:8774[سٌ ش]َيْـ[a:232[ـًٔا و]َلَا تُ[q:4248[جْ]زَوْنَ إِلَّا مَا كُ[f:100[نت]ُمْ تَعْمَل[p[ُو]نَ","translation_en":"So this day no soul shall be dealt with unjustly in the least; and you shall not be rewarded aught but that which you did.","translation_id":"Maka pada hari itu seseorang tidak akan dirugikan sedikit pun dan kamu tidak akan diberi balasan, kecuali sesuai dengan apa yang telah kamu kerjakan.","hasanah_per_verse":420},{"text_madani":"إِنَّ أَصْحَابَ الْجَنَّةِ الْيَوْمَ فِي شُغُلٍ فَاكِهُونَ","text_tajweed":"إِ[g[نّ]َ أَصْحَ[n[ـٰ]بَ [h:4715[ٱ]لْجَ[g[نّ]َةِ [h:11266[ٱ]لْيَوْمَ فِى شُغُ[f:11267[لٍ ف]َ[n[ـٰ]كِه[p[ُو]نَ","translation_en":"Surely the dwellers of the garden shall on that day be in an occupation quite happy.","translation_id":"Sesungguhnya penghuni surga pada hari itu bersenang-senang dalam kesibukan (mereka).","hasanah_per_verse":280},{"text_madani":"هُمْ وَأَزْوَاجُهُمْ فِي ظِلَالٍ عَلَى الْأَرَائِكِ مُتَّكِئُونَ","text_tajweed":"هُمْ وَأَزْو[n[َٲ]جُهُمْ فِى ظِلَ[n[ـٰ]لٍ عَلَى [h:8058[ٱ]لْأَر[o[َا]ٓئِكِ مُتَّكِــٔ[p[ُو]نَ","translation_en":"They and their wives shall be in shades, reclining on raised couches.","translation_id":"Mereka dan pasangan-pasangannya berada dalam tempat yang teduh, bersandar di atas dipan-dipan.","hasanah_per_verse":320},{"text_madani":"لَهُمْ فِيهَا فَاكِهَةٌ وَلَهُم مَّا يَدَّعُونَ","text_tajweed":"لَهُمْ فِيهَا فَ[n[ـٰ]كِهَ[a:11268[ةٌ و]َلَه[w:7443[ُم م]َّا يَدَّع[p[ُو]نَ","translation_en":"They shall have fruits therein, and they shall have whatever they desire.","translation_id":"Di surga itu mereka memperoleh buah-buahan dan memperoleh apa saja yang mereka inginkan.","hasanah_per_verse":230},{"text_madani":"سَلَامٌ قَوْلًا مِّن رَّبٍّ رَّحِيمٍ","text_tajweed":"سَلَ[n[ـٰ][f:11269[مٌ ق]َوْل[a:11270[اً م]ّ[u:11271[ِن ر]َّ[u:11272[بٍّ ر]َّح[p[ِي]مٍ","translation_en":"Peace: a word from a Merciful Lord.","translation_id":"(Kepada mereka dikatakan), “Salam,” sebagai ucapan selamat dari Tuhan Yang Maha Penyayang.","hasanah_per_verse":160},{"text_madani":"وَامْتَازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ","text_tajweed":"وَ[h:9999[ٱ]مْتَ[n[ـٰ]زُو[s[اْ] [h:11273[ٱ]لْيَوْمَ أَيُّهَا [h:11274[ٱ]لْمُ[q:5255[جْ]رِم[p[ُو]نَ","translation_en":"And get aside today, O guilty ones!","translation_id":"Dan (dikatakan kepada orang-orang kafir), “Berpisahlah kamu (dari orang-orang mukmin) pada hari ini, wahai orang-orang yang berdosa!","hasanah_per_verse":250},{"text_madani":"أَلَمْ أَعْهَدْ إِلَيْكُمْ يَا بَنِي آدَمَ أَن لَّا تَعْبُدُوا الشَّيْطَانَ ۖ إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ","text_tajweed":"۞ أَلَمْ أَعْهَ[q:11275[دْ] إِلَيْكُمْ يَ[n[ـٰ]بَن[o[ِىٓ] ءَادَمَ أ[u:4908[َن ل]َّا تَعْبُدُو[s[اْ] [h:11276[ٱ][l[ل]شَّيْطَ[n[ـٰ]نَ‌ۖ إِ[g[نّ]َهُ[n[ۥ] لَكُمْ عَدُ[a:873[وٌّ م]ُّب[p[ِي]نٌ","translation_en":"Did I not charge you, O children of Adam! that you should not serve the Shaitan? Surely he is your open enemy,","translation_id":"Bukankah Aku telah memerintahkan kepadamu wahai anak cucu Adam agar kamu tidak menyembah setan? Sungguh, setan itu musuh yang nyata bagi kamu,","hasanah_per_verse":500},{"text_madani":"وَأَنِ اعْبُدُونِي ۚ هَٰذَا صِرَاطٌ مُّسْتَقِيمٌ","text_tajweed":"وَأَنِ [h:11277[ٱ]عْبُدُونِى‌ۚ هَ[n[ـٰ]ذَا صِر[n[َٲ][a:1947[طٌ م]ُّسْتَق[p[ِي]مٌ","translation_en":"And that you should serve Me; this is the right way.","translation_id":"dan hendaklah kamu menyembah-Ku. Inilah jalan yang lurus.”","hasanah_per_verse":230},{"text_madani":"وَلَقَدْ أَضَلَّ مِنكُمْ جِبِلًّا كَثِيرًا ۖ أَفَلَمْ تَكُونُوا تَعْقِلُونَ","text_tajweed":"وَلَقَ[q:341[دْ] أَضَلَّ مِ[f:344[نك]ُمْ جِبِل[f:11278[اًّ ك]َثِيرًا‌ۖ أَفَلَمْ تَكُونُو[s[اْ] تَعْقِل[p[ُو]نَ","translation_en":"And certainly he led astray numerous people from among you. What! could you not then understand?","translation_id":"Dan sungguh, ia (setan itu) telah menyesatkan sebagian besar di antara kamu. Maka apakah kamu tidak mengerti?","hasanah_per_verse":360},{"text_madani":"هَٰذِهِ جَهَنَّمُ الَّتِي كُنتُمْ تُوعَدُونَ","text_tajweed":"هَ[n[ـٰ]ذِه[n[ِۦ] جَهَ[g[نّ]َمُ [h:11279[ٱ]لَّتِى كُ[f:100[نت]ُمْ تُوعَد[p[ُو]نَ","translation_en":"This is the hell with which you were threatened.","translation_id":"Inilah (neraka) Jahanam yang dahulu telah diperingatkan kepadamu.","hasanah_per_verse":210},{"text_madani":"اصْلَوْهَا الْيَوْمَ بِمَا كُنتُمْ تَكْفُرُونَ","text_tajweed":"ٱصْلَوْهَا [h:11280[ٱ]لْيَوْمَ بِمَا كُ[f:100[نت]ُمْ تَكْفُر[p[ُو]نَ","translation_en":"Enter into it this day because you disbelieved.","translation_id":"Masuklah ke dalamnya pada hari ini karena dahulu kamu mengingkarinya.","hasanah_per_verse":240},{"text_madani":"الْيَوْمَ نَخْتِمُ عَلَىٰ أَفْوَاهِهِمْ وَتُكَلِّمُنَا أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُم بِمَا كَانُوا يَكْسِبُونَ","text_tajweed":"ٱلْيَوْمَ نَخْتِمُ عَلَ[o[ىٰٓ] أَفْو[n[َٲ]هِهِمْ وَتُكَلِّمُن[o[َآ] أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُه[c:11281[ُم ب]ِمَا كَانُو[s[اْ] يَكْسِب[p[ُو]نَ","translation_en":"On that day We will set a seal upon their mouths, and their hands shall speak to Us, and their feet shall bear witness of what they earned.","translation_id":"Pada hari ini Kami tutup mulut mereka; tangan mereka akan berkata kepada Kami dan kaki mereka akan memberi kesaksian terhadap apa yang dahulu mereka kerjakan.","hasanah_per_verse":570},{"text_madani":"وَلَوْ نَشَاءُ لَطَمَسْنَا عَلَىٰ أَعْيُنِهِمْ فَاسْتَبَقُوا الصِّرَاطَ فَأَنَّىٰ يُبْصِرُونَ","text_tajweed":"وَلَوْ نَش[o[َا]ٓءُ لَطَمَسْنَا عَلَ[o[ىٰٓ] أَعْيُنِهِمْ فَ[h:11282[ٱ]سْتَبَقُو[s[اْ] [h:11283[ٱ][l[ل]صِّر[n[َٲ]طَ فَأَ[g[نّ]َىٰ يُ[q:60[بْ]صِر[p[ُو]نَ","translation_en":"And if We please We would certainly put out their eyes, then they would run about groping for the way, but how should they see?","translation_id":"Dan jika Kami menghendaki, pastilah Kami hapuskan penglihatan mata mereka; sehingga mereka berlomba-lomba (mencari) jalan. Maka bagaimana mungkin mereka dapat melihat?","hasanah_per_verse":460},{"text_madani":"وَلَوْ نَشَاءُ لَمَسَخْنَاهُمْ عَلَىٰ مَكَانَتِهِمْ فَمَا اسْتَطَاعُوا مُضِيًّا وَلَا يَرْجِعُونَ","text_tajweed":"وَلَوْ نَش[o[َا]ٓءُ لَمَسَخْنَ[n[ـٰ]هُمْ عَلَىٰ مَكَانَتِهِمْ فَمَا [h:11284[ٱ]سْتَطَ[n[ـٰ]عُو[s[اْ] مُضِي[a:11285[ًّا و]َلَا يَرْجِع[p[ُو]نَ","translation_en":"And if We please We would surely transform them in their place, then they would not be able to go on, nor will they return.","translation_id":"Dan jika Kami menghendaki, pastilah Kami ubah bentuk mereka di tempat mereka berada; sehingga mereka tidak sanggup berjalan lagi dan juga tidak sanggup kembali.","hasanah_per_verse":490},{"text_madani":"وَمَن نُّعَمِّرْهُ نُنَكِّسْهُ فِي الْخَلْقِ ۖ أَفَلَا يَعْقِلُونَ","text_tajweed":"وَم[a:11286[َن ن]ُّعَ[g[مّ]ِرْهُ نُنَكِّسْهُ فِى [h:4788[ٱ]لْخَلْقِ‌ۖ أَفَلَا يَعْقِل[p[ُو]نَ","translation_en":"And whomsoever We cause to live long, We reduce (him) to an abject state in constitution; do they not then understand?","translation_id":"Dan barangsiapa Kami panjangkan umurnya niscaya Kami kembalikan dia kepada awal kejadian(nya). Maka mengapa mereka tidak mengerti?","hasanah_per_verse":300},{"text_madani":"وَمَا عَلَّمْنَاهُ الشِّعْرَ وَمَا يَنبَغِي لَهُ ۚ إِنْ هُوَ إِلَّا ذِكْرٌ وَقُرْآنٌ مُّبِينٌ","text_tajweed":"وَمَا عَلَّمْنَ[n[ـٰ]هُ [h:11287[ٱ][l[ل]شِّعْرَ وَمَا يَ[i:8425[نۢب]َغِى لَهُ[o[ۥٓ‌ۚ] إِنْ هُوَ إِلَّا ذِكْ[a:11288[رٌ و]َقُرْءَا[a:11289[نٌ م]ُّب[p[ِي]نٌ","translation_en":"And We have not taught him poetry, nor is it meet for him; it is nothing but a reminder and a plain Quran,","translation_id":"Dan Kami tidak mengajarkan syair kepadanya (Muhammad) dan bersyair itu tidaklah pantas baginya. Al-Qur'an itu tidak lain hanyalah pelajaran dan Kitab yang jelas,","hasanah_per_verse":430},{"text_madani":"لِّيُنذِرَ مَن كَانَ حَيًّا وَيَحِقَّ الْقَوْلُ عَلَى الْكَافِرِينَ","text_tajweed":"لِّيُ[f:7947[نذ]ِرَ مَ[f:506[ن ك]َانَ حَي[a:11290[ًّا و]َيَحِقَّ [h:11291[ٱ]لْقَوْلُ عَلَى [h:468[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"That it may warn him who would have life, and (that) the word may prove true against the unbelievers.","translation_id":"agar dia (Muhammad) memberi peringatan kepada orang-orang yang hidup (hatinya) dan agar pasti ketetapan (azab) terhadap orang-orang kafir.","hasanah_per_verse":330},{"text_madani":"أَوَلَمْ يَرَوْا أَنَّا خَلَقْنَا لَهُم مِّمَّا عَمِلَتْ أَيْدِينَا أَنْعَامًا فَهُمْ لَهَا مَالِكُونَ","text_tajweed":"أَوَلَمْ يَرَوْ[s[اْ] أَ[g[نّ]َا خَلَ[q:5159[قْ]نَا لَه[w:402[ُم م]ِّ[g[مّ]َا عَمِلَتْ أَيْدِين[o[َآ] أَنْعَ[n[ـٰ][f:11292[مًا ف]َهُمْ لَهَا مَ[n[ـٰ]لِك[p[ُو]نَ","translation_en":"Do they not see that We have created cattle for them, out of what Our hands have wrought, so they are their masters?","translation_id":"Dan tidakkah mereka melihat bahwa Kami telah menciptakan hewan ternak untuk mereka, yaitu sebagian dari apa yang telah Kami ciptakan dengan kekuasaan Kami, lalu mereka menguasainya?","hasanah_per_verse":500},{"text_madani":"وَذَلَّلْنَاهَا لَهُمْ فَمِنْهَا رَكُوبُهُمْ وَمِنْهَا يَأْكُلُونَ","text_tajweed":"وَذَلَّلْنَ[n[ـٰ]هَا لَهُمْ فَمِنْهَا رَكُوبُهُمْ وَمِنْهَا يَأْكُل[p[ُو]نَ","translation_en":"And We have subjected them to them, so some of them they have to ride upon, and some of them they eat.","translation_id":"Dan Kami menundukkannya (hewan-hewan itu) untuk mereka; lalu sebagiannya untuk menjadi tunggangan mereka dan sebagian untuk mereka makan.","hasanah_per_verse":330},{"text_madani":"وَلَهُمْ فِيهَا مَنَافِعُ وَمَشَارِبُ ۖ أَفَلَا يَشْكُرُونَ","text_tajweed":"وَلَهُمْ فِيهَا مَنَ[n[ـٰ]فِعُ وَمَشَارِبُ‌ۖ أَفَلَا يَشْكُر[p[ُو]نَ","translation_en":"And therein they have advantages and drinks; will they not then be grateful?","translation_id":"Dan mereka memperoleh berbagai manfaat dan minuman darinya. Maka mengapa mereka tidak bersyukur?","hasanah_per_verse":290},{"text_madani":"وَاتَّخَذُوا مِن دُونِ اللَّهِ آلِهَةً لَّعَلَّهُمْ يُنصَرُونَ","text_tajweed":"وَ[h:9999[ٱ]تَّخَذُو[s[اْ] مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ ءَالِهَ[u:11293[ةً ل]َّعَلَّهُمْ يُ[f:237[نص]َر[p[ُو]نَ","translation_en":"And they have taken gods besides Allah that they may be helped.","translation_id":"Dan mereka mengambil sesembahan selain Allah agar mereka mendapat pertolongan.","hasanah_per_verse":310},{"text_madani":"لَا يَسْتَطِيعُونَ نَصْرَهُمْ وَهُمْ لَهُمْ جُندٌ مُّحْضَرُونَ","text_tajweed":"لَا يَسْتَطِيعُونَ نَصْرَهُمْ وَهُمْ لَهُمْ جُن[a:11294[دٌ م]ُّحْضَر[p[ُو]نَ","translation_en":"(But) they shall not be able to assist them, and they shall be a host brought up before them.","translation_id":"Mereka (sesembahan) itu tidak dapat menolong mereka; padahal mereka itu menjadi tentara yang disiapkan untuk menjaga (sesembahan) itu.","hasanah_per_verse":300},{"text_madani":"فَلَا يَحْزُنكَ قَوْلُهُمْ ۘ إِنَّا نَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ","text_tajweed":"فَلَا يَحْزُ[f:2435[نك]َ قَوْلُهُمْ‌ۘ إِ[g[نّ]َا نَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِن[p[ُو]نَ","translation_en":"Therefore let not their speech grieve you; surely We know what they do in secret and what they do openly.","translation_id":"Maka jangan sampai ucapan mereka membuat engkau (Muhammad) bersedih hati. Sungguh, Kami mengetahui apa yang mereka rahasiakan dan apa yang mereka nyatakan.","hasanah_per_verse":360},{"text_madani":"أَوَلَمْ يَرَ الْإِنسَانُ أَنَّا خَلَقْنَاهُ مِن نُّطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُّبِينٌ","text_tajweed":"أَوَلَمْ يَرَ [h:11295[ٱ]لْإِ[f:2732[نس]َ[n[ـٰ]نُ أَ[g[نّ]َا خَلَ[q:7232[قْ]نَ[n[ـٰ]هُ م[a:7325[ِن ن]ُّ[q:7326[طْ]فَ[f:7327[ةٍ ف]َإِذَا هُوَ خَصِي[a:7328[مٌ م]ُّب[p[ِي]نٌ","translation_en":"Does not man see that We have created him from the small seed? Then lo! he is an open disputant.","translation_id":"Dan tidakkah manusia memperhatikan bahwa Kami menciptakannya dari setetes mani, ternyata dia menjadi musuh yang nyata!","hasanah_per_verse":420},{"text_madani":"وَضَرَبَ لَنَا مَثَلًا وَنَسِيَ خَلْقَهُ ۖ قَالَ مَن يُحْيِي الْعِظَامَ وَهِيَ رَمِيمٌ","text_tajweed":"وَضَرَبَ لَنَا مَثَل[a:11296[اً و]َنَسِىَ خَلْقَهُ[n[ۥ]‌ۖ قَالَ م[a:11297[َن ي]ُحْىِ [h:11298[ٱ]لْعِظَ[n[ـٰ]مَ وَهِىَ رَم[p[ِي]مٌ","translation_en":"And he strikes out a likeness for Us and forgets his own creation. Says he: Who will give life to the bones when they are rotten?","translation_id":"Dan dia membuat perumpamaan bagi Kami dan melupakan asal kejadiannya; dia berkata, “Siapakah yang dapat menghidupkan tulang-belulang, yang telah hancur luluh?”","hasanah_per_verse":410},{"text_madani":"قُلْ يُحْيِيهَا الَّذِي أَنشَأَهَا أَوَّلَ مَرَّةٍ ۖ وَهُوَ بِكُلِّ خَلْقٍ عَلِيمٌ","text_tajweed":"قُلْ يُحْيِيهَا [h:11299[ٱ]لَّذ[o[ِىٓ] أَ[f:11300[نش]َأَه[o[َآ] أَوَّلَ مَرَّ[a:11301[ةٍ‌ۖ و]َهُوَ بِكُلِّ خَلْقٍ عَل[p[ِي]مٌ","translation_en":"Say: He will give life to them Who brought them into existence at first, and He is cognizant of all creation","translation_id":"Katakanlah (Muhammad), “Yang akan menghidupkannya ialah (Allah) yang menciptakannya pertama kali. Dan Dia Maha Mengetahui tentang segala makhluk,","hasanah_per_verse":370},{"text_madani":"الَّذِي جَعَلَ لَكُم مِّنَ الشَّجَرِ الْأَخْضَرِ نَارًا فَإِذَا أَنتُم مِّنْهُ تُوقِدُونَ","text_tajweed":"ٱلَّذِى جَعَلَ لَك[w:1578[ُم م]ِّنَ [h:11302[ٱ][l[ل]شَّجَرِ [h:11303[ٱ]لْأَخْضَرِ نَا[f:11304[رًا ف]َإِذ[o[َآ] أَ[f:428[نت][w:11305[ُم م]ِّنْهُ تُوقِد[p[ُو]نَ","translation_en":"He Who has made for you the fire (to burn) from the green tree, so that with it you kindle (fire).","translation_id":"yaitu (Allah) yang menjadikan api untukmu dari kayu yang hijau, maka seketika itu kamu nyalakan (api) dari kayu itu.”","hasanah_per_verse":440},{"text_madani":"أَوَلَيْسَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِقَادِرٍ عَلَىٰ أَن يَخْلُقَ مِثْلَهُم ۚ بَلَىٰ وَهُوَ الْخَلَّاقُ الْعَلِيمُ","text_tajweed":"أَوَلَيْسَ [h:11306[ٱ]لَّذِى خَلَقَ [h:3913[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ بِقَ[n[ـٰ]دِرٍ عَلَ[o[ىٰٓ] أ[a:7911[َن ي]َخْلُقَ مِثْلَه[c:11307[ُم‌ۚ ب]َلَىٰ وَهُوَ [h:11308[ٱ]لْخَلَّ[n[ـٰ]قُ [h:7305[ٱ]لْعَل[p[ِي]مُ","translation_en":"Is not He Who created the heavens and the earth able to create the like of them? Yea! and He is the Creator (of all), the Knower.","translation_id":"Dan bukankah (Allah) yang menciptakan langit dan bumi, mampu menciptakan kembali yang serupa itu (jasad mereka yang sudah hancur itu)? Benar, dan Dia Maha Pencipta, Maha Mengetahui.","hasanah_per_verse":630},{"text_madani":"إِنَّمَا أَمْرُهُ إِذَا أَرَادَ شَيْئًا أَن يَقُولَ لَهُ كُن فَيَكُونُ","text_tajweed":"إِ[g[نّ]َم[o[َآ] أَمْرُهُ[o[ۥٓ] إِذ[o[َآ] أَرَادَ شَيْــًٔا أ[a:11309[َن ي]َقُولَ لَهُ[n[ۥ] كُ[f:613[ن ف]َيَك[p[ُو]نُ","translation_en":"His command, when He intends anything, is only to say to it: Be, so it is.","translation_id":"Sesungguhnya urusan-Nya apabila Dia menghendaki sesuatu Dia hanya berkata kepadanya, “Jadilah!” Maka jadilah sesuatu itu.","hasanah_per_verse":340},{"text_madani":"فَسُبْحَانَ الَّذِي بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَإِلَيْهِ تُرْجَعُونَ","text_tajweed":"فَسُ[q:8705[بْ]حَ[n[ـٰ]نَ [h:11310[ٱ]لَّذِى بِيَدِه[n[ِۦ] مَلَكُوتُ كُلِّ ش[a:11311[َىْءٍ و]َإِلَيْهِ تُرْجَع[p[ُو]نَ","translation_en":"Therefore glory be to Him in Whose hand is the kingdom of all things, and to Him you shall be brought back.","translation_id":"Maka Mahasuci (Allah) yang di tangan-Nya kekuasaan atas segala sesuatu dan kepada-Nya kamu dikembalikan.","hasanah_per_verse":350}]}
