{"chapter_number":16,"name_simple":"An-Nahl","name_meaning":{"text":"The Bee","en":"The Bee","id":"Lebah Madu"},"verses_count":128,"hasanah":78320,"verses":[{"text_madani":"أَتَىٰ أَمْرُ اللَّهِ فَلَا تَسْتَعْجِلُوهُ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ","text_tajweed":"أَتَ[o[ىٰٓ] أَمْرُ [h:2832[ٱ]للَّهِ فَلَا تَسْتَعْجِلُوهُ‌ۚ سُ[q:608[بْ]حَ[n[ـٰ]نَهُ[n[ۥ] وَتَعَ[n[ـٰ]لَىٰ عَ[g[مّ]َا يُشْرِك[p[ُو]نَ","translation_en":"Allah's commandment has come, therefore do not desire to hasten it; glory be to Him, and highly exalted be He above what they associate (with Him).","translation_id":"Ketetapan Allah pasti datang, maka janganlah kamu meminta agar dipercepat (datang)nya. Mahasuci Allah dan Mahatinggi Dia dari apa yang mereka persekutukan.","hasanah_per_verse":420},{"text_madani":"يُنَزِّلُ الْمَلَائِكَةَ بِالرُّوحِ مِنْ أَمْرِهِ عَلَىٰ مَن يَشَاءُ مِنْ عِبَادِهِ أَنْ أَنذِرُوا أَنَّهُ لَا إِلَٰهَ إِلَّا أَنَا فَاتَّقُونِ","text_tajweed":"يُنَزِّلُ [h:7321[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةَ بِ[h:7322[ٱ][l[ل]رُّوحِ مِنْ أَمْرِه[n[ِۦ] عَلَىٰ م[a:476[َن ي]َش[o[َا]ٓءُ مِنْ عِبَادِه[o[ِۦٓ] أَنْ أَ[f:7323[نذ]ِر[o[ُوٓ][s[اْ] أَ[g[نّ]َهُ[n[ۥ] ل[o[َآ] إِلَ[n[ـٰ]هَ إِلّ[o[َآ] أَنَا۟ فَ[h:210[ٱ]تَّق[p[ُو]نِ","translation_en":"He sends down the angels with the inspiration by His commandment on whom He pleases of His servants, saying: Give the warning that there is no god but Me, therefore be careful (of your duty) to Me.","translation_id":"Dia menurunkan para malaikat membawa wahyu dengan perintah-Nya kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya, (dengan berfirman) yaitu, “Peringatkanlah (hamba-hamba-Ku), bahwa tidak ada tuhan selain Aku, maka hendaklah kamu bertakwa kepada-Ku.”","hasanah_per_verse":680},{"text_madani":"خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۚ تَعَالَىٰ عَمَّا يُشْرِكُونَ","text_tajweed":"خَلَقَ [h:3913[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ بِ[h:370[ٱ]لْحَقِّ‌ۚ تَعَ[n[ـٰ]لَىٰ عَ[g[مّ]َا يُشْرِك[p[ُو]نَ","translation_en":"He created the heavens and the earth with the truth, highly exalted be He above what they associate (with Him).","translation_id":"Dia menciptakan langit dan bumi dengan kebenaran. Mahatinggi Allah dari apa yang mereka persekutukan.","hasanah_per_verse":360},{"text_madani":"خَلَقَ الْإِنسَانَ مِن نُّطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُّبِينٌ","text_tajweed":"خَلَقَ [h:7324[ٱ]لْإِ[f:5969[نس]َ[n[ـٰ]نَ م[a:7325[ِن ن]ُّ[q:7326[طْ]فَ[f:7327[ةٍ ف]َإِذَا هُوَ خَصِي[a:7328[مٌ م]ُّب[p[ِي]نٌ","translation_en":"He created man from a small seed and lo! he is an open contender.","translation_id":"Dia telah menciptakan manusia dari mani, ternyata dia menjadi pembantah yang nyata.","hasanah_per_verse":300},{"text_madani":"وَالْأَنْعَامَ خَلَقَهَا ۗ لَكُمْ فِيهَا دِفْءٌ وَمَنَافِعُ وَمِنْهَا تَأْكُلُونَ","text_tajweed":"وَ[h:9999[ٱ]لْأَنْعَ[n[ـٰ]مَ خَلَقَهَا‌ۗ لَكُمْ فِيهَا دِفْ[a:7329[ءٌ و]َمَنَ[n[ـٰ]فِعُ وَمِنْهَا تَأْكُل[p[ُو]نَ","translation_en":"And He created the cattle for you; you have in them warm clothing and (many) advantages, and of them do you eat.","translation_id":"Dan hewan ternak telah diciptakan-Nya, untuk kamu padanya ada (bulu) yang menghangatkan dan berbagai manfaat, dan sebagiannya kamu makan.","hasanah_per_verse":400},{"text_madani":"وَلَكُمْ فِيهَا جَمَالٌ حِينَ تُرِيحُونَ وَحِينَ تَسْرَحُونَ","text_tajweed":"وَلَكُمْ فِيهَا جَمَالٌ حِينَ تُرِيحُونَ وَحِينَ تَسْرَح[p[ُو]نَ","translation_en":"And there is beauty in them for you when you drive them back (to home), and when you send them forth (to pasture).","translation_id":"Dan kamu memperoleh keindahan padanya, ketika kamu membawanya kembali ke kandang dan ketika kamu melepaskannya (ke tempat penggembalaan).","hasanah_per_verse":310},{"text_madani":"وَتَحْمِلُ أَثْقَالَكُمْ إِلَىٰ بَلَدٍ لَّمْ تَكُونُوا بَالِغِيهِ إِلَّا بِشِقِّ الْأَنفُسِ ۚ إِنَّ رَبَّكُمْ لَرَءُوفٌ رَّحِيمٌ","text_tajweed":"وَتَحْمِلُ أَثْقَالَكُمْ إِلَىٰ بَلَ[u:7330[دٍ ل]َّمْ تَكُونُو[s[اْ] بَ[n[ـٰ]لِغِيهِ إِلَّا بِشِقِّ [h:7331[ٱ]لْأَ[f:7332[نف]ُسِ‌ۚ إِ[g[نّ]َ رَبَّكُمْ لَرَءُو[u:744[فٌ ر]َّح[p[ِي]مٌ","translation_en":"And they carry your heavy loads to regions which you could not reach but with distress of the souls; most surely your Lord is Compassionate, Merciful.","translation_id":"Dan ia mengangkut beban-bebanmu ke suatu negeri yang kamu tidak sanggup mencapainya, kecuali dengan susah payah. Sungguh, Tuhanmu Maha Pengasih, Maha Penyayang,","hasanah_per_verse":590},{"text_madani":"وَالْخَيْلَ وَالْبِغَالَ وَالْحَمِيرَ لِتَرْكَبُوهَا وَزِينَةً ۚ وَيَخْلُقُ مَا لَا تَعْلَمُونَ","text_tajweed":"وَ[h:9999[ٱ]لْخَيْلَ وَ[h:7333[ٱ]لْبِغَالَ وَ[h:7334[ٱ]لْحَمِيرَ لِتَرْكَبُوهَا وَزِينَ[a:7335[ةً‌ۚ و]َيَخْلُقُ مَا لَا تَعْلَم[p[ُو]نَ","translation_en":"And (He made) horses and mules and asses that you might ride upon them and as an ornament; and He creates what you do not know.","translation_id":"dan (Dia telah menciptakan) kuda, bagal, dan keledai, untuk kamu tunggangi dan (menjadi) perhiasan. Allah menciptakan apa yang tidak kamu ketahui.","hasanah_per_verse":480},{"text_madani":"وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ وَمِنْهَا جَائِرٌ ۚ وَلَوْ شَاءَ لَهَدَاكُمْ أَجْمَعِينَ","text_tajweed":"وَعَلَى [h:2207[ٱ]للَّهِ قَصْدُ [h:7336[ٱ][l[ل]سَّبِيلِ وَمِنْهَا ج[o[َا]ٓئِ[a:7337[رٌ‌ۚ و]َلَوْ ش[o[َا]ٓءَ لَهَدَ[n[ٮٰ]كُمْ أَ[q:825[جْ]مَع[p[ِي]نَ","translation_en":"And upon Allah it rests to show the right way, and there are some deviating (ways); and if He please He would certainly guide you all aright.","translation_id":"Dan hak Allah menerangkan jalan yang lurus, dan di antaranya ada (jalan) yang menyimpang. Dan jika Dia menghendaki, tentu Dia memberi petunjuk kamu semua (ke jalan yang benar).","hasanah_per_verse":440},{"text_madani":"هُوَ الَّذِي أَنزَلَ مِنَ السَّمَاءِ مَاءً ۖ لَّكُم مِّنْهُ شَرَابٌ وَمِنْهُ شَجَرٌ فِيهِ تُسِيمُونَ","text_tajweed":"هُوَ [h:153[ٱ]لَّذ[o[ِىٓ] أَ[f:471[نز]َلَ مِنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ م[o[َا]ٓ[u:7338[ءً‌ۖ ل]َّك[w:6234[ُم م]ِّنْهُ شَرَا[a:7339[بٌ و]َمِنْهُ شَجَ[f:7340[رٌ ف]ِيهِ تُسِيم[p[ُو]نَ","translation_en":"He it is Who sends down water from the cloud for you; it gives drink, and by it (grow) the trees upon which you pasture.","translation_id":"Dialah yang telah menurunkan air (hujan) dari langit untuk kamu, sebagiannya menjadi minuman dan sebagiannya (menyuburkan) tumbuhan, padanya kamu menggembalakan ternakmu.","hasanah_per_verse":470},{"text_madani":"يُنبِتُ لَكُم بِهِ الزَّرْعَ وَالزَّيْتُونَ وَالنَّخِيلَ وَالْأَعْنَابَ وَمِن كُلِّ الثَّمَرَاتِ ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِّقَوْمٍ يَتَفَكَّرُونَ","text_tajweed":"يُ[i:7341[نۢب]ِتُ لَك[c:2000[ُم ب]ِهِ [h:7342[ٱ][l[ل]زَّرْعَ وَ[h:4290[ٱ][l[ل]زَّيْتُونَ وَ[h:7343[ٱ][l[ل][g[نّ]َخِيلَ وَ[h:7344[ٱ]لْأَعْنَ[n[ـٰ]بَ وَمِ[f:4136[ن ك]ُلِّ [h:1571[ٱ][l[ل]ثَّمَر[n[َٲ]تِ‌ۗ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[u:7345[ةً ل]ِّقَوْ[a:6018[مٍ ي]َتَفَكَّر[p[ُو]نَ","translation_en":"He causes to grow for you thereby herbage, and the olives, and the palm trees, and the grapes, and of all the fruits; most surely there is a sign in this for a people who reflect.","translation_id":"Dengan (air hujan) itu Dia menumbuhkan untuk kamu tanam-tanaman, zaitun, kurma, anggur dan segala macam buah-buahan. Sungguh, pada yang demikian itu benar-benar terdapat tanda (kebesaran Allah) bagi orang yang berpikir.","hasanah_per_verse":710},{"text_madani":"وَسَخَّرَ لَكُمُ اللَّيْلَ وَالنَّهَارَ وَالشَّمْسَ وَالْقَمَرَ ۖ وَالنُّجُومُ مُسَخَّرَاتٌ بِأَمْرِهِ ۗ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَعْقِلُونَ","text_tajweed":"وَسَخَّرَ لَكُمُ [h:6116[ٱ]لَّيْلَ وَ[h:6117[ٱ][l[ل][g[نّ]َهَارَ وَ[h:4264[ٱ][l[ل]شَّمْسَ وَ[h:4265[ٱ]لْقَمَرَ‌ۖ وَ[h:7346[ٱ][l[ل][g[نّ]ُجُومُ مُسَخَّر[n[َٲ][i:7347[تُۢ ب]ِأَمْرِه[o[ِۦٓ‌ۗ] إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:849[تٍ ل]ِّقَوْ[a:850[مٍ ي]َعْقِل[p[ُو]نَ","translation_en":"And He has made subservient for you the night and the day and the sun and the moon, and the stars are made subservient by His commandment; most surely there are signs in this for a people who ponder;","translation_id":"Dia menundukkan malam dan siang, matahari dan bulan untukmu, dan bin-tang-bintang dikendalikan dengan perintah-Nya. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Allah) bagi orang yang mengerti,","hasanah_per_verse":710},{"text_madani":"وَمَا ذَرَأَ لَكُمْ فِي الْأَرْضِ مُخْتَلِفًا أَلْوَانُهُ ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِّقَوْمٍ يَذَّكَّرُونَ","text_tajweed":"وَمَا ذَرَأَ لَكُمْ فِى [h:44[ٱ]لْأَرْضِ مُخْتَلِفًا أَلْو[n[َٲ]نُهُ[o[ۥٓ‌ۗ] إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[u:7345[ةً ل]ِّقَوْ[a:4403[مٍ ي]َذَّكَّر[p[ُو]نَ","translation_en":"And what He has created in the earth of varied hues most surely there is a sign in this for a people who are mindful.","translation_id":"dan (Dia juga mengendalikan) apa yang Dia ciptakan untukmu di bumi ini dengan berbagai jenis dan macam warnanya. Sungguh, pada yang demikian itu benar-benar terdapat tanda (kebesaran Allah) bagi kaum yang mengambil pelajaran.","hasanah_per_verse":490},{"text_madani":"وَهُوَ الَّذِي سَخَّرَ الْبَحْرَ لِتَأْكُلُوا مِنْهُ لَحْمًا طَرِيًّا وَتَسْتَخْرِجُوا مِنْهُ حِلْيَةً تَلْبَسُونَهَا وَتَرَى الْفُلْكَ مَوَاخِرَ فِيهِ وَلِتَبْتَغُوا مِن فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ","text_tajweed":"وَهُوَ [h:4114[ٱ]لَّذِى سَخَّرَ [h:7348[ٱ]لْبَحْرَ لِتَأْكُلُو[s[اْ] مِنْهُ لَحْ[f:7349[مًا ط]َرِي[a:7350[ًّا و]َتَسْتَخْرِجُو[s[اْ] مِنْهُ حِلْيَ[f:7351[ةً ت]َلْبَسُونَهَا وَتَرَى [h:7352[ٱ]لْفُلْكَ مَوَاخِرَ فِيهِ وَلِتَ[q:7353[بْ]تَغُو[s[اْ] مِ[f:475[ن ف]َضْلِه[n[ِۦ] وَلَعَلَّكُمْ تَشْكُر[p[ُو]نَ","translation_en":"And He it is Who has made the sea subservient that you may eat fresh flesh from it and bring forth from it ornaments which you wear, and you see the ships cleaving through it, and that you might seek of His bounty and that you may give thanks.","translation_id":"Dan Dialah yang menundukkan lautan (untukmu), agar kamu dapat memakan daging yang segar (ikan) darinya, dan (dari lautan itu) kamu mengeluarkan perhiasan yang kamu pakai. Kamu (juga) melihat perahu berlayar padanya, dan agar kamu mencari sebagian karunia-Nya, dan agar kamu bersyukur.","hasanah_per_verse":1000},{"text_madani":"وَأَلْقَىٰ فِي الْأَرْضِ رَوَاسِيَ أَن تَمِيدَ بِكُمْ وَأَنْهَارًا وَسُبُلًا لَّعَلَّكُمْ تَهْتَدُونَ","text_tajweed":"وَأَلْقَىٰ فِى [h:44[ٱ]لْأَرْضِ رَو[n[َٲ]سِىَ أَ[f:7354[ن ت]َمِيدَ بِكُمْ وَأَنْهَ[n[ـٰ][a:7355[رًا و]َسُبُل[u:7356[اً ل]َّعَلَّكُمْ تَهْتَد[p[ُو]نَ","translation_en":"And He has cast great mountains in the earth lest it might be convulsed with you, and rivers and roads that you may go aright,","translation_id":"Dan Dia menancapkan gunung di bumi agar bumi itu tidak goncang bersama kamu, (dan Dia menciptakan) sungai-sungai dan jalan-jalan agar kamu mendapat petunjuk,","hasanah_per_verse":490},{"text_madani":"وَعَلَامَاتٍ ۚ وَبِالنَّجْمِ هُمْ يَهْتَدُونَ","text_tajweed":"وَعَلَ[n[ـٰ]مَ[n[ـٰ][a:7357[تٍ‌ۚ و]َبِ[h:7358[ٱ][l[ل][g[نّ]َ[q:7358[جْ]مِ هُمْ يَهْتَد[p[ُو]نَ","translation_en":"And landmarks; and by the stars they find the right way.","translation_id":"dan (Dia menciptakan) tanda-tanda (penunjuk jalan). Dan dengan bintang-bintang mereka mendapat petunjuk.","hasanah_per_verse":220},{"text_madani":"أَفَمَن يَخْلُقُ كَمَن لَّا يَخْلُقُ ۗ أَفَلَا تَذَكَّرُونَ","text_tajweed":"أَفَم[a:7359[َن ي]َخْلُقُ كَم[u:7360[َن ل]َّا يَخْلُقُ‌ۗ أَفَلَا تَذَكَّر[p[ُو]نَ","translation_en":"Is He then Who creates like him who does not create? Do you not then mind?","translation_id":"Maka apakah (Allah) yang menciptakan sama dengan yang tidak dapat menciptakan (sesuatu)? Mengapa kamu tidak mengambil pelajaran?","hasanah_per_verse":270},{"text_madani":"وَإِن تَعُدُّوا نِعْمَةَ اللَّهِ لَا تُحْصُوهَا ۗ إِنَّ اللَّهَ لَغَفُورٌ رَّحِيمٌ","text_tajweed":"وَإِ[f:7136[ن ت]َعُدُّو[s[اْ] نِعْمَةَ [h:1154[ٱ]للَّهِ لَا تُحْصُوه[o[َآ‌ۗ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَغَفُو[u:4578[رٌ ر]َّح[p[ِي]مٌ","translation_en":"And if you would count Allah's favors, you will not be able to number them; most surely Allah is Forgiving, Merciful.","translation_id":"Dan jika kamu menghitung nikmat Allah, niscaya kamu tidak akan mampu menghitungnya. Sungguh, Allah benar-benar Maha Pengampun, Maha Penyayang.","hasanah_per_verse":390},{"text_madani":"وَاللَّهُ يَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ","text_tajweed":"وَ[h:9999[ٱ]للَّهُ يَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِن[p[ُو]نَ","translation_en":"And Allah knows what you conceal and what you do openly.","translation_id":"Dan Allah mengetahui apa yang kamu rahasiakan dan apa yang kamu lahirkan.","hasanah_per_verse":250},{"text_madani":"وَالَّذِينَ يَدْعُونَ مِن دُونِ اللَّهِ لَا يَخْلُقُونَ شَيْئًا وَهُمْ يُخْلَقُونَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ يَ[q:1240[دْ]عُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ لَا يَخْلُقُونَ شَيْـ[a:5188[ـًٔا و]َهُمْ يُخْلَق[p[ُو]نَ","translation_en":"And those whom they call on besides Allah have not created anything while they are themselves created;","translation_id":"Dan (berhala-berhala) yang mereka seru selain Allah, tidak dapat membuat sesuatu apa pun, sedang berhala-berhala itu (sendiri) dibuat orang.","hasanah_per_verse":410},{"text_madani":"أَمْوَاتٌ غَيْرُ أَحْيَاءٍ ۖ وَمَا يَشْعُرُونَ أَيَّانَ يُبْعَثُونَ","text_tajweed":"أَمْو[n[َٲ]تٌ غَيْرُ أَحْي[o[َا]ٓ[a:7361[ءٍ‌ۖ و]َمَا يَشْعُرُونَ أَيَّانَ يُ[q:4606[بْ]عَث[p[ُو]نَ","translation_en":"Dead (are they), not living, and they know not when they shall be raised.","translation_id":"(Berhala-berhala itu) benda mati, tidak hidup, dan berhala-berhala itu tidak mengetahui kapankah (penyembahnya) dibangkitkan.","hasanah_per_verse":320},{"text_madani":"إِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ ۚ فَالَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ قُلُوبُهُم مُّنكِرَةٌ وَهُم مُّسْتَكْبِرُونَ","text_tajweed":"إِلَ[n[ـٰ]هُكُمْ إِلَ[n[ـٰ][a:827[هٌ و][n[َٲ]حِ[f:7362[دٌ‌ۚ ف]َ[h:2514[ٱ]لَّذِينَ لَا يُؤْمِنُونَ بِ[h:447[ٱ]لْأَخِرَةِ قُلُوبُه[w:7363[ُم م]ُّ[f:7364[نك]ِرَ[a:7365[ةٌ و]َه[w:7366[ُم م]ُّسْتَكْبِر[p[ُو]نَ","translation_en":"Your Allah is one Allah; so (as for) those who do not believe in the hereafter, their hearts are ignorant and they are proud.","translation_id":"Tuhan kamu adalah Tuhan Yang Maha Esa. Maka orang yang tidak beriman kepada akhirat, hati mereka mengingkari (keesaan Allah), dan mereka adalah orang yang sombong.","hasanah_per_verse":550},{"text_madani":"لَا جَرَمَ أَنَّ اللَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ ۚ إِنَّهُ لَا يُحِبُّ الْمُسْتَكْبِرِينَ","text_tajweed":"لَا جَرَمَ أَ[g[نّ]َ [h:394[ٱ]للَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ‌ۚ إِ[g[نّ]َهُ[n[ۥ] لَا يُحِبُّ [h:7367[ٱ]لْمُسْتَكْبِر[p[ِي]نَ","translation_en":"Truly Allah knows what they hide and what they manifest; surely He does not love the proud.","translation_id":"Tidak diragukan lagi bahwa Allah mengetahui apa yang mereka rahasiakan dan apa yang mereka lahirkan. Sesungguhnya Dia tidak menyukai orang yang sombong.","hasanah_per_verse":490},{"text_madani":"وَإِذَا قِيلَ لَهُم مَّاذَا أَنزَلَ رَبُّكُمْ ۙ قَالُوا أَسَاطِيرُ الْأَوَّلِينَ","text_tajweed":"وَإِذَا قِيلَ لَه[w:7368[ُم م]َّاذ[o[َآ] أَ[f:471[نز]َلَ رَبُّكُمْ‌ۙ قَال[o[ُوٓ][s[اْ] أَسَ[n[ـٰ]طِيرُ [h:3993[ٱ]لْأَوَّل[p[ِي]نَ","translation_en":"And when it is said to them, what is it that your Lord has revealed? They say: Stories of the ancients;","translation_id":"Dan apabila dikatakan kepada mereka, “Apakah yang telah diturunkan Tuhanmu?” Mereka menjawab, “Dongeng-dongeng orang dahulu,”","hasanah_per_verse":400},{"text_madani":"لِيَحْمِلُوا أَوْزَارَهُمْ كَامِلَةً يَوْمَ الْقِيَامَةِ ۙ وَمِنْ أَوْزَارِ الَّذِينَ يُضِلُّونَهُم بِغَيْرِ عِلْمٍ ۗ أَلَا سَاءَ مَا يَزِرُونَ","text_tajweed":"لِيَحْمِل[o[ُوٓ][s[اْ] أَوْزَارَهُمْ كَامِلَ[a:7369[ةً ي]َوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ‌ۙ وَمِنْ أَوْزَارِ [h:7370[ٱ]لَّذِينَ يُضِلُّونَه[c:7371[ُم ب]ِغَيْرِ عِلْمٍ‌ۗ أَلَا س[o[َا]ٓءَ مَا يَزِر[p[ُو]نَ","translation_en":"That they may bear their burdens entirely on the day of resurrection and also of the burdens of those whom they lead astray without knowledge; now surely evil is what they bear.","translation_id":"(ucapan mereka) menyebabkan mereka pada hari Kiamat memikul dosa-dosanya sendiri secara sempurna, dan sebagian dosa-dosa orang yang mereka sesatkan yang tidak mengetahui sedikit pun (bahwa mereka disesatkan). Ingatlah, alangkah buruknya (dosa) yang mereka pikul itu.","hasanah_per_verse":690},{"text_madani":"قَدْ مَكَرَ الَّذِينَ مِن قَبْلِهِمْ فَأَتَى اللَّهُ بُنْيَانَهُم مِّنَ الْقَوَاعِدِ فَخَرَّ عَلَيْهِمُ السَّقْفُ مِن فَوْقِهِمْ وَأَتَاهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ","text_tajweed":"قَ[q:298[دْ] مَكَرَ [h:7027[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ فَأَتَى [h:7372[ٱ]للَّهُ بُنْيَ[n[ـٰ]نَه[w:7373[ُم م]ِّنَ [h:7374[ٱ]لْقَوَاعِدِ فَخَرَّ عَلَيْهِمُ [h:7375[ٱ][l[ل]سَّ[q:7376[قْ]فُ مِ[f:3683[ن ف]َوْقِهِمْ وَأَتَ[n[ـٰ]هُمُ [h:7377[ٱ]لْعَذَابُ مِنْ حَيْثُ لَا يَشْعُر[p[ُو]نَ","translation_en":"Those before them did indeed devise plans, but Allah demolished their building from the foundations, so the roof fell down on them from above them, and the punishment came to them from whence they did not perceive.","translation_id":"Sungguh, orang-orang yang sebelum mereka telah mengadakan tipu daya, maka Allah menghancurkan rumah-rumah mereka mulai dari pondasinya, lalu atap (rumah itu) jatuh menimpa mereka dari atas, dan siksa itu datang kepada mereka dari arah yang tidak mereka sadari.","hasanah_per_verse":860},{"text_madani":"ثُمَّ يَوْمَ الْقِيَامَةِ يُخْزِيهِمْ وَيَقُولُ أَيْنَ شُرَكَائِيَ الَّذِينَ كُنتُمْ تُشَاقُّونَ فِيهِمْ ۚ قَالَ الَّذِينَ أُوتُوا الْعِلْمَ إِنَّ الْخِزْيَ الْيَوْمَ وَالسُّوءَ عَلَى الْكَافِرِينَ","text_tajweed":"ثُ[g[مّ]َ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ يُخْزِيهِمْ وَيَقُولُ أَيْنَ شُرَك[o[َا]ٓءِىَ [h:7378[ٱ]لَّذِينَ كُ[f:100[نت]ُمْ تُشَ[m[ـٰٓ]قُّونَ فِيهِمْ‌ۚ قَالَ [h:590[ٱ]لَّذِينَ أُوتُو[s[اْ] [h:7379[ٱ]لْعِلْمَ إِ[g[نّ]َ [h:7380[ٱ]لْخِزْىَ [h:7381[ٱ]لْيَوْمَ وَ[h:7382[ٱ][l[ل]سّ[o[ُو]ٓءَ عَلَى [h:468[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"Then on the resurrection day He will bring them to disgrace and say: Where are the associates you gave Me, for whose sake you became hostile? Those who are given the knowledge will say: Surely the disgrace and the evil are this day upon the unbelievers:","translation_id":"Kemudian Allah menghinakan mereka pada hari Kiamat, dan berfirman, “Di manakah sekutu-sekutu-Ku itu (yang karena membelanya) kamu selalu memusuhi mereka (nabi-nabi dan orang yang beriman)?” Orang-orang yang diberi ilmu berkata, “Sesungguhnya kehinaan dan azab pada hari ini ditimpakan kepada orang yang kafir,”","hasanah_per_verse":980},{"text_madani":"الَّذِينَ تَتَوَفَّاهُمُ الْمَلَائِكَةُ ظَالِمِي أَنفُسِهِمْ ۖ فَأَلْقَوُا السَّلَمَ مَا كُنَّا نَعْمَلُ مِن سُوءٍ ۚ بَلَىٰ إِنَّ اللَّهَ عَلِيمٌ بِمَا كُنتُمْ تَعْمَلُونَ","text_tajweed":"ٱلَّذِينَ تَتَوَفَّ[n[ـٰ]هُمُ [h:7383[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ ظَالِم[o[ِىٓ] أَ[f:568[نف]ُسِهِمْ‌ۖ فَأَلْقَوُ[s[اْ] [h:7384[ٱ][l[ل]سَّلَمَ مَا كُ[g[نّ]َا نَعْمَلُ مِ[f:1847[ن س][o[ُو]ٓ[i:7385[ءِۭ‌ۚ ب]َلَ[o[ىٰٓ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَلِي[i:6056[مُۢ ب]ِمَا كُ[f:100[نت]ُمْ تَعْمَل[p[ُو]نَ","translation_en":"Those whom the angels cause to die while they are unjust to themselves. Then would they offer submission: We used not to do any evil. Aye! surely Allah knows what you did.","translation_id":"(yaitu) orang yang dicabut nyawanya oleh para malaikat dalam keadaan (berbuat) zhalim kepada diri sendiri, lalu mereka menyerahkan diri (sambil berkata), “Kami tidak pernah mengerjakan sesuatu kejahatan pun.” (Malaikat menjawab), “Pernah! Sesungguhnya Allah Maha Mengetahui apa yang telah kamu kerjakan.”","hasanah_per_verse":820},{"text_madani":"فَادْخُلُوا أَبْوَابَ جَهَنَّمَ خَالِدِينَ فِيهَا ۖ فَلَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ","text_tajweed":"فَ[h:9999[ٱ][q:7386[دْ]خُل[o[ُوٓ][s[اْ] أَ[q:4047[بْ]و[n[َٲ]بَ جَهَ[g[نّ]َمَ خَ[n[ـٰ]لِدِينَ فِيهَا‌ۖ فَلَبِئْسَ مَثْوَى [h:7387[ٱ]لْمُتَكَبِّر[p[ِي]نَ","translation_en":"Therefore enter the gates of hell, to abide therein; so certainly evil is the dwelling place of the proud.","translation_id":"Maka masukilah pintu-pintu neraka Jahanam, kamu kekal di dalamnya. Pasti itu seburuk-buruk tempat orang yang menyombongkan diri.","hasanah_per_verse":440},{"text_madani":"وَقِيلَ لِلَّذِينَ اتَّقَوْا مَاذَا أَنزَلَ رَبُّكُمْ ۚ قَالُوا خَيْرًا ۗ لِّلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۚ وَلَدَارُ الْآخِرَةِ خَيْرٌ ۚ وَلَنِعْمَ دَارُ الْمُتَّقِينَ","text_tajweed":"۞ وَقِيلَ لِلَّذِينَ [h:1785[ٱ]تَّقَوْ[s[اْ] مَاذ[o[َآ] أَ[f:471[نز]َلَ رَبُّكُمْ‌ۚ قَالُو[s[اْ] خَيْ[u:7388[رًا‌ۗ ل]ِّلَّذِينَ أَحْسَنُو[s[اْ] فِى هَ[n[ـٰ]ذِهِ [h:5052[ٱ][l[ل]دُّنْيَا حَسَنَ[a:7389[ةٌ‌ۚ و]َلَدَارُ [h:6855[ٱ]لْأَخِرَةِ خَيْ[a:7390[رٌ‌ۚ و]َلَنِعْمَ دَارُ [h:7391[ٱ]لْمُتَّق[p[ِي]نَ","translation_en":"And it is said to those who guard (against evil): What is it that your Lord has revealed? They say, Good. For those who do good in this world is good, and certainly the abode of the hereafter is better; and certainly most excellent is the abode of those who guard (against evil);","translation_id":"Dan kemudian dikatakan kepada orang yang bertakwa, “Apakah yang telah diturunkan oleh Tuhanmu?” Mereka menjawab, “Kebaikan.” Bagi orang yang berbuat baik di dunia ini mendapat (balasan) yang baik. Dan sesungguhnya negeri akhirat pasti lebih baik. Dan itulah sebaik-baik tempat bagi orang yang bertakwa,","hasanah_per_verse":900},{"text_madani":"جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ۖ لَهُمْ فِيهَا مَا يَشَاءُونَ ۚ كَذَٰلِكَ يَجْزِي اللَّهُ الْمُتَّقِينَ","text_tajweed":"جَ[g[نّ]َ[n[ـٰ]تُ عَ[q:5720[دْ][a:6962[نٍ ي]َ[q:6963[دْ]خُلُونَهَا تَ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ‌ۖ لَهُمْ فِيهَا مَا يَش[o[َا]ٓءُونَ‌ۚ كَذ[n[َٲ]لِكَ يَ[q:6806[جْ]زِى [h:7392[ٱ]للَّهُ [h:7393[ٱ]لْمُتَّق[p[ِي]نَ","translation_en":"The gardens of perpetuity, they shall enter them, rivers flowing beneath them; they shall have in them what they please. Thus does Allah reward those who guard (against evil),","translation_id":"(yaitu) surga-surga ‘Adn yang mereka masuki, mengalir di bawahnya sungai-sungai, di dalam (surga) itu mereka mendapat segala apa yang diinginkan. Demikianlah Allah memberi balasan kepada orang yang bertakwa,","hasanah_per_verse":670},{"text_madani":"الَّذِينَ تَتَوَفَّاهُمُ الْمَلَائِكَةُ طَيِّبِينَ ۙ يَقُولُونَ سَلَامٌ عَلَيْكُمُ ادْخُلُوا الْجَنَّةَ بِمَا كُنتُمْ تَعْمَلُونَ","text_tajweed":"ٱلَّذِينَ تَتَوَفَّ[n[ـٰ]هُمُ [h:7383[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ طَيِّبِينَ‌ۙ يَقُولُونَ سَلَ[n[ـٰ]مٌ عَلَيْكُمُ [h:7394[ٱ][q:278[دْ]خُلُو[s[اْ] [h:4726[ٱ]لْجَ[g[نّ]َةَ بِمَا كُ[f:100[نت]ُمْ تَعْمَل[p[ُو]نَ","translation_en":"Those whom the angels cause to die in a good state, saying: Peace be on you: enter the garden for what you did.","translation_id":"(yaitu) orang yang ketika diwafatkan oleh para malaikat dalam keadaan baik, mereka (para malaikat) mengatakan (kepada mereka), “Salamun ‘alaikum, masuklah ke dalam surga karena apa yang telah kamu kerjakan.”","hasanah_per_verse":640},{"text_madani":"هَلْ يَنظُرُونَ إِلَّا أَن تَأْتِيَهُمُ الْمَلَائِكَةُ أَوْ يَأْتِيَ أَمْرُ رَبِّكَ ۚ كَذَٰلِكَ فَعَلَ الَّذِينَ مِن قَبْلِهِمْ ۚ وَمَا ظَلَمَهُمُ اللَّهُ وَلَٰكِن كَانُوا أَنفُسَهُمْ يَظْلِمُونَ","text_tajweed":"هَلْ يَ[f:1141[نظ]ُرُونَ إِلّ[o[َآ] أَ[f:4552[ن ت]َأْتِيَهُمُ [h:4553[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ أَوْ يَأْتِىَ أَمْرُ رَبِّكَ‌ۚ كَذ[n[َٲ]لِكَ فَعَلَ [h:7395[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ‌ۚ وَمَا ظَلَمَهُمُ [h:2189[ٱ]للَّهُ وَلَ[n[ـٰ]كِ[f:276[ن ك]َان[o[ُوٓ][s[اْ] أَ[f:38[نف]ُسَهُمْ يَظْلِم[p[ُو]نَ","translation_en":"They do not wait aught but that the angels should come to them or that the commandment of your Lord should come to pass. Thus did those before them; and Allah was not unjust to them, but they were unjust to themselves.","translation_id":"Tidak ada yang ditunggu mereka (orang kafir) selain datangnya para malaikat kepada mereka atau datangnya perintah Tuhanmu. Demikianlah yang telah diperbuat oleh orang-orang (kafir) sebelum mereka. Allah tidak menzhalimi mereka, justru merekalah yang (selalu) menzhalimi diri mereka sendiri.","hasanah_per_verse":910},{"text_madani":"فَأَصَابَهُمْ سَيِّئَاتُ مَا عَمِلُوا وَحَاقَ بِهِم مَّا كَانُوا بِهِ يَسْتَهْزِئُونَ","text_tajweed":"فَأَصَابَهُمْ سَيِّـَٔـاتُ مَا عَمِلُو[s[اْ] وَحَاقَ بِه[w:6252[ِم م]َّا كَانُو[s[اْ] بِه[n[ِۦ] يَسْتَهْزِء[p[ُو]نَ","translation_en":"So the evil (consequences) of what they did shall afflict them and that which they mocked shall encompass them.","translation_id":"Maka mereka ditimpa azab (akibat) perbuatan mereka dan diliputi oleh azab yang dulu selalu mereka perolok-olokkan.","hasanah_per_verse":430},{"text_madani":"وَقَالَ الَّذِينَ أَشْرَكُوا لَوْ شَاءَ اللَّهُ مَا عَبَدْنَا مِن دُونِهِ مِن شَيْءٍ نَّحْنُ وَلَا آبَاؤُنَا وَلَا حَرَّمْنَا مِن دُونِهِ مِن شَيْءٍ ۚ كَذَٰلِكَ فَعَلَ الَّذِينَ مِن قَبْلِهِمْ ۚ فَهَلْ عَلَى الرُّسُلِ إِلَّا الْبَلَاغُ الْمُبِينُ","text_tajweed":"وَقَالَ [h:614[ٱ]لَّذِينَ أَشْرَكُو[s[اْ] لَوْ ش[o[َا]ٓءَ [h:78[ٱ]للَّهُ مَا عَبَ[q:7396[دْ]نَا مِ[f:3136[ن د]ُونِه[n[ِۦ] مِ[f:2103[ن ش][a:7397[َىْءٍ ن]َّحْنُ وَل[o[َآ] ءَاب[o[َا]ٓؤُنَا وَلَا حَرَّمْنَا مِ[f:3136[ن د]ُونِه[n[ِۦ] مِ[f:2103[ن ش][f:4506[َىْءٍ‌ۚ ك]َذ[n[َٲ]لِكَ فَعَلَ [h:7395[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ‌ۚ فَهَلْ عَلَى [h:7398[ٱ][l[ل]رُّسُلِ إِلَّا [h:3819[ٱ]لْبَلَ[n[ـٰ]غُ [h:3781[ٱ]لْمُب[p[ِي]نُ","translation_en":"And they who give associates (to Allah) say: If Allah had pleased, we would not have served anything besides Allah, (neither) we nor our fathers, nor would we have prohibited anything without (order from) Him. Thus did those before them; is then aught incumbent upon the messengers except a plain delivery (of the message)?","translation_id":"Dan orang musyrik berkata, “Jika Allah menghendaki, niscaya kami tidak akan menyembah sesuatu apa pun selain Dia, baik kami maupun bapak-bapak kami, dan tidak (pula) kami mengharamkan sesuatu pun tanpa (izin)-Nya.” Demikianlah yang diperbuat oleh orang sebelum mereka. Bukankah kewajiban para rasul hanya menyampaikan (amanat Allah) dengan jelas.","hasanah_per_verse":1180},{"text_madani":"وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَّسُولًا أَنِ اعْبُدُوا اللَّهَ وَاجْتَنِبُوا الطَّاغُوتَ ۖ فَمِنْهُم مَّنْ هَدَى اللَّهُ وَمِنْهُم مَّنْ حَقَّتْ عَلَيْهِ الضَّلَالَةُ ۚ فَسِيرُوا فِي الْأَرْضِ فَانظُرُوا كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِينَ","text_tajweed":"وَلَقَ[q:341[دْ] بَعَثْنَا فِى كُلِّ أُ[g[مّ]َ[u:7399[ةٍ ر]َّسُولاً أَنِ [h:3899[ٱ]عْبُدُو[s[اْ] [h:3704[ٱ]للَّهَ وَ[h:7400[ٱ][q:7400[جْ]تَنِبُو[s[اْ] [h:7401[ٱ][l[ل]طَّ[n[ـٰ]غُوتَ‌ۖ فَمِنْه[w:1456[ُم م]َّنْ هَدَى [h:741[ٱ]للَّهُ وَمِنْه[w:1106[ُم م]َّنْ حَقَّتْ عَلَيْهِ [h:7402[ٱ][l[ل]ضَّلَ[n[ـٰ]لَةُ‌ۚ فَسِيرُو[s[اْ] فِى [h:44[ٱ]لْأَرْضِ فَ[h:2257[ٱ][f:2257[نظ]ُرُو[s[اْ] كَيْفَ كَانَ عَ[n[ـٰ]قِبَةُ [h:2258[ٱ]لْمُكَذِّب[p[ِي]نَ","translation_en":"And certainly We raised in every nation a messenger saying: Serve Allah and shun the Shaitan. So there were some of them whom Allah guided and there were others against whom error was due; therefore travel in the land, then see what was the end of the rejecters.","translation_id":"Dan sungguh, Kami telah mengutus seorang rasul untuk setiap umat (untuk menyerukan), “Sembahlah Allah, dan jauhilah Thagut”, kemudian di antara mereka ada yang diberi petunjuk oleh Allah dan ada pula yang tetap dalam kesesatan. Maka berjalanlah kamu di bumi dan perhatikanlah bagaimana kesudahan orang yang mendustakan (rasul-rasul).","hasanah_per_verse":1220},{"text_madani":"إِن تَحْرِصْ عَلَىٰ هُدَاهُمْ فَإِنَّ اللَّهَ لَا يَهْدِي مَن يُضِلُّ ۖ وَمَا لَهُم مِّن نَّاصِرِينَ","text_tajweed":"إِ[f:7403[ن ت]َحْرِصْ عَلَىٰ هُدَ[n[ٮٰ]هُمْ فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ لَا يَهْدِى م[a:7404[َن ي]ُضِلُّ‌ۖ وَمَا لَه[w:1812[ُم م]ّ[a:1813[ِن ن]َّ[n[ـٰ]صِر[p[ِي]نَ","translation_en":"If you desire for their guidance, yet surely Allah does not guide him who leads astray, nor shall they have any helpers.","translation_id":"Jika engkau (Muhammad) sangat mengharapkan agar mereka mendapat petunjuk, maka sesungguhnya Allah tidak akan memberi petunjuk kepada orang yang disesatkan-Nya, dan mereka tidak mempunyai penolong.","hasanah_per_verse":460},{"text_madani":"وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ ۙ لَا يَبْعَثُ اللَّهُ مَن يَمُوتُ ۚ بَلَىٰ وَعْدًا عَلَيْهِ حَقًّا وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ","text_tajweed":"وَأَ[q:4324[قْ]سَمُو[s[اْ] بِ[h:32[ٱ]للَّهِ جَهْدَ أَيْمَ[n[ـٰ]نِهِمْ‌ۙ لَا يَ[q:7405[بْ]عَثُ [h:7406[ٱ]للَّهُ م[a:7407[َن ي]َمُوتُ‌ۚ بَلَىٰ وَعْدًا عَلَيْهِ حَق[a:7408[ًّا و]َلَ[n[ـٰ]كِ[g[نّ]َ أَكْثَرَ [h:1374[ٱ][l[ل][g[نّ]َاسِ لَا يَعْلَم[p[ُو]نَ","translation_en":"And they swear by Allah with the most energetic of their oaths: Allah will not raise up him who dies. Yea! it is a promise binding on Him, quite true, but most people do not know;","translation_id":"Dan mereka bersumpah dengan (nama) Allah dengan sumpah yang sungguh-sungguh, “Allah tidak akan membangkitkan orang yang mati.” Tidak demikian (pasti Allah akan membangkitkannya), sebagai suatu janji yang benar dari-Nya, tetapi kebanyakan manusia tidak mengetahui,","hasanah_per_verse":730},{"text_madani":"لِيُبَيِّنَ لَهُمُ الَّذِي يَخْتَلِفُونَ فِيهِ وَلِيَعْلَمَ الَّذِينَ كَفَرُوا أَنَّهُمْ كَانُوا كَاذِبِينَ","text_tajweed":"لِيُبَيِّنَ لَهُمُ [h:7409[ٱ]لَّذِى يَخْتَلِفُونَ فِيهِ وَلِيَعْلَمَ [h:2400[ٱ]لَّذِينَ كَفَر[o[ُوٓ][s[اْ] أَ[g[نّ]َهُمْ كَانُو[s[اْ] كَ[n[ـٰ]ذِب[p[ِي]نَ","translation_en":"So that He might make manifest to them that about which they differ, and that those who disbelieve might know that they were liars.","translation_id":"agar Dia menjelaskan kepada mereka apa yang mereka perselisihkan itu, dan agar orang kafir itu mengetahui bahwa mereka adalah orang yang berdusta.","hasanah_per_verse":530},{"text_madani":"إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَن نَّقُولَ لَهُ كُن فَيَكُونُ","text_tajweed":"إِ[g[نّ]َمَا قَوْلُنَا لِشَىْءٍ إِذ[o[َآ] أَرَ[q:7410[دْ]نَ[n[ـٰ]هُ أ[a:7411[َن ن]َّقُولَ لَهُ[n[ۥ] كُ[f:613[ن ف]َيَك[p[ُو]نُ","translation_en":"Our word for a thing when We intend it, is only that We say to it, Be, and it is.","translation_id":"Sesungguhnya firman Kami terhadap sesuatu apabila Kami menghendakinya, Kami hanya mengatakan kepadanya, “Jadilah!” Maka jadilah sesuatu itu.","hasanah_per_verse":370},{"text_madani":"وَالَّذِينَ هَاجَرُوا فِي اللَّهِ مِن بَعْدِ مَا ظُلِمُوا لَنُبَوِّئَنَّهُمْ فِي الدُّنْيَا حَسَنَةً ۖ وَلَأَجْرُ الْآخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا يَعْلَمُونَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ هَاجَرُو[s[اْ] فِى [h:714[ٱ]للَّهِ م[i:146[ِنۢ ب]َعْدِ مَا ظُلِمُو[s[اْ] لَنُبَوِّئَ[g[نّ]َهُمْ فِى [h:599[ٱ][l[ل]دُّنْيَا حَسَنَ[a:7412[ةً‌ۖ و]َلَأَ[q:6719[جْ]رُ [h:6720[ٱ]لْأَخِرَةِ أَكْبَرُ‌ۚ لَوْ كَانُو[s[اْ] يَعْلَم[p[ُو]نَ","translation_en":"And those who fly for Allah's sake after they are oppressed, We will most certainly give them a good abode in the world, and the reward of the hereafter is certainly much greater, did they but know;","translation_id":"Dan orang yang berhijrah karena Allah setelah mereka dizhalimi, pasti Kami akan memberikan tempat yang baik kepada mereka di dunia. Dan pahala di akhirat pasti lebih besar, sekiranya mereka mengetahui,","hasanah_per_verse":780},{"text_madani":"الَّذِينَ صَبَرُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ","text_tajweed":"ٱلَّذِينَ صَبَرُو[s[اْ] وَعَلَىٰ رَبِّهِمْ يَتَوَكَّل[p[ُو]نَ","translation_en":"Those who are patient and on their Lord do they rely.","translation_id":"(yaitu) orang yang sabar dan hanya kepada Tuhan mereka bertawakal.","hasanah_per_verse":250},{"text_madani":"وَمَا أَرْسَلْنَا مِن قَبْلِكَ إِلَّا رِجَالًا نُّوحِي إِلَيْهِمْ ۚ فَاسْأَلُوا أَهْلَ الذِّكْرِ إِن كُنتُمْ لَا تَعْلَمُونَ","text_tajweed":"وَم[o[َآ] أَرْسَلْنَا مِ[f:18[ن ق]َ[q:19[بْ]لِكَ إِلَّا رِجَال[a:6851[اً ن]ُّوح[o[ِىٓ] إِلَيْهِمْ‌ۚ فَسْــَٔل[o[ُوٓ][s[اْ] أَهْلَ [h:7413[ٱ][l[ل]ذِّكْرِ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ لَا تَعْلَم[p[ُو]نَ","translation_en":"And We did not send before you any but men to whom We sent revelation-- so ask the followers of the Reminder if you do not know--","translation_id":"Dan Kami tidak mengutus sebelum engkau (Muhammad), melainkan orang laki-laki yang Kami beri wahyu kepada mereka; maka bertanyalah kepada orang yang mempunyai pengetahuan jika kamu tidak mengetahui,","hasanah_per_verse":610},{"text_madani":"بِالْبَيِّنَاتِ وَالزُّبُرِ ۗ وَأَنزَلْنَا إِلَيْكَ الذِّكْرَ لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ وَلَعَلَّهُمْ يَتَفَكَّرُونَ","text_tajweed":"بِ[h:9999[ٱ]لْبَيِّنَ[n[ـٰ]تِ وَ[h:2474[ٱ][l[ل]زُّبُرِ‌ۗ وَأَ[f:271[نز]َلْن[o[َآ] إِلَيْكَ [h:7414[ٱ][l[ل]ذِّكْرَ لِتُبَيِّنَ لِل[g[نّ]َاسِ مَا نُزِّلَ إِلَيْهِمْ وَلَعَلَّهُمْ يَتَفَكَّر[p[ُو]نَ","translation_en":"With clear arguments and scriptures; and We have revealed to you the Reminder that you may make clear to men what has been revealed to them, and that haply they may reflect.","translation_id":"(mereka Kami utus) dengan membawa keterangan-keterangan (mukjizat) dan kitab-kitab. Dan Kami turunkan Adz-Dzikr (Al-Qur'an) kepadamu, agar engkau menerangkan kepada manusia apa yang telah diturunkan kepada mereka dan agar mereka memikirkan,","hasanah_per_verse":630},{"text_madani":"أَفَأَمِنَ الَّذِينَ مَكَرُوا السَّيِّئَاتِ أَن يَخْسِفَ اللَّهُ بِهِمُ الْأَرْضَ أَوْ يَأْتِيَهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ","text_tajweed":"أَفَأَمِنَ [h:7415[ٱ]لَّذِينَ مَكَرُو[s[اْ] [h:7416[ٱ][l[ل]سَّيِّـَٔـاتِ أ[a:7417[َن ي]َخْسِفَ [h:7418[ٱ]للَّهُ بِهِمُ [h:7419[ٱ]لْأَرْضَ أَوْ يَأْتِيَهُمُ [h:7420[ٱ]لْعَذَابُ مِنْ حَيْثُ لَا يَشْعُر[p[ُو]نَ","translation_en":"Do they then who plan evil (deeds) feel secure (of this) that Allah will not cause the earth to swallow them or that punishment may not overtake them from whence they do not perceive?","translation_id":"maka apakah orang yang membuat tipu daya yang jahat itu, merasa aman (dari bencana) dibenamkannya bumi oleh Allah bersama mereka, atau (terhadap) datangnya siksa kepada mereka dari arah yang tidak mereka sadari,","hasanah_per_verse":670},{"text_madani":"أَوْ يَأْخُذَهُمْ فِي تَقَلُّبِهِمْ فَمَا هُم بِمُعْجِزِينَ","text_tajweed":"أَوْ يَأْخُذَهُمْ فِى تَقَلُّبِهِمْ فَمَا ه[c:7421[ُم ب]ِمُعْجِز[p[ِي]نَ","translation_en":"Or that He may not seize them in the course of their journeys, then shall they not escape;","translation_id":"atau Allah mengazab mereka pada waktu mereka dalam perjalanan; sehingga mereka tidak berdaya menolak (azab itu),","hasanah_per_verse":280},{"text_madani":"أَوْ يَأْخُذَهُمْ عَلَىٰ تَخَوُّفٍ فَإِنَّ رَبَّكُمْ لَرَءُوفٌ رَّحِيمٌ","text_tajweed":"أَوْ يَأْخُذَهُمْ عَلَىٰ تَخَوُّ[f:7422[فٍ ف]َإِ[g[نّ]َ رَبَّكُمْ لَرَءُو[u:744[فٌ ر]َّح[p[ِي]مٌ","translation_en":"Or that He may not seize them by causing them to suffer gradual loss, for your Lord is most surely Compassionate, Merciful.","translation_id":"atau Allah mengazab mereka dengan berangsur-angsur (sampai binasa). Maka sungguh, Tuhanmu Maha Pengasih, Maha Penyayang.","hasanah_per_verse":310},{"text_madani":"أَوَلَمْ يَرَوْا إِلَىٰ مَا خَلَقَ اللَّهُ مِن شَيْءٍ يَتَفَيَّأُ ظِلَالُهُ عَنِ الْيَمِينِ وَالشَّمَائِلِ سُجَّدًا لِّلَّهِ وَهُمْ دَاخِرُونَ","text_tajweed":"أَوَلَمْ يَرَوْ[s[اْ] إِلَىٰ مَا خَلَقَ [h:1272[ٱ]للَّهُ مِ[f:2103[ن ش][a:7423[َىْءٍ ي]َتَفَيَّؤُ[s[اْ] ظِلَ[n[ـٰ]لُهُ[n[ۥ] عَنِ [h:7424[ٱ]لْيَمِينِ وَ[h:7425[ٱ][l[ل]شَّم[o[َا]ٓئِلِ سُجَّ[u:7426[دًا ل]ِّلَّهِ وَهُمْ د[n[َٲ]خِر[p[ُو]نَ","translation_en":"Do they not consider every thing that Allah has created? Its (very) shadows return from right and left, making obeisance to Allah while they are in utter abasement.","translation_id":"Dan apakah mereka tidak memperhatikan suatu benda yang diciptakan Allah, bayang-bayangnya berbolak-balik ke kanan dan ke kiri, dalam keadaan sujud kepada Allah, dan mereka (bersikap) rendah hati.","hasanah_per_verse":670},{"text_madani":"وَلِلَّهِ يَسْجُدُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مِن دَابَّةٍ وَالْمَلَائِكَةُ وَهُمْ لَا يَسْتَكْبِرُونَ","text_tajweed":"وَلِلَّهِ يَسْجُدُ مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَا فِى [h:44[ٱ]لْأَرْضِ مِ[f:4026[ن د][m[َا]ٓبَّ[a:7427[ةٍ و]َ[h:1146[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ وَهُمْ لَا يَسْتَكْبِر[p[ُو]نَ","translation_en":"And whatever creature that is in the heavens and that is in the earth makes obeisance to Allah (only), and the angels (too) and they do not show pride.","translation_id":"Dan segala apa yang ada di langit dan di bumi hanya bersujud kepada Allah yaitu semua makhluk bergerak (bernyawa) dan (juga) para malaikat, dan mereka (malaikat) tidak menyombongkan diri.","hasanah_per_verse":580},{"text_madani":"يَخَافُونَ رَبَّهُم مِّن فَوْقِهِمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ","text_tajweed":"يَخَافُونَ رَبَّه[w:7428[ُم م]ِّ[f:3683[ن ف]َوْقِهِمْ وَيَفْعَلُونَ مَا يُؤْمَرُ[p[و]نَ ۩","translation_en":"They fear their Lord above them and do what they are commanded.","translation_id":"Mereka takut kepada Tuhan yang (berkuasa) di atas mereka dan melaksanakan apa yang diperintahkan (kepada mereka).","hasanah_per_verse":320},{"text_madani":"وَقَالَ اللَّهُ لَا تَتَّخِذُوا إِلَٰهَيْنِ اثْنَيْنِ ۖ إِنَّمَا هُوَ إِلَٰهٌ وَاحِدٌ ۖ فَإِيَّايَ فَارْهَبُونِ","text_tajweed":"۞ وَقَالَ [h:3421[ٱ]للَّهُ لَا تَتَّخِذ[o[ُوٓ][s[اْ] إِلَ[n[ـٰ]هَيْنِ [h:7429[ٱ]ثْنَيْنِ‌ۖ إِ[g[نّ]َمَا هُوَ إِلَ[n[ـٰ][a:827[هٌ و][n[َٲ]حِ[f:7430[دٌ‌ۖ ف]َإِيَّ[n[ـٰ]ىَ فَ[h:204[ٱ]رْهَب[p[ُو]نِ","translation_en":"And Allah has said: Take not two gods, He is only one Allah; so of Me alone should you be afraid.","translation_id":"Dan Allah berfirman, “Janganlah kamu menyembah dua tuhan; hanyalah Dia Tuhan Yang Maha Esa. Maka hendaklah kepada-Ku saja kamu takut.”","hasanah_per_verse":510},{"text_madani":"وَلَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَلَهُ الدِّينُ وَاصِبًا ۚ أَفَغَيْرَ اللَّهِ تَتَّقُونَ","text_tajweed":"وَلَهُ[n[ۥ] مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ وَلَهُ [h:7431[ٱ][l[ل]دِّينُ وَاصِبًا‌ۚ أَفَغَيْرَ [h:4347[ٱ]للَّهِ تَتَّق[p[ُو]نَ","translation_en":"And whatever is in the heavens and the earth is His, and to Him should obedience be (rendered) constantly; will you then guard against other than (the punishment of) Allah?","translation_id":"Dan milik-Nya meliputi segala apa yang ada di langit dan di bumi, dan kepada-Nyalah (ibadah dan) ketaatan selama-lamanya. Mengapa kamu takut kepada selain Allah?","hasanah_per_verse":480},{"text_madani":"وَمَا بِكُم مِّن نِّعْمَةٍ فَمِنَ اللَّهِ ۖ ثُمَّ إِذَا مَسَّكُمُ الضُّرُّ فَإِلَيْهِ تَجْأَرُونَ","text_tajweed":"وَمَا بِك[w:7432[ُم م]ّ[a:7433[ِن ن]ِّعْمَ[f:7434[ةٍ ف]َمِنَ [h:2957[ٱ]للَّهِ‌ۖ ثُ[g[مّ]َ إِذَا مَسَّكُمُ [h:7435[ٱ][l[ل]ضُّرُّ فَإِلَيْهِ تَ[q:7436[جْ]ــَٔر[p[ُو]نَ","translation_en":"And whatever favor is (bestowed) on you it is from Allah; then when evil afflicts you, to Him do you cry for aid.","translation_id":"Dan segala nikmat yang ada padamu (datangnya) dari Allah, kemudian apabila kamu ditimpa kesengsaraan, maka kepada-Nyalah kamu meminta pertolongan.","hasanah_per_verse":430},{"text_madani":"ثُمَّ إِذَا كَشَفَ الضُّرَّ عَنكُمْ إِذَا فَرِيقٌ مِّنكُم بِرَبِّهِمْ يُشْرِكُونَ","text_tajweed":"ثُ[g[مّ]َ إِذَا كَشَفَ [h:7437[ٱ][l[ل]ضُّرَّ عَ[f:255[نك]ُمْ إِذَا فَرِي[a:7438[قٌ م]ِّ[f:344[نك][c:7439[ُم ب]ِرَبِّهِمْ يُشْرِك[p[ُو]نَ","translation_en":"Yet when He removes the evil from you, lo! a party of you associate others with their Lord;","translation_id":"Kemudian apabila Dia telah menghilangkan bencana dari kamu, malah sebagian kamu mempersekutukan Tuhan dengan (yang lain).","hasanah_per_verse":380},{"text_madani":"لِيَكْفُرُوا بِمَا آتَيْنَاهُمْ ۚ فَتَمَتَّعُوا ۖ فَسَوْفَ تَعْلَمُونَ","text_tajweed":"لِيَكْفُرُو[s[اْ] بِم[o[َآ] ءَاتَيْنَ[n[ـٰ]هُمْ‌ۚ فَتَمَتَّعُو[s[اْ‌ۖ] فَسَوْفَ تَعْلَم[p[ُو]نَ","translation_en":"So that they be ungrateful for what We have given them; then enjoy yourselves; for soon will you know","translation_id":"Biarlah mereka mengingkari nikmat yang telah Kami berikan kepada mereka; bersenang-senanglah kamu. Kelak kamu akan mengetahui (akibatnya).","hasanah_per_verse":340},{"text_madani":"وَيَجْعَلُونَ لِمَا لَا يَعْلَمُونَ نَصِيبًا مِّمَّا رَزَقْنَاهُمْ ۗ تَاللَّهِ لَتُسْأَلُنَّ عَمَّا كُنتُمْ تَفْتَرُونَ","text_tajweed":"وَيَ[q:7440[جْ]عَلُونَ لِمَا لَا يَعْلَمُونَ نَصِي[a:7441[بًا م]ِّ[g[مّ]َا رَزَ[q:15[قْ]نَ[n[ـٰ]هُمْ‌ۗ تَ[h:6760[ٱ]للَّهِ لَتُسْــَٔلُ[g[نّ]َ عَ[g[مّ]َا كُ[f:100[نت]ُمْ تَفْتَر[p[ُو]نَ","translation_en":"And they set apart for what they do not know a portion of what We have given them. By Allah, you shall most certainly be questioned about that which you forged.","translation_id":"Dan mereka menyediakan sebagian dari rezeki yang telah Kami berikan kepada mereka, untuk berhala-berhala yang mereka tidak mengetahui (kekuasaannya). Demi Allah, kamu pasti akan ditanyai tentang apa yang telah kamu ada-adakan.","hasanah_per_verse":570},{"text_madani":"وَيَجْعَلُونَ لِلَّهِ الْبَنَاتِ سُبْحَانَهُ ۙ وَلَهُم مَّا يَشْتَهُونَ","text_tajweed":"وَيَ[q:7440[جْ]عَلُونَ لِلَّهِ [h:7442[ٱ]لْبَنَ[n[ـٰ]تِ سُ[q:608[بْ]حَ[n[ـٰ]نَهُ[n[ۥ]‌ۙ وَلَه[w:7443[ُم م]َّا يَشْتَه[p[ُو]نَ","translation_en":"And they ascribe daughters to Allah, glory be to Him; and for themselves (they would have) what they desire.","translation_id":"Dan mereka menetapkan anak perempuan bagi Allah. Mahasuci Dia, sedang untuk mereka sendiri apa yang mereka sukai (anak laki-laki).","hasanah_per_verse":340},{"text_madani":"وَإِذَا بُشِّرَ أَحَدُهُم بِالْأُنثَىٰ ظَلَّ وَجْهُهُ مُسْوَدًّا وَهُوَ كَظِيمٌ","text_tajweed":"وَإِذَا بُشِّرَ أَحَدُه[c:7444[ُم ب]ِ[h:930[ٱ]لْأُ[f:930[نث]َىٰ ظَلَّ وَ[q:7445[جْ]هُهُ[n[ۥ] مُسْوَد[a:7446[ًّا و]َهُوَ كَظ[p[ِي]مٌ","translation_en":"And when a daughter is announced to one of them his face becomes black and he is full of wrath.","translation_id":"Padahal apabila seseorang dari mereka diberi kabar dengan (kelahiran) anak perempuan, wajahnya menjadi hitam (merah padam), dan dia sangat marah.","hasanah_per_verse":370},{"text_madani":"يَتَوَارَىٰ مِنَ الْقَوْمِ مِن سُوءِ مَا بُشِّرَ بِهِ ۚ أَيُمْسِكُهُ عَلَىٰ هُونٍ أَمْ يَدُسُّهُ فِي التُّرَابِ ۗ أَلَا سَاءَ مَا يَحْكُمُونَ","text_tajweed":"يَتَو[n[َٲ]رَىٰ مِنَ [h:4196[ٱ]لْقَوْمِ مِ[f:7447[ن س][o[ُو]ٓءِ مَا بُشِّرَ بِه[o[ِۦٓ‌ۚ] أَيُمْسِكُهُ[n[ۥ] عَلَىٰ هُونٍ أَمْ يَدُسُّهُ[n[ۥ] فِى [h:7448[ٱ][l[ل]تُّرَابِ‌ۗ أَلَا س[o[َا]ٓءَ مَا يَحْكُم[p[ُو]نَ","translation_en":"He hides himself from the people because of the evil of that which is announced to him. Shall he keep it with disgrace or bury it (alive) in the dust? Now surely evil is what they judge.","translation_id":"Dia bersembunyi dari orang banyak, disebabkan kabar buruk yang disampaikan kepadanya. Apakah dia akan memeliharanya dengan (menanggung) kehinaan atau akan membenamkannya ke dalam tanah (hidup-hidup)? Ingatlah alangkah buruknya (putusan) yang mereka tetapkan itu.","hasanah_per_verse":650},{"text_madani":"لِلَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ مَثَلُ السَّوْءِ ۖ وَلِلَّهِ الْمَثَلُ الْأَعْلَىٰ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ","text_tajweed":"لِلَّذِينَ لَا يُؤْمِنُونَ بِ[h:447[ٱ]لْأَخِرَةِ مَثَلُ [h:7449[ٱ][l[ل]سَّوْءِ‌ۖ وَلِلَّهِ [h:7450[ٱ]لْمَثَلُ [h:7451[ٱ]لْأَعْلَىٰ‌ۚ وَهُوَ [h:7045[ٱ]لْعَزِيزُ [h:681[ٱ]لْحَك[p[ِي]مُ","translation_en":"For those who do not believe in the hereafter is an evil attribute, and Allah's is the loftiest attribute; and He is the Mighty, the Wise.","translation_id":"Bagi orang-orang yang tidak beriman pada (kehidupan) akhirat, (mempunyai) sifat yang buruk; dan Allah mempunyai sifat Yang Mahatinggi. Dan Dia Mahaperkasa, Mahabijaksana.","hasanah_per_verse":580},{"text_madani":"وَلَوْ يُؤَاخِذُ اللَّهُ النَّاسَ بِظُلْمِهِم مَّا تَرَكَ عَلَيْهَا مِن دَابَّةٍ وَلَٰكِن يُؤَخِّرُهُمْ إِلَىٰ أَجَلٍ مُّسَمًّى ۖ فَإِذَا جَاءَ أَجَلُهُمْ لَا يَسْتَأْخِرُونَ سَاعَةً ۖ وَلَا يَسْتَقْدِمُونَ","text_tajweed":"وَلَوْ يُؤَاخِذُ [h:7452[ٱ]للَّهُ [h:7453[ٱ][l[ل][g[نّ]َاسَ بِظُلْمِه[w:7454[ِم م]َّا تَرَكَ عَلَيْهَا مِ[f:4026[ن د][m[َا]ٓبَّ[a:7455[ةٍ و]َلَ[n[ـٰ]ك[a:7456[ِن ي]ُؤَخِّرُهُمْ إِلَ[o[ىٰٓ] أَجَ[a:1657[لٍ م]ُّسَم[f:7457[ًّى‌ۖ ف]َإِذَا ج[o[َا]ٓءَ أَجَلُهُمْ لَا يَسْتَــْٔخِرُونَ سَاعَ[a:4666[ةً‌ۖ و]َلَا يَسْتَ[q:4667[قْ]دِم[p[ُو]نَ","translation_en":"And if Allah had destroyed men for their iniquity, He would not leave on the earth a single creature, but He respites them till an appointed time; so when their doom will come they shall not be able to delay (it) an hour nor can they bring (it) on (before its time).","translation_id":"Dan kalau Allah menghukum manusia karena kezhalimannya, niscaya tidak akan ada yang ditinggalkan-Nya (di bumi) dari makhluk yang melata sekalipun, tetapi Allah menangguhkan mereka sampai waktu yang sudah ditentukan. Maka apabila ajalnya tiba, mereka tidak dapat meminta penundaan atau percepatan sesaat pun.","hasanah_per_verse":960},{"text_madani":"وَيَجْعَلُونَ لِلَّهِ مَا يَكْرَهُونَ وَتَصِفُ أَلْسِنَتُهُمُ الْكَذِبَ أَنَّ لَهُمُ الْحُسْنَىٰ ۖ لَا جَرَمَ أَنَّ لَهُمُ النَّارَ وَأَنَّهُم مُّفْرَطُونَ","text_tajweed":"وَيَ[q:7440[جْ]عَلُونَ لِلَّهِ مَا يَكْرَهُونَ وَتَصِفُ أَلْسِنَتُهُمُ [h:7458[ٱ]لْكَذِبَ أَ[g[نّ]َ لَهُمُ [h:7459[ٱ]لْحُسْنَىٰ‌ۖ لَا جَرَمَ أَ[g[نّ]َ لَهُمُ [h:7460[ٱ][l[ل][g[نّ]َارَ وَأَ[g[نّ]َه[w:7461[ُم م]ُّفْرَط[p[ُو]نَ","translation_en":"And they ascribe to Allah what they (themselves) hate and their tongues relate the lie that they shall have the good; there is no avoiding it that for them is the fire and that they shall be sent before.","translation_id":"Dan mereka menetapkan bagi Allah apa yang mereka sendiri membencinya, dan lidah mereka mengucapkan kebohongan, bahwa sesungguhnya (segala) yang baik-baik untuk mereka. Tidaklah diragukan bahwa nerakalah bagi mereka, dan sesungguhnya mereka segera akan dimasukkan (ke dalamnya).","hasanah_per_verse":710},{"text_madani":"تَاللَّهِ لَقَدْ أَرْسَلْنَا إِلَىٰ أُمَمٍ مِّن قَبْلِكَ فَزَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ فَهُوَ وَلِيُّهُمُ الْيَوْمَ وَلَهُمْ عَذَابٌ أَلِيمٌ","text_tajweed":"تَ[h:9999[ٱ]للَّهِ لَقَ[q:2389[دْ] أَرْسَلْن[o[َآ] إِلَ[o[ىٰٓ] أُمَ[a:4041[مٍ م]ِّ[f:18[ن ق]َ[q:19[بْ]لِكَ فَزَيَّنَ لَهُمُ [h:4046[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ أَعْمَ[n[ـٰ]لَهُمْ فَهُوَ وَلِيُّهُمُ [h:7462[ٱ]لْيَوْمَ وَلَهُمْ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"By Allah, most certainly We sent (messengers) to nations before you, but the Shaitan made their deeds fair-seeming to them, so he is their guardian today, and they shall have a painful punishment.","translation_id":"Demi Allah, sungguh Kami telah mengutus (rasul-rasul) kepada umat-umat sebelum engkau (Muhammad), tetapi setan menjadikan terasa indah bagi mereka perbuatan mereka (yang buruk), sehingga dia (setan) menjadi pemimpin mereka pada hari ini dan mereka akan mendapat azab yang sangat pedih.","hasanah_per_verse":720},{"text_madani":"وَمَا أَنزَلْنَا عَلَيْكَ الْكِتَابَ إِلَّا لِتُبَيِّنَ لَهُمُ الَّذِي اخْتَلَفُوا فِيهِ ۙ وَهُدًى وَرَحْمَةً لِّقَوْمٍ يُؤْمِنُونَ","text_tajweed":"وَم[o[َآ] أَ[f:515[نز]َلْنَا عَلَيْكَ [h:1723[ٱ]لْكِتَ[n[ـٰ]بَ إِلَّا لِتُبَيِّنَ لَهُمُ [h:7409[ٱ]لَّذِى [h:7463[ٱ]خْتَلَفُو[s[اْ] فِيهِ‌ۙ وَهُ[a:4537[دًى و]َرَحْمَ[u:4735[ةً ل]ِّقَوْ[a:4294[مٍ ي]ُؤْمِن[p[ُو]نَ","translation_en":"And We have not revealed to you the Book except that you may make clear to them that about which they differ, and (as) a guidance and a mercy for a people who believe.","translation_id":"Dan Kami tidak menurunkan Kitab (Al-Qur'an) ini kepadamu (Muhammad), melainkan agar engkau dapat menjelaskan kepada mereka apa yang mereka perselisihkan, serta menjadi petunjuk dan rahmat bagi orang-orang yang beriman.","hasanah_per_verse":630},{"text_madani":"وَاللَّهُ أَنزَلَ مِنَ السَّمَاءِ مَاءً فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا ۚ إِنَّ فِي ذَٰلِكَ لَآيَةً لِّقَوْمٍ يَسْمَعُونَ","text_tajweed":"وَ[h:9999[ٱ]للَّهُ أَ[f:471[نز]َلَ مِنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ م[o[َا]ٓ[f:7464[ءً ف]َأَحْيَا بِهِ [h:842[ٱ]لْأَرْضَ بَعْدَ مَوْتِه[o[َآ‌ۚ] إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[u:7345[ةً ل]ِّقَوْ[a:6119[مٍ ي]َسْمَع[p[ُو]نَ","translation_en":"And Allah has sent down water from the cloud and therewith given life to the earth after its death; most surely there is a sign in this for a people who would listen.","translation_id":"Dan Allah menurunkan air (hujan) dari langit dan dengan air itu dihidupkan-Nya bumi yang tadinya sudah mati. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang mendengarkan (pelajaran).","hasanah_per_verse":610},{"text_madani":"وَإِنَّ لَكُمْ فِي الْأَنْعَامِ لَعِبْرَةً ۖ نُّسْقِيكُم مِّمَّا فِي بُطُونِهِ مِن بَيْنِ فَرْثٍ وَدَمٍ لَّبَنًا خَالِصًا سَائِغًا لِّلشَّارِبِينَ","text_tajweed":"وَإِ[g[نّ]َ لَكُمْ فِى [h:7465[ٱ]لْأَنْعَ[n[ـٰ]مِ لَعِ[q:1764[بْ]رَ[a:7466[ةً‌ۖ ن]ُّسْقِيك[w:7467[ُم م]ِّ[g[مّ]َا فِى بُطُونِه[n[ِۦ] م[i:4612[ِنۢ ب]َيْنِ فَرْ[a:7468[ثٍ و]َدَ[u:7469[مٍ ل]َّبَنًا خَالِ[f:7470[صًا س][o[َا]ٓئِ[u:7471[غًا ل]ِّلشَّ[n[ـٰ]رِب[p[ِي]نَ","translation_en":"And most surely there is a lesson for you in the cattle; We give you to drink of what is in their bellies-- from betwixt the feces and the blood-- pure milk, easy and agreeable to swallow for those who drink.","translation_id":"Dan sungguh, pada hewan ternak itu benar-benar terdapat pelajaran bagi kamu. Kami memberimu minum dari apa yang ada dalam perutnya (berupa) susu murni antara kotoran dan darah, yang mudah ditelan bagi orang yang meminumnya.","hasanah_per_verse":690},{"text_madani":"وَمِن ثَمَرَاتِ النَّخِيلِ وَالْأَعْنَابِ تَتَّخِذُونَ مِنْهُ سَكَرًا وَرِزْقًا حَسَنًا ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِّقَوْمٍ يَعْقِلُونَ","text_tajweed":"وَمِ[f:7472[ن ث]َمَر[n[َٲ]تِ [h:7473[ٱ][l[ل][g[نّ]َخِيلِ وَ[h:7474[ٱ]لْأَعْنَ[n[ـٰ]بِ تَتَّخِذُونَ مِنْهُ سَكَ[a:7475[رًا و]َرِزْقًا حَسَنًا‌ۗ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[u:7345[ةً ل]ِّقَوْ[a:850[مٍ ي]َعْقِل[p[ُو]نَ","translation_en":"And of the fruits of the palms and the grapes-- you obtain from them intoxication and goodly provision; most surely there is a sign in this for a people who ponder.","translation_id":"Dan dari buah kurma dan anggur, kamu membuat minuman yang memabukkan dan rezeki yang baik. Sungguh, pada yang demikian itu benar-benar terdapat tanda (kebesaran Allah) bagi orang yang mengerti.","hasanah_per_verse":650},{"text_madani":"وَأَوْحَىٰ رَبُّكَ إِلَى النَّحْلِ أَنِ اتَّخِذِي مِنَ الْجِبَالِ بُيُوتًا وَمِنَ الشَّجَرِ وَمِمَّا يَعْرِشُونَ","text_tajweed":"وَأَوْحَىٰ رَبُّكَ إِلَى [h:7476[ٱ][l[ل][g[نّ]َحْلِ أَنِ [h:7477[ٱ]تَّخِذِى مِنَ [h:7297[ٱ]لْجِبَالِ بُيُو[a:7478[تًا و]َمِنَ [h:7479[ٱ][l[ل]شَّجَرِ وَمِ[g[مّ]َا يَعْرِش[p[ُو]نَ","translation_en":"And your Lord revealed to the bee saying: Make hives in the mountains and in the trees and in what they build:","translation_id":"Dan Tuhanmu mengilhamkan kepada lebah, “Buatlah sarang di gunung-gunung, di pohon-pohon kayu, dan di tempat-tempat yang dibikin manusia,","hasanah_per_verse":540},{"text_madani":"ثُمَّ كُلِي مِن كُلِّ الثَّمَرَاتِ فَاسْلُكِي سُبُلَ رَبِّكِ ذُلُلًا ۚ يَخْرُجُ مِن بُطُونِهَا شَرَابٌ مُّخْتَلِفٌ أَلْوَانُهُ فِيهِ شِفَاءٌ لِّلنَّاسِ ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِّقَوْمٍ يَتَفَكَّرُونَ","text_tajweed":"ثُ[g[مّ]َ كُلِى مِ[f:843[ن ك]ُلِّ [h:1571[ٱ][l[ل]ثَّمَر[n[َٲ]تِ فَ[h:7480[ٱ]سْلُكِى سُبُلَ رَبِّكِ ذُلُل[a:7481[اً‌ۚ ي]َخْرُجُ م[i:7482[ِنۢ ب]ُطُونِهَا شَرَا[a:7483[بٌ م]ُّخْتَلِفٌ أَلْو[n[َٲ]نُهُ[n[ۥ] فِيهِ شِف[o[َا]ٓ[u:7484[ءٌ ل]ِّل[g[نّ]َاسِ‌ۗ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[u:7345[ةً ل]ِّقَوْ[a:6018[مٍ ي]َتَفَكَّر[p[ُو]نَ","translation_en":"Then eat of all the fruits and walk in the ways of your Lord submissively. There comes forth from within it a beverage of many colours, in which there is healing for men; most surely there is a sign in this for a people who reflect.","translation_id":"kemudian makanlah dari segala (macam) buah-buahan lalu tempuhlah jalan Tuhanmu yang telah dimudahkan (bagimu).” Dari perut lebah itu keluar minuman (madu) yang bermacam-macam warnanya, di dalamnya terdapat obat yang menyembuhkan bagi manusia. Sungguh, pada yang demikian itu benar-benar terdapat tanda (kebesaran Allah) bagi orang yang berpikir.","hasanah_per_verse":930},{"text_madani":"وَاللَّهُ خَلَقَكُمْ ثُمَّ يَتَوَفَّاكُمْ ۚ وَمِنكُم مَّن يُرَدُّ إِلَىٰ أَرْذَلِ الْعُمُرِ لِكَيْ لَا يَعْلَمَ بَعْدَ عِلْمٍ شَيْئًا ۚ إِنَّ اللَّهَ عَلِيمٌ قَدِيرٌ","text_tajweed":"وَ[h:9999[ٱ]للَّهُ خَلَقَكُمْ ثُ[g[مّ]َ يَتَوَفَّ[n[ـٰ]كُمْ‌ۚ وَمِ[f:2325[نك][w:2326[ُم م]ّ[a:7485[َن ي]ُرَدُّ إِلَ[o[ىٰٓ] أَرْذَلِ [h:7486[ٱ]لْعُمُرِ لِكَىْ لَا يَعْلَمَ بَعْدَ عِلْ[f:7487[مٍ ش]َيْــًٔا‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَلِي[f:7488[مٌ ق]َد[p[ِي]رٌ","translation_en":"And Allah has created you, then He causes you to die, and of you is he who is brought back to the worst part of life, so that after having knowledge he does not know anything; surely Allah is Knowing, Powerful.","translation_id":"Dan Allah telah menciptakan kamu, kemudian mewafatkanmu, di antara kamu ada yang dikembalikan kepada usia yang tua renta (pikun), sehingga dia tidak mengetahui lagi sesuatu yang pernah diketahuinya. Sungguh, Allah Maha Mengetahui, Mahakuasa.","hasanah_per_verse":740},{"text_madani":"وَاللَّهُ فَضَّلَ بَعْضَكُمْ عَلَىٰ بَعْضٍ فِي الرِّزْقِ ۚ فَمَا الَّذِينَ فُضِّلُوا بِرَادِّي رِزْقِهِمْ عَلَىٰ مَا مَلَكَتْ أَيْمَانُهُمْ فَهُمْ فِيهِ سَوَاءٌ ۚ أَفَبِنِعْمَةِ اللَّهِ يَجْحَدُونَ","text_tajweed":"وَ[h:9999[ٱ]للَّهُ فَضَّلَ بَعْضَكُمْ عَلَىٰ بَعْ[f:6882[ضٍ ف]ِى [h:7489[ٱ][l[ل]رِّزْقِ‌ۚ فَمَا [h:7490[ٱ]لَّذِينَ فُضِّلُو[s[اْ] بِر[m[َا]ٓدِّى رِزْقِهِمْ عَلَىٰ مَا مَلَكَتْ أَيْمَ[n[ـٰ]نُهُمْ فَهُمْ فِيهِ سَو[o[َا]ٓءٌ‌ۚ أَفَبِنِعْمَةِ [h:7491[ٱ]للَّهِ يَ[q:4008[جْ]حَد[p[ُو]نَ","translation_en":"And Allah has made some of you excel others in the means of subsistence, so those who are made to excel do not give away their sustenance to those whom their right hands possess so that they should be equal therein; is it then the favor of Allah which they deny?","translation_id":"Dan Allah melebihkan sebagian kamu atas sebagian yang lain dalam hal rezeki, tetapi orang yang dilebihkan (rezekinya itu) tidak mau memberikan rezekinya kepada para hamba sahaya yang mereka miliki, sehingga mereka sama-sama (merasakan) rezeki itu. Mengapa mereka mengingkari nikmat Allah?","hasanah_per_verse":920},{"text_madani":"وَاللَّهُ جَعَلَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَاجًا وَجَعَلَ لَكُم مِّنْ أَزْوَاجِكُم بَنِينَ وَحَفَدَةً وَرَزَقَكُم مِّنَ الطَّيِّبَاتِ ۚ أَفَبِالْبَاطِلِ يُؤْمِنُونَ وَبِنِعْمَتِ اللَّهِ هُمْ يَكْفُرُونَ","text_tajweed":"وَ[h:9999[ٱ]للَّهُ جَعَلَ لَك[w:556[ُم م]ِّنْ أَ[f:1329[نف]ُسِكُمْ أَزْو[n[َٲ][a:7492[جًا و]َجَعَلَ لَك[w:556[ُم م]ِّنْ أَزْو[n[َٲ]جِك[c:7493[ُم ب]َنِينَ وَحَفَدَ[a:7494[ةً و]َرَزَقَك[w:5306[ُم م]ِّنَ [h:5307[ٱ][l[ل]طَّيِّبَ[n[ـٰ]تِ‌ۚ أَفَبِ[h:7495[ٱ]لْبَ[n[ـٰ]طِلِ يُؤْمِنُونَ وَبِنِعْمَتِ [h:7496[ٱ]للَّهِ هُمْ يَكْفُر[p[ُو]نَ","translation_en":"And Allah has made wives for you from among yourselves, and has given you sons and grandchildren from your wives, and has given you of the good things; is it then in the falsehood that they believe while it is in the favor of Allah that they disbelieve?","translation_id":"Dan Allah menjadikan bagimu pasangan (suami atau istri) dari jenis kamu sendiri dan menjadikan anak dan cucu bagimu dari pasanganmu, serta memberimu rezeki dari yang baik. Mengapa mereka beriman kepada yang batil dan mengingkari nikmat Allah?","hasanah_per_verse":980},{"text_madani":"وَيَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَا يَمْلِكُ لَهُمْ رِزْقًا مِّنَ السَّمَاوَاتِ وَالْأَرْضِ شَيْئًا وَلَا يَسْتَطِيعُونَ","text_tajweed":"وَيَعْبُدُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ مَا لَا يَمْلِكُ لَهُمْ رِزْ[a:7497[قًا م]ِّنَ [h:7498[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ شَيْـ[a:232[ـًٔا و]َلَا يَسْتَطِيع[p[ُو]نَ","translation_en":"And they serve besides Allah that which does not control for them any sustenance at all from the heavens and the earth, nor have they any power.","translation_id":"Dan mereka menyembah selain Allah, sesuatu yang sama sekali tidak dapat memberikan rezeki kepada mereka, dari langit dan bumi, dan tidak akan sanggup (berbuat apa pun).","hasanah_per_verse":620},{"text_madani":"فَلَا تَضْرِبُوا لِلَّهِ الْأَمْثَالَ ۚ إِنَّ اللَّهَ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ","text_tajweed":"فَلَا تَضْرِبُو[s[اْ] لِلَّهِ [h:7499[ٱ]لْأَمْثَالَ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ يَعْلَمُ وَأَ[f:98[نت]ُمْ لَا تَعْلَم[p[ُو]نَ","translation_en":"Therefore do not give likenesses to Allah; surely Allah knows and you do not know.","translation_id":"Maka janganlah kamu mengadakan sekutu-sekutu bagi Allah. Sungguh, Allah mengetahui, sedang kamu tidak mengetahui.","hasanah_per_verse":420},{"text_madani":"ضَرَبَ اللَّهُ مَثَلًا عَبْدًا مَّمْلُوكًا لَّا يَقْدِرُ عَلَىٰ شَيْءٍ وَمَن رَّزَقْنَاهُ مِنَّا رِزْقًا حَسَنًا فَهُوَ يُنفِقُ مِنْهُ سِرًّا وَجَهْرًا ۖ هَلْ يَسْتَوُونَ ۚ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ","text_tajweed":"۞ ضَرَبَ [h:7103[ٱ]للَّهُ مَثَلاً عَ[q:3317[بْ][a:7500[دًا م]َّمْلُو[u:7501[كًا ل]َّا يَ[q:7502[قْ]دِرُ عَلَىٰ ش[a:7503[َىْءٍ و]َم[u:7504[َن ر]َّزَ[q:7505[قْ]نَ[n[ـٰ]هُ مِ[g[نّ]َا رِزْقًا حَسَ[f:7506[نًا ف]َهُوَ يُ[f:1550[نف]ِقُ مِنْهُ سِر[a:7507[ًّا و]َجَهْرًا‌ۖ هَلْ يَسْتَوُ[n[ۥ]نَ‌ۚ [h:7508[ٱ]لْحَمْدُ لِلَّهِ‌ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَم[p[ُو]نَ","translation_en":"Allah sets forth a parable: (consider) a slave, the property of another, (who) has no power over anything, and one whom We have granted from Ourselves a goodly sustenance so he spends from it secretly and openly; are the two alike? (All) praise is due to Allah! Nay, most of them do not know.","translation_id":"Allah membuat perumpamaan seorang hamba sahaya di bawah kekuasaan orang lain, yang tidak berdaya berbuat sesuatu, dan seorang yang Kami beri rezeki yang baik, lalu dia menginfakkan sebagian rezeki itu secara sembunyi-sembunyi dan secara terang-terangan. Samakah mereka itu? Segala puji hanya bagi Allah, tetapi kebanyakan mereka tidak mengetahui.","hasanah_per_verse":1030},{"text_madani":"وَضَرَبَ اللَّهُ مَثَلًا رَّجُلَيْنِ أَحَدُهُمَا أَبْكَمُ لَا يَقْدِرُ عَلَىٰ شَيْءٍ وَهُوَ كَلٌّ عَلَىٰ مَوْلَاهُ أَيْنَمَا يُوَجِّههُّ لَا يَأْتِ بِخَيْرٍ ۖ هَلْ يَسْتَوِي هُوَ وَمَن يَأْمُرُ بِالْعَدْلِ ۙ وَهُوَ عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ","text_tajweed":"وَضَرَبَ [h:7509[ٱ]للَّهُ مَثَل[u:7510[اً ر]َّجُلَيْنِ أَحَدُهُم[o[َآ] أَ[q:7511[بْ]كَمُ لَا يَ[q:7502[قْ]دِرُ عَلَىٰ ش[a:4300[َىْءٍ و]َهُوَ كَلٌّ عَلَىٰ مَوْلَ[n[ـٰ]هُ أَيْنَمَا يُوَجِّههُّ لَا يَأْتِ بِخَيْرٍ‌ۖ هَلْ يَسْتَوِى هُوَ وَم[a:7512[َن ي]َأْمُرُ بِ[h:1661[ٱ]لْعَ[q:1661[دْ]لِ‌ۙ وَهُوَ عَلَىٰ صِر[n[َٲ][a:726[طٍ م]ُّسْتَق[p[ِي]مٍ","translation_en":"And Allah sets forth a parable of two men; one of them is dumb, not able to do anything, and he is a burden to his master; wherever he sends him, he brings no good; can he be held equal with him who enjoins what is just, and he (himself) is on the right path?","translation_id":"Dan Allah (juga) membuat perumpamaan, dua orang laki-laki, yang seorang bisu, tidak dapat berbuat sesuatu dan dia menjadi beban penanggungnya, ke mana saja dia disuruh (oleh penanggungnya itu), dia sama sekali tidak dapat mendatangkan suatu kebaikan. Samakah orang itu dengan orang yang menyuruh berbuat keadilan, dan dia berada di jalan yang lurus?","hasanah_per_verse":1090},{"text_madani":"وَلِلَّهِ غَيْبُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَمَا أَمْرُ السَّاعَةِ إِلَّا كَلَمْحِ الْبَصَرِ أَوْ هُوَ أَقْرَبُ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","text_tajweed":"وَلِلَّهِ غَيْبُ [h:6538[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۚ وَم[o[َآ] أَمْرُ [h:7513[ٱ][l[ل]سَّاعَةِ إِلَّا كَلَمْحِ [h:7514[ٱ]لْبَصَرِ أَوْ هُوَ أَ[q:1355[قْ]رَبُ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َد[p[ِي]رٌ","translation_en":"And Allah's is the unseen of the heavens and the earth; and the matter of the hour is but as the twinkling of an eye or it is higher still; surely Allah has power over all things.","translation_id":"Dan milik Allah (segala) yang tersembunyi di langit dan di bumi. Urusan kejadian Kiamat itu, hanya seperti sekejap mata atau lebih cepat (lagi). Sesungguhnya Allah Mahakuasa atas segala sesuatu.","hasanah_per_verse":710},{"text_madani":"وَاللَّهُ أَخْرَجَكُم مِّن بُطُونِ أُمَّهَاتِكُمْ لَا تَعْلَمُونَ شَيْئًا وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ ۙ لَعَلَّكُمْ تَشْكُرُونَ","text_tajweed":"وَ[h:9999[ٱ]للَّهُ أَخْرَجَك[w:7515[ُم م]ّ[i:7516[ِنۢ ب]ُطُونِ أُ[g[مّ]َهَ[n[ـٰ]تِكُمْ لَا تَعْلَمُونَ شَيْـ[a:7517[ـًٔا و]َجَعَلَ لَكُمُ [h:7518[ٱ][l[ل]سَّمْعَ وَ[h:6037[ٱ]لْأَ[q:6037[بْ]صَ[n[ـٰ]رَ وَ[h:7519[ٱ]لْأَفْــِٔدَةَ‌ۙ لَعَلَّكُمْ تَشْكُر[p[ُو]نَ","translation_en":"And Allah has brought you forth from the wombs of your mothers-- you did not know anything-- and He gave you hearing and sight and hearts that you may give thanks.","translation_id":"Dan Allah mengeluarkan kamu dari perut ibumu dalam keadaan tidak mengetahui sesuatu pun, dan Dia memberimu pendengaran, penglihatan, dan hati nurani, agar kamu bersyukur.","hasanah_per_verse":750},{"text_madani":"أَلَمْ يَرَوْا إِلَى الطَّيْرِ مُسَخَّرَاتٍ فِي جَوِّ السَّمَاءِ مَا يُمْسِكُهُنَّ إِلَّا اللَّهُ ۗ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يُؤْمِنُونَ","text_tajweed":"أَلَمْ يَرَوْ[s[اْ] إِلَى [h:7520[ٱ][l[ل]طَّيْرِ مُسَخَّر[n[َٲ][f:7521[تٍ ف]ِى جَوِّ [h:7522[ٱ][l[ل]سَّم[o[َا]ٓءِ مَا يُمْسِكُهُ[g[نّ]َ إِلَّا [h:1742[ٱ]للَّهُ‌ۗ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:849[تٍ ل]ِّقَوْ[a:4294[مٍ ي]ُؤْمِن[p[ُو]نَ","translation_en":"Do they not see the birds, constrained in the middle of the sky? None withholds them but Allah; most surely there are signs in this for a people who believe.","translation_id":"Tidakkah mereka memperhatikan burung-burung yang dapat terbang di angkasa dengan mudah. Tidak ada yang menahannya selain Allah. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang beriman.","hasanah_per_verse":680},{"text_madani":"وَاللَّهُ جَعَلَ لَكُم مِّن بُيُوتِكُمْ سَكَنًا وَجَعَلَ لَكُم مِّن جُلُودِ الْأَنْعَامِ بُيُوتًا تَسْتَخِفُّونَهَا يَوْمَ ظَعْنِكُمْ وَيَوْمَ إِقَامَتِكُمْ ۙ وَمِنْ أَصْوَافِهَا وَأَوْبَارِهَا وَأَشْعَارِهَا أَثَاثًا وَمَتَاعًا إِلَىٰ حِينٍ","text_tajweed":"وَ[h:9999[ٱ]للَّهُ جَعَلَ لَك[w:556[ُم م]ّ[i:7523[ِنۢ ب]ُيُوتِكُمْ سَكَ[a:7524[نًا و]َجَعَلَ لَك[w:556[ُم م]ِّ[f:7525[ن ج]ُلُودِ [h:7526[ٱ]لْأَنْعَ[n[ـٰ]مِ بُيُو[f:7527[تًا ت]َسْتَخِفُّونَهَا يَوْمَ ظَعْنِكُمْ وَيَوْمَ إِقَامَتِكُمْ‌ۙ وَمِنْ أَصْوَافِهَا وَأَوْبَارِهَا وَأَشْعَارِه[o[َآ] أَثَ[n[ـٰ][a:7528[ثًا و]َمَتَ[n[ـٰ]عًا إِلَىٰ ح[p[ِي]نٍ","translation_en":"And Allah has given you a place to abide in your houses, and He has given you tents of the skins of cattle which you find light to carry on the day of your march and on the day of your halting, and of their wool and their fur and their hair (He has given you) household stuff and a provision for a time.","translation_id":"Dan Allah menjadikan rumah-rumah bagimu sebagai tempat tinggal dan Dia menjadikan bagimu rumah-rumah (kemah-kemah) dari kulit hewan ternak yang kamu merasa ringan (membawa)nya pada waktu kamu bepergian dan pada waktu kamu bermukim dan (dijadikan-Nya pula) dari bulu domba, bulu unta, dan bulu kambing, alat-alat rumah tangga dan kesenangan sampai waktu (tertentu).","hasanah_per_verse":1190},{"text_madani":"وَاللَّهُ جَعَلَ لَكُم مِّمَّا خَلَقَ ظِلَالًا وَجَعَلَ لَكُم مِّنَ الْجِبَالِ أَكْنَانًا وَجَعَلَ لَكُمْ سَرَابِيلَ تَقِيكُمُ الْحَرَّ وَسَرَابِيلَ تَقِيكُم بَأْسَكُمْ ۚ كَذَٰلِكَ يُتِمُّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تُسْلِمُونَ","text_tajweed":"وَ[h:9999[ٱ]للَّهُ جَعَلَ لَك[w:7529[ُم م]ِّ[g[مّ]َا خَلَقَ ظِلَ[n[ـٰ]ل[a:7530[اً و]َجَعَلَ لَك[w:1578[ُم م]ِّنَ [h:7297[ٱ]لْجِبَالِ أَكْنَ[n[ـٰ][a:7531[نًا و]َجَعَلَ لَكُمْ سَر[n[َٲ]بِيلَ تَقِيكُمُ [h:7532[ٱ]لْحَرَّ وَسَر[n[َٲ]بِيلَ تَقِيك[c:7533[ُم ب]َأْسَكُمْ‌ۚ كَذ[n[َٲ]لِكَ يُتِ[g[مّ]ُ نِعْمَتَهُ[n[ۥ] عَلَيْكُمْ لَعَلَّكُمْ تُسْلِم[p[ُو]نَ","translation_en":"And Allah has made for you of what He has created shelters, and He has given you in the mountains places of retreat, and He has given you garments to preserve you from the heat and coats of mail to preserve you in your fighting; even thus does He complete His favor upon you, that haply you may submit.","translation_id":"Dan Allah menjadikan tempat bernaung bagimu dari apa yang telah Dia ciptakan, Dia menjadikan bagimu tempat-tempat tinggal di gunung-gunung, dan Dia menjadikan pakaian bagimu yang memeliharamu dari panas dan pakaian (baju besi) yang memelihara kamu dalam peperangan. Demikian Allah menyempurnakan nikmat-Nya kepadamu agar kamu berserah diri (kepada-Nya).","hasanah_per_verse":1100},{"text_madani":"فَإِن تَوَلَّوْا فَإِنَّمَا عَلَيْكَ الْبَلَاغُ الْمُبِينُ","text_tajweed":"فَإِ[f:1857[ن ت]َوَلَّوْ[s[اْ] فَإِ[g[نّ]َمَا عَلَيْكَ [h:1808[ٱ]لْبَلَ[n[ـٰ]غُ [h:3781[ٱ]لْمُب[p[ِي]نُ","translation_en":"But if they turn back, then on you devolves only the clear deliverance (of the message).","translation_id":"Maka jika mereka berpaling, maka ketahuilah kewajiban yang dibebankan atasmu (Muhammad) hanyalah menyampaikan (amanat Allah) dengan terang.","hasanah_per_verse":290},{"text_madani":"يَعْرِفُونَ نِعْمَتَ اللَّهِ ثُمَّ يُنكِرُونَهَا وَأَكْثَرُهُمُ الْكَافِرُونَ","text_tajweed":"يَعْرِفُونَ نِعْمَتَ [h:1300[ٱ]للَّهِ ثُ[g[مّ]َ يُ[f:7534[نك]ِرُونَهَا وَأَكْثَرُهُمُ [h:7535[ٱ]لْكَ[n[ـٰ]فِر[p[ُو]نَ","translation_en":"They recognize the favor of Allah, yet they deny it, and most of them are ungrateful.","translation_id":"Mereka mengetahui nikmat Allah, kemudian mereka mengingkarinya dan kebanyakan mereka adalah orang yang ingkar kepada Allah.","hasanah_per_verse":390},{"text_madani":"وَيَوْمَ نَبْعَثُ مِن كُلِّ أُمَّةٍ شَهِيدًا ثُمَّ لَا يُؤْذَنُ لِلَّذِينَ كَفَرُوا وَلَا هُمْ يُسْتَعْتَبُونَ","text_tajweed":"وَيَوْمَ نَ[q:7536[بْ]عَثُ مِ[f:843[ن ك]ُلِّ أُ[g[مّ]َ[f:7537[ةٍ ش]َهِي[f:7538[دًا ث]ُ[g[مّ]َ لَا يُؤْذَنُ لِلَّذِينَ كَفَرُو[s[اْ] وَلَا هُمْ يُسْتَعْتَب[p[ُو]نَ","translation_en":"And on the day when We will raise up a witness out of every nation, then shall no permission be given to those who disbelieve, nor shall they be made to solicit favor.","translation_id":"Dan (ingatlah) pada hari (ketika) Kami bangkitkan seorang saksi (rasul) dari setiap umat, kemudian tidak diizinkan kepada orang yang kafir (untuk membela diri) dan tidak (pula) dibolehkan memohon ampunan.","hasanah_per_verse":510},{"text_madani":"وَإِذَا رَأَى الَّذِينَ ظَلَمُوا الْعَذَابَ فَلَا يُخَفَّفُ عَنْهُمْ وَلَا هُمْ يُنظَرُونَ","text_tajweed":"وَإِذَا رَءَا [h:7539[ٱ]لَّذِينَ ظَلَمُو[s[اْ] [h:7540[ٱ]لْعَذَابَ فَلَا يُخَفَّفُ عَنْهُمْ وَلَا هُمْ يُ[f:826[نظ]َر[p[ُو]نَ","translation_en":"And when those who are unjust shall see the chastisement, it shall not be lightened for them, nor shall they be respited.","translation_id":"Dan apabila orang zhalim telah menyaksikan azab, maka mereka tidak mendapat keringanan dan tidak (pula) diberi penangguhan.","hasanah_per_verse":450},{"text_madani":"وَإِذَا رَأَى الَّذِينَ أَشْرَكُوا شُرَكَاءَهُمْ قَالُوا رَبَّنَا هَٰؤُلَاءِ شُرَكَاؤُنَا الَّذِينَ كُنَّا نَدْعُو مِن دُونِكَ ۖ فَأَلْقَوْا إِلَيْهِمُ الْقَوْلَ إِنَّكُمْ لَكَاذِبُونَ","text_tajweed":"وَإِذَا رَءَا [h:7539[ٱ]لَّذِينَ أَشْرَكُو[s[اْ] شُرَك[o[َا]ٓءَهُمْ قَالُو[s[اْ] رَبَّنَا هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ شُرَك[o[َا]ٓؤُنَا [h:7541[ٱ]لَّذِينَ كُ[g[نّ]َا نَ[q:7542[دْ]عُو[s[اْ] مِ[f:7543[ن د]ُونِكَ‌ۖ فَأَلْقَوْ[s[اْ] إِلَيْهِمُ [h:7544[ٱ]لْقَوْلَ إِ[g[نّ]َكُمْ لَكَ[n[ـٰ]ذِب[p[ُو]نَ","translation_en":"And when those who associate (others with Allah) shall see their associate-gods, they shall say: Our Lord, these are our associate-gods on whom we called besides Thee. But they will give them back the reply: Most surely you are liars.","translation_id":"Dan apabila orang yang mempersekutukan (Allah) melihat sekutu-sekutu mereka, mereka berkata, “Ya Tuhan kami, mereka inilah sekutu-sekutu kami yang dahulu kami sembah selain Engkau.” Lalu sekutu mereka menyatakan kepada mereka, “Kamu benar-benar pendusta.”","hasanah_per_verse":910},{"text_madani":"وَأَلْقَوْا إِلَى اللَّهِ يَوْمَئِذٍ السَّلَمَ ۖ وَضَلَّ عَنْهُم مَّا كَانُوا يَفْتَرُونَ","text_tajweed":"وَأَلْقَوْ[s[اْ] إِلَى [h:1637[ٱ]للَّهِ يَوْمَئِذٍ [h:7545[ٱ][l[ل]سَّلَمَ‌ۖ وَضَلَّ عَنْه[w:3985[ُم م]َّا كَانُو[s[اْ] يَفْتَر[p[ُو]نَ","translation_en":"And they shall tender submission to Allah on that day; and what they used to forge shall depart from them.","translation_id":"Dan pada hari itu mereka menyatakan tunduk kepada Allah dan lenyaplah segala yang mereka ada-adakan.","hasanah_per_verse":430},{"text_madani":"الَّذِينَ كَفَرُوا وَصَدُّوا عَن سَبِيلِ اللَّهِ زِدْنَاهُمْ عَذَابًا فَوْقَ الْعَذَابِ بِمَا كَانُوا يُفْسِدُونَ","text_tajweed":"ٱلَّذِينَ كَفَرُو[s[اْ] وَصَدُّو[s[اْ] عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ زِ[q:7546[دْ]نَ[n[ـٰ]هُمْ عَذَا[f:7547[بًا ف]َوْقَ [h:7548[ٱ]لْعَذَابِ بِمَا كَانُو[s[اْ] يُفْسِد[p[ُو]نَ","translation_en":"(As for) those who disbelieve and turn away from Allah's way, We will add chastisement to their chastisement because they made mischief.","translation_id":"Orang yang kafir dan menghalangi (manusia) dari jalan Allah, Kami tambahkan kepada mereka siksaan demi siksaan disebabkan mereka selalu berbuat kerusakan.","hasanah_per_verse":590},{"text_madani":"وَيَوْمَ نَبْعَثُ فِي كُلِّ أُمَّةٍ شَهِيدًا عَلَيْهِم مِّنْ أَنفُسِهِمْ ۖ وَجِئْنَا بِكَ شَهِيدًا عَلَىٰ هَٰؤُلَاءِ ۚ وَنَزَّلْنَا عَلَيْكَ الْكِتَابَ تِبْيَانًا لِّكُلِّ شَيْءٍ وَهُدًى وَرَحْمَةً وَبُشْرَىٰ لِلْمُسْلِمِينَ","text_tajweed":"وَيَوْمَ نَ[q:7536[بْ]عَثُ فِى كُلِّ أُ[g[مّ]َ[f:7537[ةٍ ش]َهِيدًا عَلَيْه[w:4082[ِم م]ِّنْ أَ[f:568[نف]ُسِهِمْ‌ۖ وَجِئْنَا بِكَ شَهِيدًا عَلَىٰ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ‌ۚ وَنَزَّلْنَا عَلَيْكَ [h:1723[ٱ]لْكِتَ[n[ـٰ]بَ تِ[q:7549[بْ]يَ[n[ـٰ][u:7550[نًا ل]ِّكُلِّ ش[a:4536[َىْءٍ و]َهُ[a:4537[دًى و]َرَحْمَ[a:7551[ةً و]َبُشْرَىٰ لِلْمُسْلِم[p[ِي]نَ","translation_en":"And on the day when We will raise up in every people a witness against them from among themselves, and bring you as a witness against these-- and We have revealed the Book to you explaining clearly everything, and a guidance and mercy and good news for those who submit.","translation_id":"Dan (ingatlah) pada hari (ketika) Kami bangkitkan pada setiap umat seorang saksi atas mereka dari mereka sendiri, dan Kami datangkan engkau (Muhammad) menjadi saksi atas mereka. Dan Kami turunkan Kitab (Al-Qur'an) kepadamu untuk menjelaskan segala sesuatu, sebagai petunjuk, serta rahmat dan kabar gembira bagi orang yang berserah diri (Muslim).","hasanah_per_verse":1030},{"text_madani":"إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ وَإِيتَاءِ ذِي الْقُرْبَىٰ وَيَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنكَرِ وَالْبَغْيِ ۚ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ","text_tajweed":"۞ إِ[g[نّ]َ [h:80[ٱ]للَّهَ يَأْمُرُ بِ[h:1661[ٱ]لْعَ[q:1661[دْ]لِ وَ[h:7552[ٱ]لْإِحْسَ[n[ـٰ]نِ وَإِيتَآىِٕ ذِى [h:2775[ٱ]لْقُرْبَىٰ وَيَنْهَىٰ عَنِ [h:7553[ٱ]لْفَحْش[o[َا]ٓءِ وَ[h:7554[ٱ]لْمُ[f:7554[نك]َرِ وَ[h:7555[ٱ]لْبَغْىِ‌ۚ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّر[p[ُو]نَ","translation_en":"Surely Allah enjoins the doing of justice and the doing of good (to others) and the giving to the kindred, and He forbids indecency and evil and rebellion; He admonishes you that you may be mindful.","translation_id":"Sesungguhnya Allah menyuruh (kamu) berlaku adil dan berbuat kebajikan, memberi bantuan kepada kerabat, dan Dia melarang (melakukan) perbuatan keji, kemungkaran, dan permusuhan. Dia memberi pengajaran kepadamu agar kamu dapat mengambil pelajaran.","hasanah_per_verse":810},{"text_madani":"وَأَوْفُوا بِعَهْدِ اللَّهِ إِذَا عَاهَدتُّمْ وَلَا تَنقُضُوا الْأَيْمَانَ بَعْدَ تَوْكِيدِهَا وَقَدْ جَعَلْتُمُ اللَّهَ عَلَيْكُمْ كَفِيلًا ۚ إِنَّ اللَّهَ يَعْلَمُ مَا تَفْعَلُونَ","text_tajweed":"وَأَوْفُو[s[اْ] بِعَهْدِ [h:2038[ٱ]للَّهِ إِذَا عَ[n[ـٰ]هَ[d:5449[د]تُّمْ وَلَا تَ[f:7556[نق]ُضُو[s[اْ] [h:7557[ٱ]لْأَيْمَ[n[ـٰ]نَ بَعْدَ تَوْكِيدِهَا وَقَ[q:387[دْ] جَعَلْتُمُ [h:7558[ٱ]للَّهَ عَلَيْكُمْ كَفِيلاً‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ يَعْلَمُ مَا تَفْعَل[p[ُو]نَ","translation_en":"And fulfill the covenant of Allah when you have made a covenant, and do not break the oaths after making them fast, and you have indeed made Allah a surety for you; surely Allah knows what you do.","translation_id":"Dan tepatilah janji dengan Allah apabila kamu berjanji dan janganlah kamu melanggar sumpah, setelah diikrarkan, sedang kamu telah menjadikan Allah sebagai saksimu (terhadap sumpah itu). Sesungguhnya Allah mengetahui apa yang kamu perbuat.","hasanah_per_verse":890},{"text_madani":"وَلَا تَكُونُوا كَالَّتِي نَقَضَتْ غَزْلَهَا مِن بَعْدِ قُوَّةٍ أَنكَاثًا تَتَّخِذُونَ أَيْمَانَكُمْ دَخَلًا بَيْنَكُمْ أَن تَكُونَ أُمَّةٌ هِيَ أَرْبَىٰ مِنْ أُمَّةٍ ۚ إِنَّمَا يَبْلُوكُمُ اللَّهُ بِهِ ۚ وَلَيُبَيِّنَنَّ لَكُمْ يَوْمَ الْقِيَامَةِ مَا كُنتُمْ فِيهِ تَخْتَلِفُونَ","text_tajweed":"وَلَا تَكُونُو[s[اْ] كَ[h:7559[ٱ]لَّتِى نَقَضَتْ غَزْلَهَا م[i:146[ِنۢ ب]َعْدِ قُوَّةٍ أَ[f:7560[نك]َ[n[ـٰ][f:7561[ثًا ت]َتَّخِذُونَ أَيْمَ[n[ـٰ]نَكُمْ دَخَل[i:7562[اَۢ ب]َيْنَكُمْ أَ[f:1566[ن ت]َكُونَ أُ[g[مّ]َةٌ هِىَ أَرْبَىٰ مِنْ أُ[g[مّ]َةٍ‌ۚ إِ[g[نّ]َمَا يَ[q:7563[بْ]لُوكُمُ [h:7564[ٱ]للَّهُ بِه[n[ِۦ]‌ۚ وَلَيُبَيِّنَ[g[نّ]َ لَكُمْ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ مَا كُ[f:100[نت]ُمْ فِيهِ تَخْتَلِف[p[ُو]نَ","translation_en":"And be not like her who unravels her yarn, disintegrating it into pieces after she has spun it strongly. You make your oaths to be means of deceit between you because (one) nation is more numerous than (another) nation. Allah only tries you by this; and He will most certainly make clear to you on the resurrection day that about which you differed.","translation_id":"Dan janganlah kamu seperti seorang perempuan yang menguraikan benangnya yang sudah dipintal dengan kuat, menjadi cerai berai kembali. Kamu menjadikan sumpah (perjanjian)mu sebagai alat penipu di antaramu, disebabkan adanya satu golongan yang lebih banyak jumlahnya dari golongan yang lain. Allah hanya menguji kamu dengan hal itu, dan pasti pada hari Kiamat akan dijelaskan-Nya kepadamu apa yang dahulu kamu perselisihkan itu.","hasanah_per_verse":1310},{"text_madani":"وَلَوْ شَاءَ اللَّهُ لَجَعَلَكُمْ أُمَّةً وَاحِدَةً وَلَٰكِن يُضِلُّ مَن يَشَاءُ وَيَهْدِي مَن يَشَاءُ ۚ وَلَتُسْأَلُنَّ عَمَّا كُنتُمْ تَعْمَلُونَ","text_tajweed":"وَلَوْ ش[o[َا]ٓءَ [h:78[ٱ]للَّهُ لَجَعَلَكُمْ أُ[g[مّ]َ[a:1159[ةً و][n[َٲ]حِدَ[a:3601[ةً و]َلَ[n[ـٰ]ك[a:7565[ِن ي]ُضِلُّ م[a:476[َن ي]َش[o[َا]ٓءُ وَيَهْدِى م[a:476[َن ي]َش[o[َا]ٓءُ‌ۚ وَلَتُسْــَٔلُ[g[نّ]َ عَ[g[مّ]َا كُ[f:100[نت]ُمْ تَعْمَل[p[ُو]نَ","translation_en":"And if Allah please He would certainly make you a single nation, but He causes to err whom He pleases and guides whom He pleases; and most certainly you will be questioned as to what you did.","translation_id":"Dan jika Allah menghendaki niscaya Dia menjadikan kamu satu umat (saja), tetapi Dia menyesatkan siapa yang Dia kehendaki dan memberi petunjuk kepada siapa yang Dia kehendaki. Tetapi kamu pasti akan ditanya tentang apa yang telah kamu kerjakan.","hasanah_per_verse":680},{"text_madani":"وَلَا تَتَّخِذُوا أَيْمَانَكُمْ دَخَلًا بَيْنَكُمْ فَتَزِلَّ قَدَمٌ بَعْدَ ثُبُوتِهَا وَتَذُوقُوا السُّوءَ بِمَا صَدَدتُّمْ عَن سَبِيلِ اللَّهِ ۖ وَلَكُمْ عَذَابٌ عَظِيمٌ","text_tajweed":"وَلَا تَتَّخِذ[o[ُوٓ][s[اْ] أَيْمَ[n[ـٰ]نَكُمْ دَخَل[i:7562[اَۢ ب]َيْنَكُمْ فَتَزِلَّ قَدَ[i:7566[مُۢ ب]َعْدَ ثُبُوتِهَا وَتَذُوقُو[s[اْ] [h:7567[ٱ][l[ل]سّ[o[ُو]ٓءَ بِمَا صَدَ[d:7568[د]تُّمْ عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ‌ۖ وَلَكُمْ عَذَابٌ عَظ[p[ِي]مٌ","translation_en":"And do not make your oaths a means of deceit between you, lest a foot should slip after its stability and you should taste evil because you turned away from Allah's way and grievous punishment be your (lot).","translation_id":"Dan janganlah kamu jadikan sumpah-sumpahmu sebagai alat penipu di antaramu, yang menyebabkan kaki(mu) tergelincir setelah tegaknya (kukuh), dan kamu akan merasakan keburukan (di dunia) karena kamu menghalangi (manusia) dari jalan Allah, dan kamu akan mandapat azab yang besar.","hasanah_per_verse":830},{"text_madani":"وَلَا تَشْتَرُوا بِعَهْدِ اللَّهِ ثَمَنًا قَلِيلًا ۚ إِنَّمَا عِندَ اللَّهِ هُوَ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ","text_tajweed":"وَلَا تَشْتَرُو[s[اْ] بِعَهْدِ [h:2038[ٱ]للَّهِ ثَمَ[f:208[نًا ق]َلِيلاً‌ۚ إِ[g[نّ]َمَا عِ[f:264[ند]َ [h:408[ٱ]للَّهِ هُوَ خَيْ[u:263[رٌ ل]َّكُمْ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ تَعْلَم[p[ُو]نَ","translation_en":"And do not take a small price in exchange for Allah's covenant; surely what is with Allah is better for you, did you but know.","translation_id":"Dan janganlah kamu jual perjanjian (dengan) Allah dengan harga murah, karena sesungguhnya apa yang ada di sisi Allah lebih baik bagimu jika kamu mengetahui.","hasanah_per_verse":570},{"text_madani":"مَا عِندَكُمْ يَنفَدُ ۖ وَمَا عِندَ اللَّهِ بَاقٍ ۗ وَلَنَجْزِيَنَّ الَّذِينَ صَبَرُوا أَجْرَهُم بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ","text_tajweed":"مَا عِ[f:4508[ند]َكُمْ يَ[f:7569[نف]َدُ‌ۖ وَمَا عِ[f:264[ند]َ [h:408[ٱ]للَّهِ بَا[a:7570[قٍ‌ۗ و]َلَنَ[q:7571[جْ]زِيَ[g[نّ]َ [h:7572[ٱ]لَّذِينَ صَبَر[o[ُوٓ][s[اْ] أَ[q:7573[جْ]رَه[c:7574[ُم ب]ِأَحْسَنِ مَا كَانُو[s[اْ] يَعْمَل[p[ُو]نَ","translation_en":"What is with you passes away and what is with Allah is enduring; and We will most certainly give to those who are patient their reward for the best of what they did.","translation_id":"Apa yang ada di sisimu akan lenyap, dan apa yang ada di sisi Allah adalah kekal. Dan Kami pasti akan memberi balasan kepada orang yang sabar dengan pahala yang lebih baik dari apa yang telah mereka kerjakan.","hasanah_per_verse":640},{"text_madani":"مَنْ عَمِلَ صَالِحًا مِّن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً ۖ وَلَنَجْزِيَنَّهُمْ أَجْرَهُم بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ","text_tajweed":"مَنْ عَمِلَ صَ[n[ـٰ]لِ[a:7575[حًا م]ِّ[f:2511[ن ذ]َكَرٍ أَوْ أُ[f:1867[نث]َىٰ وَهُوَ مُؤْمِ[f:7576[نٌ ف]َلَنُحْيِيَ[g[نّ]َهُ[n[ۥ] حَيَ[s[و][n[ٲ][f:7577[ةً ط]َيِّبَ[a:7578[ةً‌ۖ و]َلَنَ[q:7579[جْ]زِيَ[g[نّ]َهُمْ أَ[q:7573[جْ]رَه[c:7574[ُم ب]ِأَحْسَنِ مَا كَانُو[s[اْ] يَعْمَل[p[ُو]نَ","translation_en":"Whoever does good whether male or female and he is a believer, We will most certainly make him live a happy life, and We will most certainly give them their reward for the best of what they did.","translation_id":"Barangsiapa mengerjakan kebajikan, baik laki-laki maupun perempuan dalam keadaan beriman, maka pasti akan Kami berikan kepadanya kehidupan yang baik dan akan Kami beri balasan dengan pahala yang lebih baik dari apa yang telah mereka kerjakan.","hasanah_per_verse":760},{"text_madani":"فَإِذَا قَرَأْتَ الْقُرْآنَ فَاسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ","text_tajweed":"فَإِذَا قَرَأْتَ [h:7580[ٱ]لْقُرْءَانَ فَ[h:5208[ٱ]سْتَعِذْ بِ[h:32[ٱ]للَّهِ مِنَ [h:1870[ٱ][l[ل]شَّيْطَ[n[ـٰ]نِ [h:1871[ٱ][l[ل]رَّج[p[ِي]مِ","translation_en":"So when you recite the Quran, seek refuge with Allah from the accursed Shaitan,","translation_id":"Maka apabila engkau (Muhammad) hendak membaca Al-Qur'an, mohonlah perlindungan kepada Allah dari setan yang terkutuk.","hasanah_per_verse":400},{"text_madani":"إِنَّهُ لَيْسَ لَهُ سُلْطَانٌ عَلَى الَّذِينَ آمَنُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ","text_tajweed":"إِ[g[نّ]َهُ[n[ۥ] لَيْسَ لَهُ[n[ۥ] سُلْطَ[n[ـٰ]نٌ عَلَى [h:289[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَلَىٰ رَبِّهِمْ يَتَوَكَّل[p[ُو]نَ","translation_en":"Surely he has no authority over those who believe and rely on their Lord.","translation_id":"Sungguh, setan itu tidak akan berpengaruh terhadap orang yang beriman dan bertawakal kepada Tuhan.","hasanah_per_verse":410},{"text_madani":"إِنَّمَا سُلْطَانُهُ عَلَى الَّذِينَ يَتَوَلَّوْنَهُ وَالَّذِينَ هُم بِهِ مُشْرِكُونَ","text_tajweed":"إِ[g[نّ]َمَا سُلْطَ[n[ـٰ]نُهُ[n[ۥ] عَلَى [h:289[ٱ]لَّذِينَ يَتَوَلَّوْنَهُ[n[ۥ] وَ[h:37[ٱ]لَّذِينَ ه[c:7581[ُم ب]ِه[n[ِۦ] مُشْرِك[p[ُو]نَ","translation_en":"His authority is only over those who befriend him and those who associate others with Him.","translation_id":"Pengaruhnya hanyalah terhadap orang yang menjadikannya pemimpin dan terhadap orang yang mempersekutukannya dengan Allah.","hasanah_per_verse":410},{"text_madani":"وَإِذَا بَدَّلْنَا آيَةً مَّكَانَ آيَةٍ ۙ وَاللَّهُ أَعْلَمُ بِمَا يُنَزِّلُ قَالُوا إِنَّمَا أَنتَ مُفْتَرٍ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ","text_tajweed":"وَإِذَا بَدَّلْن[o[َآ] ءَايَ[a:7582[ةً م]َّكَانَ ءَايَ[a:7583[ةٍ‌ۙ و]َ[h:72[ٱ]للَّهُ أَعْلَمُ بِمَا يُنَزِّلُ قَال[o[ُوٓ][s[اْ] إِ[g[نّ]َم[o[َآ] أَ[f:169[نت]َ مُفْتَ[i:7584[رِۭ‌ۚ ب]َلْ أَكْثَرُهُمْ لَا يَعْلَم[p[ُو]نَ","translation_en":"And when We change (one) communication for (another) communication, and Allah knows best what He reveals, they say: You are only a forger. Nay, most of them do not know.","translation_id":"Dan apabila Kami mengganti suatu ayat dengan ayat yang lain, dan Allah lebih mengetahui apa yang diturunkan-Nya, mereka berkata, “Sesungguhnya engkau (Muhammad) hanya mengada-ada saja.” Sebenarnya kebanyakan mereka tidak mengetahui.","hasanah_per_verse":670},{"text_madani":"قُلْ نَزَّلَهُ رُوحُ الْقُدُسِ مِن رَّبِّكَ بِالْحَقِّ لِيُثَبِّتَ الَّذِينَ آمَنُوا وَهُدًى وَبُشْرَىٰ لِلْمُسْلِمِينَ","text_tajweed":"قُلْ نَزَّلَهُ[n[ۥ] رُوحُ [h:7585[ٱ]لْقُدُسِ م[u:770[ِن ر]َّبِّكَ بِ[h:370[ٱ]لْحَقِّ لِيُثَبِّتَ [h:7586[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَهُ[a:510[دًى و]َبُشْرَىٰ لِلْمُسْلِم[p[ِي]نَ","translation_en":"Say: The Holy spirit has revealed it from your Lord with the truth, that it may establish those who believe and as a guidance and good news for those who submit.","translation_id":"Katakanlah, “Rohulkudus (Jibril) menurunkan Al-Qur'an itu dari Tuhanmu dengan kebenaran, untuk meneguhkan (hati) orang yang telah beriman, dan menjadi petunjuk serta kabar gembira bagi orang yang berserah diri (kepada Allah).”","hasanah_per_verse":560},{"text_madani":"وَلَقَدْ نَعْلَمُ أَنَّهُمْ يَقُولُونَ إِنَّمَا يُعَلِّمُهُ بَشَرٌ ۗ لِّسَانُ الَّذِي يُلْحِدُونَ إِلَيْهِ أَعْجَمِيٌّ وَهَٰذَا لِسَانٌ عَرَبِيٌّ مُّبِينٌ","text_tajweed":"وَلَقَ[q:341[دْ] نَعْلَمُ أَ[g[نّ]َهُمْ يَقُولُونَ إِ[g[نّ]َمَا يُعَلِّمُهُ[n[ۥ] بَشَ[u:7587[رٌ‌ۗ ل]ِّسَانُ [h:7588[ٱ]لَّذِى يُلْحِدُونَ إِلَيْهِ أَعْجَمِ[a:7589[ىٌّ و]َهَ[n[ـٰ]ذَا لِسَانٌ عَرَبِ[a:7590[ىٌّ م]ُّب[p[ِي]نٌ","translation_en":"And certainly We know that they say: Only a mortal teaches him. The tongue of him whom they reproach is barbarous, and this is clear Arabic tongue.","translation_id":"Dan sesungguhnya Kami mengetahui bahwa mereka berkata, “Sesungguhnya Al-Qur'an itu hanya diajarkan oleh seorang manusia kepadanya (Muhammad).” Bahasa orang yang mereka tuduhkan (bahwa Muhammad belajar) kepadanya adalah bahasa ‘Ajam, padahal ini (Al-Qur'an) adalah dalam bahasa Arab yang jelas.","hasanah_per_verse":690},{"text_madani":"إِنَّ الَّذِينَ لَا يُؤْمِنُونَ بِآيَاتِ اللَّهِ لَا يَهْدِيهِمُ اللَّهُ وَلَهُمْ عَذَابٌ أَلِيمٌ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ لَا يُؤْمِنُونَ بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ لَا يَهْدِيهِمُ [h:7591[ٱ]للَّهُ وَلَهُمْ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"(As for) those who do not believe in Allah's communications, surely Allah will not guide them, and they shall have a painful punishment.","translation_id":"Sesungguhnya orang yang tidak beriman kepada ayat-ayat Allah (Al-Qur'an), Allah tidak akan memberi petunjuk kepada mereka dan mereka akan mendapat azab yang pedih.","hasanah_per_verse":480},{"text_madani":"إِنَّمَا يَفْتَرِي الْكَذِبَ الَّذِينَ لَا يُؤْمِنُونَ بِآيَاتِ اللَّهِ ۖ وَأُولَٰئِكَ هُمُ الْكَاذِبُونَ","text_tajweed":"إِ[g[نّ]َمَا يَفْتَرِى [h:7592[ٱ]لْكَذِبَ [h:7593[ٱ]لَّذِينَ لَا يُؤْمِنُونَ بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ‌ۖ وَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:7594[ٱ]لْكَ[n[ـٰ]ذِب[p[ُو]نَ","translation_en":"Only they forge the lie who do not believe in Allah's communications, and these are the liars.","translation_id":"Sesungguhnya yang mengada-adakan kebohongan, hanyalah orang yang tidak beriman kepada ayat-ayat Allah, dan mereka itulah pembohong.","hasanah_per_verse":520},{"text_madani":"مَن كَفَرَ بِاللَّهِ مِن بَعْدِ إِيمَانِهِ إِلَّا مَنْ أُكْرِهَ وَقَلْبُهُ مُطْمَئِنٌّ بِالْإِيمَانِ وَلَٰكِن مَّن شَرَحَ بِالْكُفْرِ صَدْرًا فَعَلَيْهِمْ غَضَبٌ مِّنَ اللَّهِ وَلَهُمْ عَذَابٌ عَظِيمٌ","text_tajweed":"مَ[f:1457[ن ك]َفَرَ بِ[h:32[ٱ]للَّهِ م[i:146[ِنۢ ب]َعْدِ إِيمَ[n[ـٰ]نِه[o[ِۦٓ] إِلَّا مَنْ أُكْرِهَ وَقَلْبُهُ[n[ۥ] مُ[q:7595[طْ]مَئِن[i:7596[ُّۢ ب]ِ[h:562[ٱ]لْإِيمَ[n[ـٰ]نِ وَلَ[n[ـٰ]ك[a:7597[ِن م]َّ[f:7598[ن ش]َرَحَ بِ[h:2055[ٱ]لْكُفْرِ صَ[q:7599[دْ][f:7600[رًا ف]َعَلَيْهِمْ غَضَ[a:7601[بٌ م]ِّنَ [h:321[ٱ]للَّهِ وَلَهُمْ عَذَابٌ عَظ[p[ِي]مٌ","translation_en":"He who disbelieves in Allah after his having believed, not he who is compelled while his heart is at rest on account of faith, but he who opens (his) breast to disbelief-- on these is the wrath of Allah, and they shall have a grievous chastisement.","translation_id":"Barangsiapa kafir kepada Allah setelah dia beriman (dia mendapat kemurkaan Allah), kecuali orang yang dipaksa kafir padahal hatinya tetap tenang dalam beriman (dia tidak berdosa), tetapi orang yang melapangkan dadanya untuk kekafiran, maka kemurkaan Allah menimpanya dan mereka akan mendapat azab yang besar.","hasanah_per_verse":940},{"text_madani":"ذَٰلِكَ بِأَنَّهُمُ اسْتَحَبُّوا الْحَيَاةَ الدُّنْيَا عَلَى الْآخِرَةِ وَأَنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الْكَافِرِينَ","text_tajweed":"ذ[n[َٲ]لِكَ بِأَ[g[نّ]َهُمُ [h:7602[ٱ]سْتَحَبُّو[s[اْ] [h:7603[ٱ]لْحَيَ[s[و][n[ٲ]ةَ [h:446[ٱ][l[ل]دُّنْيَا عَلَى [h:7042[ٱ]لْأَخِرَةِ وَأَ[g[نّ]َ [h:859[ٱ]للَّهَ لَا يَهْدِى [h:1504[ٱ]لْقَوْمَ [h:1557[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"This is because they love this world's life more than the hereafter, and because Allah does not guide the unbelieving people.","translation_id":"Yang demikian itu disebabkan karena mereka lebih mencintai kehidupan di dunia daripada akhirat, dan Allah tidak memberi petunjuk kepada kaum yang kafir.","hasanah_per_verse":620},{"text_madani":"أُولَٰئِكَ الَّذِينَ طَبَعَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَسَمْعِهِمْ وَأَبْصَارِهِمْ ۖ وَأُولَٰئِكَ هُمُ الْغَافِلُونَ","text_tajweed":"أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ [h:51[ٱ]لَّذِينَ طَبَعَ [h:3271[ٱ]للَّهُ عَلَىٰ قُلُوبِهِمْ وَسَمْعِهِمْ وَأَ[q:79[بْ]صَ[n[ـٰ]رِهِمْ‌ۖ وَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:5154[ٱ]لْغَ[n[ـٰ]فِل[p[ُو]نَ","translation_en":"These are they on whose hearts and their hearing and their eyes Allah has set a seal, and these are the heedless ones.","translation_id":"Mereka itulah orang yang hati, pendengaran, dan penglihatannya telah dikunci oleh Allah. Mereka itulah orang yang lalai.","hasanah_per_verse":560},{"text_madani":"لَا جَرَمَ أَنَّهُمْ فِي الْآخِرَةِ هُمُ الْخَاسِرُونَ","text_tajweed":"لَا جَرَمَ أَ[g[نّ]َهُمْ فِى [h:536[ٱ]لْأَخِرَةِ هُمُ [h:150[ٱ]لْخَ[n[ـٰ]سِر[p[ُو]نَ","translation_en":"No doubt that in the hereafter they will be the losers.","translation_id":"Pastilah mereka termasuk orang yang rugi di akhirat nanti.","hasanah_per_verse":270},{"text_madani":"ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ هَاجَرُوا مِن بَعْدِ مَا فُتِنُوا ثُمَّ جَاهَدُوا وَصَبَرُوا إِنَّ رَبَّكَ مِن بَعْدِهَا لَغَفُورٌ رَّحِيمٌ","text_tajweed":"ثُ[g[مّ]َ إِ[g[نّ]َ رَبَّكَ لِلَّذِينَ هَاجَرُو[s[اْ] م[i:146[ِنۢ ب]َعْدِ مَا فُتِنُو[s[اْ] ثُ[g[مّ]َ جَ[n[ـٰ]هَدُو[s[اْ] وَصَبَر[o[ُوٓ][s[اْ] إِ[g[نّ]َ رَبَّكَ م[i:5039[ِنۢ ب]َعْدِهَا لَغَفُو[u:4578[رٌ ر]َّح[p[ِي]مٌ","translation_en":"Yet surely your Lord, with respect to those who fly after they are persecuted, then they struggle hard and are patient, most surely your Lord after that is Forgiving, Merciful.","translation_id":"Kemudian Tuhanmu (pelindung) bagi orang yang berhijrah setelah menderita cobaan, kemudian mereka berjihad dan bersabar, sungguh, Tuhanmu setelah itu benar-benar Maha Pengampun, Maha Penyayang.","hasanah_per_verse":650},{"text_madani":"يَوْمَ تَأْتِي كُلُّ نَفْسٍ تُجَادِلُ عَن نَّفْسِهَا وَتُوَفَّىٰ كُلُّ نَفْسٍ مَّا عَمِلَتْ وَهُمْ لَا يُظْلَمُونَ","text_tajweed":"۞ يَوْمَ تَأْتِى كُلُّ نَفْ[f:7604[سٍ ت]ُجَ[n[ـٰ]دِلُ ع[a:7605[َن ن]َّفْسِهَا وَتُوَفَّىٰ كُلُّ نَفْ[a:1654[سٍ م]َّا عَمِلَتْ وَهُمْ لَا يُظْلَم[p[ُو]نَ","translation_en":"(Remember) the day when every soul shall come, pleading for itself and every soul shall be paid in full what it has done, and they shall not be dealt with unjustly.","translation_id":"(Ingatlah) pada hari (ketika) setiap orang datang untuk membela dirinya sendiri dan bagi setiap orang diberi (balasan) penuh sesuai dengan apa yang telah dikerjakannya, dan mereka tidak dizhalimi (dirugikan).","hasanah_per_verse":510},{"text_madani":"وَضَرَبَ اللَّهُ مَثَلًا قَرْيَةً كَانَتْ آمِنَةً مُّطْمَئِنَّةً يَأْتِيهَا رِزْقُهَا رَغَدًا مِّن كُلِّ مَكَانٍ فَكَفَرَتْ بِأَنْعُمِ اللَّهِ فَأَذَاقَهَا اللَّهُ لِبَاسَ الْجُوعِ وَالْخَوْفِ بِمَا كَانُوا يَصْنَعُونَ","text_tajweed":"وَضَرَبَ [h:7509[ٱ]للَّهُ مَثَل[f:7606[اً ق]َرْيَ[f:7607[ةً ك]َانَتْ ءَامِنَ[a:7608[ةً م]ُّ[q:7609[طْ]مَئِ[g[نّ]َ[a:7610[ةً ي]َأْتِيهَا رِزْقُهَا رَغَ[a:7611[دًا م]ِّ[f:843[ن ك]ُلِّ مَكَا[f:7612[نٍ ف]َكَفَرَتْ بِأَنْعُمِ [h:7613[ٱ]للَّهِ فَأَذ[n[َٲ]قَهَا [h:7614[ٱ]للَّهُ لِبَاسَ [h:7615[ٱ]لْجُوعِ وَ[h:7616[ٱ]لْخَوْفِ بِمَا كَانُو[s[اْ] يَصْنَع[p[ُو]نَ","translation_en":"And Allah sets forth a parable: (Consider) a town safe and secure to which its means of subsistence come in abundance from every quarter; but it became ungrateful to Allah's favors, therefore Allah made it to taste the utmost degree of hunger and fear because of what they wrought.","translation_id":"sebuah negeri yang dahulunya aman lagi tenteram, rezeki datang kepadanya melimpah ruah dari segenap tempat, tetapi (pen-duduk)nya mengingkari nikmat-nikmat Allah, karena itu Allah menimpakan kepada mereka bencana kelaparan dan ketakutan, disebabkan apa yang mereka perbuat.","hasanah_per_verse":1070},{"text_madani":"وَلَقَدْ جَاءَهُمْ رَسُولٌ مِّنْهُمْ فَكَذَّبُوهُ فَأَخَذَهُمُ الْعَذَابُ وَهُمْ ظَالِمُونَ","text_tajweed":"وَلَقَ[q:341[دْ] ج[o[َا]ٓءَهُمْ رَسُو[a:7617[لٌ م]ِّنْهُمْ فَكَذَّبُوهُ فَأَخَذَهُمُ [h:7618[ٱ]لْعَذَابُ وَهُمْ ظَ[n[ـٰ]لِم[p[ُو]نَ","translation_en":"And certainly there came to them a Messenger from among them, but they rejected him, so the punishment overtook them while they were unjust.","translation_id":"Dan sungguh, telah datang kepada mereka seorang rasul dari (kalangan) mereka sendiri, tetapi mereka mendustakannya, karena itu mereka ditimpa azab dan mereka adalah orang yang zhalim.","hasanah_per_verse":440},{"text_madani":"فَكُلُوا مِمَّا رَزَقَكُمُ اللَّهُ حَلَالًا طَيِّبًا وَاشْكُرُوا نِعْمَتَ اللَّهِ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ","text_tajweed":"فَكُلُو[s[اْ] مِ[g[مّ]َا رَزَقَكُمُ [h:3751[ٱ]للَّهُ حَلَ[n[ـٰ]ل[f:870[اً ط]َيِّ[a:7619[بًا و]َ[h:783[ٱ]شْكُرُو[s[اْ] نِعْمَتَ [h:1300[ٱ]للَّهِ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ إِيَّاهُ تَعْبُد[p[ُو]نَ","translation_en":"Therefore eat of what Allah has given you, lawful and good (things), and give thanks for Allah's favor if Him do you serve.","translation_id":"Maka makanlah yang halal lagi baik dari rezeki yang telah diberikan Allah kepadamu; dan syukurilah nikmat Allah, jika kamu hanya menyembah kepada-Nya.","hasanah_per_verse":570},{"text_madani":"إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنزِيرِ وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ ۖ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَلَا عَادٍ فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ","text_tajweed":"إِ[g[نّ]َمَا حَرَّمَ عَلَيْكُمُ [h:882[ٱ]لْمَيْتَةَ وَ[h:883[ٱ][l[ل]دَّمَ وَلَحْمَ [h:884[ٱ]لْخِ[f:885[نز]ِيرِ وَم[o[َآ] أُهِلَّ لِغَيْرِ [h:886[ٱ]للَّهِ بِه[n[ِۦ]‌ۖ فَمَنِ [h:887[ٱ]ضْطُرَّ غَيْرَ بَا[a:888[غٍ و]َلَا عَا[f:4493[دٍ ف]َإِ[g[نّ]َ [h:513[ٱ]للَّهَ غَفُو[u:890[رٌ ر]َّح[p[ِي]مٌ","translation_en":"He has only forbidden you what dies of itself and blood and flesh of swine and that over which any other name than that of Allah has been invoked, but whoever is driven to necessity, not desiring nor exceeding the limit, then surely Allah is Forgiving, Merciful.","translation_id":"Sesungguhnya Allah hanya mengharamkan atasmu bangkai, darah, daging babi, dan (hewan) yang disembelih dengan (menyebut nama) selain Allah, tetapi barangsiapa terpaksa (memakannya) bukan karena menginginkannya dan tidak (pula) melampaui batas, maka sungguh, Allah Maha Pengampun, Maha Penyayang.","hasanah_per_verse":840},{"text_madani":"وَلَا تَقُولُوا لِمَا تَصِفُ أَلْسِنَتُكُمُ الْكَذِبَ هَٰذَا حَلَالٌ وَهَٰذَا حَرَامٌ لِّتَفْتَرُوا عَلَى اللَّهِ الْكَذِبَ ۚ إِنَّ الَّذِينَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ لَا يُفْلِحُونَ","text_tajweed":"وَلَا تَقُولُو[s[اْ] لِمَا تَصِفُ أَلْسِنَتُكُمُ [h:7620[ٱ]لْكَذِبَ هَ[n[ـٰ]ذَا حَلَ[n[ـٰ][a:7621[لٌ و]َهَ[n[ـٰ]ذَا حَرَا[u:7622[مٌ ل]ِّتَفْتَرُو[s[اْ] عَلَى [h:412[ٱ]للَّهِ [h:2035[ٱ]لْكَذِبَ‌ۚ إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ يَفْتَرُونَ عَلَى [h:412[ٱ]للَّهِ [h:2035[ٱ]لْكَذِبَ لَا يُفْلِح[p[ُو]نَ","translation_en":"And, for what your tongues describe, do not utter the lie, (saying) This is lawful and this is unlawful, in order to forge a lie against Allah; surely those who forge the lie against Allah shall not prosper.","translation_id":"Dan janganlah kamu mengatakan terhadap apa yang disebut-sebut oleh lidahmu secara dusta ”Ini halal dan ini haram,” untuk mengada-adakan kebohongan terhadap Allah. Sesungguhnya orang yang mengada-adakan kebohongan terhadap Allah tidak akan beruntung.","hasanah_per_verse":940},{"text_madani":"مَتَاعٌ قَلِيلٌ وَلَهُمْ عَذَابٌ أَلِيمٌ","text_tajweed":"مَتَ[n[ـٰ][f:2520[عٌ ق]َلِي[a:7623[لٌ و]َلَهُمْ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"A little enjoyment and they shall have a painful punishment.","translation_id":"(Itu adalah) kesenangan yang sedikit; dan mereka akan mendapat azab yang pedih.","hasanah_per_verse":200},{"text_madani":"وَعَلَى الَّذِينَ هَادُوا حَرَّمْنَا مَا قَصَصْنَا عَلَيْكَ مِن قَبْلُ ۖ وَمَا ظَلَمْنَاهُمْ وَلَٰكِن كَانُوا أَنفُسَهُمْ يَظْلِمُونَ","text_tajweed":"وَعَلَى [h:958[ٱ]لَّذِينَ هَادُو[s[اْ] حَرَّمْنَا مَا قَصَصْنَا عَلَيْكَ مِ[f:128[ن ق]َ[q:129[بْ]لُ‌ۖ وَمَا ظَلَمْنَ[n[ـٰ]هُمْ وَلَ[n[ـٰ]كِ[f:276[ن ك]َان[o[ُوٓ][s[اْ] أَ[f:38[نف]ُسَهُمْ يَظْلِم[p[ُو]نَ","translation_en":"And for those who were Jews We prohibited what We have related to you already, and We did them no injustice, but they were unjust to themselves.","translation_id":"Dan terhadap orang Yahudi, Kami haramkan apa yang telah Kami ceritakan dahulu kepadamu (Muhammad). Kami tidak menzhalimi mereka, justru merekalah yang menzhalimi diri sendiri.","hasanah_per_verse":660},{"text_madani":"ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ عَمِلُوا السُّوءَ بِجَهَالَةٍ ثُمَّ تَابُوا مِن بَعْدِ ذَٰلِكَ وَأَصْلَحُوا إِنَّ رَبَّكَ مِن بَعْدِهَا لَغَفُورٌ رَّحِيمٌ","text_tajweed":"ثُ[g[مّ]َ إِ[g[نّ]َ رَبَّكَ لِلَّذِينَ عَمِلُو[s[اْ] [h:7624[ٱ][l[ل]سّ[o[ُو]ٓءَ بِجَهَ[n[ـٰ]لَ[f:2649[ةٍ ث]ُ[g[مّ]َ تَابُو[s[اْ] م[i:146[ِنۢ ب]َعْدِ ذ[n[َٲ]لِكَ وَأَصْلَح[o[ُوٓ][s[اْ] إِ[g[نّ]َ رَبَّكَ م[i:5039[ِنۢ ب]َعْدِهَا لَغَفُو[u:4578[رٌ ر]َّح[p[ِي]مٌ","translation_en":"Yet surely your Lord, with respect to those who do an evil in ignorance, then turn after that and make amends, most surely your Lord after that is Forgiving, Merciful.","translation_id":"Kemudian, sesungguhnya Tuhanmu (mengampuni) orang yang mengerjakan kesalahan karena kebodohannya, kemudian mereka bertobat setelah itu dan memperbaiki (dirinya), sungguh, Tuhanmu setelah itu benar-benar Maha Pengampun, Maha Penyayang.","hasanah_per_verse":710},{"text_madani":"إِنَّ إِبْرَاهِيمَ كَانَ أُمَّةً قَانِتًا لِّلَّهِ حَنِيفًا وَلَمْ يَكُ مِنَ الْمُشْرِكِينَ","text_tajweed":"إِ[g[نّ]َ إِ[q:1860[بْ]ر[n[َٲ]هِيمَ كَانَ أُ[g[مّ]َ[f:7625[ةً ق]َانِ[u:7626[تًا ل]ِّلَّهِ حَنِي[a:7627[فًا و]َلَمْ يَكُ مِنَ [h:699[ٱ]لْمُشْرِك[p[ِي]نَ","translation_en":"Surely Ibrahim was an exemplar, obedient to Allah, upright, and he was not of the polytheists.","translation_id":"Sungguh, Ibrahim adalah seorang imam (yang dapat dijadikan teladan), patuh kepada Allah dan hanif. Dan dia bukanlah termasuk orang musyrik (yang mempersekutukan Allah),","hasanah_per_verse":430},{"text_madani":"شَاكِرًا لِّأَنْعُمِهِ ۚ اجْتَبَاهُ وَهَدَاهُ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ","text_tajweed":"شَاكِ[u:7628[رًا ل]ِّأَنْعُمِهِ‌ۚ [h:7629[ٱ][q:7630[جْ]تَبَ[n[ـٰ]هُ وَهَدَ[n[ٮٰ]هُ إِلَىٰ صِر[n[َٲ][a:726[طٍ م]ُّسْتَق[p[ِي]مٍ","translation_en":"Grateful for His favors; He chose him and guided him on the right path.","translation_id":"dia mensyukuri nikmat-nikmat-Nya. Allah telah memilihnya dan menunjukinya ke jalan yang lurus.","hasanah_per_verse":350},{"text_madani":"وَآتَيْنَاهُ فِي الدُّنْيَا حَسَنَةً ۖ وَإِنَّهُ فِي الْآخِرَةِ لَمِنَ الصَّالِحِينَ","text_tajweed":"وَءَاتَيْنَ[n[ـٰ]هُ فِى [h:599[ٱ][l[ل]دُّنْيَا حَسَنَ[a:7631[ةً‌ۖ و]َإِ[g[نّ]َهُ[n[ۥ] فِى [h:536[ٱ]لْأَخِرَةِ لَمِنَ [h:686[ٱ][l[ل]صَّ[n[ـٰ]لِح[p[ِي]نَ","translation_en":"And We gave him good in this world, and in the next he will most surely be among the good.","translation_id":"Dan Kami berikan kepadanya kebaikan di dunia, dan sesungguhnya di akhirat dia termasuk orang yang shalih.","hasanah_per_verse":420},{"text_madani":"ثُمَّ أَوْحَيْنَا إِلَيْكَ أَنِ اتَّبِعْ مِلَّةَ إِبْرَاهِيمَ حَنِيفًا ۖ وَمَا كَانَ مِنَ الْمُشْرِكِينَ","text_tajweed":"ثُ[g[مّ]َ أَوْحَيْن[o[َآ] إِلَيْكَ أَنِ [h:7632[ٱ]تَّبِعْ مِلَّةَ إِ[q:1860[بْ]ر[n[َٲ]هِيمَ حَنِي[a:698[فًا‌ۖ و]َمَا كَانَ مِنَ [h:699[ٱ]لْمُشْرِك[p[ِي]نَ","translation_en":"Then We revealed to you: Follow the faith of Ibrahim, the upright one, and he was not of the polytheists.","translation_id":"Kemudian Kami wahyukan kepadamu (Muhammad), “Ikutilah agama Ibrahim yang lurus, dan dia bukanlah termasuk orang musyrik.”","hasanah_per_verse":490},{"text_madani":"إِنَّمَا جُعِلَ السَّبْتُ عَلَى الَّذِينَ اخْتَلَفُوا فِيهِ ۚ وَإِنَّ رَبَّكَ لَيَحْكُمُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ","text_tajweed":"إِ[g[نّ]َمَا جُعِلَ [h:7633[ٱ][l[ل]سَّ[q:7634[بْ]تُ عَلَى [h:289[ٱ]لَّذِينَ [h:899[ٱ]خْتَلَفُو[s[اْ] فِيهِ‌ۚ وَإِ[g[نّ]َ رَبَّكَ لَيَحْكُمُ بَيْنَهُمْ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ فِيمَا كَانُو[s[اْ] فِيهِ يَخْتَلِف[p[ُو]نَ","translation_en":"The Sabbath was ordained only for those who differed about it, and most surely your Lord will judge between them on the resurrection day concerning that about which they differed.","translation_id":"Sesungguhnya (menghormati) hari Sabtu hanya diwajibkan atas orang (Yahudi) yang memperselisihkannya. Dan sesungguhnya Tuhanmu pasti akan memberi keputusan di antara mereka pada hari Kiamat terhadap apa yang telah mereka perselisihkan itu.","hasanah_per_verse":750},{"text_madani":"ادْعُ إِلَىٰ سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ ۖ وَجَادِلْهُم بِالَّتِي هِيَ أَحْسَنُ ۚ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَن ضَلَّ عَن سَبِيلِهِ ۖ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ","text_tajweed":"ٱ[q:354[دْ]عُ إِلَىٰ سَبِيلِ رَبِّكَ بِ[h:7635[ٱ]لْحِكْمَةِ وَ[h:7636[ٱ]لْمَوْعِظَةِ [h:7637[ٱ]لْحَسَنَةِ‌ۖ وَجَ[n[ـٰ]دِلْه[c:7638[ُم ب]ِ[h:4526[ٱ]لَّتِى هِىَ أَحْسَنُ‌ۚ إِ[g[نّ]َ رَبَّكَ هُوَ أَعْلَمُ بِمَ[f:7639[ن ض]َلَّ عَ[f:4361[ن س]َبِيلِه[n[ِۦ]‌ۖ وَهُوَ أَعْلَمُ بِ[h:4362[ٱ]لْمُهْتَد[p[ِي]نَ","translation_en":"Call to the way of your Lord with wisdom and goodly exhortation, and have disputations with them in the best manner; surely your Lord best knows those who go astray from His path, and He knows best those who follow the right way.","translation_id":"Serulah (manusia) kepada jalan Tuhanmu dengan hikmah dan pengajaran yang baik, dan berdebatlah dengan mereka dengan cara yang baik. Sesungguhnya Tuhanmu, Dialah yang lebih mengetahui siapa yang sesat dari jalan-Nya dan Dialah yang lebih mengetahui siapa yang mendapat petunjuk.","hasanah_per_verse":910},{"text_madani":"وَإِنْ عَاقَبْتُمْ فَعَاقِبُوا بِمِثْلِ مَا عُوقِبْتُم بِهِ ۖ وَلَئِن صَبَرْتُمْ لَهُوَ خَيْرٌ لِّلصَّابِرِينَ","text_tajweed":"وَإِنْ عَاقَ[q:7640[بْ]تُمْ فَعَاقِبُو[s[اْ] بِمِثْلِ مَا عُوقِ[q:7641[بْ]ت[c:7642[ُم ب]ِه[n[ِۦ]‌ۖ وَلَئِ[f:7643[ن ص]َبَرْتُمْ لَهُوَ خَيْ[u:7644[رٌ ل]ِّلصَّ[n[ـٰ]بِر[p[ِي]نَ","translation_en":"And if you take your turn, then retaliate with the like of that with which you were afflicted; but if you are patient, it will certainly be best for those who are patient.","translation_id":"Dan jika kamu membalas, maka balaslah dengan (balasan) yang sama dengan siksaan yang ditimpakan kepadamu. Tetapi jika kamu bersabar, sesungguhnya itulah yang lebih baik bagi orang yang sabar.","hasanah_per_verse":530},{"text_madani":"وَاصْبِرْ وَمَا صَبْرُكَ إِلَّا بِاللَّهِ ۚ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ فِي ضَيْقٍ مِّمَّا يَمْكُرُونَ","text_tajweed":"وَ[h:9999[ٱ]صْبِرْ وَمَا صَ[q:7645[بْ]رُكَ إِلَّا بِ[h:32[ٱ]للَّهِ‌ۚ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ فِى ضَيْ[a:7646[قٍ م]ِّ[g[مّ]َا يَمْكُر[p[ُو]نَ","translation_en":"And be patient and your patience is not but by (the assistance of) Allah, and grieve not for them, and do not distress yourself at what they plan.","translation_id":"Dan bersabarlah (Muhammad) dan kesabaranmu itu semata-mata dengan pertolongan Allah dan janganlah engkau bersedih hati terhadap (kekafiran) mereka dan jangan (pula) bersempit dada terhadap tipu daya yang mereka rencanakan.","hasanah_per_verse":510},{"text_madani":"إِنَّ اللَّهَ مَعَ الَّذِينَ اتَّقَوا وَّالَّذِينَ هُم مُّحْسِنُونَ","text_tajweed":"إِ[g[نّ]َ [h:80[ٱ]للَّهَ مَعَ [h:2899[ٱ]لَّذِينَ [h:7007[ٱ]تَّقَو[s[اْ] وَّ[h:37[ٱ]لَّذِينَ ه[w:7647[ُم م]ُّحْسِن[p[ُو]نَ","translation_en":"Surely Allah is with those who guard (against evil) and those who do good (to others).","translation_id":"Sungguh, Allah beserta orang-orang yang bertakwa dan orang-orang yang berbuat kebaikan.","hasanah_per_verse":320}]}
