{"chapter_number":3,"name_simple":"Ali 'Imran","name_meaning":{"text":"The Family of ’Imrân","en":"The Family of ’Imrân","id":"Keluarga Imran"},"verses_count":200,"hasanah":149850,"verses":[{"text_madani":"الم","text_tajweed":"ا[m[لٓ][m[مٓ]","translation_en":"Alif Lam Mim.","translation_id":"Alif Lam Mim.","hasanah_per_verse":30},{"text_madani":"اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ","text_tajweed":"ٱللَّهُ ل[o[َآ] إِلَ[n[ـٰ]هَ إِلَّا هُوَ [h:1468[ٱ]لْحَىُّ [h:1469[ٱ]لْقَيّ[p[ُو]مُ","translation_en":"Allah, (there is) no god but He, the Everliving, the Self-subsisting by Whom all things subsist","translation_id":"Allah, tidak ada tuhan selain Dia. Yang Mahahidup, Yang terus-menerus mengurus (makhluk-Nya).","hasanah_per_verse":240},{"text_madani":"نَزَّلَ عَلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَأَنزَلَ التَّوْرَاةَ وَالْإِنجِيلَ","text_tajweed":"نَزَّلَ عَلَيْكَ [h:1723[ٱ]لْكِتَ[n[ـٰ]بَ بِ[h:370[ٱ]لْحَقِّ مُصَدِّ[u:206[قًا ل]ِّمَا بَيْنَ يَدَيْهِ وَأَ[f:91[نز]َلَ [h:1724[ٱ][l[ل]تَّوْرَ[n[ٮٰ]ةَ وَ[h:1725[ٱ]لْإِ[f:1725[نج][p[ِي]لَ","translation_en":"He has revealed to you the Book with truth, verifying that which is before it, and He revealed the Tavrat and the Injeel aforetime, a guidance for the people, and He sent the Furqan.","translation_id":"Dia menurunkan Kitab (Al-Qur'an) kepadamu (Muhammad) yang mengandung kebenaran, membenarkan (kitab-kitab) sebelumnya, dan menurunkan Taurat dan Injil,","hasanah_per_verse":530},{"text_madani":"مِن قَبْلُ هُدًى لِّلنَّاسِ وَأَنزَلَ الْفُرْقَانَ ۗ إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ ۗ وَاللَّهُ عَزِيزٌ ذُو انتِقَامٍ","text_tajweed":"مِ[f:128[ن ق]َ[q:129[بْ]لُ هُ[u:968[دًى ل]ِّل[g[نّ]َاسِ وَأَ[f:91[نز]َلَ [h:1726[ٱ]لْفُرْقَانَ‌ۗ إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ كَفَرُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ لَهُمْ عَذَا[f:1727[بٌ ش]َدِي[a:1728[دٌ‌ۗ و]َ[h:72[ٱ]للَّهُ عَزِي[f:1729[زٌ ذ]ُو [h:1730[ٱ][f:1731[نت]ِق[p[َا]مٍ","translation_en":"Surely they who disbelieve in the communications of Allah they shall have a severe chastisement; and Allah is Mighty, the Lord of retribution.","translation_id":"sebelumnya, sebagai petunjuk bagi manusia, dan Dia menurunkan Al-Furqan. Sungguh, orang-orang yang ingkar terhadap ayat-ayat Allah akan memperoleh azab yang berat. Allah Mahaperkasa lagi mempunyai hukuman.","hasanah_per_verse":740},{"text_madani":"إِنَّ اللَّهَ لَا يَخْفَىٰ عَلَيْهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ","text_tajweed":"إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَا يَخْفَىٰ عَلَيْهِ ش[f:1732[َىْءٌ ف]ِى [h:44[ٱ]لْأَرْضِ وَلَا فِى [h:746[ٱ][l[ل]سَّم[o[َا]ٓءِ","translation_en":"Allah-- surely nothing is hidden from Him in the earth or in the heaven.","translation_id":"Bagi Allah tidak ada sesuatu pun yang tersembunyi di bumi dan di langit.","hasanah_per_verse":370},{"text_madani":"هُوَ الَّذِي يُصَوِّرُكُمْ فِي الْأَرْحَامِ كَيْفَ يَشَاءُ ۚ لَا إِلَٰهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ","text_tajweed":"هُوَ [h:153[ٱ]لَّذِى يُصَوِّرُكُمْ فِى [h:1733[ٱ]لْأَرْحَامِ كَيْفَ يَش[o[َا]ٓءُ‌ۚ ل[o[َآ] إِلَ[n[ـٰ]هَ إِلَّا هُوَ [h:1734[ٱ]لْعَزِيزُ [h:681[ٱ]لْحَك[p[ِي]مُ","translation_en":"He it is Who shapes you in the wombs as He likes; there is no god but He, the Mighty, the Wise","translation_id":"Dialah yang membentuk kamu dalam rahim menurut yang Dia kehendaki. Tidak ada tuhan selain Dia. Yang Mahaperkasa, Mahabijaksana.","hasanah_per_verse":500},{"text_madani":"هُوَ الَّذِي أَنزَلَ عَلَيْكَ الْكِتَابَ مِنْهُ آيَاتٌ مُّحْكَمَاتٌ هُنَّ أُمُّ الْكِتَابِ وَأُخَرُ مُتَشَابِهَاتٌ ۖ فَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ زَيْغٌ فَيَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ ابْتِغَاءَ الْفِتْنَةِ وَابْتِغَاءَ تَأْوِيلِهِ ۗ وَمَا يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ ۗ وَالرَّاسِخُونَ فِي الْعِلْمِ يَقُولُونَ آمَنَّا بِهِ كُلٌّ مِّنْ عِندِ رَبِّنَا ۗ وَمَا يَذَّكَّرُ إِلَّا أُولُو الْأَلْبَابِ","text_tajweed":"هُوَ [h:153[ٱ]لَّذ[o[ِىٓ] أَ[f:471[نز]َلَ عَلَيْكَ [h:1723[ٱ]لْكِتَ[n[ـٰ]بَ مِنْهُ ءَايَ[n[ـٰ][a:1735[تٌ م]ُّحْكَمَ[n[ـٰ]تٌ هُ[g[نّ]َ أُ[g[مّ]ُ [h:1736[ٱ]لْكِتَ[n[ـٰ]بِ وَأُخَرُ مُتَشَ[n[ـٰ]بِهَ[n[ـٰ][f:1737[تٌ‌ۖ ف]َأَ[g[مّ]َا [h:136[ٱ]لَّذِينَ فِى قُلُوبِهِمْ زَيْ[f:1738[غٌ ف]َيَتَّبِعُونَ مَا تَشَ[n[ـٰ]بَهَ مِنْهُ [h:1739[ٱ][q:1130[بْ]تِغ[o[َا]ٓءَ [h:1740[ٱ]لْفِتْنَةِ وَ[h:1741[ٱ][q:1741[بْ]تِغ[o[َا]ٓءَ تَأْوِيلِه[n[ِۦ]‌ۗ وَمَا يَعْلَمُ تَأْوِيلَهُ[o[ۥٓ] إِلَّا [h:1742[ٱ]للَّهُ‌ۗ وَ[h:1743[ٱ][l[ل]رّ[n[َٲ]سِخُونَ فِى [h:1403[ٱ]لْعِلْمِ يَقُولُونَ ءَامَ[g[نّ]َا بِه[n[ِۦ] كُ[a:1744[لٌّ م]ِّنْ عِ[f:398[ند]ِ رَبِّنَا‌ۗ وَمَا يَذَّكَّرُ إِلّ[o[َآ] أُ[s[وْ]لُو[s[اْ] [h:1595[ٱ]لْأَلْبَ[p[ـٰ][q[ب]ِ","translation_en":"He it is Who has revealed the Book to you; some of its verses are decisive, they are the basis of the Book, and others are allegorical; then as for those in whose hearts there is perversity they follow the part of it which is allegorical, seeking to mislead and seeking to give it (their own) interpretation. but none knows its interpretation except Allah, and those who are firmly rooted in knowledge say: We believe in it, it is all from our Lord; and none do mind except those having understanding.","translation_id":"Dialah yang menurunkan Kitab (Al-Qur'an) kepadamu (Muhammad). Di antaranya ada ayat-ayat yang muhkamat, itulah pokok-pokok Kitab (Al-Qur'an) dan yang lain mutasyabihat. Adapun orang-orang yang dalam hatinya condong pada kesesatan, mereka mengikuti yang mutasyabihat untuk mencari-cari fitnah dan untuk mencari-cari takwilnya, padahal tidak ada yang mengetahui takwilnya kecuali Allah. Dan orang-orang yang ilmunya mendalam berkata, “Kami beriman kepadanya (Al-Qur'an), semuanya dari sisi Tuhan kami.” Tidak ada yang dapat mengambil pelajaran kecuali orang yang berakal.","hasanah_per_verse":1970},{"text_madani":"رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ الْوَهَّابُ","text_tajweed":"رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَ[q:1745[بْ] لَنَا م[u:1746[ِن ل]َّدُ[f:1747[نك]َ رَحْمَةً‌ۚ إِ[g[نّ]َكَ أَ[f:169[نت]َ [h:1748[ٱ]لْوَهّ[p[َا][q[ب]ُ","translation_en":"Our Lord! make not our hearts to deviate after Thou hast guided us aright, and grant us from Thee mercy; surely Thou art the most liberal Giver.","translation_id":"(Mereka berdoa), “Ya Tuhan kami, janganlah Engkau condongkan hati kami kepada kesesatan setelah Engkau berikan petunjuk kepada kami, dan karuniakanlah kepada kami rahmat dari sisi-Mu, sesungguhnya Engkau Maha Pemberi.”","hasanah_per_verse":540},{"text_madani":"رَبَّنَا إِنَّكَ جَامِعُ النَّاسِ لِيَوْمٍ لَّا رَيْبَ فِيهِ ۚ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ","text_tajweed":"رَبَّن[o[َآ] إِ[g[نّ]َكَ جَامِعُ [h:1749[ٱ][l[ل][g[نّ]َاسِ لِيَوْ[u:1750[مٍ ل]َّا رَيْبَ فِيهِ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَا يُخْلِفُ [h:1751[ٱ]لْمِيع[p[َا][q[د]َ","translation_en":"Our Lord! surely Thou art the Gatherer of men on a day about which there is no doubt; surely Allah will not fail (His) promise.","translation_id":"”Ya Tuhan kami, Engkaulah yang mengumpulkan manusia pada hari yang tidak ada keraguan padanya.” Sungguh, Allah tidak menyalahi janji.","hasanah_per_verse":470},{"text_madani":"إِنَّ الَّذِينَ كَفَرُوا لَن تُغْنِيَ عَنْهُمْ أَمْوَالُهُمْ وَلَا أَوْلَادُهُم مِّنَ اللَّهِ شَيْئًا ۖ وَأُولَٰئِكَ هُمْ وَقُودُ النَّارِ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ كَفَرُو[s[اْ] لَ[f:1752[ن ت]ُغْنِىَ عَنْهُمْ أَمْو[n[َٲ]لُهُمْ وَل[o[َآ] أَوْلَ[n[ـٰ]دُه[w:1753[ُم م]ِّنَ [h:321[ٱ]للَّهِ شَيْـ[a:1754[ـًٔا‌ۖ و]َأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمْ وَقُودُ [h:1755[ٱ][l[ل][g[نّ][p[َا]رِ","translation_en":"(As for) those who disbelieve, surely neither their wealth nor their children shall avail them in the least against Allah, and these it is who are the fuel of the fire.","translation_id":"Sesungguhnya orang-orang yang kafir, bagi mereka tidak akan berguna sedikit pun harta benda dan anak-anak mereka terhadap (azab) Allah. Dan mereka itu (menjadi) bahan bakar api neraka.","hasanah_per_verse":660},{"text_madani":"كَدَأْبِ آلِ فِرْعَوْنَ وَالَّذِينَ مِن قَبْلِهِمْ ۚ كَذَّبُوا بِآيَاتِنَا فَأَخَذَهُمُ اللَّهُ بِذُنُوبِهِمْ ۗ وَاللَّهُ شَدِيدُ الْعِقَابِ","text_tajweed":"كَدَأْبِ ءَالِ فِرْعَوْنَ وَ[h:37[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ‌ۚ كَذَّبُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِنَا فَأَخَذَهُمُ [h:1756[ٱ]للَّهُ بِذُنُوبِهِمْ‌ۗ وَ[h:72[ٱ]للَّهُ شَدِيدُ [h:1075[ٱ]لْعِق[p[َا][q[ب]ِ","translation_en":"Like the striving of the people of Firon and those before them; they rejected Our communications, so Allah destroyed them on account of their faults; and Allah is severe in requiting (evil).","translation_id":"(Keadaan mereka) seperti keadaan pengikut Fir’aun dan orang-orang yang sebelum mereka. Mereka mendustakan ayat-ayat Kami, maka Allah menyiksa mereka disebabkan dosa-dosanya. Allah sangat berat hukuman-Nya.","hasanah_per_verse":680},{"text_madani":"قُل لِّلَّذِينَ كَفَرُوا سَتُغْلَبُونَ وَتُحْشَرُونَ إِلَىٰ جَهَنَّمَ ۚ وَبِئْسَ الْمِهَادُ","text_tajweed":"قُل لِّلَّذِينَ كَفَرُو[s[اْ] سَتُغْلَبُونَ وَتُحْشَرُونَ إِلَىٰ جَهَ[g[نّ]َمَ‌ۚ وَبِئْسَ [h:1757[ٱ]لْمِه[p[َا][q[د]ُ","translation_en":"Say to those who disbelieve: You shall be vanquished, and driven together to hell; and evil is the resting-place.","translation_id":"Katakanlah (Muhammad) kepada orang-orang yang kafir, “Kamu (pasti) akan dikalahkan dan digiring ke dalam neraka Jahanam. Dan itulah seburuk-buruk tempat tinggal.”","hasanah_per_verse":430},{"text_madani":"قَدْ كَانَ لَكُمْ آيَةٌ فِي فِئَتَيْنِ الْتَقَتَا ۖ فِئَةٌ تُقَاتِلُ فِي سَبِيلِ اللَّهِ وَأُخْرَىٰ كَافِرَةٌ يَرَوْنَهُم مِّثْلَيْهِمْ رَأْيَ الْعَيْنِ ۚ وَاللَّهُ يُؤَيِّدُ بِنَصْرِهِ مَن يَشَاءُ ۗ إِنَّ فِي ذَٰلِكَ لَعِبْرَةً لِّأُولِي الْأَبْصَارِ","text_tajweed":"قَ[q:298[دْ] كَانَ لَكُمْ ءَايَ[f:1758[ةٌ ف]ِى فِئَتَيْنِ [h:1759[ٱ][l[ل]ْتَقَتَا‌ۖ فِئَ[f:1760[ةٌ ت]ُقَ[n[ـٰ]تِلُ فِى سَبِيلِ [h:788[ٱ]للَّهِ وَأُخْرَىٰ كَافِرَ[a:1761[ةٌ ي]َرَوْنَه[w:1762[ُم م]ِّثْلَيْهِمْ رَأْىَ [h:1763[ٱ]لْعَيْنِ‌ۚ وَ[h:72[ٱ]للَّهُ يُؤَيِّدُ بِنَصْرِه[n[ِۦ] م[a:476[َن ي]َش[o[َا]ٓءُ‌ۗ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَعِ[q:1764[بْ]رَ[u:1765[ةً ل]ِّأُ[s[وْ]لِى [h:1766[ٱ]لْأَ[q:1767[بْ]صَ[p[ـٰ]رِ","translation_en":"Indeed there was a sign for you in the two hosts (which) met together in encounter; one party fighting in the way of Allah and the other unbelieving, whom they saw twice as many as themselves with the sight of the eye and Allah strengthens with His aid whom He pleases; most surely there is a lesson in this for those who have sight.","translation_id":"Sungguh, telah ada tanda bagi kamu pada dua golongan yang berhadap-hadapan. Satu golongan berperang di jalan Allah dan yang lain (golongan) kafir yang melihat dengan mata kepala, bahwa mereka (golongan Muslim) dua kali lipat mereka. Allah menguatkan dengan pertolongan-Nya bagi siapa yang Dia kehendaki. Sungguh, pada yang demikian itu terdapat pelajaran bagi orang-orang yang mempunyai penglihatan (mata hati).","hasanah_per_verse":1160},{"text_madani":"زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَوَاتِ مِنَ النِّسَاءِ وَالْبَنِينَ وَالْقَنَاطِيرِ الْمُقَنطَرَةِ مِنَ الذَّهَبِ وَالْفِضَّةِ وَالْخَيْلِ الْمُسَوَّمَةِ وَالْأَنْعَامِ وَالْحَرْثِ ۗ ذَٰلِكَ مَتَاعُ الْحَيَاةِ الدُّنْيَا ۖ وَاللَّهُ عِندَهُ حُسْنُ الْمَآبِ","text_tajweed":"زُيِّنَ لِل[g[نّ]َاسِ حُبُّ [h:1768[ٱ][l[ل]شَّهَو[n[َٲ]تِ مِنَ [h:1769[ٱ][l[ل][g[نّ]ِس[o[َا]ٓءِ وَ[h:1770[ٱ]لْبَنِينَ وَ[h:1771[ٱ]لْقَنَ[n[ـٰ]طِيرِ [h:1772[ٱ]لْمُقَ[f:1773[نط]َرَةِ مِنَ [h:1774[ٱ][l[ل]ذَّهَبِ وَ[h:1775[ٱ]لْفِضَّةِ وَ[h:1776[ٱ]لْخَيْلِ [h:1777[ٱ]لْمُسَوَّمَةِ وَ[h:1778[ٱ]لْأَنْعَ[n[ـٰ]مِ وَ[h:1779[ٱ]لْحَرْثِ‌ۗ ذ[n[َٲ]لِكَ مَتَ[n[ـٰ]عُ [h:1780[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا‌ۖ وَ[h:72[ٱ]للَّهُ عِ[f:719[ند]َهُ[n[ۥ] حُسْنُ [h:1781[ٱ]لْمَـَٔـ[p[ا][q[ب]ِ","translation_en":"The love of desires, of women and sons and hoarded treasures of gold and silver and well bred horses and cattle and tilth, is made to seem fair to men; this is the provision of the life of this world; and Allah is He with Whom is the good goal (of life).","translation_id":"Dijadikan terasa indah dalam pandangan manusia cinta terhadap apa yang diinginkan, berupa perempuan-perempuan, anak-anak, harta benda yang bertumpuk dalam bentuk emas dan perak, kuda pilihan, hewan ternak dan sawah ladang. Itulah kesenangan hidup di dunia, dan di sisi Allah-lah tempat kembali yang baik.","hasanah_per_verse":1250},{"text_madani":"قُلْ أَؤُنَبِّئُكُم بِخَيْرٍ مِّن ذَٰلِكُمْ ۚ لِلَّذِينَ اتَّقَوْا عِندَ رَبِّهِمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا وَأَزْوَاجٌ مُّطَهَّرَةٌ وَرِضْوَانٌ مِّنَ اللَّهِ ۗ وَاللَّهُ بَصِيرٌ بِالْعِبَادِ","text_tajweed":"۞ قُلْ أَؤُنَبِّئُك[c:1782[ُم ب]ِخَيْ[a:1783[رٍ م]ِّ[f:1784[ن ذ][n[َٲ]لِكُمْ‌ۚ لِلَّذِينَ [h:1785[ٱ]تَّقَوْ[s[اْ] عِ[f:264[ند]َ رَبِّهِمْ جَ[g[نّ]َ[n[ـٰ][f:1786[تٌ ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ خَ[n[ـٰ]لِدِينَ فِيهَا وَأَزْو[n[َٲ][a:1787[جٌ م]ُّطَهَّرَ[a:1788[ةٌ و]َرِضْو[n[َٲ][a:1789[نٌ م]ِّنَ [h:321[ٱ]للَّهِ‌ۗ وَ[h:72[ٱ]للَّهُ بَصِي[i:1790[رُۢ ب]ِ[h:1133[ٱ]لْعِب[p[َا][q[د]ِ","translation_en":"Say: Shall I tell you what is better than these? For those who guard (against evil) are gardens with their Lord, beneath which rivers flow, to abide in them, and pure mates and Allah's pleasure; and Allah sees the servants.","translation_id":"Katakanlah, “Maukah aku kabarkan kepadamu apa yang lebih baik dari yang demikian itu?” Bagi orang-orang yang bertakwa (tersedia) di sisi Tuhan mereka surga-surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya, dan pasangan-pasangan yang suci, serta ridha Allah. Dan Allah Maha Melihat hamba-hamba-Nya.","hasanah_per_verse":1070},{"text_madani":"الَّذِينَ يَقُولُونَ رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ","text_tajweed":"ٱلَّذِينَ يَقُولُونَ رَبَّن[o[َآ] إِ[g[نّ]َن[o[َآ] ءَامَ[g[نّ]َا فَ[h:1791[ٱ]غْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ [h:1110[ٱ][l[ل][g[نّ][p[َا]رِ","translation_en":"Those who say: Our Lord! surely we believe, therefore forgive us our faults and save us from the chastisement of the fire.","translation_id":"(Yaitu) orang-orang yang berdoa, “Ya Tuhan kami, kami benar-benar beriman, maka ampunilah dosa-dosa kami dan lindungilah kami dari azab neraka.”","hasanah_per_verse":500},{"text_madani":"الصَّابِرِينَ وَالصَّادِقِينَ وَالْقَانِتِينَ وَالْمُنفِقِينَ وَالْمُسْتَغْفِرِينَ بِالْأَسْحَارِ","text_tajweed":"ٱ[l[ل]صَّ[n[ـٰ]بِرِينَ وَ[h:1792[ٱ][l[ل]صَّ[n[ـٰ]دِقِينَ وَ[h:1793[ٱ]لْقَ[n[ـٰ]نِتِينَ وَ[h:1794[ٱ]لْمُ[f:1794[نف]ِقِينَ وَ[h:1795[ٱ]لْمُسْتَغْفِرِينَ بِ[h:1796[ٱ]لْأَسْح[p[َا]رِ","translation_en":"The patient, and the truthful, and the obedient, and those who spend (benevolently) and those who ask forgiveness in the morning times.","translation_id":"(Juga) orang yang sabar, orang yang benar, orang yang taat, orang yang menginfakkan hartanya, dan orang yang memohon ampunan pada waktu sebelum fajar.","hasanah_per_verse":540},{"text_madani":"شَهِدَ اللَّهُ أَنَّهُ لَا إِلَٰهَ إِلَّا هُوَ وَالْمَلَائِكَةُ وَأُولُو الْعِلْمِ قَائِمًا بِالْقِسْطِ ۚ لَا إِلَٰهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ","text_tajweed":"شَهِدَ [h:1797[ٱ]للَّهُ أَ[g[نّ]َهُ[n[ۥ] ل[o[َآ] إِلَ[n[ـٰ]هَ إِلَّا هُوَ وَ[h:1146[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ وَأُ[s[وْ]لُو[s[اْ] [h:1798[ٱ]لْعِلْمِ ق[o[َا]ٓئِم[i:1799[َۢا ب]ِ[h:1800[ٱ]لْقِسْطِ‌ۚ ل[o[َآ] إِلَ[n[ـٰ]هَ إِلَّا هُوَ [h:1734[ٱ]لْعَزِيزُ [h:681[ٱ]لْحَك[p[ِي]مُ","translation_en":"Allah bears witness that there is no god but He, and (so do) the angels and those possessed of knowledge, maintaining His creation with justice; there is no god but He, the Mighty, the Wise.","translation_id":"Allah menyatakan bahwa tidak ada tuhan selain Dia; (demikian pula) para malaikat dan orang berilmu yang menegakkan keadilan, tidak ada tuhan selain Dia, Yang Mahaperkasa, Maha-bijaksana.","hasanah_per_verse":720},{"text_madani":"إِنَّ الدِّينَ عِندَ اللَّهِ الْإِسْلَامُ ۗ وَمَا اخْتَلَفَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِن بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ ۗ وَمَن يَكْفُرْ بِآيَاتِ اللَّهِ فَإِنَّ اللَّهَ سَرِيعُ الْحِسَابِ","text_tajweed":"إِ[g[نّ]َ [h:1801[ٱ][l[ل]دِّينَ عِ[f:264[ند]َ [h:408[ٱ]للَّهِ [h:1802[ٱ]لْإِسْلَ[n[ـٰ]مُ‌ۗ وَمَا [h:1167[ٱ]خْتَلَفَ [h:1803[ٱ]لَّذِينَ أُوتُو[s[اْ] [h:524[ٱ]لْكِتَ[n[ـٰ]بَ إِلَّا م[i:146[ِنۢ ب]َعْدِ مَا ج[o[َا]ٓءَهُمُ [h:1804[ٱ]لْعِلْمُ بَغْي[i:1169[َۢا ب]َيْنَهُمْ‌ۗ وَم[a:636[َن ي]َكْفُرْ بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ سَرِيعُ [h:1112[ٱ]لْحِس[p[َا][q[ب]ِ","translation_en":"Surely the (true) religion with Allah is Islam, and those to whom the Book had been given did not show opposition but after knowledge had come to them, out of envy among themselves; and whoever disbelieves in the communications of Allah then surely Allah is quick in reckoning.","translation_id":"Sesungguhnya agama di sisi Allah ialah Islam. Tidaklah berselisih orang-orang yang telah diberi Kitab kecuali setelah mereka memperoleh ilmu, karena kedengkian di antara mereka. Barangsiapa ingkar terhadap ayat-ayat Allah, maka sungguh, Allah sangat cepat perhitungan-Nya.","hasanah_per_verse":1070},{"text_madani":"فَإِنْ حَاجُّوكَ فَقُلْ أَسْلَمْتُ وَجْهِيَ لِلَّهِ وَمَنِ اتَّبَعَنِ ۗ وَقُل لِّلَّذِينَ أُوتُوا الْكِتَابَ وَالْأُمِّيِّينَ أَأَسْلَمْتُمْ ۚ فَإِنْ أَسْلَمُوا فَقَدِ اهْتَدَوا ۖ وَّإِن تَوَلَّوْا فَإِنَّمَا عَلَيْكَ الْبَلَاغُ ۗ وَاللَّهُ بَصِيرٌ بِالْعِبَادِ","text_tajweed":"فَإِنْ ح[m[َا]ٓجُّوكَ فَقُلْ أَسْلَمْتُ وَ[q:1805[جْ]هِىَ لِلَّهِ وَمَنِ [h:1806[ٱ]تَّبَعَنِ‌ۗ وَقُل لِّلَّذِينَ أُوتُو[s[اْ] [h:524[ٱ]لْكِتَ[n[ـٰ]بَ وَ[h:1807[ٱ]لْأُ[g[مّ]ِيِّـ[n[ـۧ]نَ ءَأَسْلَمْتُمْ‌ۚ فَإِنْ أَسْلَمُو[s[اْ] فَقَدِ [h:705[ٱ]هْتَدَو[s[اْ‌ۖ] وَّإِ[f:706[ن ت]َوَلَّوْ[s[اْ] فَإِ[g[نّ]َمَا عَلَيْكَ [h:1808[ٱ]لْبَلَ[n[ـٰ]غُ‌ۗ وَ[h:72[ٱ]للَّهُ بَصِي[i:1790[رُۢ ب]ِ[h:1133[ٱ]لْعِب[p[َا][q[د]ِ","translation_en":"But if they dispute with you, say: I have submitted myself entirely to Allah and (so) every one who follows me; and say to those who have been given the Book and the unlearned people: Do you submit yourselves? So if they submit then indeed they follow the right way; and if they turn back, then upon you is only the delivery of the message and Allah sees the servants.","translation_id":"Kemudian jika mereka membantah engkau (Muhammad) katakanlah, “Aku berserah diri kepada Allah dan (demikian pula) orang-orang yang mengikutiku.” Dan katakanlah kepada orang-orang yang telah diberi Kitab dan kepada orang-orang buta huruf, ”Sudahkah kamu masuk Islam?” Jika mereka masuk Islam, berarti mereka telah mendapat petunjuk, tetapi jika mereka berpaling, maka kewajibanmu hanyalah menyampaikan. Dan Allah Maha Melihat hamba-hamba-Nya.","hasanah_per_verse":1220},{"text_madani":"إِنَّ الَّذِينَ يَكْفُرُونَ بِآيَاتِ اللَّهِ وَيَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ وَيَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ مِنَ النَّاسِ فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ يَكْفُرُونَ بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ وَيَ[q:323[قْ]تُلُونَ [h:324[ٱ][l[ل][g[نّ]َبِيِّـ[n[ـۧ]نَ بِغَيْرِ حَ[a:1809[قٍّ و]َيَ[q:323[قْ]تُلُونَ [h:1810[ٱ]لَّذِينَ يَأْمُرُونَ بِ[h:1800[ٱ]لْقِسْطِ مِنَ [h:721[ٱ][l[ل][g[نّ]َاسِ فَبَشِّرْه[c:1811[ُم ب]ِعَذَابٍ أَل[p[ِي]مٍ","translation_en":"Surely (as for) those who disbelieve in the communications of Allah and slay the prophets unjustly and slay those among men who enjoin justice, announce to them a painful chastisement.","translation_id":"Sesungguhnya orang-orang yang mengingkari ayat-ayat Allah dan membunuh para nabi tanpa hak (alasan yang benar) dan membunuh orang-orang yang menyuruh manusia berbuat adil, sampaikanlah kepada mereka kabar gembira yaitu azab yang pedih.","hasanah_per_verse":880},{"text_madani":"أُولَٰئِكَ الَّذِينَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالْآخِرَةِ وَمَا لَهُم مِّن نَّاصِرِينَ","text_tajweed":"أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ [h:51[ٱ]لَّذِينَ حَبِطَتْ أَعْمَ[n[ـٰ]لُهُمْ فِى [h:599[ٱ][l[ل]دُّنْيَا وَ[h:1213[ٱ]لْأَخِرَةِ وَمَا لَه[w:1812[ُم م]ّ[a:1813[ِن ن]َّ[n[ـٰ]صِر[p[ِي]نَ","translation_en":"Those are they whose works shall become null in this world as well as the hereafter, and they shall have no helpers.","translation_id":"Mereka itulah orang-orang yang sia-sia pekerjaannya di dunia dan di akhirat, dan mereka tidak memperoleh penolong.","hasanah_per_verse":500},{"text_madani":"أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِّنَ الْكِتَابِ يُدْعَوْنَ إِلَىٰ كِتَابِ اللَّهِ لِيَحْكُمَ بَيْنَهُمْ ثُمَّ يَتَوَلَّىٰ فَرِيقٌ مِّنْهُمْ وَهُم مُّعْرِضُونَ","text_tajweed":"أَلَمْ تَرَ إِلَى [h:1372[ٱ]لَّذِينَ أُوتُو[s[اْ] نَصِي[a:1814[بًا م]ِّنَ [h:891[ٱ]لْكِتَ[n[ـٰ]بِ يُ[q:1815[دْ]عَوْنَ إِلَىٰ كِتَ[n[ـٰ]بِ [h:1816[ٱ]للَّهِ لِيَحْكُمَ بَيْنَهُمْ ثُ[g[مّ]َ يَتَوَلَّىٰ فَرِي[a:388[قٌ م]ِّنْهُمْ وَه[w:1817[ُم م]ُّعْرِض[p[ُو]نَ","translation_en":"Have you not considered those (Jews) who are given a portion of the Book? They are invited to the Book of Allah that it might decide between them, then a part of them turn back and they withdraw.","translation_id":"Tidakkah engkau memperhatikan orang-orang yang telah diberi bagian Kitab (Taurat)? Mereka diajak (berpegang) pada Kitab Allah untuk memutuskan (perkara) di antara mereka. Kemudian sebagian dari mereka berpaling seraya menolak (kebenaran).","hasanah_per_verse":810},{"text_madani":"ذَٰلِكَ بِأَنَّهُمْ قَالُوا لَن تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَّعْدُودَاتٍ ۖ وَغَرَّهُمْ فِي دِينِهِم مَّا كَانُوا يَفْتَرُونَ","text_tajweed":"ذ[n[َٲ]لِكَ بِأَ[g[نّ]َهُمْ قَالُو[s[اْ] لَ[f:404[ن ت]َمَسَّنَا [h:405[ٱ][l[ل][g[نّ]َارُ إِلّ[o[َآ] أَيَّا[a:952[مًا م]َّعْدُود[n[َٲ][a:1818[تٍ‌ۖ و]َغَرَّهُمْ فِى دِينِه[w:1819[ِم م]َّا كَانُو[s[اْ] يَفْتَر[p[ُو]نَ","translation_en":"This is because they say: The fire shall not touch us but for a few days; and what they have forged deceives them in the matter of their religion.","translation_id":"Hal itu adalah karena mereka berkata, “Api neraka tidak akan menyentuh kami kecuali beberapa hari saja.” Mereka teperdaya dalam agama mereka oleh apa yang mereka ada-adakan.","hasanah_per_verse":650},{"text_madani":"فَكَيْفَ إِذَا جَمَعْنَاهُمْ لِيَوْمٍ لَّا رَيْبَ فِيهِ وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ","text_tajweed":"فَكَيْفَ إِذَا جَمَعْنَ[n[ـٰ]هُمْ لِيَوْ[u:1750[مٍ ل]َّا رَيْبَ فِيهِ وَوُفِّيَتْ كُلُّ نَفْ[a:1654[سٍ م]َّا كَسَبَتْ وَهُمْ لَا يُظْلَم[p[ُو]نَ","translation_en":"Then how will it be when We shall gather them together on a day about which there is no doubt, and every soul shall be fully paid what it has earned, and they shall not be dealt with unjustly?","translation_id":"Bagaimana jika (nanti) mereka Kami kumpulkan pada hari (Kiamat) yang tidak diragukan terjadinya dan kepada setiap jiwa diberi balasan yang sempurna sesuai dengan apa yang telah dikerjakannya dan mereka tidak dizhalimi (dirugikan)?","hasanah_per_verse":530},{"text_madani":"قُلِ اللَّهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَن تَشَاءُ وَتَنزِعُ الْمُلْكَ مِمَّن تَشَاءُ وَتُعِزُّ مَن تَشَاءُ وَتُذِلُّ مَن تَشَاءُ ۖ بِيَدِكَ الْخَيْرُ ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","text_tajweed":"قُلِ [h:1820[ٱ][l[ل]لَّهُ[g[مّ]َ مَ[n[ـٰ]لِكَ [h:1821[ٱ]لْمُلْكِ تُؤْتِى [h:1822[ٱ]لْمُلْكَ مَ[f:1823[ن ت]َش[o[َا]ٓءُ وَتَ[f:1824[نز]ِعُ [h:1825[ٱ]لْمُلْكَ مِ[g[مّ]َ[f:1826[ن ت]َش[o[َا]ٓءُ وَتُعِزُّ مَ[f:1823[ن ت]َش[o[َا]ٓءُ وَتُذِلُّ مَ[f:1823[ن ت]َش[o[َا]ٓءُ‌ۖ بِيَدِكَ [h:1827[ٱ]لْخَيْرُ‌ۖ إِ[g[نّ]َكَ عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َد[p[ِي]رٌ","translation_en":"Say: O Allah, Master of the Kingdom! Thou givest the kingdom to whomsoever Thou pleasest and takest away the kingdom from whomsoever Thou pleasest, and Thou exaltest whom Thou pleasest and abasest whom Thou pleasest in Thine hand is the good; surety, Thou hast power over all things.","translation_id":"Katakanlah (Muhammad), “Wahai Tuhan pemilik kekuasaan, Engkau berikan kekuasaan kepada siapa pun yang Engkau kehendaki, dan Engkau cabut kekuasaan dari siapa pun yang Engkau kehendaki. Engkau muliakan siapa pun yang Engkau kehendaki dan Engkau hinakan siapa pun yang Engkau kehendaki. Di tangan Engkaulah segala kebajikan. Sungguh, Engkau Mahakuasa atas segala sesuatu.","hasanah_per_verse":920},{"text_madani":"تُولِجُ اللَّيْلَ فِي النَّهَارِ وَتُولِجُ النَّهَارَ فِي اللَّيْلِ ۖ وَتُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَتُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ ۖ وَتَرْزُقُ مَن تَشَاءُ بِغَيْرِ حِسَابٍ","text_tajweed":"تُولِجُ [h:1828[ٱ]لَّيْلَ فِى [h:1829[ٱ][l[ل][g[نّ]َهَارِ وَتُولِجُ [h:1830[ٱ][l[ل][g[نّ]َهَارَ فِى [h:1831[ٱ]لَّيْلِ‌ۖ وَتُخْرِجُ [h:1832[ٱ]لْحَىَّ مِنَ [h:1833[ٱ]لْمَيِّتِ وَتُخْرِجُ [h:1834[ٱ]لْمَيِّتَ مِنَ [h:1835[ٱ]لْحَىِّ‌ۖ وَتَرْزُقُ مَ[f:1823[ن ت]َش[o[َا]ٓءُ بِغَيْرِ حِس[p[َا][q[ب]ٍ","translation_en":"Thou makest the night to pass into the day and Thou makest the day to pass into the night, and Thou bringest forth the living from the dead and Thou bringest forth the dead from the living, and Thou givest sustenance to whom Thou pleasest without measure.","translation_id":"Engkau masukkan malam ke dalam siang dan Engkau masukkan siang ke dalam malam. Dan Engkau keluarkan yang hidup dari yang mati, dan Engkau keluarkan yang mati dari yang hidup. Dan Engkau berikan rezeki kepada siapa yang Engkau kehendaki tanpa perhitungan.”","hasanah_per_verse":860},{"text_madani":"لَّا يَتَّخِذِ الْمُؤْمِنُونَ الْكَافِرِينَ أَوْلِيَاءَ مِن دُونِ الْمُؤْمِنِينَ ۖ وَمَن يَفْعَلْ ذَٰلِكَ فَلَيْسَ مِنَ اللَّهِ فِي شَيْءٍ إِلَّا أَن تَتَّقُوا مِنْهُمْ تُقَاةً ۗ وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ ۗ وَإِلَى اللَّهِ الْمَصِيرُ","text_tajweed":"لَّا يَتَّخِذِ [h:1836[ٱ]لْمُؤْمِنُونَ [h:1837[ٱ]لْكَ[n[ـٰ]فِرِينَ أَوْلِي[o[َا]ٓءَ مِ[f:107[ن د]ُونِ [h:1838[ٱ]لْمُؤْمِنِينَ‌ۖ وَم[a:1297[َن ي]َفْعَلْ ذ[n[َٲ]لِكَ فَلَيْسَ مِنَ [h:321[ٱ]للَّهِ فِى شَىْءٍ إِلّ[o[َآ] أَ[f:1839[ن ت]َتَّقُو[s[اْ] مِنْهُمْ تُقَ[n[ـٰ][a:1840[ةً‌ۗ و]َيُحَذِّرُكُمُ [h:1841[ٱ]للَّهُ نَفْسَهُ[n[ۥ]‌ۗ وَإِلَى [h:1148[ٱ]للَّهِ [h:1842[ٱ]لْمَص[p[ِي]رُ","translation_en":"Let not the believers take the unbelievers for friends rather than believers; and whoever does this, he shall have nothing of (the guardianship of) Allah, but you should guard yourselves against them, guarding carefully; and Allah makes you cautious of (retribution from) Himself; and to Allah is the eventual coming.","translation_id":"Janganlah orang-orang beriman menjadikan orang kafir sebagai pemimpin, melainkan orang-orang beriman. Barang siapa berbuat demikian, niscaya dia tidak akan memperoleh apa pun dari Allah, kecuali karena (siasat) menjaga diri dari sesuatu yang kamu takuti dari mereka. Dan Allah memperingatkan kamu akan diri (siksa)-Nya, dan hanya kepada Allah tempat kembali.","hasanah_per_verse":1130},{"text_madani":"قُلْ إِن تُخْفُوا مَا فِي صُدُورِكُمْ أَوْ تُبْدُوهُ يَعْلَمْهُ اللَّهُ ۗ وَيَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","text_tajweed":"قُلْ إِ[f:1843[ن ت]ُخْفُو[s[اْ] مَا فِى صُدُورِكُمْ أَوْ تُ[q:1844[بْ]دُوهُ يَعْلَمْهُ [h:1081[ٱ]للَّهُ‌ۗ وَيَعْلَمُ مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَا فِى [h:44[ٱ]لْأَرْضِ‌ۗ وَ[h:72[ٱ]للَّهُ عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َد[p[ِي]رٌ","translation_en":"Say: Whether you hide what is in your hearts or manifest it, Allah knows it, and He knows whatever is in the heavens and whatever is in the earth, and Allah has power over all things.","translation_id":"Katakanlah, “Jika kamu sembunyikan apa yang ada dalam hatimu atau kamu nyatakan, Allah pasti mengetahuinya.” Dia mengetahui apa yang ada di langit dan apa yang ada di bumi. Allah Mahakuasa atas segala sesuatu.","hasanah_per_verse":790},{"text_madani":"يَوْمَ تَجِدُ كُلُّ نَفْسٍ مَّا عَمِلَتْ مِنْ خَيْرٍ مُّحْضَرًا وَمَا عَمِلَتْ مِن سُوءٍ تَوَدُّ لَوْ أَنَّ بَيْنَهَا وَبَيْنَهُ أَمَدًا بَعِيدًا ۗ وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ ۗ وَاللَّهُ رَءُوفٌ بِالْعِبَادِ","text_tajweed":"يَوْمَ تَجِدُ كُلُّ نَفْ[a:1654[سٍ م]َّا عَمِلَتْ مِنْ خَيْ[a:1845[رٍ م]ُّحْضَ[a:1846[رًا و]َمَا عَمِلَتْ مِ[f:1847[ن س][o[ُو]ٓ[f:1848[ءٍ ت]َوَدُّ لَوْ أَ[g[نّ]َ بَيْنَهَا وَبَيْنَهُ[o[ۥٓ] أَمَد[i:1849[َۢا ب]َعِي[a:1850[دًا‌ۗ و]َيُحَذِّرُكُمُ [h:1841[ٱ]للَّهُ نَفْسَهُ[n[ۥ]‌ۗ وَ[h:72[ٱ]للَّهُ رَءُو[i:1132[فُۢ ب]ِ[h:1133[ٱ]لْعِب[p[َا][q[د]ِ","translation_en":"On the day that every soul shall find present what it has done of good and what it has done of evil, it shall wish that between it and that (evil) there were a long duration of time; and Allah makes you to be cautious of (retribution from) Himself; and Allah is Compassionate to the servants.","translation_id":"(Ingatlah) pada hari (ketika) setiap jiwa mendapatkan (balasan) atas kebajikan yang telah dikerjakan dihadapkan kepadanya, (begitu juga balasan) atas kejahatan yang telah dia kerjakan. Dia berharap sekiranya ada jarak yang jauh antara dia dengan (hari) itu. Dan Allah memperingatkan kamu akan diri (siksa)-Nya. Allah Maha Penyayang terhadap hamba-hamba-Nya.","hasanah_per_verse":960},{"text_madani":"قُلْ إِن كُنتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَاللَّهُ غَفُورٌ رَّحِيمٌ","text_tajweed":"قُلْ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ تُحِبُّونَ [h:1851[ٱ]للَّهَ فَ[h:1852[ٱ]تَّبِعُونِى يُحْبِ[q:1853[بْ]كُمُ [h:1854[ٱ]للَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ‌ۗ وَ[h:72[ٱ]للَّهُ غَفُو[u:890[رٌ ر]َّح[p[ِي]مٌ","translation_en":"Say: If you love Allah, then follow me, Allah will love you and forgive you your faults, and Allah is Forgiving, MercifuL","translation_id":"Katakanlah (Muhammad), “Jika kamu mencintai Allah, ikutilah aku, niscaya Allah mencintaimu dan mengampuni dosa-dosamu.” Allah Maha Pengampun, Maha Penyayang.","hasanah_per_verse":620},{"text_madani":"قُلْ أَطِيعُوا اللَّهَ وَالرَّسُولَ ۖ فَإِن تَوَلَّوْا فَإِنَّ اللَّهَ لَا يُحِبُّ الْكَافِرِينَ","text_tajweed":"قُلْ أَطِيعُو[s[اْ] [h:1855[ٱ]للَّهَ وَ[h:1856[ٱ][l[ل]رَّسُولَ‌ۖ فَإِ[f:1857[ن ت]َوَلَّوْ[s[اْ] فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ لَا يُحِبُّ [h:1858[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"Say: Obey Allah and the Messenger; but if they turn back, then surely Allah does not love the unbelievers.","translation_id":"Katakanlah (Muhammad), “Taatilah Allah dan Rasul. Jika kamu berpaling, ketahuilah bahwa Allah tidak menyukai orang-orang kafir.”","hasanah_per_verse":470},{"text_madani":"إِنَّ اللَّهَ اصْطَفَىٰ آدَمَ وَنُوحًا وَآلَ إِبْرَاهِيمَ وَآلَ عِمْرَانَ عَلَى الْعَالَمِينَ","text_tajweed":"۞ إِ[g[نّ]َ [h:80[ٱ]للَّهَ [h:688[ٱ]صْطَفَ[o[ىٰٓ] ءَادَمَ وَنُو[a:1859[حًا و]َءَالَ إِ[q:1860[بْ]ر[n[َٲ]هِيمَ وَءَالَ عِمْر[n[َٲ]نَ عَلَى [h:227[ٱ]لْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"Surely Allah chose Adam and Nuh and the descendants of Ibrahim and the descendants of Imran above the nations.","translation_id":"Sesungguhnya Allah telah memilih Adam, Nuh, keluarga Ibrahim dan keluarga Imran melebihi segala umat (pada masa masing-masing),","hasanah_per_verse":480},{"text_madani":"ذُرِّيَّةً بَعْضُهَا مِن بَعْضٍ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ","text_tajweed":"ذُرِّيَّ[i:1861[ةَۢ ب]َعْضُهَا م[i:1862[ِنۢ ب]َعْ[a:1863[ضٍ‌ۗ و]َ[h:72[ٱ]للَّهُ سَمِيعٌ عَل[p[ِي]مٌ","translation_en":"Offspring one of the other; and Allah is Hearing, Knowing.","translation_id":"(sebagai) satu keturunan, sebagiannya adalah (keturunan) dari sebagian yang lain. Allah Maha Mendengar, Maha Mengetahui.","hasanah_per_verse":270},{"text_madani":"إِذْ قَالَتِ امْرَأَتُ عِمْرَانَ رَبِّ إِنِّي نَذَرْتُ لَكَ مَا فِي بَطْنِي مُحَرَّرًا فَتَقَبَّلْ مِنِّي ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ","text_tajweed":"إِذْ قَالَتِ [h:1864[ٱ]مْرَأَتُ عِمْر[n[َٲ]نَ رَبِّ إِ[g[نّ]ِى نَذَرْتُ لَكَ مَا فِى بَ[q:1865[طْ]نِى مُحَرَّ[f:1866[رًا ف]َتَقَبَّلْ مِ[g[نّ][o[ِىٓ‌ۖ] إِ[g[نّ]َكَ أَ[f:169[نت]َ [h:668[ٱ][l[ل]سَّمِيعُ [h:669[ٱ]لْعَل[p[ِي]مُ","translation_en":"When a woman of Imran said: My Lord! surely I vow to Thee what is in my womb, to be devoted (to Thy service); accept therefore from me, surely Thou art the Hearing, the Knowing.","translation_id":"(Ingatlah), ketika istri Imran berkata, “Ya Tuhanku, sesungguhnya aku bernazar kepada-Mu, apa (janin) yang dalam kandunganku (kelak) menjadi hamba yang mengabdi (kepada-Mu), maka terimalah (nazar itu) dariku. Sungguh, Engkaulah Yang Maha Mendengar, Maha Mengetahui.”","hasanah_per_verse":660},{"text_madani":"فَلَمَّا وَضَعَتْهَا قَالَتْ رَبِّ إِنِّي وَضَعْتُهَا أُنثَىٰ وَاللَّهُ أَعْلَمُ بِمَا وَضَعَتْ وَلَيْسَ الذَّكَرُ كَالْأُنثَىٰ ۖ وَإِنِّي سَمَّيْتُهَا مَرْيَمَ وَإِنِّي أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ الشَّيْطَانِ الرَّجِيمِ","text_tajweed":"فَلَ[g[مّ]َا وَضَعَتْهَا قَالَتْ رَبِّ إِ[g[نّ]ِى وَضَعْتُه[o[َآ] أُ[f:1867[نث]َىٰ وَ[h:72[ٱ]للَّهُ أَعْلَمُ بِمَا وَضَعَتْ وَلَيْسَ [h:1868[ٱ][l[ل]ذَّكَرُ كَ[h:1869[ٱ]لْأُ[f:1869[نث]َىٰ‌ۖ وَإِ[g[نّ]ِى سَ[g[مّ]َيْتُهَا مَرْيَمَ وَإِ[g[نّ][o[ِىٓ] أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ [h:1870[ٱ][l[ل]شَّيْطَ[n[ـٰ]نِ [h:1871[ٱ][l[ل]رَّج[p[ِي]مِ","translation_en":"So when she brought forth, she said: My Lord! Surely I have brought it forth a female-- and Allah knew best what she brought forth-- and the male is not like the female, and I have named it Marium, and I commend her and her offspring into Thy protection from the accursed Shaitan.","translation_id":"Maka ketika melahirkannya, dia berkata, “Ya Tuhanku, aku telah melahirkan anak perempuan.” Padahal Allah lebih tahu apa yang dia lahirkan, dan laki-laki tidak sama dengan perempuan. ”Dan aku memberinya nama Maryam, dan aku mohon perlindungan-Mu untuknya dan anak cucunya dari (gangguan) setan yang terkutuk.”","hasanah_per_verse":1090},{"text_madani":"فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٍ وَأَنبَتَهَا نَبَاتًا حَسَنًا وَكَفَّلَهَا زَكَرِيَّا ۖ كُلَّمَا دَخَلَ عَلَيْهَا زَكَرِيَّا الْمِحْرَابَ وَجَدَ عِندَهَا رِزْقًا ۖ قَالَ يَا مَرْيَمُ أَنَّىٰ لَكِ هَٰذَا ۖ قَالَتْ هُوَ مِنْ عِندِ اللَّهِ ۖ إِنَّ اللَّهَ يَرْزُقُ مَن يَشَاءُ بِغَيْرِ حِسَابٍ","text_tajweed":"فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَ[a:1872[نٍ و]َأَ[i:1873[نۢب]َتَهَا نَبَاتًا حَسَ[a:1874[نًا و]َكَفَّلَهَا زَكَرِيَّا‌ۖ كُلَّمَا دَخَلَ عَلَيْهَا زَكَرِيَّا [h:1875[ٱ]لْمِحْرَابَ وَجَدَ عِ[f:1876[ند]َهَا رِزْ[f:1877[قًا‌ۖ ق]َالَ يَ[n[ـٰ]مَرْيَمُ أَ[g[نّ]َىٰ لَكِ هَ[n[ـٰ]ذَا‌ۖ قَالَتْ هُوَ مِنْ عِ[f:398[ند]ِ [h:399[ٱ]للَّهِ‌ۖ إِ[g[نّ]َ [h:80[ٱ]للَّهَ يَرْزُقُ م[a:476[َن ي]َش[o[َا]ٓءُ بِغَيْرِ حِس[p[َا][q[ب]ٍ","translation_en":"So her Lord accepted her with a good acceptance and made her grow up a good growing, and gave her into the charge of Zakariya; whenever Zakariya entered the sanctuary to (see) her, he found with her food. He said: O Marium! whence comes this to you? She said: It is from Allah. Surely Allah gives to whom He pleases without measure.","translation_id":"Maka Dia (Allah) menerimanya dengan penerimaan yang baik, membesarkannya dengan pertumbuhan yang baik dan menyerahkan pemeliharaannya kepada Zakaria. Setiap kali Zakaria masuk menemuinya di mihrab (kamar khusus ibadah), dia dapati makanan di sisinya. Dia berkata, “Wahai Maryam! Dari mana ini engkau peroleh?” Dia (Maryam) menjawab, “Itu dari Allah.” Sesungguhnya Allah memberi rezeki kepada siapa yang Dia kehendaki tanpa perhitungan.","hasanah_per_verse":1380},{"text_madani":"هُنَالِكَ دَعَا زَكَرِيَّا رَبَّهُ ۖ قَالَ رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ","text_tajweed":"هُنَالِكَ دَعَا زَكَرِيَّا رَبَّهُ[n[ۥ]‌ۖ قَالَ رَبِّ هَ[q:1878[بْ] لِى م[u:1746[ِن ل]َّدُ[f:1747[نك]َ ذُرِّيَّ[f:1879[ةً ط]َيِّبَةً‌ۖ إِ[g[نّ]َكَ سَمِيعُ [h:1880[ٱ][l[ل]دُّع[o[َا]ٓءِ","translation_en":"There did Zakariya pray to his Lord; he said: My Lord! grant me from Thee good offspring; surely Thou art the Hearer of prayer.","translation_id":"Di sanalah Zakaria berdoa kepada Tuhannya. Dia berkata, “Ya Tuhanku, berilah aku keturunan yang baik dari sisi-Mu, sesungguhnya Engkau Maha Mendengar doa.”","hasanah_per_verse":520},{"text_madani":"فَنَادَتْهُ الْمَلَائِكَةُ وَهُوَ قَائِمٌ يُصَلِّي فِي الْمِحْرَابِ أَنَّ اللَّهَ يُبَشِّرُكَ بِيَحْيَىٰ مُصَدِّقًا بِكَلِمَةٍ مِّنَ اللَّهِ وَسَيِّدًا وَحَصُورًا وَنَبِيًّا مِّنَ الصَّالِحِينَ","text_tajweed":"فَنَادَتْهُ [h:1881[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ وَهُوَ ق[o[َا]ٓئِ[a:1882[مٌ ي]ُصَلِّى فِى [h:1883[ٱ]لْمِحْرَابِ أَ[g[نّ]َ [h:394[ٱ]للَّهَ يُبَشِّرُكَ بِيَحْيَىٰ مُصَدِّق[i:1884[َۢا ب]ِكَلِمَ[a:1885[ةٍ م]ِّنَ [h:321[ٱ]للَّهِ وَسَيِّ[a:1886[دًا و]َحَصُو[a:1887[رًا و]َنَبِي[a:1888[ًّا م]ِّنَ [h:1889[ٱ][l[ل]صَّ[n[ـٰ]لِح[p[ِي]نَ","translation_en":"Then the angels called to him as he stood praying in the sanctuary: That Allah gives you the good news of Yahya verifying a Word from Allah, and honorable and chaste and a prophet from among the good ones.","translation_id":"Kemudian para malaikat memanggilnya, ketika dia berdiri melaksanakan shalat di mihrab, “Allah menyampaikan kabar gembira kepadamu dengan (kelahiran) Yahya, yang membenarkan sebuah kalimat (firman) dari Allah, panutan, berkemampuan menahan diri (dari hawa nafsu) dan seorang nabi di antara orang-orang shalih.”","hasanah_per_verse":920},{"text_madani":"قَالَ رَبِّ أَنَّىٰ يَكُونُ لِي غُلَامٌ وَقَدْ بَلَغَنِيَ الْكِبَرُ وَامْرَأَتِي عَاقِرٌ ۖ قَالَ كَذَٰلِكَ اللَّهُ يَفْعَلُ مَا يَشَاءُ","text_tajweed":"قَالَ رَبِّ أَ[g[نّ]َىٰ يَكُونُ لِى غُلَ[n[ـٰ][a:1890[مٌ و]َقَ[q:387[دْ] بَلَغَنِىَ [h:1891[ٱ]لْكِبَرُ وَ[h:1892[ٱ]مْرَأَتِى عَاقِ[f:1893[رٌ‌ۖ ق]َالَ كَذ[n[َٲ]لِكَ [h:1894[ٱ]للَّهُ يَفْعَلُ مَا يَش[o[َا]ٓءُ","translation_en":"He said: My Lord! when shall there be a son (born) to me, and old age has already come upon me, and my wife is barren? He said: even thus does Allah what He pleases.","translation_id":"Dia (Zakaria) berkata, “Ya Tuhanku, bagaimana aku bisa mendapat anak sedang aku sudah sangat tua dan istriku pun mandul?” Dia (Allah) berfirman, “Demikianlah, Allah berbuat apa yang Dia kehendaki.”","hasanah_per_verse":630},{"text_madani":"قَالَ رَبِّ اجْعَل لِّي آيَةً ۖ قَالَ آيَتُكَ أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَةَ أَيَّامٍ إِلَّا رَمْزًا ۗ وَاذْكُر رَّبَّكَ كَثِيرًا وَسَبِّحْ بِالْعَشِيِّ وَالْإِبْكَارِ","text_tajweed":"قَالَ رَبِّ [h:657[ٱ][q:658[جْ]عَل لّ[o[ِىٓ] ءَايَ[f:1895[ةً‌ۖ ق]َالَ ءَايَتُكَ أَلَّا تُكَلِّمَ [h:1896[ٱ][l[ل][g[نّ]َاسَ ثَلَ[n[ـٰ]ثَةَ أَيَّامٍ إِلَّا رَمْ[a:1897[زًا‌ۗ و]َ[h:1898[ٱ]ذْكُر رَّبَّكَ كَثِي[a:1899[رًا و]َسَبِّحْ بِ[h:1900[ٱ]لْعَشِىِّ وَ[h:1901[ٱ]لْإِ[q:1901[بْ]كَ[p[ـٰ]رِ","translation_en":"He said: My Lord! appoint a sign for me. Said He: Your sign is that you should not speak to men for three days except by signs; and remember your Lord much and glorify Him in the evening and the morning.","translation_id":"Dia (Zakaria) berkata, “Ya Tuhanku, berilah aku suatu tanda.” Allah berfirman, “Tanda bagimu, adalah bahwa engkau tidak berbicara dengan manusia selama tiga hari, kecuali dengan isyarat. Dan sebutlah (nama) Tuhanmu banyak-banyak, dan bertasbihlah (memuji-Nya) pada waktu petang dan pagi hari.”","hasanah_per_verse":800},{"text_madani":"وَإِذْ قَالَتِ الْمَلَائِكَةُ يَا مَرْيَمُ إِنَّ اللَّهَ اصْطَفَاكِ وَطَهَّرَكِ وَاصْطَفَاكِ عَلَىٰ نِسَاءِ الْعَالَمِينَ","text_tajweed":"وَإِذْ قَالَتِ [h:1902[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ يَ[n[ـٰ]مَرْيَمُ إِ[g[نّ]َ [h:80[ٱ]للَّهَ [h:1903[ٱ]صْطَفَ[n[ـٰ]كِ وَطَهَّرَكِ وَ[h:1904[ٱ]صْطَفَ[n[ـٰ]كِ عَلَىٰ نِس[o[َا]ٓءِ [h:1905[ٱ]لْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"And when the angels said: O Marium! surely Allah has chosen you and purified you and chosen you above the women of of the world.","translation_id":"Dan (ingatlah) ketika para malaikat berkata, “Wahai Maryam! Sesungguhnya Allah telah memilihmu, menyucikanmu, dan melebihkanmu di atas segala perempuan di seluruh alam (pada masa itu).","hasanah_per_verse":600},{"text_madani":"يَا مَرْيَمُ اقْنُتِي لِرَبِّكِ وَاسْجُدِي وَارْكَعِي مَعَ الرَّاكِعِينَ","text_tajweed":"يَ[n[ـٰ]مَرْيَمُ [h:1906[ٱ][q:1907[قْ]نُتِى لِرَبِّكِ وَ[h:1908[ٱ]سْجُدِى وَ[h:1909[ٱ]رْكَعِى مَعَ [h:217[ٱ][l[ل]رّ[n[َٲ]كِع[p[ِي]نَ","translation_en":"O Marium! keep to obedience to your Lord and humble yourself, and bow down with those who bow.","translation_id":"Wahai Maryam! Taatilah Tuhanmu, sujud dan rukuklah bersama orang-orang yang rukuk.”","hasanah_per_verse":370},{"text_madani":"ذَٰلِكَ مِنْ أَنبَاءِ الْغَيْبِ نُوحِيهِ إِلَيْكَ ۚ وَمَا كُنتَ لَدَيْهِمْ إِذْ يُلْقُونَ أَقْلَامَهُمْ أَيُّهُمْ يَكْفُلُ مَرْيَمَ وَمَا كُنتَ لَدَيْهِمْ إِذْ يَخْتَصِمُونَ","text_tajweed":"ذ[n[َٲ]لِكَ مِنْ أَ[i:1910[نۢب][o[َا]ٓءِ [h:1911[ٱ]لْغَيْبِ نُوحِيهِ إِلَيْكَ‌ۚ وَمَا كُ[f:735[نت]َ لَدَيْهِمْ إِذْ يُلْقُونَ أَ[q:1912[قْ]لَ[n[ـٰ]مَهُمْ أَيُّهُمْ يَكْفُلُ مَرْيَمَ وَمَا كُ[f:735[نت]َ لَدَيْهِمْ إِذْ يَخْتَصِم[p[ُو]نَ","translation_en":"This is of the announcements relating to the unseen which We reveal to you; and you were not with them when they cast their pens (to decide) which of them should have Marium in his charge, and you were not with them when they contended one with another.","translation_id":"Itulah sebagian dari berita-berita gaib yang Kami wahyukan kepadamu (Muhammad), padahal engkau tidak bersama mereka ketika mereka melemparkan pena mereka (untuk mengundi) siapa di antara mereka yang akan memelihara Maryam. Dan engkau pun tidak bersama mereka ketika mereka bertengkar.","hasanah_per_verse":810},{"text_madani":"إِذْ قَالَتِ الْمَلَائِكَةُ يَا مَرْيَمُ إِنَّ اللَّهَ يُبَشِّرُكِ بِكَلِمَةٍ مِّنْهُ اسْمُهُ الْمَسِيحُ عِيسَى ابْنُ مَرْيَمَ وَجِيهًا فِي الدُّنْيَا وَالْآخِرَةِ وَمِنَ الْمُقَرَّبِينَ","text_tajweed":"إِذْ قَالَتِ [h:1902[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ يَ[n[ـٰ]مَرْيَمُ إِ[g[نّ]َ [h:80[ٱ]للَّهَ يُبَشِّرُكِ بِكَلِمَ[a:1913[ةٍ م]ِّنْهُ [h:1914[ٱ]سْمُهُ [h:1915[ٱ]لْمَسِيحُ عِيسَى [h:1916[ٱ][q:1917[بْ]نُ مَرْيَمَ وَجِي[f:1918[هًا ف]ِى [h:599[ٱ][l[ل]دُّنْيَا وَ[h:1213[ٱ]لْأَخِرَةِ وَمِنَ [h:1919[ٱ]لْمُقَرَّب[p[ِي]نَ","translation_en":"When the angels said: O Marium, surely Allah gives you good news with a Word from Him (of one) whose name is the '. Messiah, Isa son of Marium, worthy of regard in this world and the hereafter and of those who are made near (to Allah).","translation_id":"(Ingatlah), ketika para malaikat berkata, “Wahai Maryam! Sesungguhnya Allah menyampaikan kabar gembira kepadamu tentang sebuah kalimat (fir-man) dari-Nya (yaitu seorang putra), namanya Al-Masih Isa putra Maryam, seorang terkemuka di dunia dan di akhirat, dan termasuk orang-orang yang didekatkan (kepada Allah),","hasanah_per_verse":910},{"text_madani":"وَيُكَلِّمُ النَّاسَ فِي الْمَهْدِ وَكَهْلًا وَمِنَ الصَّالِحِينَ","text_tajweed":"وَيُكَلِّمُ [h:1920[ٱ][l[ل][g[نّ]َاسَ فِى [h:1921[ٱ]لْمَهْدِ وَكَهْل[a:1922[اً و]َمِنَ [h:1923[ٱ][l[ل]صَّ[n[ـٰ]لِح[p[ِي]نَ","translation_en":"And he shall speak to the people when in the cradle and when of old age, and (he shall be) one of the good ones.","translation_id":"dan dia berbicara dengan manusia (sewaktu) dalam buaian dan ketika sudah dewasa, dan dia termasuk di antara orang-orang shalih.”","hasanah_per_verse":330},{"text_madani":"قَالَتْ رَبِّ أَنَّىٰ يَكُونُ لِي وَلَدٌ وَلَمْ يَمْسَسْنِي بَشَرٌ ۖ قَالَ كَذَٰلِكِ اللَّهُ يَخْلُقُ مَا يَشَاءُ ۚ إِذَا قَضَىٰ أَمْرًا فَإِنَّمَا يَقُولُ لَهُ كُن فَيَكُونُ","text_tajweed":"قَالَتْ رَبِّ أَ[g[نّ]َىٰ يَكُونُ لِى وَلَ[a:1924[دٌ و]َلَمْ يَمْسَسْنِى بَشَ[f:1925[رٌ‌ۖ ق]َالَ كَذ[n[َٲ]لِكِ [h:1926[ٱ]للَّهُ يَخْلُقُ مَا يَش[o[َا]ٓءُ‌ۚ إِذَا قَضَ[o[ىٰٓ] أَمْ[f:612[رًا ف]َإِ[g[نّ]َمَا يَقُولُ لَهُ[n[ۥ] كُ[f:613[ن ف]َيَك[p[ُو]نُ","translation_en":"She said: My Lord! when shall there be a son (born) to I me, and man has not touched me? He said: Even so, Allah creates what He pleases; when He has decreed a matter, He only says to it, Be, and it is.","translation_id":"Dia (Maryam) berkata, “Ya Tuhanku, bagaimana mungkin aku akan mempunyai anak, padahal tidak ada seorang laki-laki pun yang menyentuhku?” Dia (Allah) berfirman, “Demikianlah Allah menciptakan apa yang Dia kehendaki. Apabila Dia hendak menetapkan sesuatu, Dia hanya berkata kepadanya, “Jadilah!” Maka jadilah sesuatu itu.","hasanah_per_verse":790},{"text_madani":"وَيُعَلِّمُهُ الْكِتَابَ وَالْحِكْمَةَ وَالتَّوْرَاةَ وَالْإِنجِيلَ","text_tajweed":"وَيُعَلِّمُهُ [h:1927[ٱ]لْكِتَ[n[ـٰ]بَ وَ[h:679[ٱ]لْحِكْمَةَ وَ[h:1928[ٱ][l[ل]تَّوْرَ[n[ٮٰ]ةَ وَ[h:1725[ٱ]لْإِ[f:1725[نج][p[ِي]لَ","translation_en":"And He will teach him the Book and the wisdom and the Tavrat and the Injeel.","translation_id":"Dan Dia (Allah) mengajarkan kepadanya (Isa) Kitab, Hikmah, Taurat, dan Injil.","hasanah_per_verse":350},{"text_madani":"وَرَسُولًا إِلَىٰ بَنِي إِسْرَائِيلَ أَنِّي قَدْ جِئْتُكُم بِآيَةٍ مِّن رَّبِّكُمْ ۖ أَنِّي أَخْلُقُ لَكُم مِّنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ فَأَنفُخُ فِيهِ فَيَكُونُ طَيْرًا بِإِذْنِ اللَّهِ ۖ وَأُبْرِئُ الْأَكْمَهَ وَالْأَبْرَصَ وَأُحْيِي الْمَوْتَىٰ بِإِذْنِ اللَّهِ ۖ وَأُنَبِّئُكُم بِمَا تَأْكُلُونَ وَمَا تَدَّخِرُونَ فِي بُيُوتِكُمْ ۚ إِنَّ فِي ذَٰلِكَ لَآيَةً لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ","text_tajweed":"وَرَسُولاً إِلَىٰ بَن[o[ِىٓ] إِسْر[o[َٲ]ٓءِيلَ أَ[g[نّ]ِى قَ[q:298[دْ] جِئْتُك[c:1929[ُم ب]ِـَٔـايَ[a:1930[ةٍ م]ّ[u:243[ِن ر]َّبِّكُمْ‌ۖ أَ[g[نّ][o[ِىٓ] أَخْلُقُ لَك[w:1578[ُم م]ِّنَ [h:1931[ٱ][l[ل]طِّينِ كَهَيْــَٔةِ [h:1932[ٱ][l[ل]طَّيْرِ فَأَ[f:1933[نف]ُخُ فِيهِ فَيَكُونُ طَيْر[i:1934[َۢا ب]ِإِذْنِ [h:509[ٱ]للَّهِ‌ۖ وَأُ[q:1935[بْ]رِئُ [h:1936[ٱ]لْأَكْمَهَ وَ[h:1937[ٱ]لْأَ[q:1937[بْ]رَصَ وَأُحْىِ [h:1938[ٱ]لْمَوْتَىٰ بِإِذْنِ [h:509[ٱ]للَّهِ‌ۖ وَأُنَبِّئُك[c:1939[ُم ب]ِمَا تَأْكُلُونَ وَمَا تَدَّخِرُونَ فِى بُيُوتِكُمْ‌ۚ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[u:1410[ةً ل]َّكُمْ إِ[f:109[ن ك]ُ[f:100[نت][w:482[ُم م]ُّؤْمِن[p[ِي]نَ","translation_en":"And (make him) a messenger to the children of Israel: That I have come to you with a sign from your Lord, that I determine for you out of dust like the form of a bird, then I breathe into it and it becomes a bird with Allah's permission and I heal the blind and the leprous, and bring the dead to life with Allah's permission and I inform you of what you should eat and what you should store in your houses; most surely there is a sign in this for you, if you are believers.","translation_id":"Dan sebagai Rasul kepada Bani Israil (dia berkata), “Aku telah datang kepada kamu dengan sebuah tanda (mukjizat) dari Tuhanmu, yaitu aku membuatkan bagimu (sesuatu) dari tanah berbentuk seperti burung, lalu aku meniupnya, maka ia menjadi seekor burung dengan izin Allah. Dan aku menyembuhkan orang yang buta sejak dari lahir dan orang yang berpenyakit kusta. Dan aku menghidupkan orang mati dengan izin Allah, dan aku beritahukan kepadamu apa yang kamu makan dan apa yang kamu simpan di rumahmu. Sesungguhnya pada yang demikian itu terdapat suatu tanda (kebenaran kerasulanku) bagimu, jika kamu orang beriman.","hasanah_per_verse":1870},{"text_madani":"وَمُصَدِّقًا لِّمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَلِأُحِلَّ لَكُم بَعْضَ الَّذِي حُرِّمَ عَلَيْكُمْ ۚ وَجِئْتُكُم بِآيَةٍ مِّن رَّبِّكُمْ فَاتَّقُوا اللَّهَ وَأَطِيعُونِ","text_tajweed":"وَمُصَدِّ[u:1940[قًا ل]ِّمَا بَيْنَ يَدَىَّ مِنَ [h:1941[ٱ][l[ل]تَّوْرَ[n[ٮٰ]ةِ وَلِأُحِلَّ لَك[c:1942[ُم ب]َعْضَ [h:1943[ٱ]لَّذِى حُرِّمَ عَلَيْكُمْ‌ۚ وَجِئْتُك[c:1944[ُم ب]ِـَٔـايَ[a:1930[ةٍ م]ّ[u:243[ِن ر]َّبِّكُمْ فَ[h:112[ٱ]تَّقُو[s[اْ] [h:1945[ٱ]للَّهَ وَأَطِيع[p[ُو]نِ","translation_en":"And a verifier of that which is before me of the Taurat and that I may allow you part of that which has been forbidden t you, and I have come to you with a sign from your Lord therefore be careful of (your duty to) Allah and obey me.","translation_id":"Dan sebagai seorang yang membenarkan Taurat yang datang sebelumku, dan agar aku menghalalkan bagi kamu sebagian dari yang telah diharamkan untukmu. Dan aku datang kepadamu membawa suatu tanda (mukjizat) dari Tuhanmu. Karena itu, bertakwalah kepada Allah dan taatlah kepadaku.","hasanah_per_verse":800},{"text_madani":"إِنَّ اللَّهَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ ۗ هَٰذَا صِرَاطٌ مُّسْتَقِيمٌ","text_tajweed":"إِ[g[نّ]َ [h:80[ٱ]للَّهَ رَبِّى وَرَبُّكُمْ فَ[h:1946[ٱ]عْبُدُوهُ‌ۗ هَ[n[ـٰ]ذَا صِر[n[َٲ][a:1947[طٌ م]ُّسْتَق[p[ِي]مٌ","translation_en":"Surely Allah is my Lord and your Lord, therefore serve Him; this is the right path.","translation_id":"Sesungguhnya Allah itu Tuhanku dan Tuhanmu, karena itu sembahlah Dia. Inilah jalan yang lurus.”","hasanah_per_verse":340},{"text_madani":"فَلَمَّا أَحَسَّ عِيسَىٰ مِنْهُمُ الْكُفْرَ قَالَ مَنْ أَنصَارِي إِلَى اللَّهِ ۖ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنصَارُ اللَّهِ آمَنَّا بِاللَّهِ وَاشْهَدْ بِأَنَّا مُسْلِمُونَ","text_tajweed":"۞ فَلَ[g[مّ][o[َآ] أَحَسَّ عِيسَىٰ مِنْهُمُ [h:1948[ٱ]لْكُفْرَ قَالَ مَنْ أَ[f:1949[نص]َار[o[ِىٓ] إِلَى [h:1637[ٱ]للَّهِ‌ۖ قَالَ [h:1950[ٱ]لْحَوَارِيُّونَ نَحْنُ أَ[f:1951[نص]َارُ [h:1952[ٱ]للَّهِ ءَامَ[g[نّ]َا بِ[h:32[ٱ]للَّهِ وَ[h:1953[ٱ]شْهَ[q:1953[دْ] بِأَ[g[نّ]َا مُسْلِم[p[ُو]نَ","translation_en":"But when Isa perceived unbelief on their part, he said Who will be my helpers in Allah's way? The disciples said: We are helpers (in the way) of Allah: We believe in Allah and bear witness that we are submitting ones.","translation_id":"Maka ketika Isa merasakan keingkaran mereka (Bani Israil), dia berkata, “Siapakah yang akan menjadi penolong untuk (menegakkan agama) Allah?” Para Hawariyyµn (sahabat setianya) menjawab, “Kamilah penolong (agama) Allah. Kami beriman kepada Allah, dan saksikanlah, bahwa kami adalah orang-orang Muslim.","hasanah_per_verse":860},{"text_madani":"رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ","text_tajweed":"رَبَّن[o[َآ] ءَامَ[g[نّ]َا بِم[o[َآ] أَ[f:1954[نز]َلْتَ وَ[h:1955[ٱ]تَّبَعْنَا [h:1956[ٱ][l[ل]رَّسُولَ فَ[h:1957[ٱ]كْتُ[q:1957[بْ]نَا مَعَ [h:1958[ٱ][l[ل]شَّ[n[ـٰ]هِد[p[ِي]نَ","translation_en":"Our Lord! we believe in what Thou hast revealed and we follow the messenger, so write us down with those who bear witness.","translation_id":"Ya Tuhan kami, kami telah beriman kepada apa yang Engkau turunkan dan kami telah mengikuti Rasul, karena itu tetapkanlah kami bersama golongan orang yang memberikan kesaksian.”","hasanah_per_verse":460},{"text_madani":"وَمَكَرُوا وَمَكَرَ اللَّهُ ۖ وَاللَّهُ خَيْرُ الْمَاكِرِينَ","text_tajweed":"وَمَكَرُو[s[اْ] وَمَكَرَ [h:1959[ٱ]للَّهُ‌ۖ وَ[h:72[ٱ]للَّهُ خَيْرُ [h:1960[ٱ]لْمَ[n[ـٰ]كِر[p[ِي]نَ","translation_en":"And they planned and Allah (also) planned, and Allah is the best of planners.","translation_id":"Dan mereka (orang-orang kafir) membuat tipu daya, maka Allah pun membalas tipu daya. Dan Allah sebaik-baik pembalas tipu daya.","hasanah_per_verse":300},{"text_madani":"إِذْ قَالَ اللَّهُ يَا عِيسَىٰ إِنِّي مُتَوَفِّيكَ وَرَافِعُكَ إِلَيَّ وَمُطَهِّرُكَ مِنَ الَّذِينَ كَفَرُوا وَجَاعِلُ الَّذِينَ اتَّبَعُوكَ فَوْقَ الَّذِينَ كَفَرُوا إِلَىٰ يَوْمِ الْقِيَامَةِ ۖ ثُمَّ إِلَيَّ مَرْجِعُكُمْ فَأَحْكُمُ بَيْنَكُمْ فِيمَا كُنتُمْ فِيهِ تَخْتَلِفُونَ","text_tajweed":"إِذْ قَالَ [h:1961[ٱ]للَّهُ يَ[n[ـٰ]عِيسَ[o[ىٰٓ] إِ[g[نّ]ِى مُتَوَفِّيكَ وَرَافِعُكَ إِلَىَّ وَمُطَهِّرُكَ مِنَ [h:523[ٱ]لَّذِينَ كَفَرُو[s[اْ] وَجَاعِلُ [h:1962[ٱ]لَّذِينَ [h:1963[ٱ]تَّبَعُوكَ فَوْقَ [h:1964[ٱ]لَّذِينَ كَفَر[o[ُوٓ][s[اْ] إِلَىٰ يَوْمِ [h:1965[ٱ]لْقِيَ[n[ـٰ]مَةِ‌ۖ ثُ[g[مّ]َ إِلَىَّ مَرْجِعُكُمْ فَأَحْكُمُ بَيْنَكُمْ فِيمَا كُ[f:100[نت]ُمْ فِيهِ تَخْتَلِف[p[ُو]نَ","translation_en":"And when Allah said: O Isa, I am going to terminate the period of your stay (on earth) and cause you to ascend unto Me and purify you of those who disbelieve and make those who follow you above those who disbelieve to the day of resurrection; then to Me shall be your return, so l will decide between you concerning that in which you differed.","translation_id":"(Ingatlah), ketika Allah berfirman, “Wahai Isa! Aku mengambilmu dan mengangkatmu kepada-Ku, serta menyucikanmu dari orang-orang yang kafir, dan menjadikan orang-orang yang mengikutimu di atas orang-orang yang kafir hingga hari Kiamat. Kemudian kepada-Ku engkau kembali, lalu Aku beri keputusan tentang apa yang kamu perselisihkan.”","hasanah_per_verse":1320},{"text_madani":"فَأَمَّا الَّذِينَ كَفَرُوا فَأُعَذِّبُهُمْ عَذَابًا شَدِيدًا فِي الدُّنْيَا وَالْآخِرَةِ وَمَا لَهُم مِّن نَّاصِرِينَ","text_tajweed":"فَأَ[g[مّ]َا [h:136[ٱ]لَّذِينَ كَفَرُو[s[اْ] فَأُعَذِّبُهُمْ عَذَا[f:1966[بًا ش]َدِي[f:1967[دًا ف]ِى [h:599[ٱ][l[ل]دُّنْيَا وَ[h:1213[ٱ]لْأَخِرَةِ وَمَا لَه[w:1812[ُم م]ّ[a:1813[ِن ن]َّ[n[ـٰ]صِر[p[ِي]نَ","translation_en":"Then as to those who disbelieve, I will chastise them with severe chastisement in this world and the hereafter, and they shall have no helpers.","translation_id":"Maka adapun orang-orang yang kafir, maka akan Aku azab mereka dengan azab yang sangat keras di dunia dan di akhirat, sedang mereka tidak memperoleh penolong.","hasanah_per_verse":600},{"text_madani":"وَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَيُوَفِّيهِمْ أُجُورَهُمْ ۗ وَاللَّهُ لَا يُحِبُّ الظَّالِمِينَ","text_tajweed":"وَأَ[g[مّ]َا [h:138[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ فَيُوَفِّيهِمْ أُجُورَهُمْ‌ۗ وَ[h:72[ٱ]للَّهُ لَا يُحِبُّ [h:1968[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And as to those who believe and do good deeds, He will pay them fully their rewards; and Allah does not love the unjust.","translation_id":"Dan adapun orang yang beriman dan melakukan kebajikan, maka Dia akan memberikan pahala kepada mereka dengan sempurna. Dan Allah tidak menyukai orang zhalim.","hasanah_per_verse":590},{"text_madani":"ذَٰلِكَ نَتْلُوهُ عَلَيْكَ مِنَ الْآيَاتِ وَالذِّكْرِ الْحَكِيمِ","text_tajweed":"ذ[n[َٲ]لِكَ نَتْلُوهُ عَلَيْكَ مِنَ [h:1969[ٱ]لْأَيَ[n[ـٰ]تِ وَ[h:1970[ٱ][l[ل]ذِّكْرِ [h:1971[ٱ]لْحَك[p[ِي]مِ","translation_en":"This We recite to you of the communications and the wise reminder.","translation_id":"Demikianlah Kami bacakan kepadamu (Muhammad) sebagian ayat-ayat dan peringatan yang penuh hikmah.","hasanah_per_verse":320},{"text_madani":"إِنَّ مَثَلَ عِيسَىٰ عِندَ اللَّهِ كَمَثَلِ آدَمَ ۖ خَلَقَهُ مِن تُرَابٍ ثُمَّ قَالَ لَهُ كُن فَيَكُونُ","text_tajweed":"إِ[g[نّ]َ مَثَلَ عِيسَىٰ عِ[f:264[ند]َ [h:408[ٱ]للَّهِ كَمَثَلِ ءَادَمَ‌ۖ خَلَقَهُ[n[ۥ] مِ[f:1972[ن ت]ُرَا[f:1973[بٍ ث]ُ[g[مّ]َ قَالَ لَهُ[n[ۥ] كُ[f:613[ن ف]َيَك[p[ُو]نُ","translation_en":"Surely the likeness of Isa is with Allah as the likeness of Adam; He created him from dust, then said to him, Be, and he was.","translation_id":"Sesungguhnya perumpamaan (penciptaan) Isa bagi Allah, seperti (penciptaan) Adam. Dia menciptakannya dari tanah, kemudian Dia berkata kepadanya, “Jadilah!” Maka jadilah sesuatu itu.","hasanah_per_verse":470},{"text_madani":"الْحَقُّ مِن رَّبِّكَ فَلَا تَكُن مِّنَ الْمُمْتَرِينَ","text_tajweed":"ٱلْحَقُّ م[u:770[ِن ر]َّبِّكَ فَلَا تَك[a:1974[ُن م]ِّنَ [h:771[ٱ]لْمُمْتَر[p[ِي]نَ","translation_en":"(This is) the truth from your Lord, so be not of the disputers.","translation_id":"Kebenaran itu dari Tuhanmu, karena itu janganlah engkau (Muhammad) termasuk orang-orang yang ragu.","hasanah_per_verse":250},{"text_madani":"فَمَنْ حَاجَّكَ فِيهِ مِن بَعْدِ مَا جَاءَكَ مِنَ الْعِلْمِ فَقُلْ تَعَالَوْا نَدْعُ أَبْنَاءَنَا وَأَبْنَاءَكُمْ وَنِسَاءَنَا وَنِسَاءَكُمْ وَأَنفُسَنَا وَأَنفُسَكُمْ ثُمَّ نَبْتَهِلْ فَنَجْعَل لَّعْنَتَ اللَّهِ عَلَى الْكَاذِبِينَ","text_tajweed":"فَمَنْ ح[m[َا]ٓجَّكَ فِيهِ م[i:146[ِنۢ ب]َعْدِ مَا ج[o[َا]ٓءَكَ مِنَ [h:634[ٱ]لْعِلْمِ فَقُلْ تَعَالَوْ[s[اْ] نَ[q:1975[دْ]عُ أَ[q:1976[بْ]ن[o[َا]ٓءَنَا وَأَ[q:1977[بْ]ن[o[َا]ٓءَكُمْ وَنِس[o[َا]ٓءَنَا وَنِس[o[َا]ٓءَكُمْ وَأَ[f:1978[نف]ُسَنَا وَأَ[f:1979[نف]ُسَكُمْ ثُ[g[مّ]َ نَ[q:1980[بْ]تَهِلْ فَنَ[q:1981[جْ]عَل لَّعْنَتَ [h:1982[ٱ]للَّهِ عَلَى [h:1983[ٱ]لْكَ[n[ـٰ]ذِب[p[ِي]نَ","translation_en":"But whoever disputes with you in this matter after what has come to you of knowledge, then say: Come let us call our sons and your sons and our women and your women and our near people and your near people, then let us be earnest in prayer, and pray for the curse of Allah on the liars.","translation_id":"Siapa yang membantahmu dalam hal ini setelah engkau memperoleh ilmu, katakanlah (Muhammad), “Marilah kita panggil anak-anak kami dan anak-anak kamu, istri-istri kami dan istri-istrimu, kami sendiri dan kamu juga, kemudian marilah kita ber-mubahalah agar laknat Allah ditimpakan kepada orang-orang yang dusta.”","hasanah_per_verse":1140},{"text_madani":"إِنَّ هَٰذَا لَهُوَ الْقَصَصُ الْحَقُّ ۚ وَمَا مِنْ إِلَٰهٍ إِلَّا اللَّهُ ۚ وَإِنَّ اللَّهَ لَهُوَ الْعَزِيزُ الْحَكِيمُ","text_tajweed":"إِ[g[نّ]َ هَ[n[ـٰ]ذَا لَهُوَ [h:1984[ٱ]لْقَصَصُ [h:1985[ٱ]لْحَقُّ‌ۚ وَمَا مِنْ إِلَ[n[ـٰ]هٍ إِلَّا [h:1742[ٱ]للَّهُ‌ۚ وَإِ[g[نّ]َ [h:1986[ٱ]للَّهَ لَهُوَ [h:1987[ٱ]لْعَزِيزُ [h:681[ٱ]لْحَك[p[ِي]مُ","translation_en":"Most surely this is the true explanation, and there is no god but Allah; and most surely Allah-- He is the Mighty, the Wise.","translation_id":"Sungguh, ini adalah kisah yang benar. Tidak ada tuhan selain Allah, dan sungguh, Allah Mahaperkasa, Mahabijaksana.","hasanah_per_verse":540},{"text_madani":"فَإِن تَوَلَّوْا فَإِنَّ اللَّهَ عَلِيمٌ بِالْمُفْسِدِينَ","text_tajweed":"فَإِ[f:1857[ن ت]َوَلَّوْ[s[اْ] فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ عَلِي[i:1988[مُۢ ب]ِ[h:1989[ٱ]لْمُفْسِد[p[ِي]نَ","translation_en":"But if they turn back, then surely Allah knows the mischief-makers.","translation_id":"Kemudian jika mereka berpaling, maka (ketahuilah) bahwa Allah Maha Mengetahui orang-orang yang berbuat kerusakan.","hasanah_per_verse":280},{"text_madani":"قُلْ يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَىٰ كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا اللَّهَ وَلَا نُشْرِكَ بِهِ شَيْئًا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِّن دُونِ اللَّهِ ۚ فَإِن تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ","text_tajweed":"قُلْ يَ[o[ـٰٓ]أَهْلَ [h:1990[ٱ]لْكِتَ[n[ـٰ]بِ تَعَالَوْ[s[اْ] إِلَىٰ كَلِمَ[f:1991[ةٍ س]َو[o[َا]ٓ[i:1992[ءِۭ ب]َيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا [h:416[ٱ]للَّهَ وَلَا نُشْرِكَ بِه[n[ِۦ] شَيْـ[a:232[ـًٔا و]َلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَا[a:1993[بًا م]ِّ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ‌ۚ فَإِ[f:1857[ن ت]َوَلَّوْ[s[اْ] فَقُولُو[s[اْ] [h:1994[ٱ]شْهَدُو[s[اْ] بِأَ[g[نّ]َا مُسْلِم[p[ُو]نَ","translation_en":"Say: O followers of the Book! come to an equitable proposition between us and you that we shall not serve any but Allah and (that) we shall not associate aught with Him, and (that) some of us shall not take others for lords besides Allah; but if they turn back, then say: Bear witness that we are Muslims.","translation_id":"Katakanlah (Muhammad), “Wahai Ahli Kitab! Marilah (kita) menuju kepada satu kalimat (pegangan) yang sama antara kami dan kamu, bahwa kita tidak menyembah selain Allah dan kita tidak mempersekutukan-Nya dengan sesuatu pun, dan bahwa kita tidak menjadikan satu sama lain tuhan-tuhan selain Allah. Jika mereka berpaling maka katakanlah (kepada mereka), “Saksikanlah, bahwa kami adalah orang Muslim.”","hasanah_per_verse":1290},{"text_madani":"يَا أَهْلَ الْكِتَابِ لِمَ تُحَاجُّونَ فِي إِبْرَاهِيمَ وَمَا أُنزِلَتِ التَّوْرَاةُ وَالْإِنجِيلُ إِلَّا مِن بَعْدِهِ ۚ أَفَلَا تَعْقِلُونَ","text_tajweed":"يَ[o[ـٰٓ]أَهْلَ [h:1990[ٱ]لْكِتَ[n[ـٰ]بِ لِمَ تُح[m[َا]ٓجُّونَ ف[o[ِىٓ] إِ[q:1860[بْ]ر[n[َٲ]هِيمَ وَم[o[َآ] أُ[f:1995[نز]ِلَتِ [h:1996[ٱ][l[ل]تَّوْرَ[n[ٮٰ]ةُ وَ[h:1997[ٱ]لْإِ[f:1997[نج]ِيلُ إِلَّا م[i:254[ِنۢ ب]َعْدِه[o[ِۦٓ‌ۚ] أَفَلَا تَعْقِل[p[ُو]نَ","translation_en":"O followers of the Book! why do you dispute about Ibrahim, when the Taurat and the Injeel were not revealed till after him; do you not then understand?","translation_id":"Wahai Ahli Kitab! Mengapa kamu berbantah-bantahan tentang Ibrahim, padahal Taurat dan Injil diturunkan setelah dia (Ibrahim)? Apakah kamu tidak mengerti?","hasanah_per_verse":700},{"text_madani":"هَا أَنتُمْ هَٰؤُلَاءِ حَاجَجْتُمْ فِيمَا لَكُم بِهِ عِلْمٌ فَلِمَ تُحَاجُّونَ فِيمَا لَيْسَ لَكُم بِهِ عِلْمٌ ۚ وَاللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ","text_tajweed":"هَ[o[ـٰٓ]أَ[f:1998[نت]ُمْ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ حَ[n[ـٰ]جَ[q:1999[جْ]تُمْ فِيمَا لَك[c:2000[ُم ب]ِه[n[ِۦ] عِلْ[f:2001[مٌ ف]َلِمَ تُح[m[َا]ٓجُّونَ فِيمَا لَيْسَ لَك[c:2000[ُم ب]ِه[n[ِۦ] عِلْ[a:2002[مٌ‌ۚ و]َ[h:72[ٱ]للَّهُ يَعْلَمُ وَأَ[f:98[نت]ُمْ لَا تَعْلَم[p[ُو]نَ","translation_en":"Behold! you are they who disputed about that of which you had knowledge; why then do you dispute about that of which you have no knowledge? And Allah knows while you do not know.","translation_id":"Begitulah kamu! Kamu berbantah-bantahan tentang apa yang kamu ketahui, tetapi mengapa kamu berbantah-bantahan juga tentang apa yang tidak kamu ketahui? Allah mengetahui sedang kamu tidak mengetahui.","hasanah_per_verse":750},{"text_madani":"مَا كَانَ إِبْرَاهِيمُ يَهُودِيًّا وَلَا نَصْرَانِيًّا وَلَٰكِن كَانَ حَنِيفًا مُّسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ","text_tajweed":"مَا كَانَ إِ[q:2003[بْ]ر[n[َٲ]هِيمُ يَهُودِي[a:2004[ًّا و]َلَا نَصْرَانِي[a:2005[ًّا و]َلَ[n[ـٰ]كِ[f:2006[ن ك]َانَ حَنِي[a:2007[فًا م]ُّسْلِ[a:2008[مًا و]َمَا كَانَ مِنَ [h:699[ٱ]لْمُشْرِك[p[ِي]نَ","translation_en":"Ibrahim was not a Jew nor a Christian but he was (an) upright (man), a Muslim, and he was not one of the polytheists.","translation_id":"Ibrahim bukanlah seorang Yahudi dan bukan (pula) seorang Nasrani, tetapi dia adalah seorang yang lurus, Muslim dan dia tidaklah termasuk orang-orang musyrik.","hasanah_per_verse":610},{"text_madani":"إِنَّ أَوْلَى النَّاسِ بِإِبْرَاهِيمَ لَلَّذِينَ اتَّبَعُوهُ وَهَٰذَا النَّبِيُّ وَالَّذِينَ آمَنُوا ۗ وَاللَّهُ وَلِيُّ الْمُؤْمِنِينَ","text_tajweed":"إِ[g[نّ]َ أَوْلَى [h:2009[ٱ][l[ل][g[نّ]َاسِ بِإِ[q:2010[بْ]ر[n[َٲ]هِيمَ لَلَّذِينَ [h:2011[ٱ]تَّبَعُوهُ وَهَ[n[ـٰ]ذَا [h:2012[ٱ][l[ل][g[نّ]َبِىُّ وَ[h:37[ٱ]لَّذِينَ ءَامَنُو[s[اْ‌ۗ] وَ[h:72[ٱ]للَّهُ وَلِىُّ [h:2013[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"Most surely the nearest of people to Ibrahim are those who followed him and this Prophet and those who believe and Allah is the guardian of the believers.","translation_id":"Orang yang paling dekat kepada Ibrahim ialah orang yang mengikutinya, dan Nabi ini (Muhammad), dan orang yang beriman. Allah adalah pelindung orang-orang yang beriman.","hasanah_per_verse":660},{"text_madani":"وَدَّت طَّائِفَةٌ مِّنْ أَهْلِ الْكِتَابِ لَوْ يُضِلُّونَكُمْ وَمَا يُضِلُّونَ إِلَّا أَنفُسَهُمْ وَمَا يَشْعُرُونَ","text_tajweed":"وَدَّ[d:2014[ت] طّ[o[َا]ٓئِفَ[a:2015[ةٌ م]ِّنْ أَهْلِ [h:545[ٱ]لْكِتَ[n[ـٰ]بِ لَوْ يُضِلُّونَكُمْ وَمَا يُضِلُّونَ إِلّ[o[َآ] أَ[f:38[نف]ُسَهُمْ وَمَا يَشْعُر[p[ُو]نَ","translation_en":"A party of the followers of the Book desire that they should lead you astray, and they lead not astray but themselves, and they do not perceive.","translation_id":"Segolongan Ahli Kitab ingin menyesatkan kamu. Padahal (sesungguhnya), mereka tidak menyesatkan melainkan diri mereka sendiri, tetapi mereka tidak menyadari.","hasanah_per_verse":540},{"text_madani":"يَا أَهْلَ الْكِتَابِ لِمَ تَكْفُرُونَ بِآيَاتِ اللَّهِ وَأَنتُمْ تَشْهَدُونَ","text_tajweed":"يَ[o[ـٰٓ]أَهْلَ [h:1990[ٱ]لْكِتَ[n[ـٰ]بِ لِمَ تَكْفُرُونَ بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ وَأَ[f:98[نت]ُمْ تَشْهَد[p[ُو]نَ","translation_en":"O followers of the Book! Why do you disbelieve in the communications of Allah while you witness (them)?","translation_id":"Wahai Ahli Kitab! Mengapa kamu mengingkari ayat-ayat Allah, padahal kamu mengetahui (kebenarannya)?","hasanah_per_verse":390},{"text_madani":"يَا أَهْلَ الْكِتَابِ لِمَ تَلْبِسُونَ الْحَقَّ بِالْبَاطِلِ وَتَكْتُمُونَ الْحَقَّ وَأَنتُمْ تَعْلَمُونَ","text_tajweed":"يَ[o[ـٰٓ]أَهْلَ [h:1990[ٱ]لْكِتَ[n[ـٰ]بِ لِمَ تَلْبِسُونَ [h:2016[ٱ]لْحَقَّ بِ[h:212[ٱ]لْبَ[n[ـٰ]طِلِ وَتَكْتُمُونَ [h:2017[ٱ]لْحَقَّ وَأَ[f:98[نت]ُمْ تَعْلَم[p[ُو]نَ","translation_en":"O followers of the Book! Why do you confound the truth with the falsehood and hide the truth while you know?","translation_id":"Wahai Ahli Kitab! Mengapa kamu mencampuradukkan kebenaran dengan kebatilan, dan kamu menyembunyikan kebenaran, padahal kamu mengetahui?","hasanah_per_verse":520},{"text_madani":"وَقَالَت طَّائِفَةٌ مِّنْ أَهْلِ الْكِتَابِ آمِنُوا بِالَّذِي أُنزِلَ عَلَى الَّذِينَ آمَنُوا وَجْهَ النَّهَارِ وَاكْفُرُوا آخِرَهُ لَعَلَّهُمْ يَرْجِعُونَ","text_tajweed":"وَقَالَ[d:2018[ت] طّ[o[َا]ٓئِفَ[a:2015[ةٌ م]ِّنْ أَهْلِ [h:545[ٱ]لْكِتَ[n[ـٰ]بِ ءَامِنُو[s[اْ] بِ[h:315[ٱ]لَّذ[o[ِىٓ] أُ[f:17[نز]ِلَ عَلَى [h:289[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَ[q:2019[جْ]هَ [h:2020[ٱ][l[ل][g[نّ]َهَارِ وَ[h:2021[ٱ]كْفُر[o[ُوٓ][s[اْ] ءَاخِرَهُ[n[ۥ] لَعَلَّهُمْ يَرْجِع[p[ُو]نَ","translation_en":"And a party of the followers of the Book say: Avow belief in that which has been revealed to those who believe, in the first part of the day, and disbelieve at the end of it, perhaps they go back on their religion.","translation_id":"Dan segolongan Ahli Kitab berkata (kepada sesamanya), “Berimanlah kamu kepada apa yang diturunkan kepada orang-orang beriman pada awal siang dan ingkarilah di akhirnya, agar mereka kembali (kepada kekafiran).","hasanah_per_verse":790},{"text_madani":"وَلَا تُؤْمِنُوا إِلَّا لِمَن تَبِعَ دِينَكُمْ قُلْ إِنَّ الْهُدَىٰ هُدَى اللَّهِ أَن يُؤْتَىٰ أَحَدٌ مِّثْلَ مَا أُوتِيتُمْ أَوْ يُحَاجُّوكُمْ عِندَ رَبِّكُمْ ۗ قُلْ إِنَّ الْفَضْلَ بِيَدِ اللَّهِ يُؤْتِيهِ مَن يَشَاءُ ۗ وَاللَّهُ وَاسِعٌ عَلِيمٌ","text_tajweed":"وَلَا تُؤْمِن[o[ُوٓ][s[اْ] إِلَّا لِمَ[f:2022[ن ت]َبِعَ دِينَكُمْ قُلْ إِ[g[نّ]َ [h:2023[ٱ]لْهُدَىٰ هُدَى [h:629[ٱ]للَّهِ أ[a:2024[َن ي]ُؤْتَ[o[ىٰٓ] أَحَ[a:2025[دٌ م]ِّثْلَ م[o[َآ] أُوتِيتُمْ أَوْ يُح[m[َا]ٓجُّوكُمْ عِ[f:264[ند]َ رَبِّكُمْ‌ۗ قُلْ إِ[g[نّ]َ [h:2026[ٱ]لْفَضْلَ بِيَدِ [h:2027[ٱ]للَّهِ يُؤْتِيهِ م[a:476[َن ي]َش[o[َا]ٓءُ‌ۗ وَ[h:72[ٱ]للَّهُ و[n[َٲ]سِعٌ عَل[p[ِي]مٌ","translation_en":"And do not believe but in him who follows your religion. Say: Surely the (true) guidance is the guidance of Allah-- that one may be given (by Him) the like of what you were given; or they would contend with you by an argument before your Lord. Say: Surely grace is in the hand of Allah, He gives it to whom He pleases; and Allah is Ample-giving, Knowing.","translation_id":"Dan janganlah kamu percaya selain kepada orang yang mengikuti agamamu.” Katakanlah (Muhammad), “Sesungguhnya petunjuk itu hanyalah petunjuk Allah. (Janganlah kamu percaya) bahwa seseorang akan diberi seperti apa yang diberikan kepada kamu, atau bahwa mereka akan menyanggah kamu di hadapan Tuhanmu.” Katakanlah (Muhammad), “Sesungguhnya karunia itu di tangan Allah, Dia memberikannya kepada siapa yang Dia kehendaki. Allah Mahaluas, Maha Mengetahui.”","hasanah_per_verse":1150},{"text_madani":"يَخْتَصُّ بِرَحْمَتِهِ مَن يَشَاءُ ۗ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ","text_tajweed":"يَخْتَصُّ بِرَحْمَتِه[n[ِۦ] م[a:476[َن ي]َش[o[َا]ٓءُ‌ۗ وَ[h:72[ٱ]للَّهُ ذُو [h:550[ٱ]لْفَضْلِ [h:551[ٱ]لْعَظ[p[ِي]مِ","translation_en":"He specially chooses for His mercy whom He pleases; and Allah is the Lord of mighty grace.","translation_id":"Dia menentukan rahmat-Nya kepada siapa yang Dia kehendaki. Dan Allah memiliki karunia yang besar.","hasanah_per_verse":340},{"text_madani":"وَمِنْ أَهْلِ الْكِتَابِ مَنْ إِن تَأْمَنْهُ بِقِنطَارٍ يُؤَدِّهِ إِلَيْكَ وَمِنْهُم مَّنْ إِن تَأْمَنْهُ بِدِينَارٍ لَّا يُؤَدِّهِ إِلَيْكَ إِلَّا مَا دُمْتَ عَلَيْهِ قَائِمًا ۗ ذَٰلِكَ بِأَنَّهُمْ قَالُوا لَيْسَ عَلَيْنَا فِي الْأُمِّيِّينَ سَبِيلٌ وَيَقُولُونَ عَلَى اللَّهِ الْكَذِبَ وَهُمْ يَعْلَمُونَ","text_tajweed":"۞ وَمِنْ أَهْلِ [h:545[ٱ]لْكِتَ[n[ـٰ]بِ مَنْ إِ[f:2028[ن ت]َأْمَنْهُ بِقِ[f:2029[نط]َا[a:2030[رٍ ي]ُؤَدِّه[o[ِۦٓ] إِلَيْكَ وَمِنْه[w:1106[ُم م]َّنْ إِ[f:2028[ن ت]َأْمَنْهُ بِدِينَا[u:2031[رٍ ل]َّا يُؤَدِّه[o[ِۦٓ] إِلَيْكَ إِلَّا مَا دُمْتَ عَلَيْهِ ق[o[َا]ٓئِ[f:2032[مًا‌ۗ ذ][n[َٲ]لِكَ بِأَ[g[نّ]َهُمْ قَالُو[s[اْ] لَيْسَ عَلَيْنَا فِى [h:2033[ٱ]لْأُ[g[مّ]ِيِّـ[n[ـۧ]نَ سَبِي[a:2034[لٌ و]َيَقُولُونَ عَلَى [h:412[ٱ]للَّهِ [h:2035[ٱ]لْكَذِبَ وَهُمْ يَعْلَم[p[ُو]نَ","translation_en":"And among the followers of the Book there are some such that if you entrust one (of them) with a heap of wealth, he shall pay it back to you; and among them there are some such that if you entrust one (of them) with a dinar he shall not pay it back to you except so long as you remain firm in demanding it; this is because they say: There is not upon us in the matter of the unlearned people any way (to reproach); and they tell a lie against Allah while they know.","translation_id":"Dan di antara Ahli Kitab ada yang jika engkau percayakan kepadanya harta yang banyak, niscaya dia mengembalikannya kepadamu. Tetapi ada (pula) di antara mereka yang jika engkau percayakan kepadanya satu dinar, dia tidak mengembalikannya kepadamu, kecuali jika engkau selalu menagihnya. Yang demikian itu disebabkan mereka berkata, “Tidak ada dosa bagi kami terhadap orang-orang buta huruf.” Mereka mengatakan hal yang dusta terhadap Allah, padahal mereka mengetahui.","hasanah_per_verse":1440},{"text_madani":"بَلَىٰ مَنْ أَوْفَىٰ بِعَهْدِهِ وَاتَّقَىٰ فَإِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ","text_tajweed":"بَلَىٰ مَنْ أَوْفَىٰ بِعَهْدِه[n[ِۦ] وَ[h:2036[ٱ]تَّقَىٰ فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ يُحِبُّ [h:2037[ٱ]لْمُتَّق[p[ِي]نَ","translation_en":"Yea, whoever fulfills his promise and guards (against evil)-- then surely Allah loves those who guard (against evil).","translation_id":"Sebenarnya barangsiapa menepati janji dan bertakwa, maka sungguh, Allah mencintai orang-orang yang bertakwa.","hasanah_per_verse":360},{"text_madani":"إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا أُولَٰئِكَ لَا خَلَاقَ لَهُمْ فِي الْآخِرَةِ وَلَا يُكَلِّمُهُمُ اللَّهُ وَلَا يَنظُرُ إِلَيْهِمْ يَوْمَ الْقِيَامَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ يَشْتَرُونَ بِعَهْدِ [h:2038[ٱ]للَّهِ وَأَيْمَ[n[ـٰ]نِهِمْ ثَمَ[f:208[نًا ق]َلِيلاً أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ لَا خَلَ[n[ـٰ]قَ لَهُمْ فِى [h:536[ٱ]لْأَخِرَةِ وَلَا يُكَلِّمُهُمُ [h:893[ٱ]للَّهُ وَلَا يَ[f:2039[نظ]ُرُ إِلَيْهِمْ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"(As for) those who take a small price for the covenant of Allah and their own oaths-- surely they shall have no portion in the hereafter, and Allah will not speak to them, nor will He look upon them on the day of resurrection nor will He purify them, and they shall have a painful chastisement.","translation_id":"Sesungguhnya orang-orang yang memperjualbelikan janji Allah dan sumpah-sumpah mereka dengan harga murah, mereka itu tidak memperoleh bagian di akhirat, Allah tidak akan menyapa mereka, tidak akan memperhatikan mereka pada hari Kiamat, dan tidak akan menyucikan mereka. Bagi mereka azab yang pedih.","hasanah_per_verse":1160},{"text_madani":"وَإِنَّ مِنْهُمْ لَفَرِيقًا يَلْوُونَ أَلْسِنَتَهُم بِالْكِتَابِ لِتَحْسَبُوهُ مِنَ الْكِتَابِ وَمَا هُوَ مِنَ الْكِتَابِ وَيَقُولُونَ هُوَ مِنْ عِندِ اللَّهِ وَمَا هُوَ مِنْ عِندِ اللَّهِ وَيَقُولُونَ عَلَى اللَّهِ الْكَذِبَ وَهُمْ يَعْلَمُونَ","text_tajweed":"وَإِ[g[نّ]َ مِنْهُمْ لَفَرِي[a:2040[قًا ي]َلْوُ[n[ۥ]نَ أَلْسِنَتَه[c:2041[ُم ب]ِ[h:2042[ٱ]لْكِتَ[n[ـٰ]بِ لِتَحْسَبُوهُ مِنَ [h:891[ٱ]لْكِتَ[n[ـٰ]بِ وَمَا هُوَ مِنَ [h:891[ٱ]لْكِتَ[n[ـٰ]بِ وَيَقُولُونَ هُوَ مِنْ عِ[f:398[ند]ِ [h:399[ٱ]للَّهِ وَمَا هُوَ مِنْ عِ[f:398[ند]ِ [h:399[ٱ]للَّهِ وَيَقُولُونَ عَلَى [h:412[ٱ]للَّهِ [h:2035[ٱ]لْكَذِبَ وَهُمْ يَعْلَم[p[ُو]نَ","translation_en":"Most surely there is a party amongst those who distort the Book with their tongue that you may consider it to be (a part) of the Book, and they say, It is from Allah, while it is not from Allah, and they tell a lie against Allah whilst they know.","translation_id":"Dan sungguh, di antara mereka niscaya ada segolongan yang memutarbalikkan lidahnya membaca Kitab, agar kamu menyangka (yang mereka baca) itu sebagian dari Kitab, padahal itu bukan dari Kitab dan mereka berkata, “Itu dari Allah,” padahal itu bukan dari Allah. Mereka mengatakan hal yang dusta terhadap Allah, padahal mereka mengetahui.","hasanah_per_verse":1200},{"text_madani":"مَا كَانَ لِبَشَرٍ أَن يُؤْتِيَهُ اللَّهُ الْكِتَابَ وَالْحُكْمَ وَالنُّبُوَّةَ ثُمَّ يَقُولَ لِلنَّاسِ كُونُوا عِبَادًا لِّي مِن دُونِ اللَّهِ وَلَٰكِن كُونُوا رَبَّانِيِّينَ بِمَا كُنتُمْ تُعَلِّمُونَ الْكِتَابَ وَبِمَا كُنتُمْ تَدْرُسُونَ","text_tajweed":"مَا كَانَ لِبَشَرٍ أ[a:2043[َن ي]ُؤْتِيَهُ [h:2044[ٱ]للَّهُ [h:2045[ٱ]لْكِتَ[n[ـٰ]بَ وَ[h:2046[ٱ]لْحُكْمَ وَ[h:2047[ٱ][l[ل][g[نّ]ُبُوَّةَ ثُ[g[مّ]َ يَقُولَ لِل[g[نّ]َاسِ كُونُو[s[اْ] عِبَا[u:2048[دًا ل]ِّى مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ وَلَ[n[ـٰ]كِ[f:2049[ن ك]ُونُو[s[اْ] رَبَّ[n[ـٰ]نِيِّـ[n[ـۧ]نَ بِمَا كُ[f:100[نت]ُمْ تُعَلِّمُونَ [h:2050[ٱ]لْكِتَ[n[ـٰ]بَ وَبِمَا كُ[f:100[نت]ُمْ تَ[q:2051[دْ]رُس[p[ُو]نَ","translation_en":"It is not meet for a mortal that Allah should give him the Book and the wisdom and prophethood, then he should say to men: Be my servants rather than Allah's; but rather (he would say): Be worshippers of the Lord because of your teaching the Book and your reading (it yourselves).","translation_id":"Tidak mungkin bagi seseorang yang telah diberi kitab oleh Allah, serta hikmah dan kenabian, kemudian dia berkata kepada manusia, “Jadilah kamu penyembahku, bukan penyembah Allah,” tetapi (dia berkata), “Jadilah kamu pengabdi-pengabdi Allah, karena kamu mengajarkan kitab dan karena kamu mempelajarinya!”","hasanah_per_verse":1200},{"text_madani":"وَلَا يَأْمُرَكُمْ أَن تَتَّخِذُوا الْمَلَائِكَةَ وَالنَّبِيِّينَ أَرْبَابًا ۗ أَيَأْمُرُكُم بِالْكُفْرِ بَعْدَ إِذْ أَنتُم مُّسْلِمُونَ","text_tajweed":"وَلَا يَأْمُرَكُمْ أَ[f:2052[ن ت]َتَّخِذُو[s[اْ] [h:2053[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةَ وَ[h:907[ٱ][l[ل][g[نّ]َبِيِّـ[n[ـۧ]نَ أَرْبَابًا‌ۗ أَيَأْمُرُك[c:2054[ُم ب]ِ[h:2055[ٱ]لْكُفْرِ بَعْدَ إِذْ أَ[f:428[نت][w:2056[ُم م]ُّسْلِم[p[ُو]نَ","translation_en":"And neither would he enjoin you that you should take the angels and the prophets for lords; what! would he enjoin you with unbelief after you are Muslims?","translation_id":"dan tidak (mungkin pula baginya) menyuruh kamu menjadikan para malaikat dan para nabi sebagai Tuhan. Apakah (patut) dia menyuruh kamu menjadi kafir setelah kamu menjadi Muslim?","hasanah_per_verse":670},{"text_madani":"وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ النَّبِيِّينَ لَمَا آتَيْتُكُم مِّن كِتَابٍ وَحِكْمَةٍ ثُمَّ جَاءَكُمْ رَسُولٌ مُّصَدِّقٌ لِّمَا مَعَكُمْ لَتُؤْمِنُنَّ بِهِ وَلَتَنصُرُنَّهُ ۚ قَالَ أَأَقْرَرْتُمْ وَأَخَذْتُمْ عَلَىٰ ذَٰلِكُمْ إِصْرِي ۖ قَالُوا أَقْرَرْنَا ۚ قَالَ فَاشْهَدُوا وَأَنَا مَعَكُم مِّنَ الشَّاهِدِينَ","text_tajweed":"وَإِذْ أَخَذَ [h:2057[ٱ]للَّهُ مِيثَ[n[ـٰ]قَ [h:2058[ٱ][l[ل][g[نّ]َبِيِّـ[n[ـۧ]نَ لَم[o[َآ] ءَاتَيْتُك[w:2059[ُم م]ِّ[f:2060[ن ك]ِتَ[n[ـٰ][a:2061[بٍ و]َحِكْمَ[f:2062[ةٍ ث]ُ[g[مّ]َ ج[o[َا]ٓءَكُمْ رَسُو[a:2063[لٌ م]ُّصَدِّ[u:465[قٌ ل]ِّمَا مَعَكُمْ لَتُؤْمِنُ[g[نّ]َ بِه[n[ِۦ] وَلَتَ[f:2064[نص]ُرُ[g[نّ]َهُ[n[ۥ]‌ۚ قَالَ ءَأَ[q:2065[قْ]رَرْتُمْ وَأَخَذْتُمْ عَلَىٰ ذ[n[َٲ]لِكُمْ إِصْرِى‌ۖ قَال[o[ُوٓ][s[اْ] أَ[q:2066[قْ]رَرْنَا‌ۚ قَالَ فَ[h:2067[ٱ]شْهَدُو[s[اْ] وَأَنَا۟ مَعَك[w:2068[ُم م]ِّنَ [h:2069[ٱ][l[ل]شَّ[n[ـٰ]هِد[p[ِي]نَ","translation_en":"And when Allah made a covenant through the prophets: Certainly what I have given you of Book and wisdom-- then an messenger comes to you verifying that which is with you, you must believe in him, and you must aid him. He said: Do you affirm and accept My compact in this (matter)? They said: We do affirm. He said: Then bear witness, and I (too) am of the bearers of witness with you.","translation_id":"Dan (ingatlah), ketika Allah mengambil perjanjian dari para nabi, “Manakala Aku memberikan kitab dan hikmah kepadamu lalu datang kepada kamu seorang Rasul yang membenarkan apa yang ada pada kamu, niscaya kamu akan sungguh-sungguh beriman kepadanya dan menolongnya.” Allah berfirman, “Apakah kamu setuju dan menerima perjanjian dengan-Ku atas yang demikian itu?” Mereka menjawab, “Kami setuju.” Allah berfirman, ”Kalau begitu bersaksilah kamu (para nabi) dan Aku menjadi saksi bersama kamu.”","hasanah_per_verse":1460},{"text_madani":"فَمَن تَوَلَّىٰ بَعْدَ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الْفَاسِقُونَ","text_tajweed":"فَمَ[f:2070[ن ت]َوَلَّىٰ بَعْدَ ذ[n[َٲ]لِكَ فَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:2071[ٱ]لْفَ[n[ـٰ]سِق[p[ُو]نَ","translation_en":"Whoever therefore turns back after this, these it is that are the transgressors.","translation_id":"Maka barangsiapa berpaling setelah itu, maka mereka itulah orang yang fasik.","hasanah_per_verse":290},{"text_madani":"أَفَغَيْرَ دِينِ اللَّهِ يَبْغُونَ وَلَهُ أَسْلَمَ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَإِلَيْهِ يُرْجَعُونَ","text_tajweed":"أَفَغَيْرَ دِينِ [h:2072[ٱ]للَّهِ يَ[q:2073[بْ]غُونَ وَلَهُ[o[ۥٓ] أَسْلَمَ مَ[f:2074[ن ف]ِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ طَوْ[a:2075[عًا و]َكَرْ[a:2076[هًا و]َإِلَيْهِ يُرْجَع[p[ُو]نَ","translation_en":"Is it then other than Allah's religion that they seek (to follow), and to Him submits whoever is in the heavens and the earth, willingly or unwillingly, and to Him shall they be returned.","translation_id":"Maka mengapa mereka mencari agama yang lain selain agama Allah, padahal apa yang di langit dan di bumi berserah diri kepada-Nya, (baik) dengan suka maupun terpaksa, dan hanya kepada-Nya mereka dikembalikan?","hasanah_per_verse":620},{"text_madani":"قُلْ آمَنَّا بِاللَّهِ وَمَا أُنزِلَ عَلَيْنَا وَمَا أُنزِلَ عَلَىٰ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطِ وَمَا أُوتِيَ مُوسَىٰ وَعِيسَىٰ وَالنَّبِيُّونَ مِن رَّبِّهِمْ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّنْهُمْ وَنَحْنُ لَهُ مُسْلِمُونَ","text_tajweed":"قُلْ ءَامَ[g[نّ]َا بِ[h:32[ٱ]للَّهِ وَم[o[َآ] أُ[f:17[نز]ِلَ عَلَيْنَا وَم[o[َآ] أُ[f:17[نز]ِلَ عَلَ[o[ىٰٓ] إِ[q:1860[بْ]ر[n[َٲ]هِيمَ وَإِسْمَ[n[ـٰ]عِيلَ وَإِسْحَ[n[ـٰ]قَ وَيَعْقُوبَ وَ[h:700[ٱ]لْأَسْبَاطِ وَم[o[َآ] أُوتِىَ مُوسَىٰ وَعِيسَىٰ وَ[h:2077[ٱ][l[ل][g[نّ]َبِيُّونَ م[u:22[ِن ر]َّبِّهِمْ لَا نُفَرِّقُ بَيْنَ أَحَ[a:702[دٍ م]ِّنْهُمْ وَنَحْنُ لَهُ[n[ۥ] مُسْلِم[p[ُو]نَ","translation_en":"Say: We believe in Allah and what has been revealed to us, and what was revealed to Ibrahim and Ismail and Ishaq and Yaqoub and the tribes, and what was given to Musa and Isa and to the prophets from their Lord; we do not make any distinction between any of them, and to Him do we submit.","translation_id":"Katakanlah (Muhammad), “Kami beriman kepada Allah dan kepada apa yang diturunkan kepada kami dan yang diturunkan kepada Ibrahim, Ismail, Ishak, Yakub, dan anak cucunya, dan apa yang diberikan kepada Musa, Isa dan para nabi dari Tuhan mereka. Kami tidak membeda-bedakan seorang pun di antara mereka dan hanya kepada-Nya kami berserah diri.”","hasanah_per_verse":1260},{"text_madani":"وَمَن يَبْتَغِ غَيْرَ الْإِسْلَامِ دِينًا فَلَن يُقْبَلَ مِنْهُ وَهُوَ فِي الْآخِرَةِ مِنَ الْخَاسِرِينَ","text_tajweed":"وَم[a:2078[َن ي]َ[q:2079[بْ]تَغِ غَيْرَ [h:2080[ٱ]لْإِسْلَ[n[ـٰ]مِ دِي[f:2081[نًا ف]َل[a:2082[َن ي]ُ[q:2083[قْ]بَلَ مِنْهُ وَهُوَ فِى [h:536[ٱ]لْأَخِرَةِ مِنَ [h:340[ٱ]لْخَ[n[ـٰ]سِر[p[ِي]نَ","translation_en":"And whoever desires a religion other than Islam, it shall not be accepted from him, and in the hereafter he shall be one of the losers.","translation_id":"Dan barangsiapa mencari agama selain Islam, dia tidak akan diterima, dan di akhirat dia termasuk orang yang rugi.","hasanah_per_verse":520},{"text_madani":"كَيْفَ يَهْدِي اللَّهُ قَوْمًا كَفَرُوا بَعْدَ إِيمَانِهِمْ وَشَهِدُوا أَنَّ الرَّسُولَ حَقٌّ وَجَاءَهُمُ الْبَيِّنَاتُ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","text_tajweed":"كَيْفَ يَهْدِى [h:2084[ٱ]للَّهُ قَوْ[f:2085[مًا ك]َفَرُو[s[اْ] بَعْدَ إِيمَ[n[ـٰ]نِهِمْ وَشَهِد[o[ُوٓ][s[اْ] أَ[g[نّ]َ [h:2086[ٱ][l[ل]رَّسُولَ حَ[a:2087[قٌّ و]َج[o[َا]ٓءَهُمُ [h:2088[ٱ]لْبَيِّنَ[n[ـٰ]تُ‌ۚ وَ[h:72[ٱ]للَّهُ لَا يَهْدِى [h:1504[ٱ]لْقَوْمَ [h:1505[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"How shall Allah guide a people who disbelieved after their believing and (after) they had borne witness that the Messenger was true and clear arguments had come to them; and Allah does not guide the unjust people.","translation_id":"Bagaimana Allah akan memberi petunjuk kepada suatu kaum yang kafir setelah mereka beriman, serta mengakui bahwa Rasul (Muhammad) itu benar-benar (rasul), dan bukti-bukti yang jelas telah sampai kepada mereka? Allah tidak memberi petunjuk kepada orang zhalim.","hasanah_per_verse":830},{"text_madani":"أُولَٰئِكَ جَزَاؤُهُمْ أَنَّ عَلَيْهِمْ لَعْنَةَ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ","text_tajweed":"أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ جَز[o[َا]ٓؤُهُمْ أَ[g[نّ]َ عَلَيْهِمْ لَعْنَةَ [h:2089[ٱ]للَّهِ وَ[h:823[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةِ وَ[h:824[ٱ][l[ل][g[نّ]َاسِ أَ[q:825[جْ]مَع[p[ِي]نَ","translation_en":"(As for) these, their reward is that upon them is the curse of Allah and the angels and of men, all together.","translation_id":"Mereka itu, balasannya ialah ditimpa laknat Allah, para malaikat, dan manusia seluruhnya,","hasanah_per_verse":470},{"text_madani":"خَالِدِينَ فِيهَا لَا يُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا هُمْ يُنظَرُونَ","text_tajweed":"خَ[n[ـٰ]لِدِينَ فِيهَا لَا يُخَفَّفُ عَنْهُمُ [h:448[ٱ]لْعَذَابُ وَلَا هُمْ يُ[f:826[نظ]َر[p[ُو]نَ","translation_en":"Abiding in it; their chastisement shall not be lightened nor shall they be respited.","translation_id":"mereka kekal di dalamnya, tidak akan diringankan azabnya, dan mereka tidak diberi penangguhan,","hasanah_per_verse":370},{"text_madani":"إِلَّا الَّذِينَ تَابُوا مِن بَعْدِ ذَٰلِكَ وَأَصْلَحُوا فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ","text_tajweed":"إِلَّا [h:778[ٱ]لَّذِينَ تَابُو[s[اْ] م[i:146[ِنۢ ب]َعْدِ ذ[n[َٲ]لِكَ وَأَصْلَحُو[s[اْ] فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ غَفُو[u:890[رٌ ر]َّح[p[ِي]مٌ","translation_en":"Except those who repent after that and amend, then surely Allah is Forgiving, Merciful.","translation_id":"kecuali orang-orang yang bertobat setelah itu, dan melakukan perbaikan, maka sungguh, Allah Maha Pengampun, Maha Penyayang.","hasanah_per_verse":430},{"text_madani":"إِنَّ الَّذِينَ كَفَرُوا بَعْدَ إِيمَانِهِمْ ثُمَّ ازْدَادُوا كُفْرًا لَّن تُقْبَلَ تَوْبَتُهُمْ وَأُولَٰئِكَ هُمُ الضَّالُّونَ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ كَفَرُو[s[اْ] بَعْدَ إِيمَ[n[ـٰ]نِهِمْ ثُ[g[مّ]َ [h:2090[ٱ]زْدَادُو[s[اْ] كُفْ[u:2091[رًا ل]َّ[f:2092[ن ت]ُ[q:2093[قْ]بَلَ تَوْبَتُهُمْ وَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:2094[ٱ][l[ل]ضّ[m[َا]ٓلّ[p[ُو]نَ","translation_en":"Surely, those who disbelieve after their believing, then increase in unbelief, their repentance shall not be accepted, and these are they that go astray.","translation_id":"Sungguh, orang-orang yang kafir setelah beriman, kemudian bertambah kekafirannya, tidak akan diterima tobatnya, dan mereka itulah orang-orang yang sesat.","hasanah_per_verse":620},{"text_madani":"إِنَّ الَّذِينَ كَفَرُوا وَمَاتُوا وَهُمْ كُفَّارٌ فَلَن يُقْبَلَ مِنْ أَحَدِهِم مِّلْءُ الْأَرْضِ ذَهَبًا وَلَوِ افْتَدَىٰ بِهِ ۗ أُولَٰئِكَ لَهُمْ عَذَابٌ أَلِيمٌ وَمَا لَهُم مِّن نَّاصِرِينَ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ كَفَرُو[s[اْ] وَمَاتُو[s[اْ] وَهُمْ كُفَّا[f:2095[رٌ ف]َل[a:2082[َن ي]ُ[q:2083[قْ]بَلَ مِنْ أَحَدِه[w:2096[ِم م]ِّلْءُ [h:2097[ٱ]لْأَرْضِ ذَهَ[a:2098[بًا و]َلَوِ [h:2099[ٱ]فْتَدَىٰ بِه[o[ِۦٓ‌ۗ] أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ لَهُمْ عَذَابٌ أَلِي[a:2100[مٌ و]َمَا لَه[w:1812[ُم م]ّ[a:1813[ِن ن]َّ[n[ـٰ]صِر[p[ِي]نَ","translation_en":"Surely, those who disbelieve and die while they are unbelievers, the earth full of gold shall not be accepted from one of them, though he should offer to ransom himself with it, these it is who shall have a painful chastisement, and they shall have no helpers.","translation_id":"Sungguh, orang-orang yang kafir dan mati dalam kekafiran, tidak akan diterima (tebusan) dari seseorang di antara mereka sekalipun (berupa) emas sepenuh bumi, sekiranya dia hendak menebus diri dengannya. Mereka itulah orang-orang yang mendapat azab yang pedih dan tidak memperoleh penolong.","hasanah_per_verse":910},{"text_madani":"لَن تَنَالُوا الْبِرَّ حَتَّىٰ تُنفِقُوا مِمَّا تُحِبُّونَ ۚ وَمَا تُنفِقُوا مِن شَيْءٍ فَإِنَّ اللَّهَ بِهِ عَلِيمٌ","text_tajweed":"لَ[f:2101[ن ت]َنَالُو[s[اْ] [h:2102[ٱ]لْبِرَّ حَتَّىٰ تُ[f:1607[نف]ِقُو[s[اْ] مِ[g[مّ]َا تُحِبُّونَ‌ۚ وَمَا تُ[f:1607[نف]ِقُو[s[اْ] مِ[f:2103[ن ش][f:2104[َىْءٍ ف]َإِ[g[نّ]َ [h:513[ٱ]للَّهَ بِه[n[ِۦ] عَل[p[ِي]مٌ","translation_en":"By no means shall you attain to righteousness until you spend (benevolently) out of what you love; and whatever thing you spend, Allah surely knows it.","translation_id":"Kamu tidak akan memperoleh kebajikan, sebelum kamu menginfakkan sebagian harta yang kamu cintai. Dan apa pun yang kamu infakkan, tentang hal itu sungguh, Allah Maha Mengetahui.","hasanah_per_verse":560},{"text_madani":"كُلُّ الطَّعَامِ كَانَ حِلًّا لِّبَنِي إِسْرَائِيلَ إِلَّا مَا حَرَّمَ إِسْرَائِيلُ عَلَىٰ نَفْسِهِ مِن قَبْلِ أَن تُنَزَّلَ التَّوْرَاةُ ۗ قُلْ فَأْتُوا بِالتَّوْرَاةِ فَاتْلُوهَا إِن كُنتُمْ صَادِقِينَ","text_tajweed":"۞ كُلُّ [h:2105[ٱ][l[ل]طَّعَامِ كَانَ حِل[u:2106[اًّ ل]ِّبَن[o[ِىٓ] إِسْر[o[َٲ]ٓءِيلَ إِلَّا مَا حَرَّمَ إِسْر[o[َٲ]ٓءِيلُ عَلَىٰ نَفْسِه[n[ِۦ] مِ[f:1346[ن ق]َ[q:1347[بْ]لِ أَ[f:2107[ن ت]ُنَزَّلَ [h:2108[ٱ][l[ل]تَّوْرَ[n[ٮٰ]ةُ‌ۗ قُلْ فَأْتُو[s[اْ] بِ[h:2109[ٱ][l[ل]تَّوْرَ[n[ٮٰ]ةِ فَ[h:2110[ٱ]تْلُوه[o[َآ] إِ[f:109[ن ك]ُ[f:100[نت]ُمْ صَ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"All food was lawful to the children of Israel except that which Israel had forbidden to himself, before the Taurat was revealed. Say: Bring then the Taurat and read it, if you are truthful.","translation_id":"Semua makanan itu halal bagi Bani Israil, kecuali makanan yang diharamkan oleh Israil (Yakub) atas dirinya sebelum Taurat diturunkan. Katakanlah (Muhammad), “Maka bawalah Taurat lalu bacalah, jika kamu orang-orang yang benar.”","hasanah_per_verse":990},{"text_madani":"فَمَنِ افْتَرَىٰ عَلَى اللَّهِ الْكَذِبَ مِن بَعْدِ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ","text_tajweed":"فَمَنِ [h:2111[ٱ]فْتَرَىٰ عَلَى [h:412[ٱ]للَّهِ [h:2035[ٱ]لْكَذِبَ م[i:146[ِنۢ ب]َعْدِ ذ[n[َٲ]لِكَ فَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:1285[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ُو]نَ","translation_en":"Then whoever fabricates a lie against Allah after this, these it is that are the unjust.","translation_id":"Maka barangsiapa mengada-adakan kebohongan terhadap Allah setelah itu, maka mereka itulah orang-orang zhalim.","hasanah_per_verse":440},{"text_madani":"قُلْ صَدَقَ اللَّهُ ۗ فَاتَّبِعُوا مِلَّةَ إِبْرَاهِيمَ حَنِيفًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ","text_tajweed":"قُلْ صَدَقَ [h:2112[ٱ]للَّهُ‌ۗ فَ[h:2113[ٱ]تَّبِعُو[s[اْ] مِلَّةَ إِ[q:1860[بْ]ر[n[َٲ]هِيمَ حَنِي[a:698[فًا و]َمَا كَانَ مِنَ [h:699[ٱ]لْمُشْرِك[p[ِي]نَ","translation_en":"Say: Allah has spoken the truth, therefore follow the religion of Ibrahim, the upright one; and he was not one of the polytheists.","translation_id":"Katakanlah (Muhammad), “Benarlah (segala yang difirmankan) Allah.” Maka ikutilah agama Ibrahim yang lurus, dan dia tidaklah termasuk orang musyrik.","hasanah_per_verse":470},{"text_madani":"إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبَارَكًا وَهُدًى لِّلْعَالَمِينَ","text_tajweed":"إِ[g[نّ]َ أَوَّلَ بَيْ[a:2114[تٍ و]ُضِعَ لِل[g[نّ]َاسِ لَلَّذِى بِبَكَّةَ مُبَارَ[a:2115[كًا و]َهُ[u:2116[دًى ل]ِّلْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"Most surely the first house appointed for men is the one at Bekka, blessed and a guidance for the nations.","translation_id":"Sesungguhnya rumah (ibadah) pertama yang dibangun untuk manusia, ialah (Baitullah) yang di Bakkah (Mekah) yang diberkahi dan menjadi petunjuk bagi seluruh alam.","hasanah_per_verse":420},{"text_madani":"فِيهِ آيَاتٌ بَيِّنَاتٌ مَّقَامُ إِبْرَاهِيمَ ۖ وَمَن دَخَلَهُ كَانَ آمِنًا ۗ وَلِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلًا ۚ وَمَن كَفَرَ فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ","text_tajweed":"فِيهِ ءَايَ[n[ـٰ][i:2117[تُۢ ب]َيِّنَ[n[ـٰ][a:2118[تٌ م]َّقَامُ إِ[q:1860[بْ]ر[n[َٲ]هِيمَ‌ۖ وَمَ[f:2119[ن د]َخَلَهُ[n[ۥ] كَانَ ءَامِ[a:2120[نًا‌ۗ و]َلِلَّهِ عَلَى [h:729[ٱ][l[ل][g[نّ]َاسِ حِجُّ [h:2121[ٱ]لْبَيْتِ مَنِ [h:2122[ٱ]سْتَطَاعَ إِلَيْهِ سَبِيل[a:2123[اً‌ۚ و]َمَ[f:662[ن ك]َفَرَ فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ غَنِىٌّ عَنِ [h:2124[ٱ]لْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"In it are clear signs, the standing place of Ibrahim, and whoever enters it shall be secure, and pilgrimage to the House is incumbent upon men for the sake of Allah, (upon) every one who is able to undertake the journey to it; and whoever disbelieves, then surely Allah is Self-sufficient, above any need of the worlds.","translation_id":"Di sana terdapat tanda-tanda yang jelas, (di antaranya) maqam Ibrahim. Barangsiapa memasukinya (Baitullah) amanlah dia. Dan (di antara) kewajiban manusia terhadap Allah adalah melaksanakan ibadah haji ke Baitullah, yaitu bagi orang-orang yang mampu mengadakan perjalanan ke sana. Barangsiapa mengingkari (kewajiban) haji, maka ketahuilah bahwa Allah Mahakaya (tidak memerlukan sesuatu) dari seluruh alam.","hasanah_per_verse":990},{"text_madani":"قُلْ يَا أَهْلَ الْكِتَابِ لِمَ تَكْفُرُونَ بِآيَاتِ اللَّهِ وَاللَّهُ شَهِيدٌ عَلَىٰ مَا تَعْمَلُونَ","text_tajweed":"قُلْ يَ[o[ـٰٓ]أَهْلَ [h:1990[ٱ]لْكِتَ[n[ـٰ]بِ لِمَ تَكْفُرُونَ بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ وَ[h:72[ٱ]للَّهُ شَهِيدٌ عَلَىٰ مَا تَعْمَل[p[ُو]نَ","translation_en":"Say: O followers of the Book! why do you disbelieve in the communications of Allah? And Allah is a witness of what you do.","translation_id":"Katakanlah (Muhammad), “Wahai Ahli Kitab! Mengapa kamu mengingkari ayat-ayat Allah, padahal Allah Maha Menyaksikan apa yang kamu kerjakan?”","hasanah_per_verse":500},{"text_madani":"قُلْ يَا أَهْلَ الْكِتَابِ لِمَ تَصُدُّونَ عَن سَبِيلِ اللَّهِ مَنْ آمَنَ تَبْغُونَهَا عِوَجًا وَأَنتُمْ شُهَدَاءُ ۗ وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ","text_tajweed":"قُلْ يَ[o[ـٰٓ]أَهْلَ [h:1990[ٱ]لْكِتَ[n[ـٰ]بِ لِمَ تَصُدُّونَ عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ مَنْ ءَامَنَ تَ[q:2125[بْ]غُونَهَا عِوَ[a:2126[جًا و]َأَ[f:98[نت]ُمْ شُهَد[o[َا]ٓءُ‌ۗ وَمَا [h:384[ٱ]للَّهُ بِغَ[n[ـٰ]فِلٍ عَ[g[مّ]َا تَعْمَل[p[ُو]نَ","translation_en":"Say: O followers of the Book! why do you hinder him who believes from the way of Allah? You seek (to make) it crooked, while you are witness, and Allah is not heedless of what you do.","translation_id":"Katakanlah (Muhammad), “Wahai Ahli Kitab! Mengapa kamu menghalang-halangi orang-orang yang beriman dari jalan Allah, kamu menghendakinya (jalan Allah) bengkok, padahal kamu menyaksikan?” Dan Allah tidak lengah terhadap apa yang kamu kerjakan.","hasanah_per_verse":770},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِن تُطِيعُوا فَرِيقًا مِّنَ الَّذِينَ أُوتُوا الْكِتَابَ يَرُدُّوكُم بَعْدَ إِيمَانِكُمْ كَافِرِينَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِ[f:2127[ن ت]ُطِيعُو[s[اْ] فَرِي[a:2128[قًا م]ِّنَ [h:523[ٱ]لَّذِينَ أُوتُو[s[اْ] [h:524[ٱ]لْكِتَ[n[ـٰ]بَ يَرُدُّوك[c:2129[ُم ب]َعْدَ إِيمَ[n[ـٰ]نِكُمْ كَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"O you who believe! if you obey a party from among those who have been given the Book, they will turn you back as unbelievers after you have believed.","translation_id":"Wahai orang-orang yang beriman! Jika kamu mengikuti sebagian dari orang yang diberi Kitab, niscaya mereka akan mengembalikan kamu menjadi orang kafir setelah beriman.","hasanah_per_verse":690},{"text_madani":"وَكَيْفَ تَكْفُرُونَ وَأَنتُمْ تُتْلَىٰ عَلَيْكُمْ آيَاتُ اللَّهِ وَفِيكُمْ رَسُولُهُ ۗ وَمَن يَعْتَصِم بِاللَّهِ فَقَدْ هُدِيَ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ","text_tajweed":"وَكَيْفَ تَكْفُرُونَ وَأَ[f:98[نت]ُمْ تُتْلَىٰ عَلَيْكُمْ ءَايَ[n[ـٰ]تُ [h:1442[ٱ]للَّهِ وَفِيكُمْ رَسُولُهُ[n[ۥ]‌ۗ وَم[a:2130[َن ي]َعْتَص[c:2131[ِم ب]ِ[h:32[ٱ]للَّهِ فَقَ[q:563[دْ] هُدِىَ إِلَىٰ صِر[n[َٲ][a:726[طٍ م]ُّسْتَق[p[ِي]مٍ","translation_en":"But how can you disbelieve while it is you to whom the communications of Allah are recited, and among you is His Messenger? And whoever holds fast to Allah, he indeed is guided to the right path.","translation_id":"Dan bagaimana kamu (sampai) menjadi kafir, padahal ayat-ayat Allah dibacakan kepada kamu, dan Rasul-Nya (Muhammad) pun berada di tengah-tengah kamu? Barangsiapa berpegang teguh kepada (agama) Allah, maka sungguh, dia diberi petunjuk kepada jalan yang lurus.","hasanah_per_verse":740},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] [h:1643[ٱ]تَّقُو[s[اْ] [h:1644[ٱ]للَّهَ حَقَّ تُقَاتِه[n[ِۦ] وَلَا تَمُوتُ[g[نّ]َ إِلَّا وَأَ[f:98[نت][w:690[ُم م]ُّسْلِم[p[ُو]نَ","translation_en":"O you who believe! be careful of (your duty to) Allah with the care which is due to Him, and do not die unless you are Muslims.","translation_id":"Wahai orang-orang yang beriman! Bertakwalah kepada Allah sebenar-benar takwa kepada-Nya dan janganlah kamu mati kecuali dalam keadaan Muslim.","hasanah_per_verse":540},{"text_madani":"وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا ۚ وَاذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ إِذْ كُنتُمْ أَعْدَاءً فَأَلَّفَ بَيْنَ قُلُوبِكُمْ فَأَصْبَحْتُم بِنِعْمَتِهِ إِخْوَانًا وَكُنتُمْ عَلَىٰ شَفَا حُفْرَةٍ مِّنَ النَّارِ فَأَنقَذَكُم مِّنْهَا ۗ كَذَٰلِكَ يُبَيِّنُ اللَّهُ لَكُمْ آيَاتِهِ لَعَلَّكُمْ تَهْتَدُونَ","text_tajweed":"وَ[h:9999[ٱ]عْتَصِمُو[s[اْ] بِحَ[q:2132[بْ]لِ [h:2133[ٱ]للَّهِ جَمِي[a:2134[عًا و]َلَا تَفَرَّقُو[s[اْ‌ۚ] وَ[h:335[ٱ]ذْكُرُو[s[اْ] نِعْمَتَ [h:1300[ٱ]للَّهِ عَلَيْكُمْ إِذْ كُ[f:100[نت]ُمْ أَعْد[o[َا]ٓ[f:2135[ءً ف]َأَلَّفَ بَيْنَ قُلُوبِكُمْ فَأَصْبَحْت[c:2136[ُم ب]ِنِعْمَتِه[o[ِۦٓ] إِخْو[n[َٲ][a:2137[نًا و]َكُ[f:151[نت]ُمْ عَلَىٰ شَفَا حُفْرَ[a:2138[ةٍ م]ِّنَ [h:869[ٱ][l[ل][g[نّ]َارِ فَأَ[f:2139[نق]َذَك[w:2140[ُم م]ِّنْهَا‌ۗ كَذ[n[َٲ]لِكَ يُبَيِّنُ [h:1002[ٱ]للَّهُ لَكُمْ ءَايَ[n[ـٰ]تِه[n[ِۦ] لَعَلَّكُمْ تَهْتَد[p[ُو]نَ","translation_en":"And hold fast by the covenant of Allah all together and be not disunited, and remember the favor of Allah on you when you were enemies, then He united your hearts so by His favor you became brethren; and you were on the brink of a pit of fire, then He saved you from it, thus does Allah make clear to you His communications that you may follow the right way.","translation_id":"Dan berpegangteguhlah kamu semuanya pada tali (agama) Allah, dan janganlah kamu bercerai berai, dan ingatlah nikmat Allah kepadamu ketika kamu dahulu (masa jahiliah) bermusuhan, lalu Allah mempersatukan hatimu, sehingga dengan karunia-Nya kamu menjadi bersaudara, sedangkan (ketika itu) kamu berada di tepi jurang neraka, lalu Allah menyelamatkan kamu dari sana. Demikianlah, Allah menerangkan ayat-ayat-Nya kepadamu agar kamu mendapat petunjuk.","hasanah_per_verse":1570},{"text_madani":"وَلْتَكُن مِّنكُمْ أُمَّةٌ يَدْعُونَ إِلَى الْخَيْرِ وَيَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنكَرِ ۚ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ","text_tajweed":"وَلْتَك[a:2141[ُن م]ِّ[f:344[نك]ُمْ أُ[g[مّ]َ[a:2142[ةٌ ي]َ[q:1240[دْ]عُونَ إِلَى [h:2143[ٱ]لْخَيْرِ وَيَأْمُرُونَ بِ[h:934[ٱ]لْمَعْرُوفِ وَيَنْهَوْنَ عَنِ [h:2144[ٱ]لْمُ[f:2145[نك]َرِ‌ۚ وَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:23[ٱ]لْمُفْلِح[p[ُو]نَ","translation_en":"And from among you there should be a party who invite to good and enjoin what is right and forbid the wrong, and these it is that shall be successful.","translation_id":"Dan hendaklah di antara kamu ada segolongan orang yang menyeru kepada kebajikan, menyuruh (berbuat) yang makruf, dan mencegah dari yang mungkar. Dan mereka itulah orang-orang yang beruntung.","hasanah_per_verse":700},{"text_madani":"وَلَا تَكُونُوا كَالَّذِينَ تَفَرَّقُوا وَاخْتَلَفُوا مِن بَعْدِ مَا جَاءَهُمُ الْبَيِّنَاتُ ۚ وَأُولَٰئِكَ لَهُمْ عَذَابٌ عَظِيمٌ","text_tajweed":"وَلَا تَكُونُو[s[اْ] كَ[h:2146[ٱ]لَّذِينَ تَفَرَّقُو[s[اْ] وَ[h:2147[ٱ]خْتَلَفُو[s[اْ] م[i:146[ِنۢ ب]َعْدِ مَا ج[o[َا]ٓءَهُمُ [h:2148[ٱ]لْبَيِّنَ[n[ـٰ]تُ‌ۚ وَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ لَهُمْ عَذَابٌ عَظ[p[ِي]مٌ","translation_en":"And be not like those who became divided and disagreed after clear arguments had come to them, and these it is that shall have a grievous chastisement.","translation_id":"Dan janganlah kamu menjadi seperti orang-orang yang bercerai berai dan berselisih setelah sampai kepada mereka keterangan yang jelas. Dan Mereka itulah orang-orang yang mendapat azab yang berat,","hasanah_per_verse":650},{"text_madani":"يَوْمَ تَبْيَضُّ وُجُوهٌ وَتَسْوَدُّ وُجُوهٌ ۚ فَأَمَّا الَّذِينَ اسْوَدَّتْ وُجُوهُهُمْ أَكَفَرْتُم بَعْدَ إِيمَانِكُمْ فَذُوقُوا الْعَذَابَ بِمَا كُنتُمْ تَكْفُرُونَ","text_tajweed":"يَوْمَ تَ[q:2149[بْ]يَضُّ وُجُو[a:2150[هٌ و]َتَسْوَدُّ وُجُو[f:2151[هٌ‌ۚ ف]َأَ[g[مّ]َا [h:136[ٱ]لَّذِينَ [h:2152[ٱ]سْوَدَّتْ وُجُوهُهُمْ أَكَفَرْت[c:2153[ُم ب]َعْدَ إِيمَ[n[ـٰ]نِكُمْ فَذُوقُو[s[اْ] [h:2154[ٱ]لْعَذَابَ بِمَا كُ[f:100[نت]ُمْ تَكْفُر[p[ُو]نَ","translation_en":"On the day when (some) faces shall turn white and (some) faces shall turn black; then as to those whose faces turn black: Did you disbelieve after your believing? Taste therefore the chastisement because you disbelieved.","translation_id":"pada hari itu ada wajah yang putih berseri, dan ada pula wajah yang hitam muram. Adapun orang-orang yang berwajah hitam muram (kepada mereka dikatakan), “Mengapa kamu kafir setelah beriman? Karena itu rasakanlah azab disebabkan kekafiranmu itu.”","hasanah_per_verse":810},{"text_madani":"وَأَمَّا الَّذِينَ ابْيَضَّتْ وُجُوهُهُمْ فَفِي رَحْمَةِ اللَّهِ هُمْ فِيهَا خَالِدُونَ","text_tajweed":"وَأَ[g[مّ]َا [h:138[ٱ]لَّذِينَ [h:2155[ٱ][q:2156[بْ]يَضَّتْ وُجُوهُهُمْ فَفِى رَحْمَةِ [h:2157[ٱ]للَّهِ هُمْ فِيهَا خَ[n[ـٰ]لِد[p[ُو]نَ","translation_en":"And as to those whose faces turn white, they shall be in Allah's mercy; in it they shall-abide.","translation_id":"Dan adapun orang-orang yang berwajah putih berseri, mereka berada dalam rahmat Allah (surga); mereka kekal di dalamnya.","hasanah_per_verse":430},{"text_madani":"تِلْكَ آيَاتُ اللَّهِ نَتْلُوهَا عَلَيْكَ بِالْحَقِّ ۗ وَمَا اللَّهُ يُرِيدُ ظُلْمًا لِّلْعَالَمِينَ","text_tajweed":"تِلْكَ ءَايَ[n[ـٰ]تُ [h:1442[ٱ]للَّهِ نَتْلُوهَا عَلَيْكَ بِ[h:370[ٱ]لْحَقِّ‌ۗ وَمَا [h:384[ٱ]للَّهُ يُرِيدُ ظُلْ[u:2158[مًا ل]ِّلْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"These are the communications of Allah which We recite to you with truth, and Allah does not desire any injustice to the creatures.","translation_id":"Itulah ayat-ayat Allah yang Kami bacakan kepada kamu dengan benar, dan Allah tidaklah berkehendak menzhalimi (siapa pun) di seluruh alam.","hasanah_per_verse":490},{"text_madani":"وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ","text_tajweed":"وَلِلَّهِ مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَا فِى [h:44[ٱ]لْأَرْضِ‌ۚ وَإِلَى [h:1148[ٱ]للَّهِ تُرْجَعُ [h:1149[ٱ]لْأُم[p[ُو]رُ","translation_en":"And whatever is in the heavens and whatever is in the earth is Allah's; and to Allah all things return","translation_id":"Dan milik Allah-lah apa yang ada di langit dan apa yang ada di bumi, dan hanya kepada Allah segala urusan dikembalikan.","hasanah_per_verse":440},{"text_madani":"كُنتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ تَأْمُرُونَ بِالْمَعْرُوفِ وَتَنْهَوْنَ عَنِ الْمُنكَرِ وَتُؤْمِنُونَ بِاللَّهِ ۗ وَلَوْ آمَنَ أَهْلُ الْكِتَابِ لَكَانَ خَيْرًا لَّهُم ۚ مِّنْهُمُ الْمُؤْمِنُونَ وَأَكْثَرُهُمُ الْفَاسِقُونَ","text_tajweed":"كُ[f:100[نت]ُمْ خَيْرَ أُ[g[مّ]َةٍ أُخْرِجَتْ لِل[g[نّ]َاسِ تَأْمُرُونَ بِ[h:934[ٱ]لْمَعْرُوفِ وَتَنْهَوْنَ عَنِ [h:2144[ٱ]لْمُ[f:2145[نك]َرِ وَتُؤْمِنُونَ بِ[h:32[ٱ]للَّهِ‌ۗ وَلَوْ ءَامَنَ أَهْلُ [h:2159[ٱ]لْكِتَ[n[ـٰ]بِ لَكَانَ خَيْ[u:2160[رًا ل]َّه[w:2161[ُم‌ۚ م]ِّنْهُمُ [h:2162[ٱ]لْمُؤْمِنُونَ وَأَكْثَرُهُمُ [h:2163[ٱ]لْفَ[n[ـٰ]سِق[p[ُو]نَ","translation_en":"You are the best of the nations raised up for (the benefit of) men; you enjoin what is right and forbid the wrong and believe in Allah; and if the followers of the Book had believed it would have been better for them; of them (some) are believers and most of them are transgressors.","translation_id":"Kamu (umat Islam) adalah umat terbaik yang dilahirkan untuk manusia, (karena kamu) menyuruh (berbuat) yang makruf, dan mencegah dari yang mungkar, dan beriman kepada Allah. Sekiranya Ahli Kitab beriman, tentulah itu lebih baik bagi mereka. Di antara mereka ada yang beriman, namun kebanyakan mereka adalah orang-orang fasik.","hasanah_per_verse":1130},{"text_madani":"لَن يَضُرُّوكُمْ إِلَّا أَذًى ۖ وَإِن يُقَاتِلُوكُمْ يُوَلُّوكُمُ الْأَدْبَارَ ثُمَّ لَا يُنصَرُونَ","text_tajweed":"ل[a:2164[َن ي]َضُرُّوكُمْ إِلّ[o[َآ] أَ[a:2165[ذًى‌ۖ و]َإ[a:2166[ِن ي]ُقَ[n[ـٰ]تِلُوكُمْ يُوَلُّوكُمُ [h:2167[ٱ]لْأَ[q:2168[دْ]بَارَ ثُ[g[مّ]َ لَا يُ[f:237[نص]َر[p[ُو]نَ","translation_en":"They shall by no means harm you but with a slight evil; and if they fight with you they shall turn (their) backs to you, then shall they not be helped.","translation_id":"Mereka tidak akan membahayakan kamu, kecuali gangguan-gangguan kecil saja, dan jika mereka memerangi kamu, niscaya mereka mundur berbalik ke belakang (kalah). Selanjutnya mereka tidak mendapat pertolongan.","hasanah_per_verse":480},{"text_madani":"ضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ أَيْنَ مَا ثُقِفُوا إِلَّا بِحَبْلٍ مِّنَ اللَّهِ وَحَبْلٍ مِّنَ النَّاسِ وَبَاءُوا بِغَضَبٍ مِّنَ اللَّهِ وَضُرِبَتْ عَلَيْهِمُ الْمَسْكَنَةُ ۚ ذَٰلِكَ بِأَنَّهُمْ كَانُوا يَكْفُرُونَ بِآيَاتِ اللَّهِ وَيَقْتُلُونَ الْأَنبِيَاءَ بِغَيْرِ حَقٍّ ۚ ذَٰلِكَ بِمَا عَصَوا وَّكَانُوا يَعْتَدُونَ","text_tajweed":"ضُرِبَتْ عَلَيْهِمُ [h:318[ٱ][l[ل]ذِّلَّةُ أَيْنَ مَا ثُقِف[o[ُوٓ][s[اْ] إِلَّا بِحَ[q:2169[بْ][a:2170[لٍ م]ِّنَ [h:321[ٱ]للَّهِ وَحَ[q:2171[بْ][a:2172[لٍ م]ِّنَ [h:721[ٱ][l[ل][g[نّ]َاسِ وَب[o[َا]ٓءُو بِغَضَ[a:320[بٍ م]ِّنَ [h:321[ٱ]للَّهِ وَضُرِبَتْ عَلَيْهِمُ [h:2173[ٱ]لْمَسْكَنَةُ‌ۚ ذ[n[َٲ]لِكَ بِأَ[g[نّ]َهُمْ كَانُو[s[اْ] يَكْفُرُونَ بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ وَيَ[q:323[قْ]تُلُونَ [h:2174[ٱ]لْأَ[i:2175[نۢب]ِي[o[َا]ٓءَ بِغَيْرِ حَ[f:2176[قٍّ‌ۚ ذ][n[َٲ]لِكَ بِمَا عَصَو[s[اْ] وَّكَانُو[s[اْ] يَعْتَد[p[ُو]نَ","translation_en":"Abasement is made to cleave to them wherever they are found, except under a covenant with Allah and a covenant with men, and they have become deserving of wrath from Allah, and humiliation is made to cleave to them; this is because they disbelieved in the communications of Allah and slew the prophets unjustly; this is because they disobeyed and exceeded the limits.","translation_id":"Mereka diliputi kehinaan di mana saja mereka berada, kecuali jika mereka (berpegang) pada tali (agama) Allah dan tali (perjanjian) dengan manusia. Mereka mendapat murka dari Allah dan (selalu) diliputi kesengsaraan. Yang demikian itu karena mereka mengingkari ayat-ayat Allah dan membunuh para nabi, tanpa hak (alasan yang benar). Yang demikian itu karena mereka durhaka dan melampaui batas.","hasanah_per_verse":1520},{"text_madani":"لَيْسُوا سَوَاءً ۗ مِّنْ أَهْلِ الْكِتَابِ أُمَّةٌ قَائِمَةٌ يَتْلُونَ آيَاتِ اللَّهِ آنَاءَ اللَّيْلِ وَهُمْ يَسْجُدُونَ","text_tajweed":"۞ لَيْسُو[s[اْ] سَو[o[َا]ٓ[a:2177[ءً‌ۗ م]ِّنْ أَهْلِ [h:545[ٱ]لْكِتَ[n[ـٰ]بِ أُ[g[مّ]َ[f:2178[ةٌ ق][o[َا]ٓئِمَ[a:2179[ةٌ ي]َتْلُونَ ءَايَ[n[ـٰ]تِ [h:1298[ٱ]للَّهِ ءَان[o[َا]ٓءَ [h:2180[ٱ]لَّيْلِ وَهُمْ يَسْجُد[p[ُو]نَ","translation_en":"They are not all alike; of the followers of the Book there is an upright party; they recite Allah's communications in the nighttime and they adore (Him).","translation_id":"Mereka itu tidak (seluruhnya) sama. Di antara Ahli Kitab ada golongan yang jujur, mereka membaca ayat-ayat Allah pada malam hari, dan mereka (juga) bersujud (shalat).","hasanah_per_verse":590},{"text_madani":"يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَيَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنكَرِ وَيُسَارِعُونَ فِي الْخَيْرَاتِ وَأُولَٰئِكَ مِنَ الصَّالِحِينَ","text_tajweed":"يُؤْمِنُونَ بِ[h:32[ٱ]للَّهِ وَ[h:328[ٱ]لْيَوْمِ [h:329[ٱ]لْأَخِرِ وَيَأْمُرُونَ بِ[h:934[ٱ]لْمَعْرُوفِ وَيَنْهَوْنَ عَنِ [h:2144[ٱ]لْمُ[f:2145[نك]َرِ وَيُسَ[n[ـٰ]رِعُونَ فِى [h:2181[ٱ]لْخَيْر[n[َٲ]تِ وَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ مِنَ [h:1889[ٱ][l[ل]صَّ[n[ـٰ]لِح[p[ِي]نَ","translation_en":"They believe in Allah and the last day, and they enjoin what is right and forbid the wrong and they strive with one another in hastening to good deeds, and those are among the good.","translation_id":"Mereka beriman kepada Allah dan hari akhir, menyuruh (berbuat) yang makruf, dan mencegah dari yang mungkar dan bersegera (mengerjakan) berbagai kebajikan. Mereka termasuk orang-orang shalih.","hasanah_per_verse":840},{"text_madani":"وَمَا يَفْعَلُوا مِنْ خَيْرٍ فَلَن يُكْفَرُوهُ ۗ وَاللَّهُ عَلِيمٌ بِالْمُتَّقِينَ","text_tajweed":"وَمَا يَفْعَلُو[s[اْ] مِنْ خَيْ[f:2182[رٍ ف]َل[a:2183[َن ي]ُكْفَرُوهُ‌ۗ وَ[h:72[ٱ]للَّهُ عَلِي[i:2184[مُۢ ب]ِ[h:2185[ٱ]لْمُتَّق[p[ِي]نَ","translation_en":"And whatever good they do, they shall not be denied it, and Allah knows those who guard (against evil).","translation_id":"Dan kebajikan apa pun yang mereka kerjakan, tidak ada yang mengingkarinya. Dan Allah Maha Mengetahui orang-orang yang bertakwa.","hasanah_per_verse":400},{"text_madani":"إِنَّ الَّذِينَ كَفَرُوا لَن تُغْنِيَ عَنْهُمْ أَمْوَالُهُمْ وَلَا أَوْلَادُهُم مِّنَ اللَّهِ شَيْئًا ۖ وَأُولَٰئِكَ أَصْحَابُ النَّارِ ۚ هُمْ فِيهَا خَالِدُونَ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ كَفَرُو[s[اْ] لَ[f:1752[ن ت]ُغْنِىَ عَنْهُمْ أَمْو[n[َٲ]لُهُمْ وَل[o[َآ] أَوْلَ[n[ـٰ]دُه[w:1753[ُم م]ِّنَ [h:321[ٱ]للَّهِ شَيْـ[a:1754[ـًٔا‌ۖ و]َأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ أَصْحَ[n[ـٰ]بُ [h:201[ٱ][l[ل][g[نّ]َارِ‌ۚ هُمْ فِيهَا خَ[n[ـٰ]لِد[p[ُو]نَ","translation_en":"(As for) those who disbelieve, surely neither their wealth nor their children shall avail them in the least against Allah; and these are the inmates of the fire; therein they shall abide.","translation_id":"Sesungguhnya orang-orang kafir, baik harta maupun anak-anak mereka, sedikit pun tidak dapat menolak azab Allah. Mereka itu penghuni neraka, (dan) mereka kekal di dalamnya.","hasanah_per_verse":770},{"text_madani":"مَثَلُ مَا يُنفِقُونَ فِي هَٰذِهِ الْحَيَاةِ الدُّنْيَا كَمَثَلِ رِيحٍ فِيهَا صِرٌّ أَصَابَتْ حَرْثَ قَوْمٍ ظَلَمُوا أَنفُسَهُمْ فَأَهْلَكَتْهُ ۚ وَمَا ظَلَمَهُمُ اللَّهُ وَلَٰكِنْ أَنفُسَهُمْ يَظْلِمُونَ","text_tajweed":"مَثَلُ مَا يُ[f:16[نف]ِقُونَ فِى هَ[n[ـٰ]ذِهِ [h:2186[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا كَمَثَلِ رِي[f:2187[حٍ ف]ِيهَا صِرٌّ أَصَابَتْ حَرْثَ قَوْ[f:2188[مٍ ظ]َلَم[o[ُوٓ][s[اْ] أَ[f:38[نف]ُسَهُمْ فَأَهْلَكَتْهُ‌ۚ وَمَا ظَلَمَهُمُ [h:2189[ٱ]للَّهُ وَلَ[n[ـٰ]كِنْ أَ[f:38[نف]ُسَهُمْ يَظْلِم[p[ُو]نَ","translation_en":"The likeness of what they spend in the life of this world is as the likeness of wind in which is intense cold (that) smites the seed produce of a people who haw done injustice to their souls and destroys it; and Allah is not unjust to them, but they are unjust to themselves.","translation_id":"Perumpamaan harta yang mereka infakkan di dalam kehidupan dunia ini, ibarat angin yang mengandung hawa sangat dingin, yang menimpa tanaman (milik) suatu kaum yang menzhalimi diri sendiri, lalu angin itu merusaknya. Allah tidak menzhalimi mereka, tetapi mereka yang menzhalimi diri sendiri.","hasanah_per_verse":980},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا بِطَانَةً مِّن دُونِكُمْ لَا يَأْلُونَكُمْ خَبَالًا وَدُّوا مَا عَنِتُّمْ قَدْ بَدَتِ الْبَغْضَاءُ مِنْ أَفْوَاهِهِمْ وَمَا تُخْفِي صُدُورُهُمْ أَكْبَرُ ۚ قَدْ بَيَّنَّا لَكُمُ الْآيَاتِ ۖ إِن كُنتُمْ تَعْقِلُونَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] لَا تَتَّخِذُو[s[اْ] بِطَانَ[a:2190[ةً م]ِّ[f:2191[ن د]ُونِكُمْ لَا يَأْلُونَكُمْ خَبَال[a:2192[اً و]َدُّو[s[اْ] مَا عَنِتُّمْ قَ[q:298[دْ] بَدَتِ [h:2193[ٱ]لْبَغْض[o[َا]ٓءُ مِنْ أَفْو[n[َٲ]هِهِمْ وَمَا تُخْفِى صُدُورُهُمْ أَكْبَرُ‌ۚ قَ[q:298[دْ] بَيَّ[g[نّ]َا لَكُمُ [h:1221[ٱ]لْأَيَ[n[ـٰ]تِ‌ۖ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ تَعْقِل[p[ُو]نَ","translation_en":"O you who believe! do not take for intimate friends from among others than your own people; they do not fall short of inflicting loss upon you; they love what distresses you; vehement hatred has already appeared from out of their mouths, and what their breasts conceal is greater still; indeed, We have made the communications clear to you, if you will understand.","translation_id":"Wahai orang-orang yang beriman! Janganlah kamu menjadikan teman orang-orang yang di luar kalanganmu (seagama) sebagai teman kepercayaanmu, (karena) mereka tidak henti-hentinya menyusahkan kamu. Mereka mengharapkan kehancuranmu. Sungguh, telah nyata kebencian dari mulut mereka, dan apa yang tersembunyi di hati mereka lebih jahat. Sungguh, telah Kami terangkan kepadamu ayat-ayat (Kami), jika kamu mengerti.","hasanah_per_verse":1250},{"text_madani":"هَا أَنتُمْ أُولَاءِ تُحِبُّونَهُمْ وَلَا يُحِبُّونَكُمْ وَتُؤْمِنُونَ بِالْكِتَابِ كُلِّهِ وَإِذَا لَقُوكُمْ قَالُوا آمَنَّا وَإِذَا خَلَوْا عَضُّوا عَلَيْكُمُ الْأَنَامِلَ مِنَ الْغَيْظِ ۚ قُلْ مُوتُوا بِغَيْظِكُمْ ۗ إِنَّ اللَّهَ عَلِيمٌ بِذَاتِ الصُّدُورِ","text_tajweed":"هَ[o[ـٰٓ]أَ[f:1998[نت]ُمْ أُ[s[وْ]ل[o[َا]ٓءِ تُحِبُّونَهُمْ وَلَا يُحِبُّونَكُمْ وَتُؤْمِنُونَ بِ[h:2042[ٱ]لْكِتَ[n[ـٰ]بِ كُلِّه[n[ِۦ] وَإِذَا لَقُوكُمْ قَال[o[ُوٓ][s[اْ] ءَامَ[g[نّ]َا وَإِذَا خَلَوْ[s[اْ] عَضُّو[s[اْ] عَلَيْكُمُ [h:2194[ٱ]لْأَنَامِلَ مِنَ [h:2195[ٱ]لْغَيْظِ‌ۚ قُلْ مُوتُو[s[اْ] بِغَيْظِكُمْ‌ۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَلِي[i:2196[مُۢ ب]ِذَاتِ [h:2197[ٱ][l[ل]صُّد[p[ُو]رِ","translation_en":"Lo! you are they who will love them while they do not love you, and you believe in the Book (in) the whole of it; and when they meet you they say: We believe, and when they are alone, they bite the ends of their fingers in rage against you. Say: Die in your rage; surely Allah knows what is in the breasts.","translation_id":"Beginilah kamu! Kamu menyukai mereka, padahal mereka tidak menyukaimu, dan kamu beriman kepada semua kitab. Apabila mereka berjumpa kamu, mereka berkata, “Kami beriman,” dan apabila mereka menyendiri, mereka menggigit ujung jari karena marah dan benci kepadamu. Katakanlah, “Matilah kamu karena kemarahanmu itu!” Sungguh, Allah Maha Mengetahui segala isi hati.","hasanah_per_verse":1270},{"text_madani":"إِن تَمْسَسْكُمْ حَسَنَةٌ تَسُؤْهُمْ وَإِن تُصِبْكُمْ سَيِّئَةٌ يَفْرَحُوا بِهَا ۖ وَإِن تَصْبِرُوا وَتَتَّقُوا لَا يَضُرُّكُمْ كَيْدُهُمْ شَيْئًا ۗ إِنَّ اللَّهَ بِمَا يَعْمَلُونَ مُحِيطٌ","text_tajweed":"إِ[f:2198[ن ت]َمْسَسْكُمْ حَسَنَ[f:2199[ةٌ ت]َسُؤْهُمْ وَإِ[f:2200[ن ت]ُصِ[q:2201[بْ]كُمْ سَيِّئَ[a:2202[ةٌ ي]َفْرَحُو[s[اْ] بِهَا‌ۖ وَإِ[f:2203[ن ت]َصْبِرُو[s[اْ] وَتَتَّقُو[s[اْ] لَا يَضُرُّكُمْ كَيْدُهُمْ شَيْــًٔا‌ۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ بِمَا يَعْمَلُونَ مُح[p[ِي][q[ط]ٌ","translation_en":"If good befalls you, it grieves them, and if an evil afflicts you, they rejoice at it; and if you are patient and guard yourselves, their scheme will not injure you in any way; surely Allah comprehends what they do.","translation_id":"Jika kamu memperoleh kebaikan, (niscaya) mereka bersedih hati, tetapi jika kamu tertimpa bencana, mereka bergembira karenanya. Jika kamu bersabar dan bertakwa, tipu daya mereka tidak akan menyusahkan kamu sedikit pun. Sungguh, Allah Maha Meliputi segala apa yang mereka kerjakan.","hasanah_per_verse":880},{"text_madani":"وَإِذْ غَدَوْتَ مِنْ أَهْلِكَ تُبَوِّئُ الْمُؤْمِنِينَ مَقَاعِدَ لِلْقِتَالِ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ","text_tajweed":"وَإِذْ غَدَوْتَ مِنْ أَهْلِكَ تُبَوِّئُ [h:2204[ٱ]لْمُؤْمِنِينَ مَقَ[n[ـٰ]عِدَ لِلْقِتَالِ‌ۗ وَ[h:72[ٱ]للَّهُ سَمِيعٌ عَل[p[ِي]مٌ","translation_en":"And when you did go forth early in the morning from your family to lodge the believers in encampments for war and Allah is Hearing, Knowing.","translation_id":"Dan (ingatlah), ketika engkau (Muhammad) berangkat pada pagi hari meninggalkan keluargamu untuk mengatur orang-orang beriman pada pos-pos pertempuran. Allah Maha Mendengar, Maha Mengetahui.","hasanah_per_verse":490},{"text_madani":"إِذْ هَمَّت طَّائِفَتَانِ مِنكُمْ أَن تَفْشَلَا وَاللَّهُ وَلِيُّهُمَا ۗ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ","text_tajweed":"إِذْ هَ[g[مّ]َ[d:2205[ت] طّ[o[َا]ٓئِفَتَانِ مِ[f:344[نك]ُمْ أَ[f:2206[ن ت]َفْشَلَا وَ[h:72[ٱ]للَّهُ وَلِيُّهُمَا‌ۗ وَعَلَى [h:2207[ٱ]للَّهِ فَلْيَتَوَكَّلِ [h:2208[ٱ]لْمُؤْمِن[p[ُو]نَ","translation_en":"When two parties from among you had determined that they should show cowardice, and Allah was the guardian of them both, and in Allah should the believers trust.","translation_id":"Ketika dua golongan dari pihak kamu ingin (mundur) karena takut, padahal Allah adalah penolong mereka. Karena itu, hendaklah kepada Allah saja orang-orang mukmin bertawakal.","hasanah_per_verse":570},{"text_madani":"وَلَقَدْ نَصَرَكُمُ اللَّهُ بِبَدْرٍ وَأَنتُمْ أَذِلَّةٌ ۖ فَاتَّقُوا اللَّهَ لَعَلَّكُمْ تَشْكُرُونَ","text_tajweed":"وَلَقَ[q:341[دْ] نَصَرَكُمُ [h:2209[ٱ]للَّهُ بِبَ[q:2210[دْ][a:2211[رٍ و]َأَ[f:98[نت]ُمْ أَذِلَّ[f:2212[ةٌ‌ۖ ف]َ[h:112[ٱ]تَّقُو[s[اْ] [h:1945[ٱ]للَّهَ لَعَلَّكُمْ تَشْكُر[p[ُو]نَ","translation_en":"And Allah did certainly assist you at Badr when you were weak; be careful of (your duty to) Allah then, that you may give thanks.","translation_id":"Dan sungguh, Allah telah menolong kamu dalam perang Badar, padahal kamu dalam keadaan lemah. Karena itu bertakwalah kepada Allah, agar kamu mensyukuri-Nya.","hasanah_per_verse":470},{"text_madani":"إِذْ تَقُولُ لِلْمُؤْمِنِينَ أَلَن يَكْفِيَكُمْ أَن يُمِدَّكُمْ رَبُّكُم بِثَلَاثَةِ آلَافٍ مِّنَ الْمَلَائِكَةِ مُنزَلِينَ","text_tajweed":"إِذْ تَقُولُ لِلْمُؤْمِنِينَ أَل[a:2213[َن ي]َكْفِيَكُمْ أ[a:2214[َن ي]ُمِدَّكُمْ رَبُّك[c:2215[ُم ب]ِثَلَ[n[ـٰ]ثَةِ ءَالَ[n[ـٰ][a:2216[فٍ م]ِّنَ [h:2217[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةِ مُ[f:2218[نز]َل[p[ِي]نَ","translation_en":"When you said to the believers: Does it not suffice you that your Lord should assist you with three thousand of the angels sent down?","translation_id":"(Ingatlah), ketika engkau (Muhammad) mengatakan kepada orang-orang beriman, “Apakah tidak cukup bagimu bahwa Allah membantu kamu dengan tiga ribu malaikat yang diturunkan (dari langit)?”","hasanah_per_verse":600},{"text_madani":"بَلَىٰ ۚ إِن تَصْبِرُوا وَتَتَّقُوا وَيَأْتُوكُم مِّن فَوْرِهِمْ هَٰذَا يُمْدِدْكُمْ رَبُّكُم بِخَمْسَةِ آلَافٍ مِّنَ الْمَلَائِكَةِ مُسَوِّمِينَ","text_tajweed":"بَلَ[o[ىٰٓ‌ۚ] إِ[f:2219[ن ت]َصْبِرُو[s[اْ] وَتَتَّقُو[s[اْ] وَيَأْتُوك[w:2220[ُم م]ِّ[f:2221[ن ف]َوْرِهِمْ هَ[n[ـٰ]ذَا يُمْدِ[q:2222[دْ]كُمْ رَبُّك[c:2223[ُم ب]ِخَمْسَةِ ءَالَ[n[ـٰ][a:2216[فٍ م]ِّنَ [h:2217[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةِ مُسَوِّم[p[ِي]نَ","translation_en":"Yea! if you remain patient and are on your guard, and they come upon you in a headlong manner, your Lord will assist you with five thousand of the havoc-making angels.","translation_id":"“Ya” (cukup). Jika kamu bersabar dan bertakwa ketika mereka datang menyerang kamu dengan tiba-tiba, niscaya Allah menolongmu dengan lima ribu malaikat yang memakai tanda.","hasanah_per_verse":690},{"text_madani":"وَمَا جَعَلَهُ اللَّهُ إِلَّا بُشْرَىٰ لَكُمْ وَلِتَطْمَئِنَّ قُلُوبُكُم بِهِ ۗ وَمَا النَّصْرُ إِلَّا مِنْ عِندِ اللَّهِ الْعَزِيزِ الْحَكِيمِ","text_tajweed":"وَمَا جَعَلَهُ [h:2224[ٱ]للَّهُ إِلَّا بُشْرَىٰ لَكُمْ وَلِتَ[q:2225[طْ]مَئِ[g[نّ]َ قُلُوبُك[c:2226[ُم ب]ِه[n[ِۦ]‌ۗ وَمَا [h:2227[ٱ][l[ل][g[نّ]َصْرُ إِلَّا مِنْ عِ[f:398[ند]ِ [h:399[ٱ]للَّهِ [h:2228[ٱ]لْعَزِيزِ [h:2229[ٱ]لْحَك[p[ِي]مِ","translation_en":"And Allah did not make it but as good news for you, and that your hearts might be at ease thereby, and victory is only from Allah, the Mighty, the Wise.","translation_id":"Dan Allah tidak menjadikannya (pemberian bala-bantuan itu) melainkan sebagai kabar gembira bagi (kemenangan)mu, dan agar hatimu tenang karenanya. Dan tidak ada kemenangan itu, selain dari Allah Yang Mahaperkasa, Mahabijaksana.","hasanah_per_verse":680},{"text_madani":"لِيَقْطَعَ طَرَفًا مِّنَ الَّذِينَ كَفَرُوا أَوْ يَكْبِتَهُمْ فَيَنقَلِبُوا خَائِبِينَ","text_tajweed":"لِيَ[q:2230[قْ]طَعَ طَرَ[a:2231[فًا م]ِّنَ [h:523[ٱ]لَّذِينَ كَفَر[o[ُوٓ][s[اْ] أَوْ يَكْبِتَهُمْ فَيَ[f:2232[نق]َلِبُو[s[اْ] خ[o[َا]ٓئِب[p[ِي]نَ","translation_en":"That He may cut off a portion from among those who disbelieve, or abase them so that they should return disappointed of attaining what they desired.","translation_id":"(Allah menolong kamu dalam perang Badar dan memberi bantuan) adalah untuk membinasakan segolongan orang kafir, atau untuk menjadikan mereka hina, sehingga mereka kembali tanpa memperoleh apa pun.","hasanah_per_verse":430},{"text_madani":"لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ","text_tajweed":"لَيْسَ لَكَ مِنَ [h:2233[ٱ]لْأَمْرِ شَىْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِ[g[نّ]َهُمْ ظَ[n[ـٰ]لِم[p[ُو]نَ","translation_en":"You have no concern in the affair whether He turns to them (mercifully) or chastises them, for surely they are unjust.","translation_id":"Itu bukan menjadi urusanmu (Muhammad) apakah Allah menerima tobat mereka, atau mengazabnya, karena sesungguhnya mereka orang-orang zhalim.","hasanah_per_verse":450},{"text_madani":"وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ يَغْفِرُ لِمَن يَشَاءُ وَيُعَذِّبُ مَن يَشَاءُ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ","text_tajweed":"وَلِلَّهِ مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَا فِى [h:44[ٱ]لْأَرْضِ‌ۚ يَغْفِرُ لِم[a:1537[َن ي]َش[o[َا]ٓءُ وَيُعَذِّبُ م[a:476[َن ي]َش[o[َا]ٓءُ‌ۚ وَ[h:72[ٱ]للَّهُ غَفُو[u:890[رٌ ر]َّح[p[ِي]مٌ","translation_en":"And whatever is in the heavens and whatever is in the earth is Allah's; He forgives whom He pleases and chastises whom He pleases; and Allah is Forgiving, Merciful.","translation_id":"Dan milik Allah-lah apa yang ada di langit dan apa yang ada di bumi. Dia mengampuni siapa yang Dia kehendaki, dan mengazab siapa yang Dia kehendaki. Dan Allah Maha Pengampun, Maha Penyayang.","hasanah_per_verse":610},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَأْكُلُوا الرِّبَا أَضْعَافًا مُّضَاعَفَةً ۖ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] لَا تَأْكُلُو[s[اْ] [h:2234[ٱ][l[ل]رِّبَ[o[[s[و]ٲٓاْ] أَضْعَ[n[ـٰ][a:2235[فًا م]ُّضَ[n[ـٰ]عَفَ[a:2236[ةً‌ۖ و]َ[h:1018[ٱ]تَّقُو[s[اْ] [h:1019[ٱ]للَّهَ لَعَلَّكُمْ تُفْلِح[p[ُو]نَ","translation_en":"O you who believe! do not devour usury, making it double and redouble, and be careful of (your duty to) Allah, that you may be successful.","translation_id":"Wahai orang-orang yang beriman! Janganlah kamu memakan riba dengan berlipat ganda dan bertakwalah kepada Allah agar kamu beruntung.","hasanah_per_verse":620},{"text_madani":"وَاتَّقُوا النَّارَ الَّتِي أُعِدَّتْ لِلْكَافِرِينَ","text_tajweed":"وَ[h:9999[ٱ]تَّقُو[s[اْ] [h:2237[ٱ][l[ل][g[نّ]َارَ [h:114[ٱ]لَّت[o[ِىٓ] أُعِدَّتْ لِلْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"And guard yourselves against the fire which has been prepared for the unbelievers.","translation_id":"Dan peliharalah dirimu dari api neraka, yang disediakan bagi orang kafir.","hasanah_per_verse":270},{"text_madani":"وَأَطِيعُوا اللَّهَ وَالرَّسُولَ لَعَلَّكُمْ تُرْحَمُونَ","text_tajweed":"وَأَطِيعُو[s[اْ] [h:2238[ٱ]للَّهَ وَ[h:1856[ٱ][l[ل]رَّسُولَ لَعَلَّكُمْ تُرْحَم[p[ُو]نَ","translation_en":"And obey Allah and the Messenger, that you may be shown mercy.","translation_id":"Dan taatlah kepada Allah dan Rasul (Muhammad), agar kamu diberi rahmat.","hasanah_per_verse":290},{"text_madani":"وَسَارِعُوا إِلَىٰ مَغْفِرَةٍ مِّن رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا السَّمَاوَاتُ وَالْأَرْضُ أُعِدَّتْ لِلْمُتَّقِينَ","text_tajweed":"۞ وَسَارِع[o[ُوٓ][s[اْ] إِلَىٰ مَغْفِرَ[a:2239[ةٍ م]ّ[u:243[ِن ر]َّبِّكُمْ وَجَ[g[نّ]َةٍ عَرْضُهَا [h:2240[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تُ وَ[h:2241[ٱ]لْأَرْضُ أُعِدَّتْ لِلْمُتَّق[p[ِي]نَ","translation_en":"And hasten to forgiveness from your Lord; and a Garden, the extensiveness of which is (as) the heavens and the earth, it is prepared for those who guard (against evil).","translation_id":"Dan bersegeralah kamu mencari ampunan dari Tuhanmu dan mendapatkan surga yang luasnya seluas langit dan bumi yang disediakan bagi orang-orang yang bertakwa,","hasanah_per_verse":550},{"text_madani":"الَّذِينَ يُنفِقُونَ فِي السَّرَّاءِ وَالضَّرَّاءِ وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ ۗ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ","text_tajweed":"ٱلَّذِينَ يُ[f:16[نف]ِقُونَ فِى [h:2242[ٱ][l[ل]سَّرّ[o[َا]ٓءِ وَ[h:920[ٱ][l[ل]ضَّرّ[o[َا]ٓءِ وَ[h:2243[ٱ]لْكَ[n[ـٰ]ظِمِينَ [h:2244[ٱ]لْغَيْظَ وَ[h:2245[ٱ]لْعَافِينَ عَنِ [h:2246[ٱ][l[ل][g[نّ]َاسِ‌ۗ وَ[h:72[ٱ]للَّهُ يُحِبُّ [h:1047[ٱ]لْمُحْسِن[p[ِي]نَ","translation_en":"Those who spend (benevolently) in ease as well as in straitness, and those who restrain (their) anger and pardon men; and Allah loves the doers of good (to others).","translation_id":"(yaitu) orang yang berinfak, baik di waktu lapang maupun sempit, dan orang-orang yang menahan amarahnya dan memaafkan (kesalahan) orang lain. Dan Allah mencintai orang yang berbuat kebaikan,","hasanah_per_verse":710},{"text_madani":"وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنفُسَهُمْ ذَكَرُوا اللَّهَ فَاسْتَغْفَرُوا لِذُنُوبِهِمْ وَمَن يَغْفِرُ الذُّنُوبَ إِلَّا اللَّهُ وَلَمْ يُصِرُّوا عَلَىٰ مَا فَعَلُوا وَهُمْ يَعْلَمُونَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ إِذَا فَعَلُو[s[اْ] فَ[n[ـٰ]حِشَةً أَوْ ظَلَم[o[ُوٓ][s[اْ] أَ[f:38[نف]ُسَهُمْ ذَكَرُو[s[اْ] [h:2247[ٱ]للَّهَ فَ[h:2248[ٱ]سْتَغْفَرُو[s[اْ] لِذُنُوبِهِمْ وَم[a:2249[َن ي]َغْفِرُ [h:2250[ٱ][l[ل]ذُّنُوبَ إِلَّا [h:1742[ٱ]للَّهُ وَلَمْ يُصِرُّو[s[اْ] عَلَىٰ مَا فَعَلُو[s[اْ] وَهُمْ يَعْلَم[p[ُو]نَ","translation_en":"And those who when they commit an indecency or do injustice to their souls remember Allah and ask forgiveness for their faults-- and who forgives the faults but Allah, and (who) do not knowingly persist in what they have done.","translation_id":"dan (juga) orang-orang yang apabila mengerjakan perbuatan keji atau menzhalimi diri sendiri, (segera) mengingat Allah, lalu memohon ampunan atas dosa-dosanya, dan siapa (lagi) yang dapat mengampuni dosa-dosa selain Allah? Dan mereka tidak meneruskan perbuatan dosa itu, sedang mereka mengetahui.","hasanah_per_verse":1040},{"text_madani":"أُولَٰئِكَ جَزَاؤُهُم مَّغْفِرَةٌ مِّن رَّبِّهِمْ وَجَنَّاتٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ وَنِعْمَ أَجْرُ الْعَامِلِينَ","text_tajweed":"أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ جَز[o[َا]ٓؤُه[w:2251[ُم م]َّغْفِرَ[a:2252[ةٌ م]ّ[u:22[ِن ر]َّبِّهِمْ وَجَ[g[نّ]َ[n[ـٰ][f:2253[تٌ ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ خَ[n[ـٰ]لِدِينَ فِيهَا‌ۚ وَنِعْمَ أَ[q:2254[جْ]رُ [h:2255[ٱ]لْعَ[n[ـٰ]مِل[p[ِي]نَ","translation_en":"(As for) these-- their reward is forgiveness from their Lord, and gardens beneath which rivers flow, to abide in them, and excellent is the reward of the laborers.","translation_id":"Balasan bagi mereka ialah ampunan dari Tuhan mereka dan surga-surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya. Dan (itulah) sebaik-baik pahala bagi orang-orang yang beramal.","hasanah_per_verse":700},{"text_madani":"قَدْ خَلَتْ مِن قَبْلِكُمْ سُنَنٌ فَسِيرُوا فِي الْأَرْضِ فَانظُرُوا كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِينَ","text_tajweed":"قَ[q:298[دْ] خَلَتْ مِ[f:85[ن ق]َ[q:86[بْ]لِكُمْ سُنَ[f:2256[نٌ ف]َسِيرُو[s[اْ] فِى [h:44[ٱ]لْأَرْضِ فَ[h:2257[ٱ][f:2257[نظ]ُرُو[s[اْ] كَيْفَ كَانَ عَ[n[ـٰ]قِبَةُ [h:2258[ٱ]لْمُكَذِّب[p[ِي]نَ","translation_en":"Indeed there have been examples before you; therefore travel in the earth and see what was the end of the rejecters.","translation_id":"Sungguh, telah berlalu sebelum kamu sunnah-sunnah (Allah), karena itu berjalanlah kamu ke (segenap penjuru) bumi dan perhatikanlah bagai-mana kesudahan orang yang mendustakan (rasul-rasul).","hasanah_per_verse":540},{"text_madani":"هَٰذَا بَيَانٌ لِّلنَّاسِ وَهُدًى وَمَوْعِظَةٌ لِّلْمُتَّقِينَ","text_tajweed":"هَ[n[ـٰ]ذَا بَيَا[u:2259[نٌ ل]ِّل[g[نّ]َاسِ وَهُ[a:2260[دًى و]َمَوْعِظَ[u:2261[ةٌ ل]ِّلْمُتَّق[p[ِي]نَ","translation_en":"This is a clear statement for men, and a guidance and an admonition to those who guard (against evil).","translation_id":"Inilah (Al-Qur'an) suatu keterangan yang jelas untuk semua manusia, dan menjadi petunjuk serta pelajaran bagi orang-orang yang bertakwa.","hasanah_per_verse":290},{"text_madani":"وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنتُمُ الْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ","text_tajweed":"وَلَا تَهِنُو[s[اْ] وَلَا تَحْزَنُو[s[اْ] وَأَ[f:2262[نت]ُمُ [h:2263[ٱ]لْأَعْلَوْنَ إِ[f:109[ن ك]ُ[f:100[نت][w:482[ُم م]ُّؤْمِن[p[ِي]نَ","translation_en":"And be not infirm, and be not grieving, and you shall have the upper hand if you are believers.","translation_id":"Dan janganlah kamu (merasa) lemah, dan jangan (pula) bersedih hati, sebab kamu paling tinggi (derajatnya), jika kamu orang beriman.","hasanah_per_verse":410},{"text_madani":"إِن يَمْسَسْكُمْ قَرْحٌ فَقَدْ مَسَّ الْقَوْمَ قَرْحٌ مِّثْلُهُ ۚ وَتِلْكَ الْأَيَّامُ نُدَاوِلُهَا بَيْنَ النَّاسِ وَلِيَعْلَمَ اللَّهُ الَّذِينَ آمَنُوا وَيَتَّخِذَ مِنكُمْ شُهَدَاءَ ۗ وَاللَّهُ لَا يُحِبُّ الظَّالِمِينَ","text_tajweed":"إ[a:2264[ِن ي]َمْسَسْكُمْ قَرْ[f:2265[حٌ ف]َقَ[q:563[دْ] مَسَّ [h:2266[ٱ]لْقَوْمَ قَرْ[a:2267[حٌ م]ِّثْلُهُ[n[ۥ]‌ۚ وَتِلْكَ [h:2268[ٱ]لْأَيَّامُ نُدَاوِلُهَا بَيْنَ [h:1165[ٱ][l[ل][g[نّ]َاسِ وَلِيَعْلَمَ [h:2269[ٱ]للَّهُ [h:1171[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَيَتَّخِذَ مِ[f:344[نك]ُمْ شُهَد[o[َا]ٓءَ‌ۗ وَ[h:72[ٱ]للَّهُ لَا يُحِبُّ [h:1968[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"If a wound has afflicted you (at Ohud), a wound like it has also afflicted the (unbelieving) people; and We bring these days to men by turns, and that Allah may know those who believe and take witnesses from among you; and Allah does not love the unjust.","translation_id":"Jika kamu (pada Perang Uhud) mendapat luka, maka mereka pun (pada Perang Badar) mendapat luka yang serupa. Dan masa (kejayaan dan kehancuran) itu, Kami pergilirkan di antara manusia (agar mereka mendapat pelajaran), dan agar Allah membedakan orang-orang yang beriman (dengan orang-orang kafir) dan agar sebagian kamu dijadikan-Nya (gugur sebagai) syuhada. Dan Allah tidak menyukai orang-orang zhalim,","hasanah_per_verse":1050},{"text_madani":"وَلِيُمَحِّصَ اللَّهُ الَّذِينَ آمَنُوا وَيَمْحَقَ الْكَافِرِينَ","text_tajweed":"وَلِيُمَحِّصَ [h:2270[ٱ]للَّهُ [h:1171[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَيَمْحَقَ [h:2271[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"And that He may purge those who believe and deprive the unbelievers of blessings.","translation_id":"dan agar Allah membersihkan orang-orang yang beriman (dari dosa mereka) dan membinasakan orang-orang kafir.","hasanah_per_verse":330},{"text_madani":"أَمْ حَسِبْتُمْ أَن تَدْخُلُوا الْجَنَّةَ وَلَمَّا يَعْلَمِ اللَّهُ الَّذِينَ جَاهَدُوا مِنكُمْ وَيَعْلَمَ الصَّابِرِينَ","text_tajweed":"أَمْ حَسِ[q:1174[بْ]تُمْ أَ[f:1175[ن ت]َ[q:1176[دْ]خُلُو[s[اْ] [h:1177[ٱ]لْجَ[g[نّ]َةَ وَلَ[g[مّ]َا يَعْلَمِ [h:2272[ٱ]للَّهُ [h:2273[ٱ]لَّذِينَ جَ[n[ـٰ]هَدُو[s[اْ] مِ[f:344[نك]ُمْ وَيَعْلَمَ [h:2274[ٱ][l[ل]صَّ[n[ـٰ]بِر[p[ِي]نَ","translation_en":"Do you think that you will enter the garden while Allah has not yet known those who strive hard from among you, and (He has not) known the patient.","translation_id":"Apakah kamu mengira bahwa kamu akan masuk surga, padahal belum nyata bagi Allah orang-orang yang berjihad di antara kamu, dan belum nyata orang-orang yang sabar.","hasanah_per_verse":600},{"text_madani":"وَلَقَدْ كُنتُمْ تَمَنَّوْنَ الْمَوْتَ مِن قَبْلِ أَن تَلْقَوْهُ فَقَدْ رَأَيْتُمُوهُ وَأَنتُمْ تَنظُرُونَ","text_tajweed":"وَلَقَ[q:341[دْ] كُ[f:100[نت]ُمْ تَمَ[g[نّ]َوْنَ [h:2275[ٱ]لْمَوْتَ مِ[f:1346[ن ق]َ[q:1347[بْ]لِ أَ[f:2276[ن ت]َلْقَوْهُ فَقَ[q:563[دْ] رَأَيْتُمُوهُ وَأَ[f:98[نت]ُمْ تَ[f:248[نظ]ُر[p[ُو]نَ","translation_en":"And certainly you desired death before you met it, so indeed you have seen it and you look (at it)","translation_id":"Dan kamu benar-benar mengharapkan mati (syahid) sebelum kamu menghadapinya; maka (sekarang) kamu sungguh, telah melihatnya dan kamu menyaksikannya.","hasanah_per_verse":510},{"text_madani":"وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِن قَبْلِهِ الرُّسُلُ ۚ أَفَإِن مَّاتَ أَوْ قُتِلَ انقَلَبْتُمْ عَلَىٰ أَعْقَابِكُمْ ۚ وَمَن يَنقَلِبْ عَلَىٰ عَقِبَيْهِ فَلَن يَضُرَّ اللَّهَ شَيْئًا ۗ وَسَيَجْزِي اللَّهُ الشَّاكِرِينَ","text_tajweed":"وَمَا مُحَ[g[مّ]َدٌ إِلَّا رَسُو[f:2277[لٌ ق]َ[q:298[دْ] خَلَتْ مِ[f:1097[ن ق]َ[q:1098[بْ]لِهِ [h:2278[ٱ][l[ل]رُّسُلُ‌ۚ أَفَإِ[s[يْ][a[ن م]َّاتَ أَوْ قُتِلَ [h:2279[ٱ][f:2280[نق]َلَ[q:2280[بْ]تُمْ عَلَ[o[ىٰٓ] أَعْقَ[n[ـٰ]بِكُمْ‌ۚ وَم[a:2281[َن ي]َ[f:2282[نق]َلِ[q:2282[بْ] عَلَىٰ عَقِبَيْهِ فَل[a:2283[َن ي]َضُرَّ [h:2284[ٱ]للَّهَ شَيْـ[a:2285[ـًٔا‌ۗ و]َسَيَ[q:2286[جْ]زِى [h:2287[ٱ]للَّهُ [h:2288[ٱ][l[ل]شَّ[n[ـٰ]كِر[p[ِي]نَ","translation_en":"And Muhammad is no more than a messenger; the messengers have already passed away before him; if then he dies or is killed will you turn back upon your heels? And whoever turns back upon his heels, he will by no means do harm to Allah in the least and Allah will reward the grateful.","translation_id":"Dan Muhammad hanyalah seorang Rasul; sebelumnya telah berlalu beberapa rasul. Apakah jika dia wafat atau dibunuh kamu berbalik ke belakang (murtad)? Barangsiapa berbalik ke belakang, maka ia tidak akan merugikan Allah sedikit pun. Allah akan memberi balasan kepada orang yang bersyukur.","hasanah_per_verse":1070},{"text_madani":"وَمَا كَانَ لِنَفْسٍ أَن تَمُوتَ إِلَّا بِإِذْنِ اللَّهِ كِتَابًا مُّؤَجَّلًا ۗ وَمَن يُرِدْ ثَوَابَ الدُّنْيَا نُؤْتِهِ مِنْهَا وَمَن يُرِدْ ثَوَابَ الْآخِرَةِ نُؤْتِهِ مِنْهَا ۚ وَسَنَجْزِي الشَّاكِرِينَ","text_tajweed":"وَمَا كَانَ لِنَفْسٍ أَ[f:2289[ن ت]َمُوتَ إِلَّا بِإِذْنِ [h:509[ٱ]للَّهِ كِتَ[n[ـٰ][a:2290[بًا م]ُّؤَجَّل[a:2291[اً‌ۗ و]َم[a:2292[َن ي]ُرِ[q:2293[دْ] ثَوَابَ [h:2294[ٱ][l[ل]دُّنْيَا نُؤْتِه[n[ِۦ] مِنْهَا وَم[a:2292[َن ي]ُرِ[q:2293[دْ] ثَوَابَ [h:2295[ٱ]لْأَخِرَةِ نُؤْتِه[n[ِۦ] مِنْهَا‌ۚ وَسَنَ[q:2296[جْ]زِى [h:2297[ٱ][l[ل]شَّ[n[ـٰ]كِر[p[ِي]نَ","translation_en":"And a soul will not die but with the permission of Allah the term is fixed; and whoever desires the reward of this world, I shall give him of it, and whoever desires the reward of the hereafter I shall give him of it, and I will reward the grateful.","translation_id":"Dan setiap yang bernyawa tidak akan mati kecuali dengan izin Allah, sebagai ketetapan yang telah ditentukan waktunya. Barangsiapa menghendaki pahala dunia, niscaya Kami berikan kepadanya pahala (dunia) itu, dan barangsiapa menghendaki pahala akhirat, Kami berikan (pula) kepadanya pahala (akhirat) itu, dan Kami akan memberi balasan kepada orang-orang yang bersyukur.","hasanah_per_verse":990},{"text_madani":"وَكَأَيِّن مِّن نَّبِيٍّ قَاتَلَ مَعَهُ رِبِّيُّونَ كَثِيرٌ فَمَا وَهَنُوا لِمَا أَصَابَهُمْ فِي سَبِيلِ اللَّهِ وَمَا ضَعُفُوا وَمَا اسْتَكَانُوا ۗ وَاللَّهُ يُحِبُّ الصَّابِرِينَ","text_tajweed":"وَكَأَيّ[a:2298[ِن م]ّ[a:2299[ِن ن]َّبِ[f:2300[ىٍّ ق]َ[n[ـٰ]تَلَ مَعَهُ[n[ۥ] رِبِّيُّونَ كَثِي[f:2301[رٌ ف]َمَا وَهَنُو[s[اْ] لِم[o[َآ] أَصَابَهُمْ فِى سَبِيلِ [h:788[ٱ]للَّهِ وَمَا ضَعُفُو[s[اْ] وَمَا [h:2302[ٱ]سْتَكَانُو[s[اْ‌ۗ] وَ[h:72[ٱ]للَّهُ يُحِبُّ [h:2303[ٱ][l[ل]صَّ[n[ـٰ]بِر[p[ِي]نَ","translation_en":"And how many a prophet has fought with whom were many worshippers of the Lord; so they did not become weak-hearted on account of what befell them in Allah's way, nor did they weaken, nor did they abase themselves; and Allah loves the patient.","translation_id":"Dan betapa banyak nabi yang berperang didampingi sejumlah besar dari pengikut(nya) yang bertakwa. Mereka tidak (menjadi) lemah karena bencana yang menimpanya di jalan Allah, tidak patah semangat dan tidak (pula) menyerah (kepada musuh). Dan Allah mencintai orang-orang yang sabar.","hasanah_per_verse":880},{"text_madani":"وَمَا كَانَ قَوْلَهُمْ إِلَّا أَن قَالُوا رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ","text_tajweed":"وَمَا كَانَ قَوْلَهُمْ إِلّ[o[َآ] أَ[f:2304[ن ق]َالُو[s[اْ] رَبَّنَا [h:2305[ٱ]غْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا ف[o[ِىٓ] أَمْرِنَا وَثَبِّتْ أَ[q:1429[قْ]دَامَنَا وَ[h:1430[ٱ][f:1430[نص]ُرْنَا عَلَى [h:1431[ٱ]لْقَوْمِ [h:1432[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"And their saying was no other than that they said: Our Lord! forgive us our faults and our extravagance in our affair and make firm our feet and help us against the unbelieving people.","translation_id":"Dan tidak lain ucapan mereka hanyalah doa, “Ya Tuhan kami, ampunilah dosa-dosa kami dan tindakan-tindakan kami yang berlebihan (dalam) urusan kami dan tetapkanlah pendirian kami, dan tolonglah kami terhadap orang-orang kafir.”","hasanah_per_verse":870},{"text_madani":"فَآتَاهُمُ اللَّهُ ثَوَابَ الدُّنْيَا وَحُسْنَ ثَوَابِ الْآخِرَةِ ۗ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ","text_tajweed":"فَـَٔـاتَ[n[ـٰ]هُمُ [h:2306[ٱ]للَّهُ ثَوَابَ [h:2294[ٱ][l[ل]دُّنْيَا وَحُسْنَ ثَوَابِ [h:2307[ٱ]لْأَخِرَةِ‌ۗ وَ[h:72[ٱ]للَّهُ يُحِبُّ [h:1047[ٱ]لْمُحْسِن[p[ِي]نَ","translation_en":"So Allah gave them the reward of this world and better reward of the hereafter and Allah loves those who do good (to others).","translation_id":"Maka Allah memberi mereka pahala di dunia dan pahala yang baik di akhirat. Dan Allah mencintai orang-orang yang berbuat kebaikan.","hasanah_per_verse":500},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِن تُطِيعُوا الَّذِينَ كَفَرُوا يَرُدُّوكُمْ عَلَىٰ أَعْقَابِكُمْ فَتَنقَلِبُوا خَاسِرِينَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِ[f:2127[ن ت]ُطِيعُو[s[اْ] [h:2308[ٱ]لَّذِينَ كَفَرُو[s[اْ] يَرُدُّوكُمْ عَلَ[o[ىٰٓ] أَعْقَ[n[ـٰ]بِكُمْ فَتَ[f:2309[نق]َلِبُو[s[اْ] خَ[n[ـٰ]سِر[p[ِي]نَ","translation_en":"O you who believe! if you obey those who disbelieve they will turn you back upon your heels, so you will turn back losers.","translation_id":"Wahai orang-orang yang beriman! Jika kamu menaati orang-orang yang kafir, niscaya mereka akan mengembalikan kamu ke belakang (murtad), maka kamu akan kembali menjadi orang yang rugi.","hasanah_per_verse":640},{"text_madani":"بَلِ اللَّهُ مَوْلَاكُمْ ۖ وَهُوَ خَيْرُ النَّاصِرِينَ","text_tajweed":"بَلِ [h:2310[ٱ]للَّهُ مَوْلَ[n[ـٰ]كُمْ‌ۖ وَهُوَ خَيْرُ [h:2311[ٱ][l[ل][g[نّ]َ[n[ـٰ]صِر[p[ِي]نَ","translation_en":"Nay! Allah is your Patron and He is the best of the helpers.","translation_id":"Tetapi hanya Allah-lah pelindungmu, dan Dia penolong yang terbaik.","hasanah_per_verse":260},{"text_madani":"سَنُلْقِي فِي قُلُوبِ الَّذِينَ كَفَرُوا الرُّعْبَ بِمَا أَشْرَكُوا بِاللَّهِ مَا لَمْ يُنَزِّلْ بِهِ سُلْطَانًا ۖ وَمَأْوَاهُمُ النَّارُ ۚ وَبِئْسَ مَثْوَى الظَّالِمِينَ","text_tajweed":"سَنُلْقِى فِى قُلُوبِ [h:2312[ٱ]لَّذِينَ كَفَرُو[s[اْ] [h:2313[ٱ][l[ل]رُّعْبَ بِم[o[َآ] أَشْرَكُو[s[اْ] بِ[h:32[ٱ]للَّهِ مَا لَمْ يُنَزِّلْ بِه[n[ِۦ] سُلْطَ[n[ـٰ][a:2314[نًا‌ۖ و]َمَأْوَ[n[ٮٰ]هُمُ [h:2315[ٱ][l[ل][g[نّ]َارُ‌ۚ وَبِئْسَ مَثْوَى [h:2316[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"We will cast terror into the hearts of those who disbelieve, because they set up with Allah that for which He has sent down no authority, and their abode is the fire, and evil is the abode of the unjust.","translation_id":"Akan Kami masukkan rasa takut ke dalam hati orang-orang kafir, karena mereka mempersekutukan Allah dengan sesuatu yang Allah tidak menurunkan keterangan tentang itu. Dan tempat kembali mereka ialah neraka. Dan (itulah) seburuk-buruk tempat tinggal (bagi) orang-orang zhalim.","hasanah_per_verse":840},{"text_madani":"وَلَقَدْ صَدَقَكُمُ اللَّهُ وَعْدَهُ إِذْ تَحُسُّونَهُم بِإِذْنِهِ ۖ حَتَّىٰ إِذَا فَشِلْتُمْ وَتَنَازَعْتُمْ فِي الْأَمْرِ وَعَصَيْتُم مِّن بَعْدِ مَا أَرَاكُم مَّا تُحِبُّونَ ۚ مِنكُم مَّن يُرِيدُ الدُّنْيَا وَمِنكُم مَّن يُرِيدُ الْآخِرَةَ ۚ ثُمَّ صَرَفَكُمْ عَنْهُمْ لِيَبْتَلِيَكُمْ ۖ وَلَقَدْ عَفَا عَنكُمْ ۗ وَاللَّهُ ذُو فَضْلٍ عَلَى الْمُؤْمِنِينَ","text_tajweed":"وَلَقَ[q:341[دْ] صَدَقَكُمُ [h:2317[ٱ]للَّهُ وَعْدَهُ[o[ۥٓ] إِذْ تَحُسُّونَه[c:2318[ُم ب]ِإِذْنِه[n[ِۦ]‌ۖ حَتَّ[o[ىٰٓ] إِذَا فَشِلْتُمْ وَتَنَ[n[ـٰ]زَعْتُمْ فِى [h:2319[ٱ]لْأَمْرِ وَعَصَيْت[w:2320[ُم م]ّ[i:146[ِنۢ ب]َعْدِ م[o[َآ] أَرَ[n[ٮٰ]ك[w:2321[ُم م]َّا تُحِبُّونَ‌ۚ مِ[f:344[نك][w:2322[ُم م]ّ[a:2323[َن ي]ُرِيدُ [h:2324[ٱ][l[ل]دُّنْيَا وَمِ[f:2325[نك][w:2326[ُم م]ّ[a:2323[َن ي]ُرِيدُ [h:2327[ٱ]لْأَخِرَةَ‌ۚ ثُ[g[مّ]َ صَرَفَكُمْ عَنْهُمْ لِيَ[q:2328[بْ]تَلِيَكُمْ‌ۖ وَلَقَ[q:341[دْ] عَفَا عَ[f:255[نك]ُمْ‌ۗ وَ[h:72[ٱ]للَّهُ ذُو فَضْلٍ عَلَى [h:2329[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"And certainly Allah made good to you His promise when you slew them by His permission, until when you became weak-hearted and disputed about the affair and disobeyed after He had shown you that which you loved; of you were some who desired this world and of you were some who desired the hereafter; then He turned you away from them that He might try you; and He has certainly pardoned you, and Allah is Gracious to the believers.","translation_id":"Dan sungguh, Allah telah memenuhi janji-Nya kepadamu, ketika kamu membunuh mereka dengan izin-Nya sampai pada saat kamu lemah dan berselisih dalam urusan itu dan mengabaikan perintah Rasul setelah Allah memperlihatkan kepadamu apa yang kamu sukai. Di antara kamu ada orang yang menghendaki dunia dan di antara kamu ada (pula) orang yang menghendaki akhirat. Kemudian Allah memalingkan kamu dari mereka untuk mengujimu, tetapi Dia benar-benar telah memaafkan kamu. Dan Allah mempunyai karunia (yang diberikan) kepada orang-orang mukmin.","hasanah_per_verse":1660},{"text_madani":"إِذْ تُصْعِدُونَ وَلَا تَلْوُونَ عَلَىٰ أَحَدٍ وَالرَّسُولُ يَدْعُوكُمْ فِي أُخْرَاكُمْ فَأَثَابَكُمْ غَمًّا بِغَمٍّ لِّكَيْلَا تَحْزَنُوا عَلَىٰ مَا فَاتَكُمْ وَلَا مَا أَصَابَكُمْ ۗ وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ","text_tajweed":"۞ إِذْ تُصْعِدُونَ وَلَا تَلْوُ[n[ۥ]نَ عَلَ[o[ىٰٓ] أَحَ[a:2330[دٍ و]َ[h:2331[ٱ][l[ل]رَّسُولُ يَ[q:2332[دْ]عُوكُمْ ف[o[ِىٓ] أُخْرَ[n[ٮٰ]كُمْ فَأَثَ[n[ـٰ]بَكُمْ غَ[g[مّ][i:2333[َۢا ب]ِغَ[u:2334[[g[مّ]ٍ ل]ِّكَيْلَا تَحْزَنُو[s[اْ] عَلَىٰ مَا فَاتَكُمْ وَلَا م[o[َآ] أَصَ[n[ـٰ]بَكُمْ‌ۗ وَ[h:72[ٱ]للَّهُ خَبِي[i:2335[رُۢ ب]ِمَا تَعْمَل[p[ُو]نَ","translation_en":"When you ran off precipitately and did not wait for any one, and the Messenger was calling you from your rear, so He gave you another sorrow instead of (your) sorrow, so that you might not grieve at what had escaped you, nor (at) what befell you; and Allah is aware of what you do.","translation_id":"(Ingatlah) ketika kamu lari dan tidak menoleh kepada siapa pun, sedang Rasul (Muhammad) yang berada di antara (kawan-kawan)mu yang lain memanggil kamu (kelompok yang lari), karena itu Allah menimpakan kepadamu kesedihan demi kesedihan, agar kamu tidak bersedih hati (lagi) terhadap apa yang luput dari kamu dan terhadap apa yang menimpamu. Dan Allah Mahateliti apa yang kamu kerjakan.","hasanah_per_verse":1060},{"text_madani":"ثُمَّ أَنزَلَ عَلَيْكُم مِّن بَعْدِ الْغَمِّ أَمَنَةً نُّعَاسًا يَغْشَىٰ طَائِفَةً مِّنكُمْ ۖ وَطَائِفَةٌ قَدْ أَهَمَّتْهُمْ أَنفُسُهُمْ يَظُنُّونَ بِاللَّهِ غَيْرَ الْحَقِّ ظَنَّ الْجَاهِلِيَّةِ ۖ يَقُولُونَ هَل لَّنَا مِنَ الْأَمْرِ مِن شَيْءٍ ۗ قُلْ إِنَّ الْأَمْرَ كُلَّهُ لِلَّهِ ۗ يُخْفُونَ فِي أَنفُسِهِم مَّا لَا يُبْدُونَ لَكَ ۖ يَقُولُونَ لَوْ كَانَ لَنَا مِنَ الْأَمْرِ شَيْءٌ مَّا قُتِلْنَا هَاهُنَا ۗ قُل لَّوْ كُنتُمْ فِي بُيُوتِكُمْ لَبَرَزَ الَّذِينَ كُتِبَ عَلَيْهِمُ الْقَتْلُ إِلَىٰ مَضَاجِعِهِمْ ۖ وَلِيَبْتَلِيَ اللَّهُ مَا فِي صُدُورِكُمْ وَلِيُمَحِّصَ مَا فِي قُلُوبِكُمْ ۗ وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","text_tajweed":"ثُ[g[مّ]َ أَ[f:471[نز]َلَ عَلَيْك[w:548[ُم م]ّ[i:146[ِنۢ ب]َعْدِ [h:2336[ٱ]لْغَ[g[مّ]ِ أَمَنَ[a:2337[ةً ن]ُّعَا[a:2338[سًا ي]َغْشَىٰ ط[o[َا]ٓئِفَ[a:2339[ةً م]ِّ[f:344[نك]ُمْ‌ۖ وَط[o[َا]ٓئِفَ[f:2340[ةٌ ق]َ[q:298[دْ] أَهَ[g[مّ]َتْهُمْ أَ[f:2341[نف]ُسُهُمْ يَظُ[g[نّ]ُونَ بِ[h:32[ٱ]للَّهِ غَيْرَ [h:2342[ٱ]لْحَقِّ ظَ[g[نّ]َ [h:2343[ٱ]لْجَ[n[ـٰ]هِلِيَّةِ‌ۖ يَقُولُونَ هَل لَّنَا مِنَ [h:2233[ٱ]لْأَمْرِ مِ[f:2103[ن ش][f:2344[َىْءٍ‌ۗ ق]ُلْ إِ[g[نّ]َ [h:2345[ٱ]لْأَمْرَ كُلَّهُ[n[ۥ] لِلَّهِ‌ۗ يُخْفُونَ ف[o[ِىٓ] أَ[f:568[نف]ُسِه[w:2346[ِم م]َّا لَا يُ[q:2347[بْ]دُونَ لَكَ‌ۖ يَقُولُونَ لَوْ كَانَ لَنَا مِنَ [h:2233[ٱ]لْأَمْرِ ش[a:2348[َىْءٌ م]َّا قُتِلْنَا هَ[n[ـٰ]هُنَا‌ۗ قُل لَّوْ كُ[f:100[نت]ُمْ فِى بُيُوتِكُمْ لَبَرَزَ [h:2349[ٱ]لَّذِينَ كُتِبَ عَلَيْهِمُ [h:2350[ٱ]لْقَتْلُ إِلَىٰ مَضَاجِعِهِمْ‌ۖ وَلِيَ[q:2351[بْ]تَلِىَ [h:2352[ٱ]للَّهُ مَا فِى صُدُورِكُمْ وَلِيُمَحِّصَ مَا فِى قُلُوبِكُمْ‌ۗ وَ[h:72[ٱ]للَّهُ عَلِي[i:2196[مُۢ ب]ِذَاتِ [h:2197[ٱ][l[ل]صُّد[p[ُو]رِ","translation_en":"Then after sorrow He sent down security upon you, a calm coming upon a party of you, and (there was) another party whom their own souls had rendered anxious; they entertained about Allah thoughts of ignorance quite unjustly, saying: We have no hand in the affair. Say: Surely the affair is wholly (in the hands) of Allah. They conceal within their souls what they would not reveal to you. They say: Had we any hand in the affair, we would not have been slain here. Say: Had you remained in your houses, those for whom slaughter was ordained would certainly have gone forth to the places where they would be slain, and that Allah might test what was in your breasts and that He might purge what was in your hearts; and Allah knows what is in the breasts.","translation_id":"Kemudian setelah kamu ditimpa kesedihan, Dia menurunkan rasa aman kepadamu (berupa) kantuk yang meliputi segolongan dari kamu, sedangkan segolongan lagi telah dicemaskan oleh diri mereka sendiri; mereka menyangka yang tidak benar terhadap Allah seperti sangkaan jahiliah. Mereka berkata, “Adakah sesuatu yang dapat kita perbuat dalam urusan ini?” Katakanlah (Muhammad), “Sesungguhnya segala urusan itu di tangan Allah.” Mereka menyembunyikan dalam hatinya apa yang tidak mereka terangkan kepadamu. Mereka berkata, “Sekiranya ada sesuatu yang dapat kita perbuat dalam urusan ini, niscaya kita tidak akan dibunuh (dikalahkan) di sini.” Katakanlah (Muhammad), “Meskipun kamu ada di rumahmu, niscaya orang-orang yang telah ditetapkan akan mati terbunuh itu keluar (juga) ke tempat mereka terbunuh.” Allah (berbuat demikian) untuk menguji apa yang ada dalam dadamu dan untuk membersihkan apa yang ada dalam hatimu. Dan Allah Maha Mengetahui isi hati.","hasanah_per_verse":2910},{"text_madani":"إِنَّ الَّذِينَ تَوَلَّوْا مِنكُمْ يَوْمَ الْتَقَى الْجَمْعَانِ إِنَّمَا اسْتَزَلَّهُمُ الشَّيْطَانُ بِبَعْضِ مَا كَسَبُوا ۖ وَلَقَدْ عَفَا اللَّهُ عَنْهُمْ ۗ إِنَّ اللَّهَ غَفُورٌ حَلِيمٌ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ تَوَلَّوْ[s[اْ] مِ[f:344[نك]ُمْ يَوْمَ [h:2353[ٱ][l[ل]ْتَقَى [h:2354[ٱ]لْجَمْعَانِ إِ[g[نّ]َمَا [h:2355[ٱ]سْتَزَلَّهُمُ [h:2356[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ بِبَعْضِ مَا كَسَبُو[s[اْ‌ۖ] وَلَقَ[q:341[دْ] عَفَا [h:2357[ٱ]للَّهُ عَنْهُمْ‌ۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ غَفُورٌ حَل[p[ِي]مٌ","translation_en":"(As for) those of you who turned back on the day when the two armies met, only the Shaitan sought to cause them to make a slip on account of some deeds they had done, and certainly Allah has pardoned them; surely Allah is Forgiving, Forbearing.","translation_id":"Sesungguhnya orang-orang yang berpaling di antara kamu ketika terjadi pertemuan (pertempuran) antara dua pasukan itu, sesungguhnya mereka digelincirkan oleh setan, disebabkan sebagian kesalahan (dosa) yang telah mereka perbuat (pada masa lampau), tetapi Allah benar-benar telah memaafkan mereka. Sungguh, Allah Maha Pengampun, Maha Penyantun.","hasanah_per_verse":890},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَكُونُوا كَالَّذِينَ كَفَرُوا وَقَالُوا لِإِخْوَانِهِمْ إِذَا ضَرَبُوا فِي الْأَرْضِ أَوْ كَانُوا غُزًّى لَّوْ كَانُوا عِندَنَا مَا مَاتُوا وَمَا قُتِلُوا لِيَجْعَلَ اللَّهُ ذَٰلِكَ حَسْرَةً فِي قُلُوبِهِمْ ۗ وَاللَّهُ يُحْيِي وَيُمِيتُ ۗ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] لَا تَكُونُو[s[اْ] كَ[h:2146[ٱ]لَّذِينَ كَفَرُو[s[اْ] وَقَالُو[s[اْ] لِإِخْو[n[َٲ]نِهِمْ إِذَا ضَرَبُو[s[اْ] فِى [h:44[ٱ]لْأَرْضِ أَوْ كَانُو[s[اْ] غُز[u:2358[ًّى ل]َّوْ كَانُو[s[اْ] عِ[f:2359[ند]َنَا مَا مَاتُو[s[اْ] وَمَا قُتِلُو[s[اْ] لِيَ[q:2360[جْ]عَلَ [h:2361[ٱ]للَّهُ ذ[n[َٲ]لِكَ حَسْرَ[f:2362[ةً ف]ِى قُلُوبِهِمْ‌ۗ وَ[h:72[ٱ]للَّهُ يُحْى[n[ِۦ] وَيُمِيتُ‌ۗ وَ[h:72[ٱ]للَّهُ بِمَا تَعْمَلُونَ بَص[p[ِي]رٌ","translation_en":"O you who believe! be not like those who disbelieve and say of their brethren when they travel in the earth or engage in fighting: Had they been with us, they would not have died and they would not have been slain; so Allah makes this to be an intense regret in their hearts; and Allah gives life and causes death and Allah sees what you do.","translation_id":"Wahai orang-orang yang beriman! Janganlah kamu seperti orang-orang kafir yang mengatakan kepada saudara-saudaranya apabila mereka mengadakan perjalanan di bumi atau berperang, “Sekiranya mereka tetap bersama kita, tentulah mereka tidak mati dan tidak terbunuh.” (Dengan perkataan) yang demikian itu, karena Allah hendak menimbulkan rasa penyesalan di hati mereka. Allah menghidupkan dan mematikan, dan Allah Maha Melihat apa yang kamu kerjakan.","hasanah_per_verse":1570},{"text_madani":"وَلَئِن قُتِلْتُمْ فِي سَبِيلِ اللَّهِ أَوْ مُتُّمْ لَمَغْفِرَةٌ مِّنَ اللَّهِ وَرَحْمَةٌ خَيْرٌ مِّمَّا يَجْمَعُونَ","text_tajweed":"وَلَئِ[f:2363[ن ق]ُتِلْتُمْ فِى سَبِيلِ [h:788[ٱ]للَّهِ أَوْ مُتُّمْ لَمَغْفِرَ[a:2364[ةٌ م]ِّنَ [h:321[ٱ]للَّهِ وَرَحْمَةٌ خَيْ[a:2365[رٌ م]ِّ[g[مّ]َا يَ[q:2366[جْ]مَع[p[ُو]نَ","translation_en":"And if you are slain in the way of Allah or you die, certainly forgiveness from Allah and mercy is better than what they amass.","translation_id":"Dan sungguh, sekiranya kamu gugur di jalan Allah atau mati, sungguh, pastilah ampunan Allah dan rahmat-Nya lebih baik (bagimu) daripada apa (harta rampasan) yang mereka kumpulkan.","hasanah_per_verse":530},{"text_madani":"وَلَئِن مُّتُّمْ أَوْ قُتِلْتُمْ لَإِلَى اللَّهِ تُحْشَرُونَ","text_tajweed":"وَلَئ[a:2367[ِن م]ُّتُّمْ أَوْ قُتِلْتُمْ لَإِلَى [h:2368[ٱ]للَّهِ تُحْشَر[p[ُو]نَ","translation_en":"And if indeed you die or you are slain, certainly to Allah shall you be gathered together.","translation_id":"Dan sungguh, sekiranya kamu mati atau gugur, pastilah kepada Allah kamu dikumpulkan.","hasanah_per_verse":280},{"text_madani":"فَبِمَا رَحْمَةٍ مِّنَ اللَّهِ لِنتَ لَهُمْ ۖ وَلَوْ كُنتَ فَظًّا غَلِيظَ الْقَلْبِ لَانفَضُّوا مِنْ حَوْلِكَ ۖ فَاعْفُ عَنْهُمْ وَاسْتَغْفِرْ لَهُمْ وَشَاوِرْهُمْ فِي الْأَمْرِ ۖ فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللَّهِ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُتَوَكِّلِينَ","text_tajweed":"فَبِمَا رَحْمَ[a:2369[ةٍ م]ِّنَ [h:321[ٱ]للَّهِ لِ[f:2370[نت]َ لَهُمْ‌ۖ وَلَوْ كُ[f:735[نت]َ فَظًّا غَلِيظَ [h:2371[ٱ]لْقَلْبِ لَ[h:2372[ٱ][f:2372[نف]َضُّو[s[اْ] مِنْ حَوْلِكَ‌ۖ فَ[h:2373[ٱ]عْفُ عَنْهُمْ وَ[h:2374[ٱ]سْتَغْفِرْ لَهُمْ وَشَاوِرْهُمْ فِى [h:2319[ٱ]لْأَمْرِ‌ۖ فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى [h:412[ٱ]للَّهِ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ يُحِبُّ [h:2375[ٱ]لْمُتَوَكِّل[p[ِي]نَ","translation_en":"Thus it is due to mercy from Allah that you deal with them gently, and had you been rough, hard hearted, they would certainly have dispersed from around you; pardon them therefore and ask pardon for them, and take counsel with them in the affair; so when you have decided, then place your trust in Allah; surely Allah loves those who trust.","translation_id":"Maka berkat rahmat Allah engkau (Muhammad) berlaku lemah lembut terhadap mereka. Sekiranya engkau bersikap keras dan berhati kasar, tentulah mereka menjauhkan diri dari sekitarmu. Karena itu maafkanlah mereka dan mohonkanlah ampunan untuk mereka, dan bermusyawarahlah dengan mereka dalam urusan itu. Kemudian, apabila engkau telah membulatkan tekad, maka bertawakallah kepada Allah. Sungguh, Allah mencintai orang yang bertawakal.","hasanah_per_verse":1210},{"text_madani":"إِن يَنصُرْكُمُ اللَّهُ فَلَا غَالِبَ لَكُمْ ۖ وَإِن يَخْذُلْكُمْ فَمَن ذَا الَّذِي يَنصُرُكُم مِّن بَعْدِهِ ۗ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ","text_tajweed":"إ[a:2376[ِن ي]َ[f:2377[نص]ُرْكُمُ [h:2378[ٱ]للَّهُ فَلَا غَالِبَ لَكُمْ‌ۖ وَإ[a:2379[ِن ي]َخْذُلْكُمْ فَمَ[f:2380[ن ذ]َا [h:1376[ٱ]لَّذِى يَ[f:2381[نص]ُرُك[w:2382[ُم م]ّ[i:254[ِنۢ ب]َعْدِه[n[ِۦ]‌ۗ وَعَلَى [h:2207[ٱ]للَّهِ فَلْيَتَوَكَّلِ [h:2208[ٱ]لْمُؤْمِن[p[ُو]نَ","translation_en":"If Allah assists you, then there is none that can overcome you, and if He forsakes you, who is there then that can assist you after Him? And on Allah should the believers rely.","translation_id":"Jika Allah menolong kamu, maka tidak ada yang dapat mengalahkanmu, tetapi jika Allah membiarkan kamu (tidak memberi pertolongan), maka siapa yang dapat menolongmu setelah itu? Karena itu, hendaklah kepada Allah saja orang-orang mukmin bertawakal.","hasanah_per_verse":750},{"text_madani":"وَمَا كَانَ لِنَبِيٍّ أَن يَغُلَّ ۚ وَمَن يَغْلُلْ يَأْتِ بِمَا غَلَّ يَوْمَ الْقِيَامَةِ ۚ ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ","text_tajweed":"وَمَا كَانَ لِنَبِىٍّ أ[a:2383[َن ي]َغُلَّ‌ۚ وَم[a:2384[َن ي]َغْلُلْ يَأْتِ بِمَا غَلَّ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ‌ۚ ثُ[g[مّ]َ تُوَفَّىٰ كُلُّ نَفْ[a:1654[سٍ م]َّا كَسَبَتْ وَهُمْ لَا يُظْلَم[p[ُو]نَ","translation_en":"And it is not attributable to a prophet that he should act unfaithfully; and he who acts unfaithfully shall bring that in respect of which he has acted unfaithfully on the day of resurrection; then shall every soul be paid back fully what it has earned, and they shall not be dealt with unjustly.","translation_id":"Dan tidak mungkin seorang nabi berkhianat (dalam urusan harta rampasan perang). Barangsiapa berkhianat, niscaya pada hari Kiamat dia akan datang membawa apa yang dikhianatkannya itu. Kemudian setiap orang akan diberi balasan yang sempurna sesuai dengan apa yang dilakukannya, dan mereka tidak dizhalimi.","hasanah_per_verse":680},{"text_madani":"أَفَمَنِ اتَّبَعَ رِضْوَانَ اللَّهِ كَمَن بَاءَ بِسَخَطٍ مِّنَ اللَّهِ وَمَأْوَاهُ جَهَنَّمُ ۚ وَبِئْسَ الْمَصِيرُ","text_tajweed":"أَفَمَنِ [h:2385[ٱ]تَّبَعَ رِضْو[n[َٲ]نَ [h:2386[ٱ]للَّهِ كَم[i:2387[َنۢ ب][o[َا]ٓءَ بِسَخَ[a:2388[طٍ م]ِّنَ [h:321[ٱ]للَّهِ وَمَأْوَ[n[ٮٰ]هُ جَهَ[g[نّ]َمُ‌ۚ وَبِئْسَ [h:665[ٱ]لْمَص[p[ِي]رُ","translation_en":"Is then he who follows the pleasure of Allah like him who has made himself deserving of displeasure from Allah, and his abode is hell; and it is an evil destination.","translation_id":"Maka adakah orang yang mengikuti keridhaan Allah sama dengan orang yang kembali membawa kemurkaan dari Allah dan tempatnya di neraka Jahanam? Itulah seburuk-buruk tempat kembali.","hasanah_per_verse":530},{"text_madani":"هُمْ دَرَجَاتٌ عِندَ اللَّهِ ۗ وَاللَّهُ بَصِيرٌ بِمَا يَعْمَلُونَ","text_tajweed":"هُمْ دَرَجَ[n[ـٰ]تٌ عِ[f:264[ند]َ [h:408[ٱ]للَّهِ‌ۗ وَ[h:72[ٱ]للَّهُ بَصِي[i:505[رُۢ ب]ِمَا يَعْمَل[p[ُو]نَ","translation_en":"There are (varying) grades with Allah, and Allah sees what they do.","translation_id":"(Kedudukan) mereka itu bertingkat-tingkat di sisi Allah, dan Allah Maha Melihat apa yang mereka kerjakan.","hasanah_per_verse":320},{"text_madani":"لَقَدْ مَنَّ اللَّهُ عَلَى الْمُؤْمِنِينَ إِذْ بَعَثَ فِيهِمْ رَسُولًا مِّنْ أَنفُسِهِمْ يَتْلُو عَلَيْهِمْ آيَاتِهِ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَإِن كَانُوا مِن قَبْلُ لَفِي ضَلَالٍ مُّبِينٍ","text_tajweed":"لَقَ[q:2389[دْ] مَ[g[نّ]َ [h:2390[ٱ]للَّهُ عَلَى [h:2329[ٱ]لْمُؤْمِنِينَ إِذْ بَعَثَ فِيهِمْ رَسُول[a:2391[اً م]ِّنْ أَ[f:568[نف]ُسِهِمْ يَتْلُو[s[اْ] عَلَيْهِمْ ءَايَ[n[ـٰ]تِه[n[ِۦ] وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ [h:678[ٱ]لْكِتَ[n[ـٰ]بَ وَ[h:679[ٱ]لْحِكْمَةَ وَإِ[f:2392[ن ك]َانُو[s[اْ] مِ[f:128[ن ق]َ[q:129[بْ]لُ لَفِى ضَلَ[n[ـٰ][a:2393[لٍ م]ُّب[p[ِي]نٍ","translation_en":"Certainly Allah conferred a benefit upon the believers when He raised among them a Messenger from among themselves, reciting to them His communications and purifying them, and teaching them the Book and the wisdom, although before that they were surely in manifest error.","translation_id":"Sungguh, Allah telah memberi karunia kepada orang-orang beriman ketika (Allah) mengutus seorang Rasul (Muhammad) di tengah-tengah mereka dari kalangan mereka sendiri, yang membacakan kepada mereka ayat-ayat-Nya, menyucikan (jiwa) mereka, dan mengajarkan kepada mereka Kitab (Al-Qur'an) dan Hikmah (Sunnah), meskipun sebelumnya, mereka benar-benar dalam kesesatan yang nyata.","hasanah_per_verse":1070},{"text_madani":"أَوَلَمَّا أَصَابَتْكُم مُّصِيبَةٌ قَدْ أَصَبْتُم مِّثْلَيْهَا قُلْتُمْ أَنَّىٰ هَٰذَا ۖ قُلْ هُوَ مِنْ عِندِ أَنفُسِكُمْ ۗ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","text_tajweed":"أَوَلَ[g[مّ][o[َآ] أَصَ[n[ـٰ]بَتْك[w:2394[ُم م]ُّصِيبَ[f:2395[ةٌ ق]َ[q:298[دْ] أَصَ[q:2396[بْ]ت[w:2397[ُم م]ِّثْلَيْهَا قُلْتُمْ أَ[g[نّ]َىٰ هَ[n[ـٰ]ذَا‌ۖ قُلْ هُوَ مِنْ عِ[f:398[ند]ِ أَ[f:1329[نف]ُسِكُمْ‌ۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َد[p[ِي]رٌ","translation_en":"What! when a misfortune befell you, and you had certainly afflicted (the unbelievers) with twice as much, you began to say: Whence is this? Say: It is from yourselves; surely Allah has power over all things.","translation_id":"Dan mengapa kamu (heran) ketika ditimpa musibah (kekalahan pada Perang Uhud), padahal kamu telah menimpakan musibah dua kali lipat (kepada musuh-musuhmu pada Perang Badar) kamu berkata, “Dari mana datangnya (kekalahan) ini?” Katakanlah, “Itu dari (kesalahan) dirimu sendiri.” Sungguh, Allah Mahakuasa atas segala sesuatu.","hasanah_per_verse":730},{"text_madani":"وَمَا أَصَابَكُمْ يَوْمَ الْتَقَى الْجَمْعَانِ فَبِإِذْنِ اللَّهِ وَلِيَعْلَمَ الْمُؤْمِنِينَ","text_tajweed":"وَم[o[َآ] أَصَ[n[ـٰ]بَكُمْ يَوْمَ [h:2353[ٱ][l[ل]ْتَقَى [h:2354[ٱ]لْجَمْعَانِ فَبِإِذْنِ [h:2398[ٱ]للَّهِ وَلِيَعْلَمَ [h:2399[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"And what befell you on the day when the two armies met (at Ohud) was with Allah's knowledge, and that He might know the believers.","translation_id":"Dan apa yang menimpa kamu ketika terjadi pertemuan (pertempuran) antara dua pasukan itu adalah dengan izin Allah, dan agar Allah menguji siapa orang (yang benar-benar) beriman.","hasanah_per_verse":470},{"text_madani":"وَلِيَعْلَمَ الَّذِينَ نَافَقُوا ۚ وَقِيلَ لَهُمْ تَعَالَوْا قَاتِلُوا فِي سَبِيلِ اللَّهِ أَوِ ادْفَعُوا ۖ قَالُوا لَوْ نَعْلَمُ قِتَالًا لَّاتَّبَعْنَاكُمْ ۗ هُمْ لِلْكُفْرِ يَوْمَئِذٍ أَقْرَبُ مِنْهُمْ لِلْإِيمَانِ ۚ يَقُولُونَ بِأَفْوَاهِهِم مَّا لَيْسَ فِي قُلُوبِهِمْ ۗ وَاللَّهُ أَعْلَمُ بِمَا يَكْتُمُونَ","text_tajweed":"وَلِيَعْلَمَ [h:2400[ٱ]لَّذِينَ نَافَقُو[s[اْ‌ۚ] وَقِيلَ لَهُمْ تَعَالَوْ[s[اْ] قَ[n[ـٰ]تِلُو[s[اْ] فِى سَبِيلِ [h:788[ٱ]للَّهِ أَوِ [h:2401[ٱ][q:2402[دْ]فَعُو[s[اْ‌ۖ] قَالُو[s[اْ] لَوْ نَعْلَمُ قِتَال[u:2403[اً ل]َّ[h:2404[ٱ]تَّبَعْنَ[n[ـٰ]كُمْ‌ۗ هُمْ لِلْكُفْرِ يَوْمَئِذٍ أَ[q:1355[قْ]رَبُ مِنْهُمْ لِلْإِيمَ[n[ـٰ]نِ‌ۚ يَقُولُونَ بِأَفْو[n[َٲ]هِه[w:2405[ِم م]َّا لَيْسَ فِى قُلُوبِهِمْ‌ۗ وَ[h:72[ٱ]للَّهُ أَعْلَمُ بِمَا يَكْتُم[p[ُو]نَ","translation_en":"And that He might know the hypocrites; and it was said to them: Come, fight in Allah's way, or defend yourselves. They said: If we knew fighting, we would certainly have followed you. They were on that day much nearer to unbelief than to belief. They say with their mouths what is not in their hearts, and Allah best knows what they conceal.","translation_id":"Dan untuk menguji orang-orang yang munafik, kepada mereka dikatakan, “Marilah berperang di jalan Allah atau pertahankanlah (dirimu).” Mereka berkata, “Sekiranya kami mengetahui (bagaimana cara) berperang, tentulah kami mengikuti kamu.” Mereka pada hari itu lebih dekat kepada kekafiran dari pada keimanan. Mereka mengatakan dengan mulutnya apa yang tidak sesuai dengan isi hatinya. Dan Allah lebih mengetahui apa yang mereka sembunyikan.","hasanah_per_verse":1510},{"text_madani":"الَّذِينَ قَالُوا لِإِخْوَانِهِمْ وَقَعَدُوا لَوْ أَطَاعُونَا مَا قُتِلُوا ۗ قُلْ فَادْرَءُوا عَنْ أَنفُسِكُمُ الْمَوْتَ إِن كُنتُمْ صَادِقِينَ","text_tajweed":"ٱلَّذِينَ قَالُو[s[اْ] لِإِخْو[n[َٲ]نِهِمْ وَقَعَدُو[s[اْ] لَوْ أَطَاعُونَا مَا قُتِلُو[s[اْ‌ۗ] قُلْ فَ[h:2406[ٱ][q:2406[دْ]رَءُو[s[اْ] عَنْ أَ[f:2407[نف]ُسِكُمُ [h:2408[ٱ]لْمَوْتَ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ صَ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"Those who said of their brethren whilst they (themselves) held back: Had they obeyed us, they would not have been killed. Say: Then avert death from yourselves if you speak the truth.","translation_id":"(Mereka itu adalah) orang-orang yang berkata kepada saudara-saudaranya dan mereka tidak turut pergi berperang, “Sekiranya mereka mengikuti kita, tentulah mereka tidak terbunuh.” Katakanlah, “Cegahlah kematian itu dari dirimu, jika kamu orang yang benar.”","hasanah_per_verse":740},{"text_madani":"وَلَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا ۚ بَلْ أَحْيَاءٌ عِندَ رَبِّهِمْ يُرْزَقُونَ","text_tajweed":"وَلَا تَحْسَبَ[g[نّ]َ [h:2409[ٱ]لَّذِينَ قُتِلُو[s[اْ] فِى سَبِيلِ [h:788[ٱ]للَّهِ أَمْو[n[َٲ]ت[i:2410[َۢا‌ۚ ب]َلْ أَحْي[o[َا]ٓءٌ عِ[f:264[ند]َ رَبِّهِمْ يُرْزَق[p[ُو]نَ","translation_en":"And reckon not those who are killed in Allah's way as dead; nay, they are alive (and) are provided sustenance from their Lord;","translation_id":"Dan jangan sekali-kali kamu mengira bahwa orang-orang yang gugur di jalan Allah itu mati; sebenarnya mereka itu hidup di sisi Tuhannya mendapat rezeki,","hasanah_per_verse":540},{"text_madani":"فَرِحِينَ بِمَا آتَاهُمُ اللَّهُ مِن فَضْلِهِ وَيَسْتَبْشِرُونَ بِالَّذِينَ لَمْ يَلْحَقُوا بِهِم مِّنْ خَلْفِهِمْ أَلَّا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ","text_tajweed":"فَرِحِينَ بِم[o[َآ] ءَاتَ[n[ـٰ]هُمُ [h:2411[ٱ]للَّهُ مِ[f:475[ن ف]َضْلِه[n[ِۦ] وَيَسْتَ[q:2412[بْ]شِرُونَ بِ[h:2413[ٱ]لَّذِينَ لَمْ يَلْحَقُو[s[اْ] بِه[w:2414[ِم م]ِّنْ خَلْفِهِمْ أَلَّا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَن[p[ُو]نَ","translation_en":"Rejoicing in what Allah has given them out of His grace and they rejoice for the sake of those who, (being left) behind them, have not yet joined them, that they shall have no fear, nor shall they grieve.","translation_id":"Mereka bergembira dengan karunia yang diberikan Allah kepadanya, dan bergirang hati terhadap orang yang masih tinggal di belakang yang belum menyusul mereka, bahwa tidak ada rasa takut pada mereka dan mereka tidak bersedih hati.","hasanah_per_verse":780},{"text_madani":"يَسْتَبْشِرُونَ بِنِعْمَةٍ مِّنَ اللَّهِ وَفَضْلٍ وَأَنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُؤْمِنِينَ","text_tajweed":"۞ يَسْتَ[q:2415[بْ]شِرُونَ بِنِعْمَ[a:2416[ةٍ م]ِّنَ [h:321[ٱ]للَّهِ وَفَضْ[a:2417[لٍ و]َأَ[g[نّ]َ [h:859[ٱ]للَّهَ لَا يُضِيعُ أَ[q:2418[جْ]رَ [h:2419[ٱ]لْمُؤْمِن[p[ِي]نَ","translation_en":"They rejoice on account of favor from Allah and (His) grace, and that Allah will not waste the reward of the believers.","translation_id":"Mereka bergirang hati dengan nikmat dan karunia dari Allah. Dan sungguh, Allah tidak menyia-nyiakan pahala orang-orang yang beriman,","hasanah_per_verse":470},{"text_madani":"الَّذِينَ اسْتَجَابُوا لِلَّهِ وَالرَّسُولِ مِن بَعْدِ مَا أَصَابَهُمُ الْقَرْحُ ۚ لِلَّذِينَ أَحْسَنُوا مِنْهُمْ وَاتَّقَوْا أَجْرٌ عَظِيمٌ","text_tajweed":"ٱلَّذِينَ [h:2420[ٱ]سْتَجَابُو[s[اْ] لِلَّهِ وَ[h:2421[ٱ][l[ل]رَّسُولِ م[i:146[ِنۢ ب]َعْدِ م[o[َآ] أَصَابَهُمُ [h:2422[ٱ]لْقَرْحُ‌ۚ لِلَّذِينَ أَحْسَنُو[s[اْ] مِنْهُمْ وَ[h:538[ٱ]تَّقَوْ[s[اْ] أَ[q:2423[جْ]رٌ عَظ[p[ِي]مٌ","translation_en":"(As for) those who responded (at Ohud) to the call of Allah and the Messenger after the wound had befallen them, those among them who do good (to others) and guard (against evil) shall have a great reward.","translation_id":"(yaitu) orang-orang yang menaati (perintah) Allah dan Rasul setelah mereka mendapat luka (dalam Perang Uhud). Orang-orang yang berbuat kebajikan dan bertakwa di antara mereka mendapat pahala yang besar.","hasanah_per_verse":690},{"text_madani":"الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا وَقَالُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ","text_tajweed":"ٱلَّذِينَ قَالَ لَهُمُ [h:2424[ٱ][l[ل][g[نّ]َاسُ إِ[g[نّ]َ [h:2425[ٱ][l[ل][g[نّ]َاسَ قَ[q:298[دْ] جَمَعُو[s[اْ] لَكُمْ فَ[h:2426[ٱ]خْشَوْهُمْ فَزَادَهُمْ إِيمَ[n[ـٰ][a:2427[نًا و]َقَالُو[s[اْ] حَسْبُنَا [h:2428[ٱ]للَّهُ وَنِعْمَ [h:2429[ٱ]لْوَك[p[ِي]لُ","translation_en":"Those to whom the people said: Surely men have gathered against you, therefore fear them, but this increased their faith, and they said: Allah is sufficient for us and most excellent is the Protector.","translation_id":"(Yaitu) orang-orang (yang menaati Allah dan Rasul) yang ketika ada orang-orang mengatakan kepadanya, “Orang-orang (Quraisy) telah mengumpulkan pasukan untuk menyerang kamu, karena itu takutlah kepada mereka,” ternyata (ucapan) itu menambah (kuat) iman mereka dan mereka menjawab, “Cukuplah Allah (menjadi penolong) bagi kami dan Dia sebaik-baik pelindung.”","hasanah_per_verse":770},{"text_madani":"فَانقَلَبُوا بِنِعْمَةٍ مِّنَ اللَّهِ وَفَضْلٍ لَّمْ يَمْسَسْهُمْ سُوءٌ وَاتَّبَعُوا رِضْوَانَ اللَّهِ ۗ وَاللَّهُ ذُو فَضْلٍ عَظِيمٍ","text_tajweed":"فَ[h:9999[ٱ][f:2430[نق]َلَبُو[s[اْ] بِنِعْمَ[a:2416[ةٍ م]ِّنَ [h:321[ٱ]للَّهِ وَفَضْ[u:2431[لٍ ل]َّمْ يَمْسَسْهُمْ س[o[ُو]ٓ[a:2432[ءٌ و]َ[h:2433[ٱ]تَّبَعُو[s[اْ] رِضْو[n[َٲ]نَ [h:2386[ٱ]للَّهِ‌ۗ وَ[h:72[ٱ]للَّهُ ذُو فَضْلٍ عَظ[p[ِي]مٍ","translation_en":"So they returned with favor from Allah and (His) grace, no evil touched them and they followed the pleasure of Allah; and Allah is the Lord of mighty grace.","translation_id":"Maka mereka kembali dengan nikmat dan karunia (yang besar) dari Allah, mereka tidak ditimpa suatu bencana dan mereka mengikuti keridhaan Allah. Allah mempunyai karunia yang besar.","hasanah_per_verse":640},{"text_madani":"إِنَّمَا ذَٰلِكُمُ الشَّيْطَانُ يُخَوِّفُ أَوْلِيَاءَهُ فَلَا تَخَافُوهُمْ وَخَافُونِ إِن كُنتُم مُّؤْمِنِينَ","text_tajweed":"إِ[g[نّ]َمَا ذ[n[َٲ]لِكُمُ [h:2434[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ يُخَوِّفُ أَوْلِي[o[َا]ٓءَهُ[n[ۥ] فَلَا تَخَافُوهُمْ وَخَافُونِ إِ[f:109[ن ك]ُ[f:100[نت][w:482[ُم م]ُّؤْمِن[p[ِي]نَ","translation_en":"It is only the Shaitan that causes you to fear from his friends, but do not fear them, and fear Me if you are believers.","translation_id":"Sesungguhnya mereka hanyalah setan yang menakut-nakuti (kamu) dengan teman-teman setianya, karena itu janganlah kamu takut kepada mereka, tetapi takutlah kepada-Ku, jika kamu orang-orang beriman.","hasanah_per_verse":540},{"text_madani":"وَلَا يَحْزُنكَ الَّذِينَ يُسَارِعُونَ فِي الْكُفْرِ ۚ إِنَّهُمْ لَن يَضُرُّوا اللَّهَ شَيْئًا ۗ يُرِيدُ اللَّهُ أَلَّا يَجْعَلَ لَهُمْ حَظًّا فِي الْآخِرَةِ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ","text_tajweed":"وَلَا يَحْزُ[f:2435[نك]َ [h:2436[ٱ]لَّذِينَ يُسَ[n[ـٰ]رِعُونَ فِى [h:2437[ٱ]لْكُفْرِ‌ۚ إِ[g[نّ]َهُمْ ل[a:2438[َن ي]َضُرُّو[s[اْ] [h:2439[ٱ]للَّهَ شَيْـ[a:2440[ـًٔا‌ۗ ي]ُرِيدُ [h:976[ٱ]للَّهُ أَلَّا يَ[q:2441[جْ]عَلَ لَهُمْ حَظ[f:2442[ًّا ف]ِى [h:536[ٱ]لْأَخِرَةِ‌ۖ وَلَهُمْ عَذَابٌ عَظ[p[ِي]مٌ","translation_en":"And let not those grieve you who fall into unbelief hastily; surely they can do no harm to Allah at all; Allah intends that He should not give them any portion in the hereafter, and they shall have a grievous chastisement.","translation_id":"Dan janganlah engkau (Muhammad) dirisaukan oleh orang-orang yang dengan mudah kembali menjadi kafir; sesungguhnya sedikit pun mereka tidak merugikan Allah. Allah tidak akan memberi bagian (pahala) kepada mereka di akhirat, dan mereka akan mendapat azab yang besar.","hasanah_per_verse":870},{"text_madani":"إِنَّ الَّذِينَ اشْتَرَوُا الْكُفْرَ بِالْإِيمَانِ لَن يَضُرُّوا اللَّهَ شَيْئًا وَلَهُمْ عَذَابٌ أَلِيمٌ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ [h:52[ٱ]شْتَرَوُ[s[اْ] [h:2443[ٱ]لْكُفْرَ بِ[h:562[ٱ]لْإِيمَ[n[ـٰ]نِ ل[a:2438[َن ي]َضُرُّو[s[اْ] [h:2439[ٱ]للَّهَ شَيْـ[a:2444[ـًٔا و]َلَهُمْ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"Surely those who have bought unbelief at the price of faith shall do no harm at all to Allah, and they shall have a painful chastisement.","translation_id":"Sesungguhnya orang-orang yang membeli kekafiran dengan iman, sedikit pun tidak merugikan Allah; dan mereka akan mendapat azab yang pedih.","hasanah_per_verse":530},{"text_madani":"وَلَا يَحْسَبَنَّ الَّذِينَ كَفَرُوا أَنَّمَا نُمْلِي لَهُمْ خَيْرٌ لِّأَنفُسِهِمْ ۚ إِنَّمَا نُمْلِي لَهُمْ لِيَزْدَادُوا إِثْمًا ۚ وَلَهُمْ عَذَابٌ مُّهِينٌ","text_tajweed":"وَلَا يَحْسَبَ[g[نّ]َ [h:2445[ٱ]لَّذِينَ كَفَر[o[ُوٓ][s[اْ] أَ[g[نّ]َمَا نُمْلِى لَهُمْ خَيْ[u:2446[رٌ ل]ِّأَ[f:2447[نف]ُسِهِمْ‌ۚ إِ[g[نّ]َمَا نُمْلِى لَهُمْ لِيَزْدَاد[o[ُوٓ][s[اْ] إِثْ[a:2448[مًا‌ۚ و]َلَهُمْ عَذَا[a:478[بٌ م]ُّه[p[ِي]نٌ","translation_en":"And let not those who disbelieve think that Our granting them respite is better for their souls; We grant them respite only that they may add to their sins; and they shall have a disgraceful chastisement.","translation_id":"Dan jangan sekali-kali orang-orang kafir itu mengira bahwa tenggang waktu yang Kami berikan kepada mereka lebih baik baginya. Sesungguhnya tenggang waktu yang Kami berikan kepada mereka hanyalah agar dosa mereka semakin bertambah; dan mereka akan mendapat azab yang menghinakan.","hasanah_per_verse":740},{"text_madani":"مَّا كَانَ اللَّهُ لِيَذَرَ الْمُؤْمِنِينَ عَلَىٰ مَا أَنتُمْ عَلَيْهِ حَتَّىٰ يَمِيزَ الْخَبِيثَ مِنَ الطَّيِّبِ ۗ وَمَا كَانَ اللَّهُ لِيُطْلِعَكُمْ عَلَى الْغَيْبِ وَلَٰكِنَّ اللَّهَ يَجْتَبِي مِن رُّسُلِهِ مَن يَشَاءُ ۖ فَآمِنُوا بِاللَّهِ وَرُسُلِهِ ۚ وَإِن تُؤْمِنُوا وَتَتَّقُوا فَلَكُمْ أَجْرٌ عَظِيمٌ","text_tajweed":"مَّا كَانَ [h:742[ٱ]للَّهُ لِيَذَرَ [h:2449[ٱ]لْمُؤْمِنِينَ عَلَىٰ م[o[َآ] أَ[f:428[نت]ُمْ عَلَيْهِ حَتَّىٰ يَمِيزَ [h:2450[ٱ]لْخَبِيثَ مِنَ [h:2451[ٱ][l[ل]طَّيِّبِ‌ۗ وَمَا كَانَ [h:742[ٱ]للَّهُ لِيُ[q:2452[طْ]لِعَكُمْ عَلَى [h:2453[ٱ]لْغَيْبِ وَلَ[n[ـٰ]كِ[g[نّ]َ [h:1441[ٱ]للَّهَ يَ[q:2454[جْ]تَبِى م[u:1711[ِن ر]ُّسُلِه[n[ِۦ] م[a:476[َن ي]َش[o[َا]ٓءُ‌ۖ فَـَٔـامِنُو[s[اْ] بِ[h:32[ٱ]للَّهِ وَرُسُلِه[n[ِۦ]‌ۚ وَإِ[f:2455[ن ت]ُؤْمِنُو[s[اْ] وَتَتَّقُو[s[اْ] فَلَكُمْ أَ[q:2423[جْ]رٌ عَظ[p[ِي]مٌ","translation_en":"On no account will Allah leave the believers in the condition which you are in until He separates the evil from the good; nor is Allah going to make you acquainted with the unseen, but Allah chooses of His messengers whom He pleases; therefore believe in Allah and His messengers; and if you believe and guard (against evil), then you shall have a great reward.","translation_id":"Allah tidak akan membiarkan orang-orang yang beriman sebagaimana dalam keadaan kamu sekarang ini, sehingga Dia membedakan yang buruk dari yang baik. Allah tidak akan memperlihatkan kepadamu hal-hal yang gaib, tetapi Allah memilih siapa yang Dia kehendaki di antara rasul-rasul-Nya. Karena itu, berimanlah kepada Allah dan rasul-rasul-Nya. Jika kamu beriman dan bertakwa, maka kamu akan mendapat pahala yang besar.","hasanah_per_verse":1460},{"text_madani":"وَلَا يَحْسَبَنَّ الَّذِينَ يَبْخَلُونَ بِمَا آتَاهُمُ اللَّهُ مِن فَضْلِهِ هُوَ خَيْرًا لَّهُم ۖ بَلْ هُوَ شَرٌّ لَّهُمْ ۖ سَيُطَوَّقُونَ مَا بَخِلُوا بِهِ يَوْمَ الْقِيَامَةِ ۗ وَلِلَّهِ مِيرَاثُ السَّمَاوَاتِ وَالْأَرْضِ ۗ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ","text_tajweed":"وَلَا يَحْسَبَ[g[نّ]َ [h:2445[ٱ]لَّذِينَ يَ[q:2456[بْ]خَلُونَ بِم[o[َآ] ءَاتَ[n[ـٰ]هُمُ [h:2411[ٱ]للَّهُ مِ[f:475[ن ف]َضْلِه[n[ِۦ] هُوَ خَيْ[u:2160[رًا ل]َّه[c:2457[ُم‌ۖ ب]َلْ هُوَ شَ[u:2458[رٌّ ل]َّهُمْ‌ۖ سَيُطَوَّقُونَ مَا بَخِلُو[s[اْ] بِه[n[ِۦ] يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ‌ۗ وَلِلَّهِ مِير[n[َٲ]ثُ [h:2459[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۗ وَ[h:72[ٱ]للَّهُ بِمَا تَعْمَلُونَ خَب[p[ِي]رٌ","translation_en":"And let not those deem, who are niggardly in giving away that which Allah has granted them out of His grace, that it is good for them; nay, it is worse for them; they shall have that whereof they were niggardly made to cleave to their necks on the resurrection day; and Allah's is the heritage of the heavens and the earth; and Allah is aware of what you do.","translation_id":"Dan jangan sekali-kali orang-orang yang kikir dengan apa yang diberikan Allah kepada mereka dari karunia-Nya mengira bahwa (kikir) itu baik bagi mereka, padahal (kikir) itu buruk bagi mereka. Apa (harta) yang mereka kikirkan itu akan dikalungkan (di lehernya) pada hari Kiamat. Milik Allah-lah warisan (apa yang ada) di langit dan di bumi. Allah Mahateliti apa yang kamu kerjakan.","hasanah_per_verse":1220},{"text_madani":"لَّقَدْ سَمِعَ اللَّهُ قَوْلَ الَّذِينَ قَالُوا إِنَّ اللَّهَ فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ ۘ سَنَكْتُبُ مَا قَالُوا وَقَتْلَهُمُ الْأَنبِيَاءَ بِغَيْرِ حَقٍّ وَنَقُولُ ذُوقُوا عَذَابَ الْحَرِيقِ","text_tajweed":"لَّقَ[q:2389[دْ] سَمِعَ [h:2460[ٱ]للَّهُ قَوْلَ [h:2461[ٱ]لَّذِينَ قَال[o[ُوٓ][s[اْ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ فَقِي[a:2462[رٌ و]َنَحْنُ أَغْنِي[o[َا]ٓءُ‌ۘ سَنَكْتُبُ مَا قَالُو[s[اْ] وَقَتْلَهُمُ [h:2463[ٱ]لْأَ[i:2175[نۢب]ِي[o[َا]ٓءَ بِغَيْرِ حَ[a:2464[قٍّ و]َنَقُولُ ذُوقُو[s[اْ] عَذَابَ [h:2465[ٱ]لْحَر[p[ِي][q[ق]ِ","translation_en":"Allah has certainly heard the saying of those who said: Surely Allah is poor and we are rich. I will record what they say, and their killing the prophets unjustly, and I will say: Taste the chastisement of burning.","translation_id":"Sungguh, Allah telah mendengar perkataan orang-orang (Yahudi) yang mengatakan, “Sesungguhnya Allah itu miskin dan kami kaya.” Kami akan mencatat perkataan mereka dan perbuatan mereka membunuh nabi-nabi tanpa hak (alasan yang benar), dan Kami akan mengatakan (kepada mereka), “Rasakanlah olehmu azab yang membakar!”","hasanah_per_verse":950},{"text_madani":"ذَٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيدِ","text_tajweed":"ذ[n[َٲ]لِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَ[g[نّ]َ [h:859[ٱ]للَّهَ لَيْسَ بِظَلَّا[u:2466[مٍ ل]ِّلْعَب[p[ِي][q[د]ِ","translation_en":"This is for what your own hands have sent before and because Allah is not in the least unjust to the servants.","translation_id":"Demikian itu disebabkan oleh perbuatan tanganmu sendiri, dan sesungguhnya Allah tidak menzhalimi hamba-hamba-Nya.","hasanah_per_verse":370},{"text_madani":"الَّذِينَ قَالُوا إِنَّ اللَّهَ عَهِدَ إِلَيْنَا أَلَّا نُؤْمِنَ لِرَسُولٍ حَتَّىٰ يَأْتِيَنَا بِقُرْبَانٍ تَأْكُلُهُ النَّارُ ۗ قُلْ قَدْ جَاءَكُمْ رُسُلٌ مِّن قَبْلِي بِالْبَيِّنَاتِ وَبِالَّذِي قُلْتُمْ فَلِمَ قَتَلْتُمُوهُمْ إِن كُنتُمْ صَادِقِينَ","text_tajweed":"ٱلَّذِينَ قَال[o[ُوٓ][s[اْ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَهِدَ إِلَيْن[o[َآ] أَلَّا نُؤْمِنَ لِرَسُولٍ حَتَّىٰ يَأْتِيَنَا بِقُرْبَا[f:2467[نٍ ت]َأْكُلُهُ [h:2468[ٱ][l[ل][g[نّ]َارُ‌ۗ قُلْ قَ[q:298[دْ] ج[o[َا]ٓءَكُمْ رُسُ[a:2469[لٌ م]ِّ[f:2470[ن ق]َ[q:2471[بْ]لِى بِ[h:484[ٱ]لْبَيِّنَ[n[ـٰ]تِ وَبِ[h:2472[ٱ]لَّذِى قُلْتُمْ فَلِمَ قَتَلْتُمُوهُمْ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ صَ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"(Those are they) who said: Surely Allah has enjoined us that we should not believe in any messenger until he brings us an offering which the fire consumes. Say: Indeed, there came to you messengers before me with clear arguments and with that which you demand; why then did you kill them if you are truthful?","translation_id":"(Yaitu) orang-orang (Yahudi) yang mengatakan, “Sesungguhnya Allah telah memerintahkan kepada kami, agar kami tidak beriman kepada seorang rasul, sebelum dia mendatangkan kepada kami kurban yang dimakan api.” Katakanlah (Muhammad), “Sungguh, beberapa orang rasul sebelumku telah datang kepadamu, (dengan) membawa bukti-bukti yang nyata dan membawa apa yang kamu sebutkan, tetapi mengapa kamu membunuhnya jika kamu orang-orang yang benar.”","hasanah_per_verse":1200},{"text_madani":"فَإِن كَذَّبُوكَ فَقَدْ كُذِّبَ رُسُلٌ مِّن قَبْلِكَ جَاءُوا بِالْبَيِّنَاتِ وَالزُّبُرِ وَالْكِتَابِ الْمُنِيرِ","text_tajweed":"فَإِ[f:2473[ن ك]َذَّبُوكَ فَقَ[q:563[دْ] كُذِّبَ رُسُ[a:2469[لٌ م]ِّ[f:18[ن ق]َ[q:19[بْ]لِكَ ج[o[َا]ٓءُو بِ[h:484[ٱ]لْبَيِّنَ[n[ـٰ]تِ وَ[h:2474[ٱ][l[ل]زُّبُرِ وَ[h:906[ٱ]لْكِتَ[n[ـٰ]بِ [h:2475[ٱ]لْمُن[p[ِي]رِ","translation_en":"But if they reject you, so indeed were rejected before you messengers who came with clear arguments and scriptures and the illuminating book.","translation_id":"Maka jika mereka mendustakan engkau (Muhammad), maka (ketahuilah) rasul-rasul sebelum engkau pun telah didustakan (pula), mereka membawa mukjizat-mukjizat yang nyata, Zubur dan Kitab yang memberi penjelasan yang sempurna.","hasanah_per_verse":550},{"text_madani":"كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ ۗ وَإِنَّمَا تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ الْقِيَامَةِ ۖ فَمَن زُحْزِحَ عَنِ النَّارِ وَأُدْخِلَ الْجَنَّةَ فَقَدْ فَازَ ۗ وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا مَتَاعُ الْغُرُورِ","text_tajweed":"كُلُّ نَفْ[f:2476[سٍ ذ][o[َا]ٓئِقَةُ [h:2477[ٱ]لْمَوْتِ‌ۗ وَإِ[g[نّ]َمَا تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ‌ۖ فَمَ[f:2478[ن ز]ُحْزِحَ عَنِ [h:2479[ٱ][l[ل][g[نّ]َارِ وَأُ[q:2480[دْ]خِلَ [h:2481[ٱ]لْجَ[g[نّ]َةَ فَقَ[q:563[دْ] فَازَ‌ۗ وَمَا [h:2482[ٱ]لْحَيَ[s[و][n[ٲ]ةُ [h:1156[ٱ][l[ل]دُّنْي[o[َآ] إِلَّا مَتَ[n[ـٰ]عُ [h:2483[ٱ]لْغُر[p[ُو]رِ","translation_en":"Every soul shall taste of death, and you shall only be paid fully your reward on the resurrection day; then whoever is removed far away from the fire and is made to enter the garden he indeed has attained the object; and the life of this world is nothing but a provision of vanities.","translation_id":"Setiap yang bernyawa akan merasakan mati. Dan hanya pada hari Kiamat sajalah diberikan dengan sempurna balasanmu. Barangsiapa dijauhkan dari neraka dan dimasukkan ke dalam surga, sungguh, dia memperoleh kemenangan. Kehidupan dunia hanyalah kesenangan yang memperdaya.","hasanah_per_verse":990},{"text_madani":"لَتُبْلَوُنَّ فِي أَمْوَالِكُمْ وَأَنفُسِكُمْ وَلَتَسْمَعُنَّ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ مِن قَبْلِكُمْ وَمِنَ الَّذِينَ أَشْرَكُوا أَذًى كَثِيرًا ۚ وَإِن تَصْبِرُوا وَتَتَّقُوا فَإِنَّ ذَٰلِكَ مِنْ عَزْمِ الْأُمُورِ","text_tajweed":"۞ لَتُ[q:2484[بْ]لَوُ[g[نّ]َ ف[o[ِىٓ] أَمْو[n[َٲ]لِكُمْ وَأَ[f:2485[نف]ُسِكُمْ وَلَتَسْمَعُ[g[نّ]َ مِنَ [h:523[ٱ]لَّذِينَ أُوتُو[s[اْ] [h:524[ٱ]لْكِتَ[n[ـٰ]بَ مِ[f:85[ن ق]َ[q:86[بْ]لِكُمْ وَمِنَ [h:501[ٱ]لَّذِينَ أَشْرَك[o[ُوٓ][s[اْ] أَ[f:2486[ذًى ك]َثِي[a:2487[رًا‌ۚ و]َإِ[f:2203[ن ت]َصْبِرُو[s[اْ] وَتَتَّقُو[s[اْ] فَإِ[g[نّ]َ ذ[n[َٲ]لِكَ مِنْ عَزْمِ [h:2488[ٱ]لْأُم[p[ُو]رِ","translation_en":"You shall certainly be tried respecting your wealth and your souls, and you shall certainly hear from those who have been given the Book before you and from those who are polytheists much annoying talk; and if you are patient and guard (against evil), surely this is one of the affairs (which should be) determined upon.","translation_id":"Kamu pasti akan diuji dengan hartamu dan dirimu. Dan pasti kamu akan mendengar banyak hal yang sangat menyakitkan hati dari orang-orang yang diberi Kitab sebelum kamu dan dari orang-orang musyrik. Jika kamu bersabar dan bertakwa, maka sesungguhnya yang demikian itu termasuk urusan yang (patut) diutamakan.","hasanah_per_verse":1080},{"text_madani":"وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ الَّذِينَ أُوتُوا الْكِتَابَ لَتُبَيِّنُنَّهُ لِلنَّاسِ وَلَا تَكْتُمُونَهُ فَنَبَذُوهُ وَرَاءَ ظُهُورِهِمْ وَاشْتَرَوْا بِهِ ثَمَنًا قَلِيلًا ۖ فَبِئْسَ مَا يَشْتَرُونَ","text_tajweed":"وَإِذْ أَخَذَ [h:2057[ٱ]للَّهُ مِيثَ[n[ـٰ]قَ [h:2489[ٱ]لَّذِينَ أُوتُو[s[اْ] [h:524[ٱ]لْكِتَ[n[ـٰ]بَ لَتُبَيِّنُ[g[نّ]َهُ[n[ۥ] لِل[g[نّ]َاسِ وَلَا تَكْتُمُونَهُ[n[ۥ] فَنَبَذُوهُ وَر[o[َا]ٓءَ ظُهُورِهِمْ وَ[h:2490[ٱ]شْتَرَوْ[s[اْ] بِه[n[ِۦ] ثَمَ[f:208[نًا ق]َلِيل[f:2491[اً‌ۖ ف]َبِئْسَ مَا يَشْتَر[p[ُو]نَ","translation_en":"And when Allah made a covenant with those who were given the Book: You shall certainly make it known to men and you shall not hide it; but they cast it behind their backs and took a small price for it; so evil is that which they buy.","translation_id":"Dan (ingatlah), ketika Allah mengambil janji dari orang-orang yang telah diberi Kitab (yaitu), “Hendaklah kamu benar-benar menerangkannya (isi Kitab itu) kepada manusia, dan janganlah kamu menyembunyikannya,” lalu mereka melemparkan (janji itu) ke belakang punggung mereka dan menjualnya dengan harga murah. Maka itu seburuk-buruk jual-beli yang mereka lakukan.","hasanah_per_verse":990},{"text_madani":"لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوا وَّيُحِبُّونَ أَن يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا فَلَا تَحْسَبَنَّهُم بِمَفَازَةٍ مِّنَ الْعَذَابِ ۖ وَلَهُمْ عَذَابٌ أَلِيمٌ","text_tajweed":"لَا تَحْسَبَ[g[نّ]َ [h:2409[ٱ]لَّذِينَ يَفْرَحُونَ بِم[o[َآ] أَتَو[s[اْ] وَّيُحِبُّونَ أ[a:2492[َن ي]ُحْمَدُو[s[اْ] بِمَا لَمْ يَفْعَلُو[s[اْ] فَلَا تَحْسَبَ[g[نّ]َه[c:2493[ُم ب]ِمَفَازَ[a:2494[ةٍ م]ِّنَ [h:503[ٱ]لْعَذَابِ‌ۖ وَلَهُمْ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"Do not think those who rejoice for what they have done and love that they should be praised for what they have not done-- so do by no means think them to be safe from the chastisement, and they shall have a painful chastisement.","translation_id":"Jangan sekali-kali kamu mengira bahwa orang yang gembira dengan apa yang telah mereka kerjakan dan mereka suka dipuji atas perbuatan yang tidak mereka lakukan, jangan sekali-kali kamu mengira bahwa mereka akan lolos dari azab. Mereka akan mendapat azab yang pedih.","hasanah_per_verse":860},{"text_madani":"وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","text_tajweed":"وَلِلَّهِ مُلْكُ [h:555[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۗ وَ[h:72[ٱ]للَّهُ عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َد[p[ِي]رٌ","translation_en":"And Allah's is the kingdom of the heavens and the earth, and Allah has power over all things.","translation_id":"Dan milik Allah-lah kerajaan langit dan bumi; dan Allah Mahakuasa atas segala sesuatu.","hasanah_per_verse":380},{"text_madani":"إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِّأُولِي الْأَلْبَابِ","text_tajweed":"إِ[g[نّ]َ فِى خَلْقِ [h:831[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ وَ[h:832[ٱ]خْتِلَ[n[ـٰ]فِ [h:833[ٱ]لَّيْلِ وَ[h:834[ٱ][l[ل][g[نّ]َهَارِ لَأَيَ[n[ـٰ][u:2495[تٍ ل]ِّأُ[s[وْ]لِى [h:2496[ٱ]لْأَلْبَ[p[ـٰ][q[ب]ِ","translation_en":"Most surely in the creation of the heavens and the earth and the alternation of the night and the day there are signs for men who understand.","translation_id":"Sesungguhnya dalam penciptaan langit dan bumi, dan pergantian malam dan siang terdapat tanda-tanda (kebesaran Allah) bagi orang yang berakal,","hasanah_per_verse":570},{"text_madani":"الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ","text_tajweed":"ٱلَّذِينَ يَذْكُرُونَ [h:2497[ٱ]للَّهَ قِيَ[n[ـٰ][a:2498[مًا و]َقُعُو[a:2499[دًا و]َعَلَىٰ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِى خَلْقِ [h:831[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ رَبَّنَا مَا خَلَ[q:2500[قْ]تَ هَ[n[ـٰ]ذَا بَ[n[ـٰ]طِل[f:2501[اً س]ُ[q:168[بْ]حَ[n[ـٰ]نَكَ فَقِنَا عَذَابَ [h:1110[ٱ][l[ل][g[نّ][p[َا]رِ","translation_en":"Those who remember Allah standing and sitting and lying on their sides and reflect on the creation of the heavens and the earth: Our Lord! Thou hast not created this in vain! Glory be to Thee; save us then from the chastisement of the fire:","translation_id":"(yaitu) orang-orang yang mengingat Allah sambil berdiri, duduk atau dalam keadaan berbaring, dan mereka memikirkan tentang penciptaan langit dan bumi (seraya berkata), “Ya Tuhan kami, tidaklah Engkau menciptakan semua ini sia-sia; Mahasuci Engkau, lindungilah kami dari azab neraka.","hasanah_per_verse":1000},{"text_madani":"رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ ۖ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ","text_tajweed":"رَبَّن[o[َآ] إِ[g[نّ]َكَ مَ[f:2502[ن ت]ُ[q:2503[دْ]خِلِ [h:2504[ٱ][l[ل][g[نّ]َارَ فَقَ[q:563[دْ] أَخْزَيْتَهُ[n[ۥ]‌ۖ وَمَا لِلظَّ[n[ـٰ]لِمِينَ مِنْ أَ[f:1600[نص][p[َا]رٍ","translation_en":"Our Lord! surely whomsoever Thou makest enter the fire, him Thou hast indeed brought to disgrace, and there shall be no helpers for the unjust:","translation_id":"Ya Tuhan kami, sesungguhnya orang yang Engkau masukkan ke dalam neraka, maka sungguh, Engkau telah menghinakannya, dan tidak ada seorang penolong pun bagi orang yang zhalim.","hasanah_per_verse":450},{"text_madani":"رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا ۚ رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ","text_tajweed":"رَّبَّن[o[َآ] إِ[g[نّ]َنَا سَمِعْنَا مُنَادِ[a:2505[يًا ي]ُنَادِى لِلْإِيمَ[n[ـٰ]نِ أَنْ ءَامِنُو[s[اْ] بِرَبِّكُمْ فَـَٔـامَ[g[نّ]َا‌ۚ رَبَّنَا فَ[h:1791[ٱ]غْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَ[g[نّ]َا سَيِّـَٔـاتِنَا وَتَوَفَّنَا مَعَ [h:2506[ٱ]لْأَ[q:2507[بْ]ر[p[َا]رِ","translation_en":"Our Lord! surely we have heard a preacher calling to the faith, saying: Believe in your Lord, so we did believe; Our Lord! forgive us therefore our faults, and cover our evil deeds and make us die with the righteous.","translation_id":"Ya Tuhan kami, sesungguhnya kami mendengar orang yang menyeru kepada iman, (yaitu), “Berimanlah kamu kepada Tuhanmu,” maka kami pun beriman. Ya Tuhan kami, ampunilah dosa-dosa kami dan hapuskanlah kesalahan-kesalahan kami, dan matikanlah kami beserta orang-orang yang berbakti.","hasanah_per_verse":950},{"text_madani":"رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ ۗ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ","text_tajweed":"رَبَّنَا وَءَاتِنَا مَا وَعَ[d:2508[د]تَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ‌ۗ إِ[g[نّ]َكَ لَا تُخْلِفُ [h:2509[ٱ]لْمِيع[p[َا][q[د]َ","translation_en":"Our Lord! and grant us what Thou hast promised us by Thy messengers; and disgrace us not on the day of resurrection; surely Thou dost not fail to perform the promise.","translation_id":"Ya Tuhan kami, berilah kami apa yang telah Engkau janjikan kepada kami melalui rasul-rasul-Mu. Dan janganlah Engkau hinakan kami pada hari Kiamat. Sungguh, Engkau tidak pernah mengingkari janji.”","hasanah_per_verse":580},{"text_madani":"فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لَا أُضِيعُ عَمَلَ عَامِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَىٰ ۖ بَعْضُكُم مِّن بَعْضٍ ۖ فَالَّذِينَ هَاجَرُوا وَأُخْرِجُوا مِن دِيَارِهِمْ وَأُوذُوا فِي سَبِيلِي وَقَاتَلُوا وَقُتِلُوا لَأُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ وَلَأُدْخِلَنَّهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ثَوَابًا مِّنْ عِندِ اللَّهِ ۗ وَاللَّهُ عِندَهُ حُسْنُ الثَّوَابِ","text_tajweed":"فَ[h:9999[ٱ]سْتَجَابَ لَهُمْ رَبُّهُمْ أَ[g[نّ]ِى ل[o[َآ] أُضِيعُ عَمَلَ عَ[n[ـٰ]مِ[a:2510[لٍ م]ِّ[f:344[نك][w:431[ُم م]ِّ[f:2511[ن ذ]َكَرٍ أَوْ أُ[f:1867[نث]َىٰ‌ۖ بَعْضُك[w:2512[ُم م]ّ[i:1862[ِنۢ ب]َعْ[f:2513[ضٍ‌ۖ ف]َ[h:2514[ٱ]لَّذِينَ هَاجَرُو[s[اْ] وَأُخْرِجُو[s[اْ] مِ[f:432[ن د]ِيَ[n[ـٰ]رِهِمْ وَأُوذُو[s[اْ] فِى سَبِيلِى وَقَ[n[ـٰ]تَلُو[s[اْ] وَقُتِلُو[s[اْ] لَأُكَفِّرَ[g[نّ]َ عَنْهُمْ سَيِّـَٔـاتِهِمْ وَلَأُ[q:2515[دْ]خِلَ[g[نّ]َهُمْ جَ[g[نّ]َ[n[ـٰ][f:119[تٍ ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ ثَوَا[a:2516[بًا م]ِّنْ عِ[f:398[ند]ِ [h:399[ٱ]للَّهِ‌ۗ وَ[h:72[ٱ]للَّهُ عِ[f:719[ند]َهُ[n[ۥ] حُسْنُ [h:2517[ٱ][l[ل]ثَّو[p[َا][q[ب]ِ","translation_en":"So their Lord accepted their prayer: That I will not waste the work of a worker among you, whether male or female, the one of you being from the other; they, therefore, who fled and were turned out of their homes and persecuted in My way and who fought and were slain, I will most certainly cover their evil deeds, and I will most certainly make them enter gardens beneath which rivers flow; a reward from Allah, and with Allah is yet better reward.","translation_id":"Maka Tuhan mereka memperkenankan permohonannya (dengan berfirman), “Sesungguhnya Aku tidak menyia-nyiakan amal orang yang beramal di antara kamu, baik laki-laki maupun perempuan, (karena) sebagian kamu adalah (keturunan) dari sebagian yang lain. Maka orang yang berhijrah, yang diusir dari kampung halamannya, yang disakiti pada jalan-Ku, yang berperang dan yang terbunuh, pasti akan Aku hapus kesalahan mereka dan pasti Aku masukkan mereka ke dalam surga-surga yang mengalir di bawahnya sungai-sungai, sebagai pahala dari Allah. Dan di sisi Allah ada pahala yang baik.”","hasanah_per_verse":1880},{"text_madani":"لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُوا فِي الْبِلَادِ","text_tajweed":"لَا يَغُرَّ[g[نّ]َكَ تَقَلُّبُ [h:2518[ٱ]لَّذِينَ كَفَرُو[s[اْ] فِى [h:2519[ٱ]لْبِلَ[p[ـٰ][q[د]ِ","translation_en":"Let it not deceive you that those who disbelieve go to and fro in the cities fearlessly.","translation_id":"Jangan sekali-kali kamu teperdaya oleh kegiatan orang-orang kafir (yang bergerak) di seluruh negeri.","hasanah_per_verse":290},{"text_madani":"مَتَاعٌ قَلِيلٌ ثُمَّ مَأْوَاهُمْ جَهَنَّمُ ۚ وَبِئْسَ الْمِهَادُ","text_tajweed":"مَتَ[n[ـٰ][f:2520[عٌ ق]َلِي[f:2521[لٌ ث]ُ[g[مّ]َ مَأْوَ[n[ٮٰ]هُمْ جَهَ[g[نّ]َمُ‌ۚ وَبِئْسَ [h:1757[ٱ]لْمِه[p[َا][q[د]ُ","translation_en":"A brief enjoyment! then their abode is hell, and evil is the resting-place.","translation_id":"Itu hanyalah kesenangan sementara, kemudian tempat kembali mereka ialah neraka Jahanam. (Jahanam) itu seburuk-buruk tempat tinggal.","hasanah_per_verse":300},{"text_madani":"لَٰكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا نُزُلًا مِّنْ عِندِ اللَّهِ ۗ وَمَا عِندَ اللَّهِ خَيْرٌ لِّلْأَبْرَارِ","text_tajweed":"لَ[n[ـٰ]كِنِ [h:2522[ٱ]لَّذِينَ [h:2523[ٱ]تَّقَوْ[s[اْ] رَبَّهُمْ لَهُمْ جَ[g[نّ]َ[n[ـٰ][f:1786[تٌ ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ خَ[n[ـٰ]لِدِينَ فِيهَا نُزُل[a:2524[اً م]ِّنْ عِ[f:398[ند]ِ [h:399[ٱ]للَّهِ‌ۗ وَمَا عِ[f:264[ند]َ [h:408[ٱ]للَّهِ خَيْ[u:2525[رٌ ل]ِّلْأَ[q:2526[بْ]ر[p[َا]رِ","translation_en":"But as to those who are careful of (their duty to) their Lord, they shall have gardens beneath which rivers flow, abiding in them; an entertainment from their Lord, and that which is with Allah is best for the righteous.","translation_id":"Tetapi orang-orang yang bertakwa kepada Tuhannya, mereka akan mendapat surga-surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya sebagai karunia dari Allah. Dan apa yang di sisi Allah lebih baik bagi orang-orang yang berbakti.","hasanah_per_verse":850},{"text_madani":"وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَن يُؤْمِنُ بِاللَّهِ وَمَا أُنزِلَ إِلَيْكُمْ وَمَا أُنزِلَ إِلَيْهِمْ خَاشِعِينَ لِلَّهِ لَا يَشْتَرُونَ بِآيَاتِ اللَّهِ ثَمَنًا قَلِيلًا ۗ أُولَٰئِكَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ ۗ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ","text_tajweed":"وَإِ[g[نّ]َ مِنْ أَهْلِ [h:545[ٱ]لْكِتَ[n[ـٰ]بِ لَم[a:2527[َن ي]ُؤْمِنُ بِ[h:32[ٱ]للَّهِ وَم[o[َآ] أُ[f:17[نز]ِلَ إِلَيْكُمْ وَم[o[َآ] أُ[f:17[نز]ِلَ إِلَيْهِمْ خَ[n[ـٰ]شِعِينَ لِلَّهِ لَا يَشْتَرُونَ بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ ثَمَ[f:208[نًا ق]َلِيلاً‌ۗ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ لَهُمْ أَ[q:331[جْ]رُهُمْ عِ[f:264[ند]َ رَبِّهِمْ‌ۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ سَرِيعُ [h:1112[ٱ]لْحِس[p[َا][q[ب]ِ","translation_en":"And most surely of the followers of the Book there are those who believe in Allah and (in) that which has been revealed to you and (in) that which has been revealed to them, being lowly before Allah; they do not take a small price for the communications of Allah; these it is that have their reward with their Lord; surely Allah is quick in reckoning.","translation_id":"Dan sesungguhnya di antara Ahli Kitab ada yang beriman kepada Allah, dan kepada apa yang diturunkan kepada kamu, dan yang diturunkan kepada mereka, karena mereka berendah hati kepada Allah, dan mereka tidak memperjualbelikan ayat-ayat Allah dengan harga murah. Mereka memperoleh pahala di sisi Tuhannya. Sungguh, Allah sangat cepat perhitungan-Nya.","hasanah_per_verse":1210},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] [h:2528[ٱ]صْبِرُو[s[اْ] وَصَابِرُو[s[اْ] وَرَابِطُو[s[اْ] وَ[h:1018[ٱ]تَّقُو[s[اْ] [h:1019[ٱ]للَّهَ لَعَلَّكُمْ تُفْلِح[p[ُو]نَ","translation_en":"O you who believe! be patient and excel in patience and remain steadfast, and be careful of (your duty to) Allah, that you may be successful.","translation_id":"Wahai orang-orang yang beriman! Bersabarlah kamu dan kuatkanlah kesabaranmu dan tetaplah bersiap-siaga (di perbatasan negerimu) dan bertakwalah kepada Allah agar kamu beruntung.","hasanah_per_verse":570}]}
