{"chapter_number":64,"name_simple":"At-Taghabun","name_meaning":{"text":"The Mutual Disillusion","en":"The Mutual Disillusion","id":"Hari Dinampakkan Kesalahan"},"verses_count":18,"hasanah":10910,"verses":[{"text_madani":"يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","text_tajweed":"يُسَبِّحُ لِلَّهِ مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَا فِى [h:44[ٱ]لْأَرْضِ‌ۖ لَهُ [h:1397[ٱ]لْمُلْكُ وَلَهُ [h:10443[ٱ]لْحَمْدُ‌ۖ وَهُوَ عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َد[p[ِي]رٌ","translation_en":"Whatever is in the heavens and whatever is in the earth declares the glory of Allah; to Him belongs the kingdom, and to Him is due (all) praise, and He has power over all things.","translation_id":"Apa yang ada di langit dan apa yang ada di bumi senantiasa bertasbih kepada Allah; milik-Nya semua kerajaan dan bagi-Nya (pula) segala puji; dan Dia Mahakuasa atas segala sesuatu.","hasanah_per_verse":590},{"text_madani":"هُوَ الَّذِي خَلَقَكُمْ فَمِنكُمْ كَافِرٌ وَمِنكُم مُّؤْمِنٌ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ","text_tajweed":"هُوَ [h:153[ٱ]لَّذِى خَلَقَكُمْ فَمِ[f:12615[نك]ُمْ كَافِ[a:13630[رٌ و]َمِ[f:2325[نك][w:13631[ُم م]ُّؤْمِ[a:13632[نٌ‌ۚ و]َ[h:72[ٱ]للَّهُ بِمَا تَعْمَلُونَ بَص[p[ِي]رٌ","translation_en":"He it is Who created you, but one of you is an unbeliever and another of you is a believer; and Allah sees what you do.","translation_id":"Dialah yang menciptakan kamu, lalu di antara kamu ada yang kafir dan di antara kamu (juga) ada yang mukmin. Dan Allah Maha Melihat apa yang kamu kerjakan.","hasanah_per_verse":470},{"text_madani":"خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ ۖ وَإِلَيْهِ الْمَصِيرُ","text_tajweed":"خَلَقَ [h:3913[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ بِ[h:370[ٱ]لْحَقِّ وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ‌ۖ وَإِلَيْهِ [h:3461[ٱ]لْمَص[p[ِي]رُ","translation_en":"He created the heavens and the earth with truth, and He formed you, then made goodly your forms, and to Him is the ultimate resort.","translation_id":"Dia menciptakan langit dan bumi dengan (tujuan) yang benar, Dia membentuk rupamu lalu memperbagus rupamu, dan kepada-Nya tempat kembali.","hasanah_per_verse":490},{"text_madani":"يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ ۚ وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","text_tajweed":"يَعْلَمُ مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ وَيَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ‌ۚ وَ[h:72[ٱ]للَّهُ عَلِي[i:2196[مُۢ ب]ِذَاتِ [h:2197[ٱ][l[ل]صُّد[p[ُو]رِ","translation_en":"He knows what is in the heavens and the earth, and He knows what you hide and what you manifest; and Allah is Cognizant of what is in the hearts.","translation_id":"Dia mengetahui apa yang di langit dan di bumi, dan mengetahui apa yang kamu rahasiakan dan apa yang kamu nyatakan. Dan Allah Maha Mengetahui segala isi hati.","hasanah_per_verse":620},{"text_madani":"أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ كَفَرُوا مِن قَبْلُ فَذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ","text_tajweed":"أَلَمْ يَأْتِكُمْ نَبَؤُ[s[اْ] [h:7058[ٱ]لَّذِينَ كَفَرُو[s[اْ] مِ[f:128[ن ق]َ[q:129[بْ]لُ فَذَاقُو[s[اْ] وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"Has there not come to you the story of those who disbelieved before, then tasted the evil result of their conduct, and they had a painful punishment?","translation_id":"Apakah belum sampai kepadamu (orang-orang kafir) berita orang-orang kafir dahulu? Maka mereka telah merasakan akibat buruk dari perbuatannya dan mereka memperoleh azab yang pedih.","hasanah_per_verse":530},{"text_madani":"ذَٰلِكَ بِأَنَّهُ كَانَت تَّأْتِيهِمْ رُسُلُهُم بِالْبَيِّنَاتِ فَقَالُوا أَبَشَرٌ يَهْدُونَنَا فَكَفَرُوا وَتَوَلَّوا ۚ وَّاسْتَغْنَى اللَّهُ ۚ وَاللَّهُ غَنِيٌّ حَمِيدٌ","text_tajweed":"ذ[n[َٲ]لِكَ بِأَ[g[نّ]َهُ[n[ۥ] كَانَت تَّأْتِيهِمْ رُسُلُه[c:4900[ُم ب]ِ[h:484[ٱ]لْبَيِّنَ[n[ـٰ]تِ فَقَال[o[ُوٓ][s[اْ] أَبَشَ[a:13633[رٌ ي]َهْدُونَنَا فَكَفَرُو[s[اْ] وَتَوَلَّو[s[اْ‌ۚ] وَّ[h:13634[ٱ]سْتَغْنَى [h:13635[ٱ]للَّهُ‌ۚ وَ[h:72[ٱ]للَّهُ غَنِىٌّ حَم[p[ِي][q[د]ٌ","translation_en":"That is because there came to them their messengers with clear arguments, but they said: Shall mortals guide us? So they disbelieved and turned back, and Allah does not stand in need (of anything), and Allah is Self-sufficient, Praised.","translation_id":"Yang demikian itu karena sesungguhnya ketika rasul-rasul datang kepada mereka (membawa) keterangan-ke-terangan lalu mereka berkata, “Apakah (pantas) manusia yang memberi petunjuk kepada kami?” Lalu mereka ingkar dan berpaling; padahal Allah tidak memerlukan (mereka). Dan Allah Mahakaya, Maha Terpuji.","hasanah_per_verse":820},{"text_madani":"زَعَمَ الَّذِينَ كَفَرُوا أَن لَّن يُبْعَثُوا ۚ قُلْ بَلَىٰ وَرَبِّي لَتُبْعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ ۚ وَذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ","text_tajweed":"زَعَمَ [h:13636[ٱ]لَّذِينَ كَفَر[o[ُوٓ][s[اْ] أ[u:8842[َن ل]ّ[a:13637[َن ي]ُ[q:13638[بْ]عَثُو[s[اْ‌ۚ] قُلْ بَلَىٰ وَرَبِّى لَتُ[q:13639[بْ]عَثُ[g[نّ]َ ثُ[g[مّ]َ لَتُنَبَّؤُ[g[نّ]َ بِمَا عَمِلْتُمْ‌ۚ وَذ[n[َٲ]لِكَ عَلَى [h:412[ٱ]للَّهِ يَس[p[ِي]رٌ","translation_en":"Those who disbelieve think that they shall never be raised. Say: Aye! by my Lord! you shall most certainly be raised, then you shall most certainly be informed of what you did; and that is easy to Allah.","translation_id":"Orang-orang yang kafir mengira, bahwa mereka tidak akan dibangkitkan. Katakanlah (Muhammad), “Tidak demikian, demi Tuhanku, kamu pasti dibangkitkan, kemudian diberitakan semua yang telah kamu kerjakan.” Dan yang demikian itu mudah bagi Allah.","hasanah_per_verse":690},{"text_madani":"فَآمِنُوا بِاللَّهِ وَرَسُولِهِ وَالنُّورِ الَّذِي أَنزَلْنَا ۚ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ","text_tajweed":"فَـَٔـامِنُو[s[اْ] بِ[h:32[ٱ]للَّهِ وَرَسُولِه[n[ِۦ] وَ[h:13640[ٱ][l[ل][g[نّ]ُورِ [h:13641[ٱ]لَّذ[o[ِىٓ] أَ[f:515[نز]َلْنَا‌ۚ وَ[h:72[ٱ]للَّهُ بِمَا تَعْمَلُونَ خَب[p[ِي]رٌ","translation_en":"Therefore believe in Allah and His Messenger and the Light which We have revealed; and Allah is Aware of what you do.","translation_id":"Maka berimanlah kamu kepada Allah dan Rasul-Nya dan kepada cahaya (Al-Qur'an) yang telah Kami turunkan. Dan Allah Mahateliti terhadap apa yang kamu kerjakan.","hasanah_per_verse":510},{"text_madani":"يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ۖ ذَٰلِكَ يَوْمُ التَّغَابُنِ ۗ وَمَن يُؤْمِن بِاللَّهِ وَيَعْمَلْ صَالِحًا يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُدْخِلْهُ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ","text_tajweed":"يَوْمَ يَ[q:12425[جْ]مَعُكُمْ لِيَوْمِ [h:13642[ٱ]لْجَمْعِ‌ۖ ذ[n[َٲ]لِكَ يَوْمُ [h:13643[ٱ][l[ل]تَّغَابُنِ‌ۗ وَم[a:13644[َن ي]ُؤْم[i:12652[ِنۢ ب]ِ[h:32[ٱ]للَّهِ وَيَعْمَلْ صَ[n[ـٰ]لِ[a:13645[حًا ي]ُكَفِّرْ عَنْهُ سَيِّـَٔـاتِه[n[ِۦ] وَيُ[q:13646[دْ]خِلْهُ جَ[g[نّ]َ[n[ـٰ][f:119[تٍ ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ خَ[n[ـٰ]لِدِينَ فِيه[o[َآ] أَبَ[f:5811[دًا‌ۚ ذ][n[َٲ]لِكَ [h:3911[ٱ]لْفَوْزُ [h:2633[ٱ]لْعَظ[p[ِي]مُ","translation_en":"On the day that He will gather you for the day of gathering, that is the day of loss and gain; and whoever believes in Allah and does good, He will remove from him his evil and cause him to enter gardens beneath which rivers flow, to abide therein forever; that is the great achievement.","translation_id":"(Ingatlah) pada hari (ketika) Allah mengumpulkan kamu pada hari berhimpun, itulah hari pengungkapan kesalahan-kesalahan. Dan barangsiapa beriman kepada Allah dan mengerjakan kebajikan niscaya Allah akan menghapus kesalahan-kesalahannya dan memasukkannya ke dalam surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya selama-lamanya. Itulah kemenangan yang agung.","hasanah_per_verse":1220},{"text_madani":"وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ النَّارِ خَالِدِينَ فِيهَا ۖ وَبِئْسَ الْمَصِيرُ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ كَفَرُو[s[اْ] وَكَذَّبُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِن[o[َآ] أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ أَصْحَ[n[ـٰ]بُ [h:201[ٱ][l[ل][g[نّ]َارِ خَ[n[ـٰ]لِدِينَ فِيهَا‌ۖ وَبِئْسَ [h:665[ٱ]لْمَص[p[ِي]رُ","translation_en":"And (as for) those who disbelieve and reject Our communications, they are the inmates of the fire, to abide therein and evil is the resort.","translation_id":"Dan orang-orang yang kafir dan men-dustakan ayat-ayat Kami, mereka itulah penghuni neraka, mereka kekal di dalamnya. Dan itulah seburuk-buruk tempat kembali.","hasanah_per_verse":590},{"text_madani":"مَا أَصَابَ مِن مُّصِيبَةٍ إِلَّا بِإِذْنِ اللَّهِ ۗ وَمَن يُؤْمِن بِاللَّهِ يَهْدِ قَلْبَهُ ۚ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ","text_tajweed":"م[o[َآ] أَصَابَ م[a:12140[ِن م]ُّصِيبَةٍ إِلَّا بِإِذْنِ [h:509[ٱ]للَّهِ‌ۗ وَم[a:13644[َن ي]ُؤْم[i:12652[ِنۢ ب]ِ[h:32[ٱ]للَّهِ يَهْدِ قَلْبَهُ[n[ۥ]‌ۚ وَ[h:72[ٱ]للَّهُ بِكُلِّ شَىْءٍ عَل[p[ِي]مٌ","translation_en":"No affliction comes about but by Allah's permission; and whoever believes in Allah, He guides aright his heart; and Allah is Cognizant of all things.","translation_id":"Tidak ada sesuatu musibah yang menimpa (seseorang), kecuali dengan izin Allah; dan barangsiapa beriman kepada Allah, niscaya Allah akan memberi petunjuk kepada hatinya. Dan Allah Maha Mengetahui segala sesuatu.","hasanah_per_verse":580},{"text_madani":"وَأَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ ۚ فَإِن تَوَلَّيْتُمْ فَإِنَّمَا عَلَىٰ رَسُولِنَا الْبَلَاغُ الْمُبِينُ","text_tajweed":"وَأَطِيعُو[s[اْ] [h:2238[ٱ]للَّهَ وَأَطِيعُو[s[اْ] [h:2865[ٱ][l[ل]رَّسُولَ‌ۚ فَإِ[f:3779[ن ت]َوَلَّيْتُمْ فَإِ[g[نّ]َمَا عَلَىٰ رَسُولِنَا [h:3780[ٱ]لْبَلَ[n[ـٰ]غُ [h:3781[ٱ]لْمُب[p[ِي]نُ","translation_en":"And obey Allah and obey the Messenger, but if you turn back, then upon Our Messenger devolves only the clear delivery (of the message).","translation_id":"Dan taatlah kepada Allah dan taatlah kepada Rasul. Jika kamu berpaling maka sesungguhnya kewajiban Rasul Kami hanyalah menyampaikan (amanah Allah) dengan terang.","hasanah_per_verse":590},{"text_madani":"اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ","text_tajweed":"ٱللَّهُ ل[o[َآ] إِلَ[n[ـٰ]هَ إِلَّا هُوَ‌ۚ وَعَلَى [h:2207[ٱ]للَّهِ فَلْيَتَوَكَّلِ [h:2208[ٱ]لْمُؤْمِن[p[ُو]نَ","translation_en":"Allah, there is no god but He; and upon Allah, then, let the believers rely.","translation_id":"(Dialah) Allah, tidak ada tuhan selain Dia. Dan hendaklah orang-orang mukmin bertawakal kepada Allah.","hasanah_per_verse":370},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلَادِكُمْ عَدُوًّا لَّكُمْ فَاحْذَرُوهُمْ ۚ وَإِن تَعْفُوا وَتَصْفَحُوا وَتَغْفِرُوا فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِ[g[نّ]َ مِنْ أَزْو[n[َٲ]جِكُمْ وَأَوْلَ[n[ـٰ]دِكُمْ عَدُو[u:13647[ًّا ل]َّكُمْ فَ[h:13648[ٱ]حْذَرُوهُمْ‌ۚ وَإِ[f:13649[ن ت]َعْفُو[s[اْ] وَتَصْفَحُو[s[اْ] وَتَغْفِرُو[s[اْ] فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ غَفُو[u:890[رٌ ر]َّح[p[ِي]مٌ","translation_en":"O you who believe! surely from among your wives and your children there is an enemy to you; therefore beware of them; and if you pardon and forbear and forgive, then surely Allah is Forgiving, Merciful.","translation_id":"Wahai orang-orang yang beriman! Sesungguhnya di antara istri-istrimu dan anak-anakmu ada yang menjadi musuh bagimu, maka berhati-hatilah kamu terhadap mereka; dan jika kamu maafkan dan kamu santuni serta ampuni (mereka), maka sungguh, Allah Maha Pengampun, Maha Penyayang.","hasanah_per_verse":870},{"text_madani":"إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ ۚ وَاللَّهُ عِندَهُ أَجْرٌ عَظِيمٌ","text_tajweed":"إِ[g[نّ]َم[o[َآ] أَمْو[n[َٲ]لُكُمْ وَأَوْلَ[n[ـٰ]دُكُمْ فِتْنَ[a:13650[ةٌ‌ۚ و]َ[h:72[ٱ]للَّهُ عِ[f:719[ند]َهُ[o[ۥٓ] أَ[q:2423[جْ]رٌ عَظ[p[ِي]مٌ","translation_en":"Your possessions and your children are only a trial, and Allah it is with Whom is a great reward.","translation_id":"Sesungguhnya hartamu dan anak-anakmu hanyalah cobaan (bagimu), dan di sisi Allah pahala yang besar.","hasanah_per_verse":390},{"text_madani":"فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ وَاسْمَعُوا وَأَطِيعُوا وَأَنفِقُوا خَيْرًا لِّأَنفُسِكُمْ ۗ وَمَن يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ","text_tajweed":"فَ[h:9999[ٱ]تَّقُو[s[اْ] [h:1945[ٱ]للَّهَ مَا [h:5393[ٱ]سْتَطَعْتُمْ وَ[h:486[ٱ]سْمَعُو[s[اْ] وَأَطِيعُو[s[اْ] وَأَ[f:1045[نف]ِقُو[s[اْ] خَيْ[u:13651[رًا ل]ِّأَ[f:13652[نف]ُسِكُمْ‌ۗ وَم[a:13470[َن ي]ُوقَ شُحَّ نَفْسِه[n[ِۦ] فَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:23[ٱ]لْمُفْلِح[p[ُو]نَ","translation_en":"Therefore be careful of (your duty to) Allah as much as you can, and hear and obey and spend, it is better for your souls; and whoever is saved from the greediness of his soul, these it is that are the successful.","translation_id":"Maka bertakwalah kamu kepada Allah menurut kesanggupanmu dan dengarlah serta taatlah; dan infakkanlah harta yang baik untuk dirimu. Dan barang-siapa dijaga dirinya dari kekikiran, mereka itulah orang-orang yang beruntung.","hasanah_per_verse":790},{"text_madani":"إِن تُقْرِضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعِفْهُ لَكُمْ وَيَغْفِرْ لَكُمْ ۚ وَاللَّهُ شَكُورٌ حَلِيمٌ","text_tajweed":"إِ[f:13653[ن ت]ُ[q:13654[قْ]رِضُو[s[اْ] [h:13655[ٱ]للَّهَ قَرْضًا حَسَ[a:13656[نًا ي]ُضَ[n[ـٰ]عِفْهُ لَكُمْ وَيَغْفِرْ لَكُمْ‌ۚ وَ[h:72[ٱ]للَّهُ شَكُورٌ حَل[p[ِي]مٌ","translation_en":"If you set apart for Allah a goodly portion, He will double it for you and forgive you; and Allah is the Multiplier (of rewards), Forbearing,","translation_id":"Jika kamu meminjamkan kepada Allah dengan pinjaman yang baik, niscaya Dia melipatgandakan (balasan) untukmu dan mengampuni kamu. Dan Allah Maha Mensyukuri, Maha Penyantun.","hasanah_per_verse":500},{"text_madani":"عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيزُ الْحَكِيمُ","text_tajweed":"عَ[n[ـٰ]لِمُ [h:4186[ٱ]لْغَيْبِ وَ[h:4187[ٱ][l[ل]شَّهَ[n[ـٰ]دَةِ [h:10627[ٱ]لْعَزِيزُ [h:681[ٱ]لْحَك[p[ِي]مُ","translation_en":"The Knower of the unseen and the seen, the Mighty, the Wise.","translation_id":"Yang Mengetahui yang gaib dan yang nyata. Yang Mahaperkasa, Mahabijaksana.","hasanah_per_verse":290}]}
