{"chapter_number":38,"name_simple":"Sad","name_meaning":{"text":"The Letter \"Saad\"","en":"The Letter \"Saad\"","id":"Shad"},"verses_count":88,"hasanah":30650,"verses":[{"text_madani":"ص ۚ وَالْقُرْآنِ ذِي الذِّكْرِ","text_tajweed":"[m[صٓ]‌ۚ وَ[h:5855[ٱ]لْقُرْءَانِ ذِى [h:11465[ٱ][l[ل]ذِّكْرِ","translation_en":"Suad, I swear by the Quran, full of admonition.","translation_id":"Sad, demi Al-Qur'an yang mengandung peringatan.","hasanah_per_verse":150},{"text_madani":"بَلِ الَّذِينَ كَفَرُوا فِي عِزَّةٍ وَشِقَاقٍ","text_tajweed":"بَلِ [h:10932[ٱ]لَّذِينَ كَفَرُو[s[اْ] فِى عِزَّ[a:11466[ةٍ و]َشِق[p[َا][q[ق]ٍ","translation_en":"Nay! those who disbelieve are in self-exaltation and opposition.","translation_id":"Tetapi orang-orang yang kafir (berada) dalam kesombongan dan permusuhan.","hasanah_per_verse":220},{"text_madani":"كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّن قَرْنٍ فَنَادَوا وَّلَاتَ حِينَ مَنَاصٍ","text_tajweed":"كَمْ أَهْلَكْنَا مِ[f:617[ن ق]َ[q:618[بْ]لِه[w:3926[ِم م]ِّ[f:3927[ن ق]َرْ[f:11467[نٍ ف]َنَادَو[s[اْ] وَّلَاتَ حِينَ مَن[p[َا]صٍ","translation_en":"How many did We destroy before them of the generations, then they cried while the time of escaping had passed away.","translation_id":"Betapa banyak umat sebelum mereka yang telah Kami binasakan, lalu mereka meminta tolong padahal (waktu itu) bukanlah saat untuk lari melepaskan diri.","hasanah_per_verse":370},{"text_madani":"وَعَجِبُوا أَن جَاءَهُم مُّنذِرٌ مِّنْهُمْ ۖ وَقَالَ الْكَافِرُونَ هَٰذَا سَاحِرٌ كَذَّابٌ","text_tajweed":"وَعَجِب[o[ُوٓ][s[اْ] أَ[f:11468[ن ج][o[َا]ٓءَه[w:11469[ُم م]ُّ[f:6895[نذ]ِ[a:11470[رٌ م]ِّنْهُمْ‌ۖ وَقَالَ [h:11471[ٱ]لْكَ[n[ـٰ]فِرُونَ هَ[n[ـٰ]ذَا سَ[n[ـٰ]حِ[f:11472[رٌ ك]َذّ[p[َا][q[ب]ٌ","translation_en":"And they wonder that there has come to them a warner from among themselves, and the disbelievers say: This is an enchanter, a liar.","translation_id":"Dan mereka heran karena mereka kedatangan seorang pemberi peringatan (rasul) dari kalangan mereka; dan orang-orang kafir berkata, “Orang ini adalah pesihir yang banyak berdusta.”","hasanah_per_verse":440},{"text_madani":"أَجَعَلَ الْآلِهَةَ إِلَٰهًا وَاحِدًا ۖ إِنَّ هَٰذَا لَشَيْءٌ عُجَابٌ","text_tajweed":"أَجَعَلَ [h:11473[ٱ]لْأَلِهَةَ إِلَ[n[ـٰ][a:693[هًا و][n[َٲ]حِدًا‌ۖ إِ[g[نّ]َ هَ[n[ـٰ]ذَا لَشَىْءٌ عُج[p[َا][q[ب]ٌ","translation_en":"What! makes he the gods a single Allah? A strange thing is this, to be sure!","translation_id":"Apakah dia menjadikan tuhan-tuhan itu Tuhan yang satu saja? Sungguh, ini benar-benar sesuatu yang sangat mengherankan.","hasanah_per_verse":320},{"text_madani":"وَانطَلَقَ الْمَلَأُ مِنْهُمْ أَنِ امْشُوا وَاصْبِرُوا عَلَىٰ آلِهَتِكُمْ ۖ إِنَّ هَٰذَا لَشَيْءٌ يُرَادُ","text_tajweed":"وَ[h:9999[ٱ][f:11474[نط]َلَقَ [h:11475[ٱ]لْمَلَأُ مِنْهُمْ أَنِ [h:11476[ٱ]مْشُو[s[اْ] وَ[h:11477[ٱ]صْبِرُو[s[اْ] عَلَ[o[ىٰٓ] ءَالِهَتِكُمْ‌ۖ إِ[g[نّ]َ هَ[n[ـٰ]ذَا لَش[a:11478[َىْءٌ ي]ُر[p[َا][q[د]ُ","translation_en":"And the chief persons of them break forth, saying: Go and steadily adhere to your gods; this is most surely a thing sought after.","translation_id":"Lalu pergilah pemimpin-pemimpin mereka (seraya berkata), “Pergilah kamu dan tetaplah (menyembah) tuhan-tuhanmu, sesungguhnya ini benar-benar suatu hal yang dikehendaki.","hasanah_per_verse":510},{"text_madani":"مَا سَمِعْنَا بِهَٰذَا فِي الْمِلَّةِ الْآخِرَةِ إِنْ هَٰذَا إِلَّا اخْتِلَاقٌ","text_tajweed":"مَا سَمِعْنَا بِهَ[n[ـٰ]ذَا فِى [h:11479[ٱ]لْمِلَّةِ [h:11480[ٱ]لْأَخِرَةِ إِنْ هَ[n[ـٰ]ذ[o[َآ] إِلَّا [h:11481[ٱ]خْتِلَ[p[ـٰ][q[ق]ٌ","translation_en":"We never heard of this in the former faith; this is nothing but a forgery:","translation_id":"Kami tidak pernah mendengar hal ini dalam agama yang terakhir; ini (mengesakan Allah), tidak lain hanyalah (dusta) yang diada-adakan,","hasanah_per_verse":380},{"text_madani":"أَأُنزِلَ عَلَيْهِ الذِّكْرُ مِن بَيْنِنَا ۚ بَلْ هُمْ فِي شَكٍّ مِّن ذِكْرِي ۖ بَل لَّمَّا يَذُوقُوا عَذَابِ","text_tajweed":"أَءُ[f:11482[نز]ِلَ عَلَيْهِ [h:7197[ٱ][l[ل]ذِّكْرُ م[i:4086[ِنۢ ب]َيْنِنَا‌ۚ بَلْ هُمْ فِى شَ[a:6215[كٍّ م]ِّ[f:11483[ن ذ]ِكْرِى‌ۖ بَل لَّ[g[مّ]َا يَذُوقُو[s[اْ] عَذ[p[َا][q[ب]ِ","translation_en":"Has the reminder been revealed to him from among us? Nay! they are in doubt as to My reminder. Nay! they have not yet tasted My chastisement!","translation_id":"mengapa Al-Qur'an itu diturunkan kepada dia di antara kita?” Sebenarnya mereka ragu-ragu terhadap Al-Qur'an-Ku, tetapi mereka belum merasakan azab(-Ku).","hasanah_per_verse":500},{"text_madani":"أَمْ عِندَهُمْ خَزَائِنُ رَحْمَةِ رَبِّكَ الْعَزِيزِ الْوَهَّابِ","text_tajweed":"أَمْ عِ[f:5060[ند]َهُمْ خَز[o[َا]ٓئِنُ رَحْمَةِ رَبِّكَ [h:11484[ٱ]لْعَزِيزِ [h:11485[ٱ]لْوَهّ[p[َا][q[ب]ِ","translation_en":"Or is it that they have the treasures of the mercy of your Lord, the Mighty, the great Giver?","translation_id":"Atau apakah mereka itu mempunyai perbendaharaan rahmat Tuhanmu Yang Mahaperkasa, Maha Pemberi?","hasanah_per_verse":310},{"text_madani":"أَمْ لَهُم مُّلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا ۖ فَلْيَرْتَقُوا فِي الْأَسْبَابِ","text_tajweed":"أَمْ لَه[w:11486[ُم م]ُّلْكُ [h:555[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ وَمَا بَيْنَهُمَا‌ۖ فَلْيَرْتَقُو[s[اْ] فِى [h:11487[ٱ]لْأَسْبَ[p[ـٰ][q[ب]ِ","translation_en":"Or is it that theirs is the kingdom of the heavens and the earth and what is between them? Then let them ascend by any","translation_id":"Atau apakah mereka mempunyai kerajaan langit dan bumi dan apa yang ada di antara keduanya? (Jika ada), maka biarlah mereka menaiki tangga-tangga (ke langit).","hasanah_per_verse":480},{"text_madani":"جُندٌ مَّا هُنَالِكَ مَهْزُومٌ مِّنَ الْأَحْزَابِ","text_tajweed":"جُن[a:11488[دٌ م]َّا هُنَالِكَ مَهْزُو[a:11489[مٌ م]ِّنَ [h:6277[ٱ]لْأَحْز[p[َا][q[ب]ِ","translation_en":"A host of deserters of the allies shall be here put to flight.","translation_id":"(Mereka itu) kelompok besar bala tentara yang berada di sana yang akan dikalahkan.","hasanah_per_verse":240},{"text_madani":"كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ وَفِرْعَوْنُ ذُو الْأَوْتَادِ","text_tajweed":"كَذَّبَتْ قَ[q:8394[بْ]لَهُمْ قَوْمُ نُو[a:9048[حٍ و]َعَا[a:11490[دٌ و]َفِرْعَوْنُ ذُو [h:11491[ٱ]لْأَوْت[p[َا][q[د]ِ","translation_en":"The people of Nuh and Ad, and Firon, the lord of spikes, rejected (messengers) before them.","translation_id":"Sebelum mereka itu, kaum Nuh, ‘Ad dan Fir’aun yang mempunyai bala tentara yang banyak, juga telah mendustakan (rasul-rasul),","hasanah_per_verse":340},{"text_madani":"وَثَمُودُ وَقَوْمُ لُوطٍ وَأَصْحَابُ الْأَيْكَةِ ۚ أُولَٰئِكَ الْأَحْزَابُ","text_tajweed":"وَثَمُودُ وَقَوْمُ لُو[a:11492[طٍ و]َأَصْحَ[n[ـٰ]بُ لْــَٔيْكَةِ‌ۚ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ [h:11493[ٱ]لْأَحْز[p[َا][q[ب]ُ","translation_en":"And Samood and the people of Lut and the dwellers of the thicket; these were the parties.","translation_id":"dan (begitu juga) Tsamud, kaum Luth dan penduduk Aikah. Mereka itulah golongan-golongan yang bersekutu (menentang rasul-rasul).","hasanah_per_verse":360},{"text_madani":"إِن كُلٌّ إِلَّا كَذَّبَ الرُّسُلَ فَحَقَّ عِقَابِ","text_tajweed":"إِ[f:11494[ن ك]ُلٌّ إِلَّا كَذَّبَ [h:11495[ٱ][l[ل]رُّسُلَ فَحَقَّ عِق[p[َا][q[ب]ِ","translation_en":"There was none of them but called the messengers liars, so just was My retribution.","translation_id":"Semua mereka itu mendustakan rasul-rasul, maka pantas mereka merasakan azab-Ku.","hasanah_per_verse":220},{"text_madani":"وَمَا يَنظُرُ هَٰؤُلَاءِ إِلَّا صَيْحَةً وَاحِدَةً مَّا لَهَا مِن فَوَاقٍ","text_tajweed":"وَمَا يَ[f:2039[نظ]ُرُ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ إِلَّا صَيْحَ[a:11222[ةً و][n[َٲ]حِدَ[a:11496[ةً م]َّا لَهَا مِ[f:11497[ن ف]َو[p[َا][q[ق]ٍ","translation_en":"Nor do these await aught but a single cry, there being no delay in it.","translation_id":"Dan sebenarnya yang mereka tunggu adalah satu teriakan saja, yang tidak ada selanya.","hasanah_per_verse":350},{"text_madani":"وَقَالُوا رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبْلَ يَوْمِ الْحِسَابِ","text_tajweed":"وَقَالُو[s[اْ] رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَ[q:3282[بْ]لَ يَوْمِ [h:11498[ٱ]لْحِس[p[َا][q[ب]ِ","translation_en":"And they say: O our Lord! hasten on to us our portion before the day of reckoning.","translation_id":"Dan mereka berkata, “Ya Tuhan kami, segerakanlah azab yang diperuntukkan bagi kami sebelum hari perhitungan.”","hasanah_per_verse":320},{"text_madani":"اصْبِرْ عَلَىٰ مَا يَقُولُونَ وَاذْكُرْ عَبْدَنَا دَاوُودَ ذَا الْأَيْدِ ۖ إِنَّهُ أَوَّابٌ","text_tajweed":"ٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَ[h:1898[ٱ]ذْكُرْ عَ[q:11499[بْ]دَنَا دَاوُ[n[ۥ]دَ ذَا [h:11500[ٱ]لْأَيْدِ‌ۖ إِ[g[نّ]َهُ[o[ۥٓ] أَوّ[p[َا][q[ب]ٌ","translation_en":"Bear patiently what they say, and remember Our servant Dawood, the possessor of power; surely he was frequent in returning (to Allah).","translation_id":"Bersabarlah atas apa yang mereka katakan; dan ingatlah akan hamba Kami Dawud yang mempunyai kekuatan; sungguh dia sangat taat (kepada Allah).","hasanah_per_verse":440},{"text_madani":"إِنَّا سَخَّرْنَا الْجِبَالَ مَعَهُ يُسَبِّحْنَ بِالْعَشِيِّ وَالْإِشْرَاقِ","text_tajweed":"إِ[g[نّ]َا سَخَّرْنَا [h:11501[ٱ]لْجِبَالَ مَعَهُ[n[ۥ] يُسَبِّحْنَ بِ[h:1900[ٱ]لْعَشِىِّ وَ[h:11502[ٱ]لْإِشْر[p[َا][q[ق]ِ","translation_en":"Surely We made the mountains to sing the glory (of Allah) in unison with him at the evening and the sunrise,","translation_id":"Sungguh, Kamilah yang menundukkan gunung-gunung untuk bertasbih bersama dia (Dawud) pada waktu petang dan pagi,","hasanah_per_verse":360},{"text_madani":"وَالطَّيْرَ مَحْشُورَةً ۖ كُلٌّ لَّهُ أَوَّابٌ","text_tajweed":"وَ[h:9999[ٱ][l[ل]طَّيْرَ مَحْشُورَ[f:11503[ةً‌ۖ ك]ُ[u:610[لٌّ ل]َّهُ[o[ۥٓ] أَوّ[p[َا][q[ب]ٌ","translation_en":"And the birds gathered together; all joined in singing with him.","translation_id":"dan (Kami tundukkan pula) burung-burung dalam keadaan terkumpul. Masing-masing sangat taat (kepada Allah).","hasanah_per_verse":200},{"text_madani":"وَشَدَدْنَا مُلْكَهُ وَآتَيْنَاهُ الْحِكْمَةَ وَفَصْلَ الْخِطَابِ","text_tajweed":"وَشَدَ[q:11504[دْ]نَا مُلْكَهُ[n[ۥ] وَءَاتَيْنَ[n[ـٰ]هُ [h:11505[ٱ]لْحِكْمَةَ وَفَصْلَ [h:11506[ٱ]لْخِط[p[َا][q[ب]ِ","translation_en":"And We strengthened his kingdom and We gave him wisdom and a clear judgment.","translation_id":"Dan Kami kuatkan kerajaannya dan Kami berikan hikmah kepadanya serta kebijaksanaan dalam memutuskan perkara.","hasanah_per_verse":330},{"text_madani":"وَهَلْ أَتَاكَ نَبَأُ الْخَصْمِ إِذْ تَسَوَّرُوا الْمِحْرَابَ","text_tajweed":"۞ وَهَلْ أَتَ[n[ـٰ]كَ نَبَؤُ[s[اْ] [h:11507[ٱ]لْخَصْمِ إِذْ تَسَوَّرُو[s[اْ] [h:11508[ٱ]لْمِحْر[p[َا][q[ب]َ","translation_en":"And has there come to you the story of the litigants, when they made an entry into the private chamber by ascending over the walls?","translation_id":"Dan apakah telah sampai kepadamu berita orang-orang yang berselisih ketika mereka memanjat dinding mihrab?","hasanah_per_verse":300},{"text_madani":"إِذْ دَخَلُوا عَلَىٰ دَاوُودَ فَفَزِعَ مِنْهُمْ ۖ قَالُوا لَا تَخَفْ ۖ خَصْمَانِ بَغَىٰ بَعْضُنَا عَلَىٰ بَعْضٍ فَاحْكُم بَيْنَنَا بِالْحَقِّ وَلَا تُشْطِطْ وَاهْدِنَا إِلَىٰ سَوَاءِ الصِّرَاطِ","text_tajweed":"إِذْ دَخَلُو[s[اْ] عَلَىٰ دَاوُ[n[ۥ]دَ فَفَزِعَ مِنْهُمْ‌ۖ قَالُو[s[اْ] لَا تَخَفْ‌ۖ خَصْمَانِ بَغَىٰ بَعْضُنَا عَلَىٰ بَعْ[f:11509[ضٍ ف]َ[h:3549[ٱ]حْك[c:11510[ُم ب]َيْنَنَا بِ[h:370[ٱ]لْحَقِّ وَلَا تُشْطِ[q:11511[طْ] وَ[h:11512[ٱ]هْدِن[o[َآ] إِلَىٰ سَو[o[َا]ٓءِ [h:11513[ٱ][l[ل]صِّر[p[َٲ][q[ط]ِ","translation_en":"When they entered in upon Dawood and he was frightened at them, they said: Fear not; two litigants, of whom one has acted wrongfully towards the other, therefore decide between us with justice, and do not act unjustly, and guide us to the right way.","translation_id":"ketika mereka masuk menemui Dawud lalu dia terkejut karena (kedatangan) mereka. Mereka berkata, “Janganlah takut! (Kami) berdua sedang berselisih, sebagian dari kami berbuat zhalim kepada yang lain; maka berilah keputusan di antara kami secara adil dan janganlah menyimpang dari kebenaran serta tunjukilah kami ke jalan yang lurus.","hasanah_per_verse":930},{"text_madani":"إِنَّ هَٰذَا أَخِي لَهُ تِسْعٌ وَتِسْعُونَ نَعْجَةً وَلِيَ نَعْجَةٌ وَاحِدَةٌ فَقَالَ أَكْفِلْنِيهَا وَعَزَّنِي فِي الْخِطَابِ","text_tajweed":"إِ[g[نّ]َ هَ[n[ـٰ]ذ[o[َآ] أَخِى لَهُ[n[ۥ] تِسْ[a:11514[عٌ و]َتِسْعُونَ نَعْجَ[a:11515[ةً و]َلِىَ نَعْجَ[a:11516[ةٌ و][n[َٲ]حِدَ[f:11517[ةٌ ف]َقَالَ أَكْفِلْنِيهَا وَعَزَّنِى فِى [h:11518[ٱ]لْخِط[p[َا][q[ب]ِ","translation_en":"Surely this is my brother; he has ninety-nine ewes and I have a single ewe; but he said: Make it over to me, and he has prevailed against me in discourse.","translation_id":"Sesungguhnya saudaraku ini mempunyai sembilan puluh sembilan ekor kambing betina dan aku mempunyai seekor saja, lalu dia berkata, “Serahkanlah (kambingmu) itu kepadaku! Dan dia mengalahkan aku dalam perdebatan.”","hasanah_per_verse":600},{"text_madani":"قَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ إِلَىٰ نِعَاجِهِ ۖ وَإِنَّ كَثِيرًا مِّنَ الْخُلَطَاءِ لَيَبْغِي بَعْضُهُمْ عَلَىٰ بَعْضٍ إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَقَلِيلٌ مَّا هُمْ ۗ وَظَنَّ دَاوُودُ أَنَّمَا فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وَخَرَّ رَاكِعًا وَأَنَابَ","text_tajweed":"قَالَ لَقَ[q:2389[دْ] ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ إِلَىٰ نِعَاجِه[n[ِۦ]‌ۖ وَإِ[g[نّ]َ كَثِي[a:3614[رًا م]ِّنَ [h:11519[ٱ]لْخُلَط[o[َا]ٓءِ لَيَ[q:11520[بْ]غِى بَعْضُهُمْ عَلَىٰ بَعْضٍ إِلَّا [h:778[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ وَقَلِي[a:11521[لٌ م]َّا هُمْ‌ۗ وَظَ[g[نّ]َ دَاوُ[n[ۥ]دُ أَ[g[نّ]َمَا فَتَ[g[نّ]َ[n[ـٰ]هُ فَ[h:11522[ٱ]سْتَغْفَرَ رَبَّهُ[n[ۥ] وَخَرَّ رَاكِ[a:11523[عًا و]َأَنَ[p[ا][q[ب]َ ۩","translation_en":"He said: Surely he has been unjust to you in demanding your ewe (to add) to his own ewes; and most surely most of the partners act wrongfully towards one another, save those who believe and do good, and very few are they; and Dawood was sure that We had tried him, so he sought the protection of his Lord and he fell down bowing and turned time after time (to Him).","translation_id":"Dia (Dawud) berkata, “Sungguh, dia telah berbuat zhalim kepadamu dengan meminta kambingmu itu untuk (ditambahkan) kepada kambingnya. Memang banyak di antara orang-orang yang bersekutu itu berbuat zhalim kepada yang lain, kecuali orang-orang yang beriman dan mengerjakan kebajikan; dan hanya sedikitlah mereka yang begitu.” Dan Dawud menduga bahwa Kami mengujinya; maka dia memohon ampunan kepada Tuhannya lalu menyungkur sujud dan bertobat.","hasanah_per_verse":1370},{"text_madani":"فَغَفَرْنَا لَهُ ذَٰلِكَ ۖ وَإِنَّ لَهُ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَآبٍ","text_tajweed":"فَغَفَرْنَا لَهُ[n[ۥ] ذ[n[َٲ]لِكَ‌ۖ وَإِ[g[نّ]َ لَهُ[n[ۥ] عِ[f:2359[ند]َنَا لَزُلْفَىٰ وَحُسْنَ مَــٔ[p[َا][q[ب]ٍ","translation_en":"Therefore We rectified for him this, and most surely he had a nearness to Us and an excellent resort.","translation_id":"Lalu Kami mengampuni (kesalahannya) itu. Dan sungguh, dia mempunyai kedudukan yang benar-benar dekat di sisi Kami dan tempat kembali yang baik.","hasanah_per_verse":330},{"text_madani":"يَا دَاوُودُ إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الْأَرْضِ فَاحْكُم بَيْنَ النَّاسِ بِالْحَقِّ وَلَا تَتَّبِعِ الْهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ اللَّهِ ۚ إِنَّ الَّذِينَ يَضِلُّونَ عَن سَبِيلِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ بِمَا نَسُوا يَوْمَ الْحِسَابِ","text_tajweed":"يَ[n[ـٰ]دَاوُ[n[ۥ]دُ إِ[g[نّ]َا جَعَلْنَ[n[ـٰ]كَ خَلِيفَ[f:11524[ةً ف]ِى [h:44[ٱ]لْأَرْضِ فَ[h:3549[ٱ]حْك[c:11525[ُم ب]َيْنَ [h:1165[ٱ][l[ل][g[نّ]َاسِ بِ[h:370[ٱ]لْحَقِّ وَلَا تَتَّبِعِ [h:11526[ٱ]لْهَوَىٰ فَيُضِلَّكَ عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ‌ۚ إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ يَضِلُّونَ عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ لَهُمْ عَذَا[f:1727[بٌ ش]َدِي[i:4392[دُۢ ب]ِمَا نَسُو[s[اْ] يَوْمَ [h:11527[ٱ]لْحِس[p[َا][q[ب]ِ","translation_en":"o Dawood! surely We have made you a ruler in the land; so judge between men with justice and do not follow desire, lest it should lead you astray from the path of Allah; (as for) those who go astray from the path of Allah, they shall surely have a severe punishment because they forgot the day of reckoning.","translation_id":"(Allah berfirman), “Wahai Dawud! Sesungguhnya engkau Kami jadikan khalifah (penguasa) di bumi, maka berilah keputusan (perkara) di antara manusia dengan adil dan janganlah engkau mengikuti hawa nafsu, karena akan menyesatkan engkau dari jalan Allah. Sungguh, orang-orang yang sesat dari jalan Allah akan mendapat azab yang berat, karena mereka melupakan hari perhitungan.”","hasanah_per_verse":1220},{"text_madani":"وَمَا خَلَقْنَا السَّمَاءَ وَالْأَرْضَ وَمَا بَيْنَهُمَا بَاطِلًا ۚ ذَٰلِكَ ظَنُّ الَّذِينَ كَفَرُوا ۚ فَوَيْلٌ لِّلَّذِينَ كَفَرُوا مِنَ النَّارِ","text_tajweed":"وَمَا خَلَ[q:5159[قْ]نَا [h:8692[ٱ][l[ل]سَّم[o[َا]ٓءَ وَ[h:1474[ٱ]لْأَرْضَ وَمَا بَيْنَهُمَا بَ[n[ـٰ]طِل[f:11528[اً‌ۚ ذ][n[َٲ]لِكَ ظَ[g[نّ]ُ [h:6104[ٱ]لَّذِينَ كَفَرُو[s[اْ‌ۚ] فَوَيْ[u:396[لٌ ل]ِّلَّذِينَ كَفَرُو[s[اْ] مِنَ [h:869[ٱ][l[ل][g[نّ][p[َا]رِ","translation_en":"And We did not create the heaven and the earth and what is between them in vain; that is the opinion of those who disbelieve then woe to those who disbelieve on account of the fire.","translation_id":"Dan Kami tidak menciptakan langit dan bumi dan apa yang ada di antara keduanya dengan sia-sia. Itu anggapan orang-orang kafir, maka celakalah orang-orang yang kafir itu karena mereka akan masuk neraka.","hasanah_per_verse":700},{"text_madani":"أَمْ نَجْعَلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ كَالْمُفْسِدِينَ فِي الْأَرْضِ أَمْ نَجْعَلُ الْمُتَّقِينَ كَالْفُجَّارِ","text_tajweed":"أَمْ نَ[q:8225[جْ]عَلُ [h:11529[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ كَ[h:11530[ٱ]لْمُفْسِدِينَ فِى [h:44[ٱ]لْأَرْضِ أَمْ نَ[q:8225[جْ]عَلُ [h:11531[ٱ]لْمُتَّقِينَ كَ[h:11532[ٱ]لْفُجّ[p[َا]رِ","translation_en":"Shall We treat those who believe and do good like the mischief-makers in the earth? Or shall We make those who guard (against evil) like the wicked?","translation_id":"Pantaskah Kami memperlakukan orang-orang yang beriman dan mengerjakan kebajikan sama dengan orang-orang yang berbuat kerusakan di bumi? Atau pantaskah Kami menganggap orang-orang yang bertakwa sama dengan orang-orang yang jahat?","hasanah_per_verse":660},{"text_madani":"كِتَابٌ أَنزَلْنَاهُ إِلَيْكَ مُبَارَكٌ لِّيَدَّبَّرُوا آيَاتِهِ وَلِيَتَذَكَّرَ أُولُو الْأَلْبَابِ","text_tajweed":"كِتَ[n[ـٰ]بٌ أَ[f:4236[نز]َلْنَ[n[ـٰ]هُ إِلَيْكَ مُبَ[n[ـٰ]رَ[u:11533[كٌ ل]ِّيَدَّبَّر[o[ُوٓ][s[اْ] ءَايَ[n[ـٰ]تِه[n[ِۦ] وَلِيَتَذَكَّرَ أُ[s[وْ]لُو[s[اْ] [h:1595[ٱ]لْأَلْبَ[p[ـٰ][q[ب]ِ","translation_en":"(It is) a Book We have revealed to you abounding in good that they may ponder over its verses, and that those endowed with understanding may be mindful.","translation_id":"Kitab (Al-Qur'an) yang Kami turunkan kepadamu penuh berkah agar mereka menghayati ayat-ayatnya dan agar orang-orang yang berakal sehat mendapat pelajaran.","hasanah_per_verse":500},{"text_madani":"وَوَهَبْنَا لِدَاوُودَ سُلَيْمَانَ ۚ نِعْمَ الْعَبْدُ ۖ إِنَّهُ أَوَّابٌ","text_tajweed":"وَوَهَ[q:4212[بْ]نَا لِدَاوُ[n[ۥ]دَ سُلَيْمَ[n[ـٰ]نَ‌ۚ نِعْمَ [h:11534[ٱ]لْعَ[q:11535[بْ]دُ‌ۖ إِ[g[نّ]َهُ[o[ۥٓ] أَوّ[p[َا][q[ب]ٌ","translation_en":"And We gave to Dawood Sulaiman, most excellent the servant! Surely he was frequent in returning (to Allah).","translation_id":"Dan kepada Dawud Kami karuniakan (anak bernama) Sulaiman; dia adalah sebaik-baik hamba. Sungguh, dia sangat taat (kepada Allah).","hasanah_per_verse":330},{"text_madani":"إِذْ عُرِضَ عَلَيْهِ بِالْعَشِيِّ الصَّافِنَاتُ الْجِيَادُ","text_tajweed":"إِذْ عُرِضَ عَلَيْهِ بِ[h:1900[ٱ]لْعَشِىِّ [h:11536[ٱ][l[ل]صَّ[n[ـٰ]فِنَ[n[ـٰ]تُ [h:11537[ٱ]لْجِي[p[َا][q[د]ُ","translation_en":"When there were brought to him in the evening (horses) still when standing, swift when running--","translation_id":"(Ingatlah) ketika pada suatu sore dipertunjukkan kepadanya (kuda-kuda) yang jinak, (tetapi) sangat cepat larinya,","hasanah_per_verse":290},{"text_madani":"فَقَالَ إِنِّي أَحْبَبْتُ حُبَّ الْخَيْرِ عَن ذِكْرِ رَبِّي حَتَّىٰ تَوَارَتْ بِالْحِجَابِ","text_tajweed":"فَقَالَ إِ[g[نّ][o[ِىٓ] أَحْبَ[q:11538[بْ]تُ حُبَّ [h:11539[ٱ]لْخَيْرِ عَ[f:3773[ن ذ]ِكْرِ رَبِّى حَتَّىٰ تَوَارَتْ بِ[h:11540[ٱ]لْحِج[p[َا][q[ب]ِ","translation_en":"Then he said: Surely I preferred the good things to the remembrance of my Lord-- until the sun set and time for Asr prayer was over, (he said):","translation_id":"maka dia berkata, “Sesungguhnya aku menyukai segala yang baik (kuda), yang membuat aku ingat akan (kebesaran) Tuhanku, sampai matahari terbenam.”","hasanah_per_verse":420},{"text_madani":"رُدُّوهَا عَلَيَّ ۖ فَطَفِقَ مَسْحًا بِالسُّوقِ وَالْأَعْنَاقِ","text_tajweed":"رُدُّوهَا عَلَىَّ‌ۖ فَطَفِقَ مَسْح[i:11541[َۢا ب]ِ[h:11542[ٱ][l[ل]سُّوقِ وَ[h:11543[ٱ]لْأَعْن[p[َا][q[ق]ِ","translation_en":"Bring them back to me; so he began to slash (their) legs and necks.","translation_id":"”Bawalah semua kuda itu kembali kepadaku.” Lalu dia mengusap-usap kaki dan leher kuda itu.","hasanah_per_verse":300},{"text_madani":"وَلَقَدْ فَتَنَّا سُلَيْمَانَ وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِ جَسَدًا ثُمَّ أَنَابَ","text_tajweed":"وَلَقَ[q:341[دْ] فَتَ[g[نّ]َا سُلَيْمَ[n[ـٰ]نَ وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّه[n[ِۦ] جَسَ[f:11544[دًا ث]ُ[g[مّ]َ أَن[p[َا][q[ب]َ","translation_en":"And certainly We tried Sulaiman, and We put on his throne a (mere) body, so he turned (to Allah).","translation_id":"Dan sungguh, Kami telah menguji Sulaiman dan Kami jadikan (dia) tergeletak di atas kursinya sebagai tubuh (yang lemah karena sakit), kemudian dia bertobat.","hasanah_per_verse":390},{"text_madani":"قَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَّا يَنبَغِي لِأَحَدٍ مِّن بَعْدِي ۖ إِنَّكَ أَنتَ الْوَهَّابُ","text_tajweed":"قَالَ رَبِّ [h:5032[ٱ]غْفِرْ لِى وَهَ[q:1745[بْ] لِى مُلْ[u:11545[كًا ل]َّا يَ[i:8425[نۢب]َغِى لِأَحَ[a:11546[دٍ م]ّ[i:692[ِنۢ ب]َعْد[o[ِىٓ‌ۖ] إِ[g[نّ]َكَ أَ[f:169[نت]َ [h:1748[ٱ]لْوَهّ[p[َا][q[ب]ُ","translation_en":"He said: My Lord! do Thou forgive me and grant me a kingdom which is not fit for (being inherited by) anyone after me;","translation_id":"Dia berkata, “Ya Tuhanku, ampunilah aku dan anugerahkanlah kepadaku kerajaan yang tidak dimiliki oleh siapa pun setelahku. Sungguh, Engkaulah Yang Maha Pemberi.”","hasanah_per_verse":490},{"text_madani":"فَسَخَّرْنَا لَهُ الرِّيحَ تَجْرِي بِأَمْرِهِ رُخَاءً حَيْثُ أَصَابَ","text_tajweed":"فَسَخَّرْنَا لَهُ [h:11547[ٱ][l[ل]رِّيحَ تَ[q:120[جْ]رِى بِأَمْرِه[n[ِۦ] رُخ[o[َا]ٓءً حَيْثُ أَص[p[َا][q[ب]َ","translation_en":"Then We made the wind subservient to him; it made his command to run gently wherever he desired,","translation_id":"Kemudian Kami tundukkan kepadanya angin yang berhembus dengan baik menurut perintahnya ke mana saja yang dikehendakinya,","hasanah_per_verse":330},{"text_madani":"وَالشَّيَاطِينَ كُلَّ بَنَّاءٍ وَغَوَّاصٍ","text_tajweed":"وَ[h:9999[ٱ][l[ل]شَّيَ[n[ـٰ]طِينَ كُلَّ بَ[g[نّ][o[َا]ٓ[a:11548[ءٍ و]َغَوّ[p[َا]صٍ","translation_en":"And the shaitans, every builder and diver,","translation_id":"dan (Kami tundukkan pula kepadanya) setan-setan, semuanya ahli bangunan dan penyelam,","hasanah_per_verse":200},{"text_madani":"وَآخَرِينَ مُقَرَّنِينَ فِي الْأَصْفَادِ","text_tajweed":"وَءَاخَرِينَ مُقَرَّنِينَ فِى [h:7184[ٱ]لْأَصْف[p[َا][q[د]ِ","translation_en":"And others fettered in chains.","translation_id":"dan (setan) yang lain yang terikat dalam belenggu.","hasanah_per_verse":210},{"text_madani":"هَٰذَا عَطَاؤُنَا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسَابٍ","text_tajweed":"هَ[n[ـٰ]ذَا عَط[o[َا]ٓؤُنَا فَ[h:11549[ٱ]مْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِس[p[َا][q[ب]ٍ","translation_en":"This is Our free gift, therefore give freely or withhold, without reckoning.","translation_id":"Inilah anugerah Kami; maka berikanlah (kepada orang lain) atau tahanlah (untuk dirimu sendiri) tanpa perhitungan.","hasanah_per_verse":280},{"text_madani":"وَإِنَّ لَهُ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَآبٍ","text_tajweed":"وَإِ[g[نّ]َ لَهُ[n[ۥ] عِ[f:2359[ند]َنَا لَزُلْفَىٰ وَحُسْنَ مَــٔ[p[َا][q[ب]ٍ","translation_en":"And most surely he had a nearness to Us and an excellent resort.","translation_id":"Dan sungguh, dia mempunyai kedudukan yang dekat pada sisi Kami dan tempat kembali yang baik.","hasanah_per_verse":220},{"text_madani":"وَاذْكُرْ عَبْدَنَا أَيُّوبَ إِذْ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ الشَّيْطَانُ بِنُصْبٍ وَعَذَابٍ","text_tajweed":"وَ[h:9999[ٱ]ذْكُرْ عَ[q:11499[بْ]دَن[o[َآ] أَيُّوبَ إِذْ نَادَىٰ رَبَّهُ[o[ۥٓ] أَ[g[نّ]ِى مَسَّنِىَ [h:11550[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ بِنُصْ[a:11551[بٍ و]َعَذ[p[َا][q[ب]ٍ","translation_en":"And remember Our servant Ayyub, when he called upon his Lord: The Shaitan has afflicted me with toil and torment.","translation_id":"Dan ingatlah akan hamba Kami Ayyub ketika dia menyeru Tuhannya, “Sesungguhnya aku diganggu setan dengan penderitaan dan bencana.”","hasanah_per_verse":460},{"text_madani":"ارْكُضْ بِرِجْلِكَ ۖ هَٰذَا مُغْتَسَلٌ بَارِدٌ وَشَرَابٌ","text_tajweed":"ٱرْكُضْ بِرِ[q:11552[جْ]لِكَ‌ۖ هَ[n[ـٰ]ذَا مُغْتَسَ[i:11553[لُۢ ب]َارِ[a:11554[دٌ و]َشَر[p[َا][q[ب]ٌ","translation_en":"Urge with your foot; here is a cool washing-place and a drink.","translation_id":"(Allah berfirman), “Hentakkanlah kakimu; inilah air yang sejuk untuk mandi dan untuk minum.”","hasanah_per_verse":260},{"text_madani":"وَوَهَبْنَا لَهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنَّا وَذِكْرَىٰ لِأُولِي الْأَلْبَابِ","text_tajweed":"وَوَهَ[q:4212[بْ]نَا لَهُ[o[ۥٓ] أَهْلَهُ[n[ۥ] وَمِثْلَه[w:8834[ُم م]َّعَهُمْ رَحْمَ[a:11254[ةً م]ِّ[g[نّ]َا وَذِكْرَىٰ لِأُ[s[وْ]لِى [h:11555[ٱ]لْأَلْبَ[p[ـٰ][q[ب]ِ","translation_en":"And We gave him his family and the like of them with them, as a mercy from Us, and as a reminder to those possessed of understanding.","translation_id":"Dan Kami anugerahi dia (dengan mengumpulkan kembali) keluarganya dan Kami lipatgandakan jumlah mereka, sebagai rahmat dari Kami dan pelajaran bagi orang-orang yang berpikiran sehat.","hasanah_per_verse":460},{"text_madani":"وَخُذْ بِيَدِكَ ضِغْثًا فَاضْرِب بِّهِ وَلَا تَحْنَثْ ۗ إِنَّا وَجَدْنَاهُ صَابِرًا ۚ نِّعْمَ الْعَبْدُ ۖ إِنَّهُ أَوَّابٌ","text_tajweed":"وَخُذْ بِيَدِكَ ضِغْ[f:11556[ثًا ف]َ[h:8556[ٱ]ضْرِب بِّه[n[ِۦ] وَلَا تَحْنَثْ‌ۗ إِ[g[نّ]َا وَجَ[q:11557[دْ]نَ[n[ـٰ]هُ صَابِ[a:11558[رًا‌ۚ ن]ِّعْمَ [h:11534[ٱ]لْعَ[q:11535[بْ]دُ‌ۖ إِ[g[نّ]َهُ[o[ۥٓ] أَوّ[p[َا][q[ب]ٌ","translation_en":"And take in your hand a green branch and beat her with It and do not break your oath; surely We found him patient; most excellent the servant! Surely he was frequent in returning (to Allah).","translation_id":"Dan ambillah seikat (rumput) dengan tanganmu, lalu pukullah dengan itu dan janganlah engkau melanggar sumpah. Sesungguhnya Kami dapati dia (Ayyub) seorang yang sabar. Dialah sebaik-baik hamba. Sungguh, dia sangat taat (kepada Allah).","hasanah_per_verse":540},{"text_madani":"وَاذْكُرْ عِبَادَنَا إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ أُولِي الْأَيْدِي وَالْأَبْصَارِ","text_tajweed":"وَ[h:9999[ٱ]ذْكُرْ عِبَ[n[ـٰ]دَن[o[َآ] إِ[q:1860[بْ]ر[n[َٲ]هِيمَ وَإِسْحَ[n[ـٰ]قَ وَيَعْقُوبَ أُ[s[وْ]لِى [h:11559[ٱ]لْأَيْدِى وَ[h:11560[ٱ]لْأَ[q:11560[بْ]صَ[p[ـٰ]رِ","translation_en":"And remember Our servants Ibrahim and Ishaq and Yaqoub, men of power and insight.","translation_id":"Dan ingatlah hamba-hamba Kami: Ibrahim, Ishak dan Yakub yang mempunyai kekuatan-kekuatan yang besar dan ilmu-ilmu (yang tinggi).","hasanah_per_verse":480},{"text_madani":"إِنَّا أَخْلَصْنَاهُم بِخَالِصَةٍ ذِكْرَى الدَّارِ","text_tajweed":"إِ[g[نّ][o[َآ] أَخْلَصْنَ[n[ـٰ]ه[c:11561[ُم ب]ِخَالِصَ[f:11562[ةٍ ذ]ِكْرَى [h:11563[ٱ][l[ل]دّ[p[َا]رِ","translation_en":"Surely We purified them by a pure quality, the keeping in mind of the (final) abode.","translation_id":"Sungguh, Kami telah menyucikan mereka dengan (menganugerahkan) akhlak yang tinggi kepadanya yaitu selalu mengingatkan (manusia) kepada negeri akhirat.","hasanah_per_verse":260},{"text_madani":"وَإِنَّهُمْ عِندَنَا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيَارِ","text_tajweed":"وَإِ[g[نّ]َهُمْ عِ[f:2359[ند]َنَا لَمِنَ [h:11564[ٱ]لْمُصْطَفَيْنَ [h:11565[ٱ]لْأَخْي[p[َا]رِ","translation_en":"And most surely they were with Us, of the elect, the best.","translation_id":"Dan sungguh, di sisi Kami mereka termasuk orang-orang pilihan yang paling baik.","hasanah_per_verse":280},{"text_madani":"وَاذْكُرْ إِسْمَاعِيلَ وَالْيَسَعَ وَذَا الْكِفْلِ ۖ وَكُلٌّ مِّنَ الْأَخْيَارِ","text_tajweed":"وَ[h:9999[ٱ]ذْكُرْ إِسْمَ[n[ـٰ]عِيلَ وَ[h:4217[ٱ]لْيَسَعَ وَذَا [h:8836[ٱ]لْكِفْلِ‌ۖ وَكُ[a:11566[لٌّ م]ِّنَ [h:11567[ٱ]لْأَخْي[p[َا]رِ","translation_en":"And remember Ismail and Al-Yasha and Zulkifl; and they were all of the best.","translation_id":"Dan ingatlah Ismail, Ilyasa‘ dan Zulkifli. Semuanya termasuk orang-orang yang paling baik.","hasanah_per_verse":380},{"text_madani":"هَٰذَا ذِكْرٌ ۚ وَإِنَّ لِلْمُتَّقِينَ لَحُسْنَ مَآبٍ","text_tajweed":"هَ[n[ـٰ]ذَا ذِكْ[a:11568[رٌ‌ۚ و]َإِ[g[نّ]َ لِلْمُتَّقِينَ لَحُسْنَ مَــٔ[p[َا][q[ب]ٍ","translation_en":"This is a reminder; and most surely there is an excellent resort for those who guard (against evil),","translation_id":"Ini adalah kehormatan (bagi mereka). Dan sungguh, bagi orang-orang yang bertakwa (disediakan) tempat kembali yang terbaik,","hasanah_per_verse":230},{"text_madani":"جَنَّاتِ عَدْنٍ مُّفَتَّحَةً لَّهُمُ الْأَبْوَابُ","text_tajweed":"جَ[g[نّ]َ[n[ـٰ]تِ عَ[q:5720[دْ][a:11569[نٍ م]ُّفَتَّحَ[u:11570[ةً ل]َّهُمُ [h:11571[ٱ]لْأَ[q:11572[بْ]و[p[َٲ][q[ب]ُ","translation_en":"The gardens of perpetuity, the doors are opened for them.","translation_id":"(yaitu) surga ’Adn yang pintu-pintunya terbuka bagi mereka,","hasanah_per_verse":220},{"text_madani":"مُتَّكِئِينَ فِيهَا يَدْعُونَ فِيهَا بِفَاكِهَةٍ كَثِيرَةٍ وَشَرَابٍ","text_tajweed":"مُتَّكِــِٔينَ فِيهَا يَ[q:1240[دْ]عُونَ فِيهَا بِفَ[n[ـٰ]كِهَ[f:11573[ةٍ ك]َثِيرَ[a:11574[ةٍ و]َشَر[p[َا][q[ب]ٍ","translation_en":"Reclining therein, calling therein for many fruits and drink.","translation_id":"di dalamnya mereka bersandar (di atas dipan-dipan) sambil meminta buah-buahan yang banyak dan minuman (di surga itu).","hasanah_per_verse":350},{"text_madani":"وَعِندَهُمْ قَاصِرَاتُ الطَّرْفِ أَتْرَابٌ","text_tajweed":"۞ وَعِ[f:11364[ند]َهُمْ قَ[n[ـٰ]صِر[n[َٲ]تُ [h:11365[ٱ][l[ل]طَّرْفِ أَتْر[p[َا][q[ب]ٌ","translation_en":"And with them shall be those restraining their eyes, equals in age.","translation_id":"dan di samping mereka (ada bidadari-bidadari) yang redup pandangannya dan sebaya umurnya.","hasanah_per_verse":220},{"text_madani":"هَٰذَا مَا تُوعَدُونَ لِيَوْمِ الْحِسَابِ","text_tajweed":"هَ[n[ـٰ]ذَا مَا تُوعَدُونَ لِيَوْمِ [h:11575[ٱ]لْحِس[p[َا][q[ب]ِ","translation_en":"This is what you are promised for the day of reckoning.","translation_id":"Inilah apa yang dijanjikan kepadamu pada hari perhitungan.","hasanah_per_verse":210},{"text_madani":"إِنَّ هَٰذَا لَرِزْقُنَا مَا لَهُ مِن نَّفَادٍ","text_tajweed":"إِ[g[نّ]َ هَ[n[ـٰ]ذَا لَرِزْقُنَا مَا لَهُ[n[ۥ] م[a:11576[ِن ن]َّف[p[َا][q[د]ٍ","translation_en":"Most surely this is Our sustenance; it shall never come to an end;","translation_id":"Sungguh, inilah rezeki dari Kami yang tidak ada habis-habisnya.","hasanah_per_verse":210},{"text_madani":"هَٰذَا ۚ وَإِنَّ لِلطَّاغِينَ لَشَرَّ مَآبٍ","text_tajweed":"هَ[n[ـٰ]ذَا‌ۚ وَإِ[g[نّ]َ لِلطَّ[n[ـٰ]غِينَ لَشَرَّ مَــٔ[p[َا][q[ب]ٍ","translation_en":"This (shall be so); and most surely there is an evil resort for the inordinate ones;","translation_id":"Beginilah (keadaan mereka). Dan sungguh, bagi orang-orang yang durhaka pasti (disediakan) tempat kembali yang buruk,","hasanah_per_verse":190},{"text_madani":"جَهَنَّمَ يَصْلَوْنَهَا فَبِئْسَ الْمِهَادُ","text_tajweed":"جَهَ[g[نّ]َمَ يَصْلَوْنَهَا فَبِئْسَ [h:11577[ٱ]لْمِه[p[َا][q[د]ُ","translation_en":"Hell; they shall enter it, so evil is the resting-place.","translation_id":"(yaitu) neraka Jahanam yang mereka masuki; maka itulah seburuk-buruk tempat tinggal.","hasanah_per_verse":210},{"text_madani":"هَٰذَا فَلْيَذُوقُوهُ حَمِيمٌ وَغَسَّاقٌ","text_tajweed":"هَ[n[ـٰ]ذَا فَلْيَذُوقُوهُ حَمِي[a:11578[مٌ و]َغَسّ[p[َا][q[ق]ٌ","translation_en":"This (shall be so); so let them taste it, boiling and intensely cold (drink).","translation_id":"Inilah (azab neraka), maka biarlah mereka merasakannya, (minuman mereka) air yang sangat panas dan air yang sangat dingin,","hasanah_per_verse":200},{"text_madani":"وَآخَرُ مِن شَكْلِهِ أَزْوَاجٌ","text_tajweed":"وَءَاخَرُ مِ[f:11579[ن ش]َكْلِه[o[ِۦٓ] أَزْو[p[َٲ][q[ج]ٌ","translation_en":"And other (punishment) of the same kind-- of various sorts.","translation_id":"dan berbagai macam (azab) yang lain yang serupa itu.","hasanah_per_verse":150},{"text_madani":"هَٰذَا فَوْجٌ مُّقْتَحِمٌ مَّعَكُمْ ۖ لَا مَرْحَبًا بِهِمْ ۚ إِنَّهُمْ صَالُو النَّارِ","text_tajweed":"هَ[n[ـٰ]ذَا فَوْ[a:11580[جٌ م]ُّ[q:11581[قْ]تَحِ[a:11582[مٌ م]َّعَكُمْ‌ۖ لَا مَرْحَب[i:11583[َۢا ب]ِهِمْ‌ۚ إِ[g[نّ]َهُمْ صَالُو[s[اْ] [h:11584[ٱ][l[ل][g[نّ][p[َا]رِ","translation_en":"This is an army plunging in without consideration along with you; no welcome for them, surely they shall enter fire.","translation_id":"(Dikatakan kepada mereka), “Ini rombongan besar (pengikut-pengikutmu) yang masuk berdesak-desak bersama kamu (ke neraka).” Tidak ada ucapan selamat datang bagi mereka karena sesungguhnya mereka akan masuk neraka (kata pemimpin-pemimpin mereka).","hasanah_per_verse":380},{"text_madani":"قَالُوا بَلْ أَنتُمْ لَا مَرْحَبًا بِكُمْ ۖ أَنتُمْ قَدَّمْتُمُوهُ لَنَا ۖ فَبِئْسَ الْقَرَارُ","text_tajweed":"قَالُو[s[اْ] بَلْ أَ[f:428[نت]ُمْ لَا مَرْحَب[i:11585[َۢا ب]ِكُمْ‌ۖ أَ[f:428[نت]ُمْ قَدَّمْتُمُوهُ لَنَا‌ۖ فَبِئْسَ [h:11586[ٱ]لْقَر[p[َا]رُ","translation_en":"They shall say: Nay! you-- no welcome to you: you did proffer it to us, so evil is the resting-place.","translation_id":"(Para pengikut mereka menjawab), “Sebenarnya kamulah yang (lebih pan-tas) tidak menerima ucapan selamat datang, karena kamulah yang menjerumuskan kami ke dalam azab, maka itulah seburuk-buruk tempat menetap.”","hasanah_per_verse":450},{"text_madani":"قَالُوا رَبَّنَا مَن قَدَّمَ لَنَا هَٰذَا فَزِدْهُ عَذَابًا ضِعْفًا فِي النَّارِ","text_tajweed":"قَالُو[s[اْ] رَبَّنَا مَ[f:11587[ن ق]َدَّمَ لَنَا هَ[n[ـٰ]ذَا فَزِ[q:11588[دْ]هُ عَذَا[f:4678[بًا ض]ِعْ[f:11589[فًا ف]ِى [h:4674[ٱ][l[ل][g[نّ][p[َا]رِ","translation_en":"They shall say: Our Lord! whoever prepared it first for us, add Thou to him a double chastisement in the fire.","translation_id":"Mereka berkata (lagi), “Ya Tuhan kami, barangsiapa menjerumuskan kami ke dalam (azab) ini, maka tambahkanlah azab kepadanya dua kali lipat di dalam neraka.”","hasanah_per_verse":400},{"text_madani":"وَقَالُوا مَا لَنَا لَا نَرَىٰ رِجَالًا كُنَّا نَعُدُّهُم مِّنَ الْأَشْرَارِ","text_tajweed":"وَقَالُو[s[اْ] مَا لَنَا لَا نَرَىٰ رِجَال[f:11590[اً ك]ُ[g[نّ]َا نَعُدُّه[w:11591[ُم م]ِّنَ [h:11592[ٱ]لْأَشْر[p[َا]رِ","translation_en":"And they shall say: What is the matter with us that we do not see men whom we used to count among the vicious?","translation_id":"Dan (orang-orang durhaka) berkata, “Mengapa kami tidak melihat orang-orang yang dahulu (di dunia) kami anggap sebagai orang-orang yang jahat (hina).","hasanah_per_verse":380},{"text_madani":"أَتَّخَذْنَاهُمْ سِخْرِيًّا أَمْ زَاغَتْ عَنْهُمُ الْأَبْصَارُ","text_tajweed":"أَتَّخَذْنَ[n[ـٰ]هُمْ سِخْرِيًّا أَمْ زَاغَتْ عَنْهُمُ [h:11593[ٱ]لْأَ[q:4305[بْ]صَ[p[ـٰ]رُ","translation_en":"Was it that we (only) took them in scorn, or have our eyes (now) turned aside from them?","translation_id":"Dahulu kami menjadikan mereka olok-olokan, ataukah karena penglihatan kami yang tidak melihat mereka?”","hasanah_per_verse":300},{"text_madani":"إِنَّ ذَٰلِكَ لَحَقٌّ تَخَاصُمُ أَهْلِ النَّارِ","text_tajweed":"إِ[g[نّ]َ ذ[n[َٲ]لِكَ لَحَ[f:11594[قٌّ ت]َخَاصُمُ أَهْلِ [h:11595[ٱ][l[ل][g[نّ][p[َا]رِ","translation_en":"That most surely is the truth: the contending one with another of the inmates of the fire.","translation_id":"Sungguh, yang demikian benar-benar terjadi, (yaitu) pertengkaran di antara penghuni neraka.","hasanah_per_verse":210},{"text_madani":"قُلْ إِنَّمَا أَنَا مُنذِرٌ ۖ وَمَا مِنْ إِلَٰهٍ إِلَّا اللَّهُ الْوَاحِدُ الْقَهَّارُ","text_tajweed":"قُلْ إِ[g[نّ]َم[o[َآ] أَنَا۟ مُ[f:6895[نذ]ِ[a:11596[رٌ‌ۖ و]َمَا مِنْ إِلَ[n[ـٰ]هٍ إِلَّا [h:1742[ٱ]للَّهُ [h:11597[ٱ]لْو[n[َٲ]حِدُ [h:6662[ٱ]لْقَهّ[p[َا]رُ","translation_en":"Say: I am only a warner, and there is no god but Allah, the One, the Subduer (of all):","translation_id":"Katakanlah (Muhammad), “Sesungguhnya aku hanya seorang pemberi peringatan, tidak ada tuhan selain Allah Yang Maha Esa, Mahaperkasa,","hasanah_per_verse":400},{"text_madani":"رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الْعَزِيزُ الْغَفَّارُ","text_tajweed":"رَبُّ [h:6926[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ وَمَا بَيْنَهُمَا [h:11598[ٱ]لْعَزِيزُ [h:11599[ٱ]لْغَفَّ[p[ـٰ]رُ","translation_en":"The Lord of the heavens and the earth and what is between them, the Mighty, the most Forgiving.","translation_id":"(yaitu) Tuhan langit dan bumi dan apa yang ada di antara keduanya, Yang Mahaperkasa, Maha Pengampun.”","hasanah_per_verse":370},{"text_madani":"قُلْ هُوَ نَبَأٌ عَظِيمٌ","text_tajweed":"قُلْ هُوَ نَبَؤٌاْ عَظ[p[ِي]مٌ","translation_en":"Say: It is a message of importance,","translation_id":"Katakanlah, “Itu (Al-Qur'an) adalah berita besar,","hasanah_per_verse":110},{"text_madani":"أَنتُمْ عَنْهُ مُعْرِضُونَ","text_tajweed":"أَ[f:428[نت]ُمْ عَنْهُ مُعْرِض[p[ُو]نَ","translation_en":"(And) you are turning aside from it:","translation_id":"yang kamu berpaling darinya.","hasanah_per_verse":130},{"text_madani":"مَا كَانَ لِيَ مِنْ عِلْمٍ بِالْمَلَإِ الْأَعْلَىٰ إِذْ يَخْتَصِمُونَ","text_tajweed":"مَا كَانَ لِىَ مِنْ عِلْ[i:11600[مِۭ ب]ِ[h:11601[ٱ]لْمَلَإِ [h:11602[ٱ]لْأَعْلَ[o[ىٰٓ] إِذْ يَخْتَصِم[p[ُو]نَ","translation_en":"I had no knowledge of the exalted chiefs when they contended:","translation_id":"Aku tidak mempunyai pengetahuan sedikit pun tentang al-mala’ul a’la (malaikat) itu ketika mereka berbantah-bantahan.","hasanah_per_verse":330},{"text_madani":"إِن يُوحَىٰ إِلَيَّ إِلَّا أَنَّمَا أَنَا نَذِيرٌ مُّبِينٌ","text_tajweed":"إ[a:11603[ِن ي]ُوحَ[o[ىٰٓ] إِلَىَّ إِلّ[o[َآ] أَ[g[نّ]َم[o[َآ] أَنَا۟ نَذِي[a:5164[رٌ م]ُّب[p[ِي]نٌ","translation_en":"Naught is revealed to me save that I am a plain warner.","translation_id":"Yang diwahyukan kepadaku, bahwa aku hanyalah seorang pemberi peringatan yang nyata.”","hasanah_per_verse":270},{"text_madani":"إِذْ قَالَ رَبُّكَ لِلْمَلَائِكَةِ إِنِّي خَالِقٌ بَشَرًا مِّن طِينٍ","text_tajweed":"إِذْ قَالَ رَبُّكَ لِلْمَلَ[o[ـٰٓ]ئِكَةِ إِ[g[نّ]ِى خَ[n[ـٰ]لِ[i:7235[قُۢ ب]َشَ[a:7236[رًا م]ِّ[f:3917[ن ط][p[ِي]نٍ","translation_en":"When your Lord said to the angels; Surely I am going to create a mortal from dust:","translation_id":"(Ingatlah) ketika Tuhanmu berfirman kepada malaikat, “Sesungguhnya Aku akan menciptakan manusia dari tanah.","hasanah_per_verse":320},{"text_madani":"فَإِذَا سَوَّيْتُهُ وَنَفَخْتُ فِيهِ مِن رُّوحِي فَقَعُوا لَهُ سَاجِدِينَ","text_tajweed":"فَإِذَا سَوَّيْتُهُ[n[ۥ] وَنَفَخْتُ فِيهِ م[u:7237[ِن ر]ُّوحِى فَقَعُو[s[اْ] لَهُ[n[ۥ] سَ[n[ـٰ]جِد[p[ِي]نَ","translation_en":"So when I have made him complete and breathed into him of My spirit, then fall down making obeisance to him.","translation_id":"Kemudian apabila telah Aku sempurnakan kejadiannya dan Aku tiupkan roh (ciptaan)-Ku kepadanya; maka tunduklah kamu dengan bersujud kepadanya.”","hasanah_per_verse":360},{"text_madani":"فَسَجَدَ الْمَلَائِكَةُ كُلُّهُمْ أَجْمَعُونَ","text_tajweed":"فَسَجَدَ [h:7238[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ كُلُّهُمْ أَ[q:7239[جْ]مَع[p[ُو]نَ","translation_en":"And the angels did obeisance, all of them,","translation_id":"Lalu para malaikat itu bersujud semuanya,","hasanah_per_verse":220},{"text_madani":"إِلَّا إِبْلِيسَ اسْتَكْبَرَ وَكَانَ مِنَ الْكَافِرِينَ","text_tajweed":"إِلّ[o[َآ] إِ[q:180[بْ]لِيسَ [h:11604[ٱ]سْتَكْبَرَ وَكَانَ مِنَ [h:182[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"But not Iblis: he was proud and he was one of the unbelievers.","translation_id":"kecuali Iblis; ia menyombongkan diri dan ia termasuk golongan yang kafir.","hasanah_per_verse":280},{"text_madani":"قَالَ يَا إِبْلِيسُ مَا مَنَعَكَ أَن تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ ۖ أَسْتَكْبَرْتَ أَمْ كُنتَ مِنَ الْعَالِينَ","text_tajweed":"قَالَ يَ[o[ـٰٓ]إِ[q:7241[بْ]لِيسُ مَا مَنَعَكَ أَ[f:11605[ن ت]َسْجُدَ لِمَا خَلَ[q:11606[قْ]تُ بِيَدَىَّ‌ۖ أَسْتَكْبَرْتَ أَمْ كُ[f:735[نت]َ مِنَ [h:11607[ٱ]لْعَال[p[ِي]نَ","translation_en":"He said: O Iblis! what prevented you that you should do obeisance to him whom I created with My two hands? Are you proud or are you of the exalted ones?","translation_id":"(Allah) berfirman, “Wahai Iblis, apakah yang menghalangi kamu sujud kepada yang telah Aku ciptakan dengan kekuasaan-Ku. Apakah kamu menyombongkan diri atau kamu (merasa) termasuk golongan yang (lebih) tinggi?”","hasanah_per_verse":540},{"text_madani":"قَالَ أَنَا خَيْرٌ مِّنْهُ ۖ خَلَقْتَنِي مِن نَّارٍ وَخَلَقْتَهُ مِن طِينٍ","text_tajweed":"قَالَ أَنَا۟ خَيْ[a:4596[رٌ م]ِّنْهُ‌ۖ خَلَ[q:4597[قْ]تَنِى م[a:4598[ِن ن]َّا[a:4599[رٍ و]َخَلَ[q:4600[قْ]تَهُ[n[ۥ] مِ[f:3917[ن ط][p[ِي]نٍ","translation_en":"He said: I am better than he; Thou hast created me of fire, and him Thou didst create of dust.","translation_id":"(Iblis) berkata, “Aku lebih baik daripadanya, karena Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah.”","hasanah_per_verse":340},{"text_madani":"قَالَ فَاخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ","text_tajweed":"قَالَ فَ[h:4603[ٱ]خْرُ[q:4603[جْ] مِنْهَا فَإِ[g[نّ]َكَ رَج[p[ِي]مٌ","translation_en":"He said: Then get out of it, for surely you are driven away:","translation_id":"(Allah) berfirman, “Kalau begitu keluarlah kamu dari surga! Sesungguhnya kamu adalah makhluk yang terkutuk.","hasanah_per_verse":200},{"text_madani":"وَإِنَّ عَلَيْكَ لَعْنَتِي إِلَىٰ يَوْمِ الدِّينِ","text_tajweed":"وَإِ[g[نّ]َ عَلَيْكَ لَعْنَت[o[ِىٓ] إِلَىٰ يَوْمِ [h:5[ٱ][l[ل]دّ[p[ِي]نِ","translation_en":"And surely My curse is on you to the day of judgment.","translation_id":"Dan sungguh, kutukan-Ku tetap atasmu sampai hari pembalasan.”","hasanah_per_verse":230},{"text_madani":"قَالَ رَبِّ فَأَنظِرْنِي إِلَىٰ يَوْمِ يُبْعَثُونَ","text_tajweed":"قَالَ رَبِّ فَأَ[f:7245[نظ]ِرْن[o[ِىٓ] إِلَىٰ يَوْمِ يُ[q:4606[بْ]عَث[p[ُو]نَ","translation_en":"He said: My Lord! then respite me to the day that they are raised.","translation_id":"(Iblis) berkata, “Ya Tuhanku, tangguhkanlah aku sampai pada hari mereka dibangkitkan.”","hasanah_per_verse":240},{"text_madani":"قَالَ فَإِنَّكَ مِنَ الْمُنظَرِينَ","text_tajweed":"قَالَ فَإِ[g[نّ]َكَ مِنَ [h:4607[ٱ]لْمُ[f:4608[نظ]َر[p[ِي]نَ","translation_en":"He said: Surely you are of the respited ones,","translation_id":"(Allah) berfirman, “Maka sesungguhnya kamu termasuk golongan yang diberi penangguhan,","hasanah_per_verse":170},{"text_madani":"إِلَىٰ يَوْمِ الْوَقْتِ الْمَعْلُومِ","text_tajweed":"إِلَىٰ يَوْمِ [h:7246[ٱ]لْوَ[q:7247[قْ]تِ [h:7248[ٱ]لْمَعْل[p[ُو]مِ","translation_en":"Till the period of the time made known.","translation_id":"sampai pada hari yang telah ditentukan waktunya (hari Kiamat).”","hasanah_per_verse":180},{"text_madani":"قَالَ فَبِعِزَّتِكَ لَأُغْوِيَنَّهُمْ أَجْمَعِينَ","text_tajweed":"قَالَ فَبِعِزَّتِكَ لَأُغْوِيَ[g[نّ]َهُمْ أَ[q:825[جْ]مَع[p[ِي]نَ","translation_en":"He said: Then by Thy Might I will surely make them live an evil life, all,","translation_id":"(Iblis) menjawab, “Demi kemuliaan-Mu, pasti aku akan menyesatkan mereka semuanya,","hasanah_per_verse":230},{"text_madani":"إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ","text_tajweed":"إِلَّا عِبَادَكَ مِنْهُمُ [h:7249[ٱ]لْمُخْلَص[p[ِي]نَ","translation_en":"Except Thy servants from among them, the purified ones.","translation_id":"kecuali hamba-hamba-Mu yang terpilih di antara mereka.\"","hasanah_per_verse":200},{"text_madani":"قَالَ فَالْحَقُّ وَالْحَقَّ أَقُولُ","text_tajweed":"قَالَ فَ[h:11608[ٱ]لْحَقُّ وَ[h:11609[ٱ]لْحَقَّ أَق[p[ُو]لُ","translation_en":"He said: The truth then is and the truth do I speak:","translation_id":"(Allah) berfirman, “Maka yang benar (adalah sumpahku), dan hanya kebenaran itulah yang Aku katakan.","hasanah_per_verse":170},{"text_madani":"لَأَمْلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنْهُمْ أَجْمَعِينَ","text_tajweed":"لَأَمْلَأَ[g[نّ]َ جَهَ[g[نّ]َمَ مِ[f:3891[نك]َ وَمِ[g[مّ]َ[f:11610[ن ت]َبِعَكَ مِنْهُمْ أَ[q:825[جْ]مَع[p[ِي]نَ","translation_en":"That I will most certainly fill hell with you and with those among them who follow you, all.","translation_id":"Sungguh, Aku akan memenuhi neraka Jahanam dengan kamu dan dengan orang-orang yang mengikutimu di antara mereka semuanya.”","hasanah_per_verse":310},{"text_madani":"قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَا أَنَا مِنَ الْمُتَكَلِّفِينَ","text_tajweed":"قُلْ م[o[َآ] أَسْــَٔلُكُمْ عَلَيْهِ مِنْ أَ[q:6133[جْ][a:11611[رٍ و]َم[o[َآ] أَنَا۟ مِنَ [h:11612[ٱ]لْمُتَكَلِّف[p[ِي]نَ","translation_en":"Say: I do not ask you for any reward for it; nor am I of those who affect:","translation_id":"Katakanlah (Muhammad), “Aku tidak meminta imbalan sedikit pun kepadamu atasnya (dakwahku); dan aku bukanlah termasuk orang yang mengada-ada.","hasanah_per_verse":360},{"text_madani":"إِنْ هُوَ إِلَّا ذِكْرٌ لِّلْعَالَمِينَ","text_tajweed":"إِنْ هُوَ إِلَّا ذِكْ[u:6839[رٌ ل]ِّلْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"It is nothing but a reminder to the nations;","translation_id":"(Al-Qur'an) ini tidak lain hanyalah peringatan bagi seluruh alam.","hasanah_per_verse":180},{"text_madani":"وَلَتَعْلَمُنَّ نَبَأَهُ بَعْدَ حِينٍ","text_tajweed":"وَلَتَعْلَمُ[g[نّ]َ نَبَأَهُ[n[ۥ] بَعْدَ ح[p[ِي]نِۭ","translation_en":"And most certainly you will come to know about it after a time.","translation_id":"Dan sungguh, kamu akan mengetahui (kebenaran) beritanya (Al-Qur'an) setelah beberapa waktu lagi.”","hasanah_per_verse":170}]}
