{"chapter_number":35,"name_simple":"Fatir","name_meaning":{"text":"Originator","en":"Originator","id":"Pencipta"},"verses_count":45,"hasanah":32380,"verses":[{"text_madani":"الْحَمْدُ لِلَّهِ فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ جَاعِلِ الْمَلَائِكَةِ رُسُلًا أُولِي أَجْنِحَةٍ مَّثْنَىٰ وَثُلَاثَ وَرُبَاعَ ۚ يَزِيدُ فِي الْخَلْقِ مَا يَشَاءُ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","text_tajweed":"ٱلْحَمْدُ لِلَّهِ فَاطِرِ [h:3956[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ جَاعِلِ [h:11058[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةِ رُسُلاً أُ[s[وْ]ل[o[ِىٓ] أَ[q:11059[جْ]نِحَ[a:11060[ةٍ م]َّثْنَىٰ وَثُلَ[n[ـٰ]ثَ وَرُبَ[n[ـٰ]عَۚ يَزِيدُ فِى [h:4788[ٱ]لْخَلْقِ مَا يَش[o[َا]ٓءُۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َد[p[ِي]رٌ","translation_en":"All praise is due to Allah, the Originator of the heavens and the earth, the Maker of the angels, messengers flying on wings, two, and three, and four; He increases in creation what He pleases; surely Allah has power over all things.","translation_id":"Segala puji bagi Allah Pencipta langit dan bumi, yang menjadikan malaikat sebagai utusan-utusan (untuk mengurus berbagai macam urusan) yang mempunyai sayap, masing-masing (ada yang) dua, tiga dan empat. Allah menambahkan pada ciptaan-Nya apa yang Dia kehendaki. Sungguh, Allah Mahakuasa atas segala sesuatu.","hasanah_per_verse":1000},{"text_madani":"مَّا يَفْتَحِ اللَّهُ لِلنَّاسِ مِن رَّحْمَةٍ فَلَا مُمْسِكَ لَهَا ۖ وَمَا يُمْسِكْ فَلَا مُرْسِلَ لَهُ مِن بَعْدِهِ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ","text_tajweed":"مَّا يَفْتَحِ [h:11061[ٱ]للَّهُ لِل[g[نّ]َاسِ م[u:11062[ِن ر]َّحْمَ[f:11063[ةٍ ف]َلَا مُمْسِكَ لَهَاۖ وَمَا يُمْسِكْ فَلَا مُرْسِلَ لَهُ[n[ۥ] م[i:254[ِنۢ ب]َعْدِهِ[n[ۚۦ] وَهُوَ [h:7045[ٱ]لْعَزِيزُ [h:681[ٱ]لْحَك[p[ِي]مُ","translation_en":"Whatever Allah grants to men of (His) mercy, there is none to withhold it, and what He withholds there is none to send it forth after that, and He is the Mighty, the Wise","translation_id":"Apa saja di antara rahmat Allah yang dianugerahkan kepada manusia, maka tidak ada yang dapat menahannya; dan apa saja yang ditahan-Nya maka tidak ada yang sanggup untuk melepaskannya setelah itu. Dan Dialah Yang Mahaperkasa, Mahabijaksana.","hasanah_per_verse":680},{"text_madani":"يَا أَيُّهَا النَّاسُ اذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ ۚ هَلْ مِنْ خَالِقٍ غَيْرُ اللَّهِ يَرْزُقُكُم مِّنَ السَّمَاءِ وَالْأَرْضِ ۚ لَا إِلَٰهَ إِلَّا هُوَ ۖ فَأَنَّىٰ تُؤْفَكُونَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:82[ٱ][l[ل][g[نّ]َاسُ [h:11064[ٱ]ذْكُرُو[s[اْ] نِعْمَتَ [h:1300[ٱ]للَّهِ عَلَيْكُمْۚ هَلْ مِنْ خَ[n[ـٰ]لِقٍ غَيْرُ [h:4057[ٱ]للَّهِ يَرْزُقُك[w:6034[ُم م]ِّنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ وَ[h:177[ٱ]لْأَرْضِۚ ل[o[َآ] إِلَ[n[ـٰ]هَ إِلَّا هُوَۖ فَأَ[g[نّ]َىٰ تُؤْفَك[p[ُو]نَ","translation_en":"O men! call to mind the favor of Allah on you; is there any creator besides Allah who gives you sustenance from the heaven and the earth? There is no god but He; whence are you then turned away?","translation_id":"Wahai manusia! Ingatlah akan nikmat Allah kepadamu. Adakah pencipta selain Allah yang dapat memberikan rezeki kepadamu dari langit dan bumi? Tidak ada tuhan selain Dia; maka mengapa kamu berpaling (dari ketauhidan)?","hasanah_per_verse":850},{"text_madani":"وَإِن يُكَذِّبُوكَ فَقَدْ كُذِّبَتْ رُسُلٌ مِّن قَبْلِكَ ۚ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ","text_tajweed":"وَإ[a:9047[ِن ي]ُكَذِّبُوكَ فَقَ[q:563[دْ] كُذِّبَتْ رُسُ[a:2469[لٌ م]ِّ[f:18[ن ق]َ[q:19[بْ]لِكَۚ وَإِلَى [h:1148[ٱ]للَّهِ تُرْجَعُ [h:1149[ٱ]لْأُم[p[ُو]رُ","translation_en":"And if they call you a liar, truly messengers before you were called liars, and to Allah are all affairs returned.","translation_id":"Dan jika mereka mendustakan engkau (setelah engkau beri peringatan), maka sungguh, rasul-rasul sebelum engkau telah didustakan pula. Dan hanya kepada Allah segala urusan dikembalikan.","hasanah_per_verse":430},{"text_madani":"يَا أَيُّهَا النَّاسُ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۖ فَلَا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا ۖ وَلَا يَغُرَّنَّكُم بِاللَّهِ الْغَرُورُ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:82[ٱ][l[ل][g[نّ]َاسُ إِ[g[نّ]َ وَعْدَ [h:3149[ٱ]للَّهِ حَ[f:10612[قٌّۖ ف]َلَا تَغُرَّ[g[نّ]َكُمُ [h:10613[ٱ]لْحَيَ[s[و][n[ٲ]ةُ [h:1156[ٱ][l[ل]دُّنْيَاۖ وَلَا يَغُرَّ[g[نّ]َك[c:10614[ُم ب]ِ[h:32[ٱ]للَّهِ [h:10615[ٱ]لْغَر[p[ُو]رُ","translation_en":"O men! surely the promise of Allah is true, therefore let not the life of this world deceive you, and let not the archdeceiver deceive you respecting Allah.","translation_id":"Wahai manusia! Sungguh, janji Allah itu benar, maka janganlah kehidupan dunia memperdayakan kamu dan janganlah (setan) yang pandai menipu, memperdayakan kamu tentang Allah.","hasanah_per_verse":630},{"text_madani":"إِنَّ الشَّيْطَانَ لَكُمْ عَدُوٌّ فَاتَّخِذُوهُ عَدُوًّا ۚ إِنَّمَا يَدْعُو حِزْبَهُ لِيَكُونُوا مِنْ أَصْحَابِ السَّعِيرِ","text_tajweed":"إِ[g[نّ]َ [h:4634[ٱ][l[ل]شَّيْطَ[n[ـٰ]نَ لَكُمْ عَدُ[f:11065[وٌّ ف]َ[h:11066[ٱ]تَّخِذُوهُ عَدُوًّاۚ إِ[g[نّ]َمَا يَ[q:1242[دْ]عُو[s[اْ] حِزْبَهُ[n[ۥ] لِيَكُونُو[s[اْ] مِنْ أَصْحَ[n[ـٰ]بِ [h:11067[ٱ][l[ل]سَّع[p[ِي]رِ","translation_en":"Surely the Shaitan is your enemy, so take him for an enemy; he only invites his party that they may be inmates of the burning","translation_id":"Sungguh, setan itu musuh bagimu, maka perlakukanlah ia sebagai musuh, karena sesungguhnya setan itu hanya mengajak golongannya agar mereka menjadi penghuni neraka yang menyala-nyala.","hasanah_per_verse":580},{"text_madani":"الَّذِينَ كَفَرُوا لَهُمْ عَذَابٌ شَدِيدٌ ۖ وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُم مَّغْفِرَةٌ وَأَجْرٌ كَبِيرٌ","text_tajweed":"ٱلَّذِينَ كَفَرُو[s[اْ] لَهُمْ عَذَا[f:1727[بٌ ش]َدِي[a:11068[دٌۖ و]َ[h:37[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ لَه[w:3412[ُم م]َّغْفِرَ[a:3413[ةٌ و]َأَ[q:3414[جْ][f:6259[رٌ ك]َب[p[ِي]رٌ","translation_en":"(As for) those who disbelieve, they shall have a severe punishment, and (as for) those who believe and do good, they shall have forgiveness and a great reward.","translation_id":"Orang-orang yang kafir, mereka akan mendapat azab yang sangat keras. Dan orang-orang yang beriman dan mengerjakan kebajikan, mereka memperoleh ampunan dan pahala yang besar.","hasanah_per_verse":620},{"text_madani":"أَفَمَن زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَنًا ۖ فَإِنَّ اللَّهَ يُضِلُّ مَن يَشَاءُ وَيَهْدِي مَن يَشَاءُ ۖ فَلَا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَرَاتٍ ۚ إِنَّ اللَّهَ عَلِيمٌ بِمَا يَصْنَعُونَ","text_tajweed":"أَفَمَ[f:11069[ن ز]ُيِّنَ لَهُ[n[ۥ] س[o[ُو]ٓءُ عَمَلِه[n[ِۦ] فَرَءَاهُ حَسَ[f:11070[نًاۖ ف]َإِ[g[نّ]َ [h:513[ٱ]للَّهَ يُضِلُّ م[a:476[َن ي]َش[o[َا]ٓءُ وَيَهْدِى م[a:476[َن ي]َش[o[َا]ٓءُۖ فَلَا تَذْهَ[q:11071[بْ] نَفْسُكَ عَلَيْهِمْ حَسَر[n[َٲ]تٍۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَلِي[i:6056[مُۢ ب]ِمَا يَصْنَع[p[ُو]نَ","translation_en":"What! is he whose evil deed is made fairseeming to him so much so that he considers it good? Now surely Allah makes err whom He pleases and guides aright whom He pleases, so let not your soul waste away in grief for them; surely Allah is Cognizant of what they do","translation_id":"Maka apakah pantas orang yang dijadikan terasa indah perbuatan buruknya, lalu menganggap baik perbuatannya itu? Sesungguhnya Allah menyesatkan siapa yang Dia kehendaki dan memberi petunjuk kepada siapa yang Dia kehendaki. Maka jangan engkau (Muhammad) biarkan dirimu binasa karena kesedihan terhadap mereka. Sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat.","hasanah_per_verse":910},{"text_madani":"وَاللَّهُ الَّذِي أَرْسَلَ الرِّيَاحَ فَتُثِيرُ سَحَابًا فَسُقْنَاهُ إِلَىٰ بَلَدٍ مَّيِّتٍ فَأَحْيَيْنَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا ۚ كَذَٰلِكَ النُّشُورُ","text_tajweed":"وَ[h:9999[ٱ]للَّهُ [h:11072[ٱ]لَّذ[o[ِىٓ] أَرْسَلَ [h:9659[ٱ][l[ل]رِّيَ[n[ـٰ]حَ فَتُثِيرُ سَحَا[f:11073[بًا ف]َسُ[q:11074[قْ]نَ[n[ـٰ]هُ إِلَىٰ بَلَ[a:11075[دٍ م]َّيِّ[f:11076[تٍ ف]َأَحْيَيْنَا بِهِ [h:842[ٱ]لْأَرْضَ بَعْدَ مَوْتِهَاۚ كَذ[n[َٲ]لِكَ [h:11077[ٱ][l[ل][g[نّ]ُش[p[ُو]رُ","translation_en":"And Allah is He Who sends the winds so they raise a cloud, then We drive it on to a dead country, and therewith We give life to the earth after its death; even so is the quickening.","translation_id":"Dan Allah-lah yang mengirimkan angin; lalu (angin itu) menggerakkan awan, maka Kami arahkan awan itu ke suatu negeri yang mati (tandus) lalu dengan hujan itu Kami hidupkan bumi setelah mati (kering). Seperti itulah kebangkitan itu.","hasanah_per_verse":760},{"text_madani":"مَن كَانَ يُرِيدُ الْعِزَّةَ فَلِلَّهِ الْعِزَّةُ جَمِيعًا ۚ إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهُ ۚ وَالَّذِينَ يَمْكُرُونَ السَّيِّئَاتِ لَهُمْ عَذَابٌ شَدِيدٌ ۖ وَمَكْرُ أُولَٰئِكَ هُوَ يَبُورُ","text_tajweed":"مَ[f:506[ن ك]َانَ يُرِيدُ [h:11078[ٱ]لْعِزَّةَ فَلِلَّهِ [h:11079[ٱ]لْعِزَّةُ جَمِيعًاۚ إِلَيْهِ يَصْعَدُ [h:11080[ٱ]لْكَلِمُ [h:11081[ٱ][l[ل]طَّيِّبُ وَ[h:11082[ٱ]لْعَمَلُ [h:11083[ٱ][l[ل]صَّ[n[ـٰ]لِحُ يَرْفَعُهُۚ[n[ۥ] وَ[h:37[ٱ]لَّذِينَ يَمْكُرُونَ [h:11084[ٱ][l[ل]سَّيِّـَٔـاتِ لَهُمْ عَذَا[f:1727[بٌ ش]َدِي[a:11085[دٌۖ و]َمَكْرُ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُوَ يَب[p[ُو]رُ","translation_en":"Whoever desires honor, then to Allah belongs the honor wholly. To Him do ascend the good words; and the good deeds, lift them up, and (as for) those who plan evil deeds, they shall have a severe chastisement; and (as for) their plan, it shall perish.","translation_id":"Barangsiapa menghendaki kemuliaan, maka (ketahuilah) kemuliaan itu semuanya milik Allah. Kepada-Nyalah akan naik perkataan-perkataan yang baik, dan amal kebajikan Dia akan mengangkatnya. Adapun orang-orang yang merencanakan kejahatan mereka akan mendapat azab yang sangat keras, dan rencana jahat mereka akan hancur.","hasanah_per_verse":1080},{"text_madani":"وَاللَّهُ خَلَقَكُم مِّن تُرَابٍ ثُمَّ مِن نُّطْفَةٍ ثُمَّ جَعَلَكُمْ أَزْوَاجًا ۚ وَمَا تَحْمِلُ مِنْ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِ ۚ وَمَا يُعَمَّرُ مِن مُّعَمَّرٍ وَلَا يُنقَصُ مِنْ عُمُرِهِ إِلَّا فِي كِتَابٍ ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ","text_tajweed":"وَ[h:9999[ٱ]للَّهُ خَلَقَك[w:2530[ُم م]ِّ[f:1972[ن ت]ُرَا[f:1973[بٍ ث]ُ[g[مّ]َ م[a:7325[ِن ن]ُّ[q:7326[طْ]فَ[f:8077[ةٍ ث]ُ[g[مّ]َ جَعَلَكُمْ أَزْو[n[َٲ][a:11086[جًاۚ و]َمَا تَحْمِلُ مِنْ أُ[f:1867[نث]َىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِ[n[ۚۦ] وَمَا يُعَ[g[مّ]َرُ م[a:11087[ِن م]ُّعَ[g[مّ]َ[a:11088[رٍ و]َلَا يُ[f:11089[نق]َصُ مِنْ عُمُرِه[o[ِۦٓ] إِلَّا فِى كِتَ[n[ـٰ]بٍۚ إِ[g[نّ]َ ذ[n[َٲ]لِكَ عَلَى [h:412[ٱ]للَّهِ يَس[p[ِي]رٌ","translation_en":"And Allah created you of dust, then of the life-germ, then He made you pairs; and no female bears, nor does she bring forth, except with His knowledge; and no one whose life is lengthened has his life lengthened, nor is aught diminished of one's life, but it is all in a book; surely this is easy to Allah.","translation_id":"Dan Allah menciptakan kamu dari tanah kemudian dari air mani, kemudian Dia menjadikan kamu berpasangan (laki-laki dan perempuan). Tidak ada seorang perempuan pun yang mengandung dan melahirkan, melainkan dengan sepengetahuan-Nya. Dan tidak dipanjangkan umur seseorang dan tidak pula dikurangi umurnya, melainkan (sudah ditetapkan) dalam Kitab (Lauh Mahfuzh). Sungguh, yang demikian itu mudah bagi Allah.","hasanah_per_verse":1150},{"text_madani":"وَمَا يَسْتَوِي الْبَحْرَانِ هَٰذَا عَذْبٌ فُرَاتٌ سَائِغٌ شَرَابُهُ وَهَٰذَا مِلْحٌ أُجَاجٌ ۖ وَمِن كُلٍّ تَأْكُلُونَ لَحْمًا طَرِيًّا وَتَسْتَخْرِجُونَ حِلْيَةً تَلْبَسُونَهَا ۖ وَتَرَى الْفُلْكَ فِيهِ مَوَاخِرَ لِتَبْتَغُوا مِن فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ","text_tajweed":"وَمَا يَسْتَوِى [h:11090[ٱ]لْبَحْرَانِ هَ[n[ـٰ]ذَا عَذْ[f:9670[بٌ ف]ُرَا[f:11091[تٌ س][o[َا]ٓئِ[f:11092[غٌ ش]َرَابُهُ[n[ۥ] وَهَ[n[ـٰ]ذَا مِلْحٌ أُجَا[a:11093[جٌۖ و]َمِ[f:11094[ن ك]ُ[f:11095[لٍّ ت]َأْكُلُونَ لَحْ[f:7349[مًا ط]َرِي[a:11096[ًّا و]َتَسْتَخْرِجُونَ حِلْيَ[f:7351[ةً ت]َلْبَسُونَهَاۖ وَتَرَى [h:7352[ٱ]لْفُلْكَ فِيهِ مَوَاخِرَ لِتَ[q:7694[بْ]تَغُو[s[اْ] مِ[f:475[ن ف]َضْلِه[n[ِۦ] وَلَعَلَّكُمْ تَشْكُر[p[ُو]نَ","translation_en":"And the two seas are not alike: the one sweet, that subdues thirst by its excessive sweetness, pleasant to drink; and the other salt, that burns by its saltness; yet from each of them you eat fresh flesh and bring forth ornaments which you wear; and you see the ships cleave through it that you may seek of His bounty and that you may be grateful.","translation_id":"Dan tidak sama (antara) dua lautan; yang ini tawar, segar, sedap diminum dan yang lain asin lagi pahit. Dan dari (masing-masing lautan) itu kamu dapat memakan daging yang segar dan kamu dapat mengeluarkan perhiasan yang kamu pakai, dan di sana kamu melihat kapal-kapal berlayar membelah laut agar kamu dapat mencari karunia-Nya dan agar kamu bersyukur.","hasanah_per_verse":1270},{"text_madani":"يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ كُلٌّ يَجْرِي لِأَجَلٍ مُّسَمًّى ۚ ذَٰلِكُمُ اللَّهُ رَبُّكُمْ لَهُ الْمُلْكُ ۚ وَالَّذِينَ تَدْعُونَ مِن دُونِهِ مَا يَمْلِكُونَ مِن قِطْمِيرٍ","text_tajweed":"يُولِجُ [h:9084[ٱ]لَّيْلَ فِى [h:1829[ٱ][l[ل][g[نّ]َهَارِ وَيُولِجُ [h:9085[ٱ][l[ل][g[نّ]َهَارَ فِى [h:1831[ٱ]لَّيْلِ وَسَخَّرَ [h:6864[ٱ][l[ل]شَّمْسَ وَ[h:4265[ٱ]لْقَمَرَ كُ[a:6865[لٌّ ي]َ[q:6866[جْ]رِى لِأَجَ[a:6867[لٍ م]ُّسَم[f:11097[ًّىۚ ذ][n[َٲ]لِكُمُ [h:4260[ٱ]للَّهُ رَبُّكُمْ لَهُ [h:1397[ٱ]لْمُلْكُۚ وَ[h:37[ٱ]لَّذِينَ تَ[q:4040[دْ]عُونَ مِ[f:3136[ن د]ُونِه[n[ِۦ] مَا يَمْلِكُونَ مِ[f:11098[ن ق]ِ[q:11099[طْ]م[p[ِي]رٍ","translation_en":"He causes the night to enter in upon the day, and He causes the day to enter in upon the night, and He has made subservient (to you) the sun and the moon; each one follows its course to an appointed time; this is Allah, your Lord, His is the kingdom; and those whom you call upon besides Him do not control a straw.","translation_id":"Dia memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam dan menundukkan matahari dan bulan, masing-masing beredar menurut waktu yang ditentukan. Yang (berbuat) demikian itulah Allah Tuhanmu, milik-Nyalah segala kerajaan. Dan orang-orang yang kamu seru (sembah) selain Allah tidak mempunyai apa-apa walaupun setipis kulit ari.","hasanah_per_verse":1150},{"text_madani":"إِن تَدْعُوهُمْ لَا يَسْمَعُوا دُعَاءَكُمْ وَلَوْ سَمِعُوا مَا اسْتَجَابُوا لَكُمْ ۖ وَيَوْمَ الْقِيَامَةِ يَكْفُرُونَ بِشِرْكِكُمْ ۚ وَلَا يُنَبِّئُكَ مِثْلُ خَبِيرٍ","text_tajweed":"إِ[f:11100[ن ت]َ[q:5192[دْ]عُوهُمْ لَا يَسْمَعُو[s[اْ] دُع[o[َا]ٓءَكُمْ وَلَوْ سَمِعُو[s[اْ] مَا [h:11101[ٱ]سْتَجَابُو[s[اْ] لَكُمْۖ وَيَوْمَ [h:443[ٱ]لْقِيَ[n[ـٰ]مَةِ يَكْفُرُونَ بِشِرْكِكُمْۚ وَلَا يُنَبِّئُكَ مِثْلُ خَب[p[ِي]رٍ","translation_en":"If you call on them they shall not hear your call, and even if they could hear they shall not answer you; and on the resurrection day they will deny your associating them (with Allah); and none can inform you like the One Who is Aware.","translation_id":"Jika kamu menyeru mereka, mereka tidak mendengar seruanmu, dan sekiranya mereka mendengar, mereka juga tidak memperkenankan permintaanmu. Dan pada hari Kiamat mereka akan mengingkari kemusyrikanmu dan tidak ada yang dapat memberikan keterangan kepadamu seperti yang diberikan oleh (Allah) Yang Mahateliti.","hasanah_per_verse":810},{"text_madani":"يَا أَيُّهَا النَّاسُ أَنتُمُ الْفُقَرَاءُ إِلَى اللَّهِ ۖ وَاللَّهُ هُوَ الْغَنِيُّ الْحَمِيدُ","text_tajweed":"۞ يَ[o[ـٰٓ]أَيُّهَا [h:82[ٱ][l[ل][g[نّ]َاسُ أَ[f:8796[نت]ُمُ [h:11102[ٱ]لْفُقَر[o[َا]ٓءُ إِلَى [h:1637[ٱ]للَّهِۖ وَ[h:72[ٱ]للَّهُ هُوَ [h:6121[ٱ]لْغَنِىُّ [h:9093[ٱ]لْحَم[p[ِي][q[د]ُ","translation_en":"O men! you are they who stand in need of Allah, and Allah is He Who is the Self-sufficient, the Praised One.","translation_id":"Wahai manusia! Kamulah yang memerlukan Allah; dan Allah Dialah Yang Mahakaya (tidak memerlukan sesuatu), Maha Terpuji.","hasanah_per_verse":470},{"text_madani":"إِن يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ","text_tajweed":"إ[a:3197[ِن ي]َشَأْ يُذْهِ[q:3198[بْ]كُمْ وَيَأْتِ بِخَلْ[f:7086[قٍ ج]َد[p[ِي][q[د]ٍ","translation_en":"If He please, He will take you off and bring a new generation.","translation_id":"Jika Dia menghendaki, niscaya Dia membinasakan kamu dan mendatangkan makhluk yang baru (untuk menggantikan kamu).","hasanah_per_verse":230},{"text_madani":"وَمَا ذَٰلِكَ عَلَى اللَّهِ بِعَزِيزٍ","text_tajweed":"وَمَا ذ[n[َٲ]لِكَ عَلَى [h:412[ٱ]للَّهِ بِعَز[p[ِي]زٍ","translation_en":"And this is not hard to Allah.","translation_id":"Dan yang demikian itu tidak sulit bagi Allah.","hasanah_per_verse":180},{"text_madani":"وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۚ وَإِن تَدْعُ مُثْقَلَةٌ إِلَىٰ حِمْلِهَا لَا يُحْمَلْ مِنْهُ شَيْءٌ وَلَوْ كَانَ ذَا قُرْبَىٰ ۗ إِنَّمَا تُنذِرُ الَّذِينَ يَخْشَوْنَ رَبَّهُم بِالْغَيْبِ وَأَقَامُوا الصَّلَاةَ ۚ وَمَن تَزَكَّىٰ فَإِنَّمَا يَتَزَكَّىٰ لِنَفْسِهِ ۚ وَإِلَى اللَّهِ الْمَصِيرُ","text_tajweed":"وَلَا تَزِرُ وَازِرَ[a:4572[ةٌ و]ِزْرَ أُخْرَىٰۚ وَإِ[f:11103[ن ت]َ[q:6220[دْ]عُ مُثْقَلَةٌ إِلَىٰ حِمْلِهَا لَا يُحْمَلْ مِنْهُ ش[a:11104[َىْءٌ و]َلَوْ كَانَ ذَا قُرْبَ[o[ىٰٓۗ] إِ[g[نّ]َمَا تُ[f:11105[نذ]ِرُ [h:11106[ٱ]لَّذِينَ يَخْشَوْنَ رَبَّه[c:8779[ُم ب]ِ[h:13[ٱ]لْغَيْبِ وَأَقَامُو[s[اْ] [h:1641[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَۚ وَمَ[f:11107[ن ت]َزَكَّىٰ فَإِ[g[نّ]َمَا يَتَزَكَّىٰ لِنَفْسِهِ[n[ۚۦ] وَإِلَى [h:1148[ٱ]للَّهِ [h:1842[ٱ]لْمَص[p[ِي]رُ","translation_en":"And a burdened soul cannot bear the burden of another and if one weighed down by burden should cry for (another to carry) its burden, not aught of it shall be carried, even though he be near of kin. You warn only those who fear their Lord in secret and keep up prayer; and whoever purifies himself, he purifies himself only for (the good of) his own soul; and to Allah is the eventual coming.","translation_id":"Dan orang yang berdosa tidak akan memikul dosa orang lain. Dan jika seseorang yang dibebani berat dosanya memanggil (orang lain) untuk memikul bebannya itu tidak akan dipikulkan sedikit pun, meskipun (yang dipanggilnya itu) kaum kerabatnya. Sesungguhnya yang dapat engkau beri peringatan hanya orang-orang yang takut kepada (azab) Tuhannya (sekalipun) mereka tidak melihat-Nya dan mereka yang melaksanakan shalat. Dan barangsiapa menyucikan dirinya, sesungguhnya dia menyucikan diri untuk kebaikan dirinya sendiri. Dan kepada Allah-lah tempat kembali.","hasanah_per_verse":1380},{"text_madani":"وَمَا يَسْتَوِي الْأَعْمَىٰ وَالْبَصِيرُ","text_tajweed":"وَمَا يَسْتَوِى [h:4068[ٱ]لْأَعْمَىٰ وَ[h:4069[ٱ]لْبَص[p[ِي]رُ","translation_en":"And the blind and the seeing are not alike","translation_id":"Dan tidaklah sama orang yang buta dengan orang yang melihat,","hasanah_per_verse":210},{"text_madani":"وَلَا الظُّلُمَاتُ وَلَا النُّورُ","text_tajweed":"وَلَا [h:11108[ٱ][l[ل]ظُّلُمَ[n[ـٰ]تُ وَلَا [h:11109[ٱ][l[ل][g[نّ][p[ُو]رُ","translation_en":"Nor the darkness and the light,","translation_id":"dan tidak (pula) sama gelap gulita dengan cahaya,","hasanah_per_verse":180},{"text_madani":"وَلَا الظِّلُّ وَلَا الْحَرُورُ","text_tajweed":"وَلَا [h:11110[ٱ][l[ل]ظِّلُّ وَلَا [h:11111[ٱ]لْحَر[p[ُو]رُ","translation_en":"Nor the shade and the heat,","translation_id":"dan tidak (pula) sama yang teduh dengan yang panas,","hasanah_per_verse":160},{"text_madani":"وَمَا يَسْتَوِي الْأَحْيَاءُ وَلَا الْأَمْوَاتُ ۚ إِنَّ اللَّهَ يُسْمِعُ مَن يَشَاءُ ۖ وَمَا أَنتَ بِمُسْمِعٍ مَّن فِي الْقُبُورِ","text_tajweed":"وَمَا يَسْتَوِى [h:11112[ٱ]لْأَحْي[o[َا]ٓءُ وَلَا [h:11113[ٱ]لْأَمْو[n[َٲ]تُۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ يُسْمِعُ م[a:476[َن ي]َش[o[َا]ٓءُۖ وَم[o[َآ] أَ[f:169[نت]َ بِمُسْمِ[a:11114[عٍ م]َّ[f:2074[ن ف]ِى [h:8926[ٱ]لْقُب[p[ُو]رِ","translation_en":"Neither are the living and the dead alike. Surely Allah makes whom He pleases hear, and you cannot make those hear who are in the graves.","translation_id":"dan tidak (pula) sama orang yang hi-dup dengan orang yang mati. Sungguh, Allah memberikan pendengaran kepada siapa yang Dia kehendaki dan engkau (Muhammad) tidak akan sanggup menjadikan orang yang di dalam kubur dapat mendengar.","hasanah_per_verse":620},{"text_madani":"إِنْ أَنتَ إِلَّا نَذِيرٌ","text_tajweed":"إِنْ أَ[f:169[نت]َ إِلَّا نَذ[p[ِي]رٌ","translation_en":"You are naught but a warner.","translation_id":"Engkau tidak lain hanyalah seorang pemberi peringatan.","hasanah_per_verse":120},{"text_madani":"إِنَّا أَرْسَلْنَاكَ بِالْحَقِّ بَشِيرًا وَنَذِيرًا ۚ وَإِن مِّنْ أُمَّةٍ إِلَّا خَلَا فِيهَا نَذِيرٌ","text_tajweed":"إِ[g[نّ][o[َآ] أَرْسَلْنَ[n[ـٰ]كَ بِ[h:370[ٱ]لْحَقِّ بَشِي[a:622[رًا و]َنَذِي[a:11115[رًاۚ و]َإ[a:3281[ِن م]ِّنْ أُ[g[مّ]َةٍ إِلَّا خَلَا فِيهَا نَذ[p[ِي]رٌ","translation_en":"Surely We have sent you with the truth as a bearer of good news and a warner; and there is not a people but a warner has gone among them.","translation_id":"Sungguh, Kami mengutus engkau dengan membawa kebenaran sebagai pembawa berita gembira dan sebagai pemberi peringatan. Dan tidak ada satu pun umat melainkan di sana telah datang seorang pemberi peringatan.","hasanah_per_verse":480},{"text_madani":"وَإِن يُكَذِّبُوكَ فَقَدْ كَذَّبَ الَّذِينَ مِن قَبْلِهِمْ جَاءَتْهُمْ رُسُلُهُم بِالْبَيِّنَاتِ وَبِالزُّبُرِ وَبِالْكِتَابِ الْمُنِيرِ","text_tajweed":"وَإ[a:9047[ِن ي]ُكَذِّبُوكَ فَقَ[q:563[دْ] كَذَّبَ [h:4507[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ ج[o[َا]ٓءَتْهُمْ رُسُلُه[c:4900[ُم ب]ِ[h:484[ٱ]لْبَيِّنَ[n[ـٰ]تِ وَبِ[h:11116[ٱ][l[ل]زُّبُرِ وَبِ[h:11117[ٱ]لْكِتَ[n[ـٰ]بِ [h:11118[ٱ]لْمُن[p[ِي]رِ","translation_en":"And if they call you a liar, so did those before them indeed call (their messengers) liars; their messengers had come to them with clear arguments, and with scriptures, and with the illuminating book.","translation_id":"Dan jika mereka mendustakanmu, maka sungguh, orang-orang yang sebelum mereka pun telah mendustakan (rasul-rasul); ketika rasul-rasulnya datang dengan membawa keterangan yang nyata (mukjizat), zubur, dan kitab yang memberi penjelasan yang sempurna.","hasanah_per_verse":670},{"text_madani":"ثُمَّ أَخَذْتُ الَّذِينَ كَفَرُوا ۖ فَكَيْفَ كَانَ نَكِيرِ","text_tajweed":"ثُ[g[مّ]َ أَخَذْتُ [h:11119[ٱ]لَّذِينَ كَفَرُو[s[اْۖ] فَكَيْفَ كَانَ نَك[p[ِي]رِ","translation_en":"Then did I punish those who disbelieved, so how was the manifestation of My disapproval?","translation_id":"Kemudian Aku azab orang-orang yang kafir; maka (lihatlah) bagaimana akibat kemurkaan-Ku.","hasanah_per_verse":270},{"text_madani":"أَلَمْ تَرَ أَنَّ اللَّهَ أَنزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجْنَا بِهِ ثَمَرَاتٍ مُّخْتَلِفًا أَلْوَانُهَا ۚ وَمِنَ الْجِبَالِ جُدَدٌ بِيضٌ وَحُمْرٌ مُّخْتَلِفٌ أَلْوَانُهَا وَغَرَابِيبُ سُودٌ","text_tajweed":"أَلَمْ تَرَ أَ[g[نّ]َ [h:394[ٱ]للَّهَ أَ[f:471[نز]َلَ مِنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ م[o[َا]ٓ[f:4278[ءً ف]َأَخْرَ[q:4279[جْ]نَا بِه[n[ِۦ] ثَمَر[n[َٲ][a:11120[تٍ م]ُّخْتَلِفًا أَلْو[n[َٲ]نُهَاۚ وَمِنَ [h:11121[ٱ]لْجِبَالِ جُدَ[i:11122[دُۢ ب]ِي[a:11123[ضٌ و]َحُمْ[a:11124[رٌ م]ُّخْتَلِفٌ أَلْو[n[َٲ]نُهَا وَغَرَابِيبُ س[p[ُو][q[د]ٌ","translation_en":"Do you not see that Allah sends down water from the cloud, then We bring forth therewith fruits of various colors; and in the mountains are streaks, white and red, of various hues and (others) intensely black?","translation_id":"Tidakkah engkau melihat bahwa Allah menurunkan air dari langit lalu dengan air itu Kami hasilkan buah-buahan yang beraneka macam jenisnya. Dan di antara gunung-gunung itu ada garis-garis putih dan merah yang beraneka macam warnanya dan ada (pula) yang hitam pekat.","hasanah_per_verse":940},{"text_madani":"وَمِنَ النَّاسِ وَالدَّوَابِّ وَالْأَنْعَامِ مُخْتَلِفٌ أَلْوَانُهُ كَذَٰلِكَ ۗ إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ ۗ إِنَّ اللَّهَ عَزِيزٌ غَفُورٌ","text_tajweed":"وَمِنَ [h:30[ٱ][l[ل][g[نّ]َاسِ وَ[h:11125[ٱ][l[ل]دَّو[m[َا]ٓبِّ وَ[h:1778[ٱ]لْأَنْعَ[n[ـٰ]مِ مُخْتَلِفٌ أَلْو[n[َٲ]نُهُ[n[ۥ] كَذ[n[َٲ]لِكَۗ إِ[g[نّ]َمَا يَخْشَى [h:11126[ٱ]للَّهَ مِنْ عِبَادِهِ [h:11127[ٱ]لْعُلَمَ[o[ـٰٓ]ؤُ[s[اْ]ۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَزِيزٌ غَف[p[ُو]رٌ","translation_en":"And of men and beasts and cattle are various species of it likewise; those of His servants only who are possessed of knowledge fear Allah; surely Allah is Mighty, Forgiving.","translation_id":"Dan demikian (pula) di antara manusia, makhluk bergerak yang bernyawa dan hewan-hewan ternak ada yang bermacam-macam warnanya (dan jenisnya). Di antara hamba-hamba Allah yang takut kepada-Nya, hanyalah para ulama. Sungguh, Allah Mahaperkasa, Maha Pengampun.","hasanah_per_verse":780},{"text_madani":"إِنَّ الَّذِينَ يَتْلُونَ كِتَابَ اللَّهِ وَأَقَامُوا الصَّلَاةَ وَأَنفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً يَرْجُونَ تِجَارَةً لَّن تَبُورَ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ يَتْلُونَ كِتَ[n[ـٰ]بَ [h:525[ٱ]للَّهِ وَأَقَامُو[s[اْ] [h:1641[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ وَأَ[f:2789[نف]َقُو[s[اْ] مِ[g[مّ]َا رَزَ[q:15[قْ]نَ[n[ـٰ]هُمْ سِر[a:1623[ًّا و]َعَلَانِيَ[a:11128[ةً ي]َرْجُونَ تِجَ[n[ـٰ]رَ[u:11129[ةً ل]َّ[f:11130[ن ت]َب[p[ُو]رَ","translation_en":"Surely they who recite the Book of Allah and keep up prayer and spend out of what We have given them secretly and openly, hope for a gain which will not perish.","translation_id":"Sesungguhnya orang-orang yang selalu membaca Kitab Allah (Al-Qur'an) dan melaksanakan shalat dan menginfakkan sebagian rezeki yang Kami anugerahkan kepadanya dengan diam-diam dan terang-terangan, mereka itu mengharapkan perdagangan yang tidak akan rugi,","hasanah_per_verse":760},{"text_madani":"لِيُوَفِّيَهُمْ أُجُورَهُمْ وَيَزِيدَهُم مِّن فَضْلِهِ ۚ إِنَّهُ غَفُورٌ شَكُورٌ","text_tajweed":"لِيُوَفِّيَهُمْ أُجُورَهُمْ وَيَزِيدَه[w:9444[ُم م]ِّ[f:475[ن ف]َضْلِهِ[o[ۚۦٓ] إِ[g[نّ]َهُ[n[ۥ] غَفُو[f:11131[رٌ ش]َك[p[ُو]رٌ","translation_en":"That He may pay them back fully their rewards and give them more out of His grace: surely He is Forgiving, Multiplier of rewards.","translation_id":"agar Allah menyempurnakan pahalanya kepada mereka dan menambah karunia-Nya. Sungguh, Allah Maha Pengampun, Maha Mensyukuri.","hasanah_per_verse":370},{"text_madani":"وَالَّذِي أَوْحَيْنَا إِلَيْكَ مِنَ الْكِتَابِ هُوَ الْحَقُّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ ۗ إِنَّ اللَّهَ بِعِبَادِهِ لَخَبِيرٌ بَصِيرٌ","text_tajweed":"وَ[h:9999[ٱ]لَّذ[o[ِىٓ] أَوْحَيْن[o[َآ] إِلَيْكَ مِنَ [h:891[ٱ]لْكِتَ[n[ـٰ]بِ هُوَ [h:8923[ٱ]لْحَقُّ مُصَدِّ[u:206[قًا ل]ِّمَا بَيْنَ يَدَيْهِۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ بِعِبَادِه[n[ِۦ] لَخَبِي[i:11132[رُۢ ب]َص[p[ِي]رٌ","translation_en":"And that which We have revealed to you of the Book, that is the truth verifying that which is before it; most surely with respect to His servants Allah is Aware, Seeing.","translation_id":"Dan apa yang telah Kami wahyukan kepadamu (Muhammad) yaitu Kitab (Al-Qur'an) itulah yang benar, membenarkan kitab-kitab yang sebelumnya. Sungguh, Allah benar-benar Maha Mengetahui, Maha Melihat (keadaan) hamba-hamba-Nya.","hasanah_per_verse":650},{"text_madani":"ثُمَّ أَوْرَثْنَا الْكِتَابَ الَّذِينَ اصْطَفَيْنَا مِنْ عِبَادِنَا ۖ فَمِنْهُمْ ظَالِمٌ لِّنَفْسِهِ وَمِنْهُم مُّقْتَصِدٌ وَمِنْهُمْ سَابِقٌ بِالْخَيْرَاتِ بِإِذْنِ اللَّهِ ۚ ذَٰلِكَ هُوَ الْفَضْلُ الْكَبِيرُ","text_tajweed":"ثُ[g[مّ]َ أَوْرَثْنَا [h:11133[ٱ]لْكِتَ[n[ـٰ]بَ [h:11134[ٱ]لَّذِينَ [h:11135[ٱ]صْطَفَيْنَا مِنْ عِبَادِنَاۖ فَمِنْهُمْ ظَالِ[u:8069[مٌ ل]ِّنَفْسِه[n[ِۦ] وَمِنْه[w:11136[ُم م]ُّ[q:10606[قْ]تَصِ[a:11137[دٌ و]َمِنْهُمْ سَابِ[i:11138[قُۢ ب]ِ[h:11139[ٱ]لْخَيْر[n[َٲ]تِ بِإِذْنِ [h:509[ٱ]للَّهِۚ ذ[n[َٲ]لِكَ هُوَ [h:11140[ٱ]لْفَضْلُ [h:11141[ٱ]لْكَب[p[ِي]رُ","translation_en":"Then We gave the Book for an inheritance to those whom We chose from among Our servants; but of them is he who makes his soul to suffer a loss, and of them is he who takes a middle course, and of them is he who is foremost in deeds of goodness by Allah's permission; this is the great excellence.","translation_id":"Kemudian Kitab itu Kami wariskan kepada orang-orang yang Kami pilih di antara hamba-hamba Kami, lalu di antara mereka ada yang menzhalimi diri sendiri, ada yang pertengahan dan ada (pula) yang lebih dahulu berbuat kebaikan dengan izin Allah. Yang demikian itu adalah karunia yang besar.","hasanah_per_verse":990},{"text_madani":"جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍ وَلُؤْلُؤًا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌ","text_tajweed":"جَ[g[نّ]َ[n[ـٰ]تُ عَ[q:5720[دْ][a:6962[نٍ ي]َ[q:6963[دْ]خُلُونَهَا يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِ[f:8050[ن ذ]َهَ[a:8971[بٍ و]َلُؤْلُ[a:8972[ؤًاۖ و]َلِبَاسُهُمْ فِيهَا حَر[p[ِي]رٌ","translation_en":"Gardens of perpetuity, they shall enter therein; they shad be made to wear therein bracelets of gold and pearls, and their dress therein shall be silk.","translation_id":"(Mereka akan mendapat) surga ‘Adn, mereka masuk ke dalamnya, di dalamnya mereka diberi perhiasan gelang-gelang dari emas dan mutiara, dan pakaian mereka di dalamnya adalah sutera.","hasanah_per_verse":570},{"text_madani":"وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ عَنَّا الْحَزَنَ ۖ إِنَّ رَبَّنَا لَغَفُورٌ شَكُورٌ","text_tajweed":"وَقَالُو[s[اْ] [h:4698[ٱ]لْحَمْدُ لِلَّهِ [h:3912[ٱ]لَّذ[o[ِىٓ] أَذْهَبَ عَ[g[نّ]َا [h:11142[ٱ]لْحَزَنَۖ إِ[g[نّ]َ رَبَّنَا لَغَفُو[f:11143[رٌ ش]َك[p[ُو]رٌ","translation_en":"And they shall say: (All) praise is due to Allah, Who has made grief to depart from us; most surely our Lord is Forgiving, Multiplier of rewards,","translation_id":"Dan mereka berkata, “Segala puji bagi Allah yang telah menghilangkan kesedihan dari kami. Sungguh, Tuhan kami benar-benar Maha Pengampun, Maha Mensyukuri,","hasanah_per_verse":450},{"text_madani":"الَّذِي أَحَلَّنَا دَارَ الْمُقَامَةِ مِن فَضْلِهِ لَا يَمَسُّنَا فِيهَا نَصَبٌ وَلَا يَمَسُّنَا فِيهَا لُغُوبٌ","text_tajweed":"ٱلَّذ[o[ِىٓ] أَحَلَّنَا دَارَ [h:11144[ٱ]لْمُقَامَةِ مِ[f:475[ن ف]َضْلِه[n[ِۦ] لَا يَمَسُّنَا فِيهَا نَصَ[a:5892[بٌ و]َلَا يَمَسُّنَا فِيهَا لُغ[p[ُو][q[ب]ٌ","translation_en":"Who has made us alight in a house abiding for ever out of His grace; toil shall not touch us therein, nor shall fatigue therein afflict us.","translation_id":"yang dengan karunia-Nya menempatkan kami dalam tempat yang kekal (surga); di dalamnya kami tidak merasa lelah dan tidak pula merasa lesu.”","hasanah_per_verse":550},{"text_madani":"وَالَّذِينَ كَفَرُوا لَهُمْ نَارُ جَهَنَّمَ لَا يُقْضَىٰ عَلَيْهِمْ فَيَمُوتُوا وَلَا يُخَفَّفُ عَنْهُم مِّنْ عَذَابِهَا ۚ كَذَٰلِكَ نَجْزِي كُلَّ كَفُورٍ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ كَفَرُو[s[اْ] لَهُمْ نَارُ جَهَ[g[نّ]َمَ لَا يُ[q:8625[قْ]ضَىٰ عَلَيْهِمْ فَيَمُوتُو[s[اْ] وَلَا يُخَفَّفُ عَنْه[w:11145[ُم م]ِّنْ عَذَابِهَاۚ كَذ[n[َٲ]لِكَ نَ[q:4214[جْ]زِى كُلَّ كَف[p[ُو]رٍ","translation_en":"And (as for) those who disbelieve, for them is the fire of hell; it shall not be finished with them entirely so that they should die, nor shall the chastisement thereof be lightened to them: even thus do We retribute every ungrateful one.","translation_id":"Dan orang-orang yang kafir, bagi mereka neraka Jahanam. Mereka tidak dibinasakan hingga mereka mati, dan tidak diringankan dari mereka azabnya. Demikianlah Kami membalas setiap orang yang sangat kafir.","hasanah_per_verse":720},{"text_madani":"وَهُمْ يَصْطَرِخُونَ فِيهَا رَبَّنَا أَخْرِجْنَا نَعْمَلْ صَالِحًا غَيْرَ الَّذِي كُنَّا نَعْمَلُ ۚ أَوَلَمْ نُعَمِّرْكُم مَّا يَتَذَكَّرُ فِيهِ مَن تَذَكَّرَ وَجَاءَكُمُ النَّذِيرُ ۖ فَذُوقُوا فَمَا لِلظَّالِمِينَ مِن نَّصِيرٍ","text_tajweed":"وَهُمْ يَصْطَرِخُونَ فِيهَا رَبَّن[o[َآ] أَخْرِ[q:2927[جْ]نَا نَعْمَلْ صَ[n[ـٰ]لِحًا غَيْرَ [h:287[ٱ]لَّذِى كُ[g[نّ]َا نَعْمَلُۚ أَوَلَمْ نُعَ[g[مّ]ِرْك[w:11146[ُم م]َّا يَتَذَكَّرُ فِيهِ مَ[f:11147[ن ت]َذَكَّرَ وَج[o[َا]ٓءَكُمُ [h:11148[ٱ][l[ل][g[نّ]َذِيرُۖ فَذُوقُو[s[اْ] فَمَا لِلظَّ[n[ـٰ]لِمِينَ م[a:9103[ِن ن]َّص[p[ِي]رٍ","translation_en":"And they shall cry therein for succour: O our Lord! take us out, we will do good deeds other than those which we used to do. Did We not preserve you alive long enough, so that he who would be mindful in it should mind? And there came to you the warner; therefore taste; because for the unjust, there is no helper.","translation_id":"Dan mereka berteriak di dalam neraka itu, “Ya Tuhan kami, keluarkanlah kami (dari neraka), niscaya kami akan mengerjakan kebajikan, yang berlainan dengan yang telah kami kerjakan dahulu.” (Dikatakan kepada mereka), “Bukankah Kami telah memanjangkan umurmu untuk dapat berpikir bagi orang yang mau berpikir, padahal telah datang kepadamu seorang pemberi peringatan? Maka rasakanlah (azab Kami), dan bagi orang-orang zhalim tidak ada seorang penolong pun.”","hasanah_per_verse":1080},{"text_madani":"إِنَّ اللَّهَ عَالِمُ غَيْبِ السَّمَاوَاتِ وَالْأَرْضِ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","text_tajweed":"إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَ[n[ـٰ]لِمُ غَيْبِ [h:11149[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِۚ إِ[g[نّ]َهُ[n[ۥ] عَلِي[i:2196[مُۢ ب]ِذَاتِ [h:2197[ٱ][l[ل]صُّد[p[ُو]رِ","translation_en":"Surely Allah is the Knower of what is unseen in the heavens and the earth; surely He is Cognizant of what is in the hearts.","translation_id":"Sungguh, Allah mengetahui yang gaib (tersembunyi) di langit dan di bumi. Sungguh, Dia Maha Mengetahui segala isi hati.","hasanah_per_verse":440},{"text_madani":"هُوَ الَّذِي جَعَلَكُمْ خَلَائِفَ فِي الْأَرْضِ ۚ فَمَن كَفَرَ فَعَلَيْهِ كُفْرُهُ ۖ وَلَا يَزِيدُ الْكَافِرِينَ كُفْرُهُمْ عِندَ رَبِّهِمْ إِلَّا مَقْتًا ۖ وَلَا يَزِيدُ الْكَافِرِينَ كُفْرُهُمْ إِلَّا خَسَارًا","text_tajweed":"هُوَ [h:153[ٱ]لَّذِى جَعَلَكُمْ خَلَ[o[ـٰٓ]ئِفَ فِى [h:44[ٱ]لْأَرْضِۚ فَمَ[f:3429[ن ك]َفَرَ فَعَلَيْهِ كُفْرُهُۖ[n[ۥ] وَلَا يَزِيدُ [h:11150[ٱ]لْكَ[n[ـٰ]فِرِينَ كُفْرُهُمْ عِ[f:264[ند]َ رَبِّهِمْ إِلَّا مَ[q:11151[قْ][a:11152[تًاۖ و]َلَا يَزِيدُ [h:11150[ٱ]لْكَ[n[ـٰ]فِرِينَ كُفْرُهُمْ إِلَّا خَسَارًا","translation_en":"He it is Who made you rulers in the land; therefore whoever disbelieves, his unbelief is against himself; and their unbelief does not increase the disbelievers with their Lord in anything except hatred; and their unbelief does not increase the disbelievers in anything except loss.","translation_id":"Dialah yang menjadikan kamu sebagai khalifah-khalifah di bumi. Barangsiapa kafir, maka (akibat) kekafirannya akan menimpa dirinya sendiri. Dan kekafiran orang-orang kafir itu hanya akan menambah kemurkaan di sisi Tuhan mereka. Dan kekafiran orang-orang kafir itu hanya akan menambah kerugian mereka belaka.","hasanah_per_verse":1000},{"text_madani":"قُلْ أَرَأَيْتُمْ شُرَكَاءَكُمُ الَّذِينَ تَدْعُونَ مِن دُونِ اللَّهِ أَرُونِي مَاذَا خَلَقُوا مِنَ الْأَرْضِ أَمْ لَهُمْ شِرْكٌ فِي السَّمَاوَاتِ أَمْ آتَيْنَاهُمْ كِتَابًا فَهُمْ عَلَىٰ بَيِّنَتٍ مِّنْهُ ۚ بَلْ إِن يَعِدُ الظَّالِمُونَ بَعْضُهُم بَعْضًا إِلَّا غُرُورًا","text_tajweed":"قُلْ أَرَءَيْتُمْ شُرَك[o[َا]ٓءَكُمُ [h:11153[ٱ]لَّذِينَ تَ[q:4040[دْ]عُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ أَرُونِى مَاذَا خَلَقُو[s[اْ] مِنَ [h:1579[ٱ]لْأَرْضِ أَمْ لَهُمْ شِرْ[f:11154[كٌ ف]ِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ أَمْ ءَاتَيْنَ[n[ـٰ]هُمْ كِتَ[n[ـٰ][f:11155[بًا ف]َهُمْ عَلَىٰ بَيِّنَ[a:11156[تٍ م]ِّنْهُۚ بَلْ إ[a:11157[ِن ي]َعِدُ [h:11158[ٱ][l[ل]ظَّ[n[ـٰ]لِمُونَ بَعْضُه[c:11159[ُم ب]َعْضًا إِلَّا غُرُورًا","translation_en":"Say: Have you considered your associates which you call upon besides Allah? Show me what part of the earth they have created, or have they any share in the heavens; or, have We given them a book so that they follow a clear argument thereof? Nay, the unjust do not hold out promises one to another but only to deceive.","translation_id":"Katakanlah, “Terangkanlah olehmu tentang sekutu-sekutumu yang kamu seru selain Allah.” Perlihatkanlah kepada-Ku (bagian) manakah dari bumi ini yang telah mereka ciptakan; ataukah mereka mempunyai peran serta dalam (penciptaan) langit; atau adakah Kami memberikan kitab kepada mereka sehingga mereka mendapat keterangan-keterangan yang jelas darinya? Sebenarnya orang-orang zhalim itu, sebagian mereka hanya menjanjikan tipuan belaka kepada sebagian yang lain.","hasanah_per_verse":1320},{"text_madani":"إِنَّ اللَّهَ يُمْسِكُ السَّمَاوَاتِ وَالْأَرْضَ أَن تَزُولَا ۚ وَلَئِن زَالَتَا إِنْ أَمْسَكَهُمَا مِنْ أَحَدٍ مِّن بَعْدِهِ ۚ إِنَّهُ كَانَ حَلِيمًا غَفُورًا","text_tajweed":"۞ إِ[g[نّ]َ [h:80[ٱ]للَّهَ يُمْسِكُ [h:11160[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ أَ[f:11161[ن ت]َزُولَاۚ وَلَئِ[f:11162[ن ز]َالَت[o[َآ] إِنْ أَمْسَكَهُمَا مِنْ أَحَ[a:1710[دٍ م]ّ[i:254[ِنۢ ب]َعْدِهِ[o[ۚۦٓ] إِ[g[نّ]َهُ[n[ۥ] كَانَ حَلِيمًا غَفُورًا","translation_en":"Surely Allah upholds the heavens and the earth lest they come to naught; and if they should come to naught, there Is none who can uphold them after Him; surely He is the Forbearing, the Forgiving.","translation_id":"Sungguh, Allah yang menahan langit dan bumi agar tidak lenyap; dan jika keduanya akan lenyap tidak ada seorang pun yang mampu menahannya selain Allah. Sungguh, Dia Maha Penyantun, Maha Pengampun.","hasanah_per_verse":760},{"text_madani":"وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لَئِن جَاءَهُمْ نَذِيرٌ لَّيَكُونُنَّ أَهْدَىٰ مِنْ إِحْدَى الْأُمَمِ ۖ فَلَمَّا جَاءَهُمْ نَذِيرٌ مَّا زَادَهُمْ إِلَّا نُفُورًا","text_tajweed":"وَأَ[q:4324[قْ]سَمُو[s[اْ] بِ[h:32[ٱ]للَّهِ جَهْدَ أَيْمَ[n[ـٰ]نِهِمْ لَئِ[f:11163[ن ج][o[َا]ٓءَهُمْ نَذِي[u:11164[رٌ ل]َّيَكُونُ[g[نّ]َ أَهْدَىٰ مِنْ إِحْدَى [h:11165[ٱ]لْأُمَمِۖ فَلَ[g[مّ]َا ج[o[َا]ٓءَهُمْ نَذِي[a:11166[رٌ م]َّا زَادَهُمْ إِلَّا نُفُورًا","translation_en":"And they swore by Allah with the strongest of their oaths that if there came to them a warner they would be better guided than any of the nations; but when there came to them a warner it increased them in naught but aversion.","translation_id":"Dan mereka bersumpah dengan nama Allah dengan sungguh-sungguh bahwa jika datang kepada mereka seorang pemberi peringatan, niscaya mereka akan lebih mendapat petunjuk dari salah satu umat-umat (yang lain). Tetapi ketika pemberi peringatan datang kepada mereka, tidak menambah (apa-apa) kepada mereka, bahkan semakin jauh mereka dari (kebenaran),","hasanah_per_verse":830},{"text_madani":"اسْتِكْبَارًا فِي الْأَرْضِ وَمَكْرَ السَّيِّئِ ۚ وَلَا يَحِيقُ الْمَكْرُ السَّيِّئُ إِلَّا بِأَهْلِهِ ۚ فَهَلْ يَنظُرُونَ إِلَّا سُنَّتَ الْأَوَّلِينَ ۚ فَلَن تَجِدَ لِسُنَّتِ اللَّهِ تَبْدِيلًا ۖ وَلَن تَجِدَ لِسُنَّتِ اللَّهِ تَحْوِيلًا","text_tajweed":"ٱسْتِكْبَا[f:11167[رًا ف]ِى [h:44[ٱ]لْأَرْضِ وَمَكْرَ [h:11168[ٱ][l[ل]سَّيِّىِٕۚ وَلَا يَحِيقُ [h:11169[ٱ]لْمَكْرُ [h:11170[ٱ][l[ل]سَّيِّئُ إِلَّا بِأَهْلِهِ[n[ۚۦ] فَهَلْ يَ[f:1141[نظ]ُرُونَ إِلَّا سُ[g[نّ]َتَ [h:11171[ٱ]لْأَوَّلِينَۚ فَلَ[f:2843[ن ت]َجِدَ لِسُ[g[نّ]َتِ [h:11172[ٱ]للَّهِ تَ[q:10752[بْ]دِيل[a:11173[اًۖ و]َلَ[f:3232[ن ت]َجِدَ لِسُ[g[نّ]َتِ [h:11172[ٱ]للَّهِ تَحْوِيلاً","translation_en":"(In) behaving proudly in the land and in planning evil; and the evil plans shall not beset any save the authors of it. Then should they wait for aught except the way of the former people? For you shall not find any alteration in the course of Allah; and you shall not find any change in the course of Allah.","translation_id":"karena kesombongan (mereka) di bumi dan karena rencana (mereka) yang jahat. Rencana yang jahat itu hanya akan menimpa orang yang merencanakannya sendiri. Mereka hanyalah menunggu (berlakunya) ketentuan kepada orang-orang yang terdahulu. Maka kamu tidak akan mendapatkan perubahan bagi Allah, dan tidak (pula) akan menemui penyimpangan bagi ketentuan Allah itu.","hasanah_per_verse":1110},{"text_madani":"أَوَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِن قَبْلِهِمْ وَكَانُوا أَشَدَّ مِنْهُمْ قُوَّةً ۚ وَمَا كَانَ اللَّهُ لِيُعْجِزَهُ مِن شَيْءٍ فِي السَّمَاوَاتِ وَلَا فِي الْأَرْضِ ۚ إِنَّهُ كَانَ عَلِيمًا قَدِيرًا","text_tajweed":"أَوَلَمْ يَسِيرُو[s[اْ] فِى [h:44[ٱ]لْأَرْضِ فَيَ[f:6853[نظ]ُرُو[s[اْ] كَيْفَ كَانَ عَ[n[ـٰ]قِبَةُ [h:6854[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ وَكَان[o[ُوٓ][s[اْ] أَشَدَّ مِنْهُمْ قُوَّۚ[a:11174[ةً و]َمَا كَانَ [h:742[ٱ]للَّهُ لِيُعْجِزَهُ[n[ۥ] مِ[f:2103[ن ش][f:5402[َىْءٍ ف]ِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَلَا فِى [h:44[ٱ]لْأَرْضِۚ إِ[g[نّ]َهُ[n[ۥ] كَانَ عَلِي[f:11175[مًا ق]َدِيرًا","translation_en":"Have they not travelled in the land and seen how was the end of those before them while they were stronger than these in power? And Allah is not such that any thing in the heavens or in the earth should escape Him; surely He is Knowing, Powerful.","translation_id":"Dan tidakkah mereka bepergian di bumi lalu melihat bagaimana kesudahan orang-orang sebelum mereka (yang mendustakan rasul), padahal orang-orang itu lebih besar kekuatannya dari mereka? Dan tidak ada sesuatu pun yang dapat melemahkan Allah baik di langit maupun di bumi. Sungguh, Dia Maha Mengetahui, Mahakuasa.","hasanah_per_verse":1200},{"text_madani":"وَلَوْ يُؤَاخِذُ اللَّهُ النَّاسَ بِمَا كَسَبُوا مَا تَرَكَ عَلَىٰ ظَهْرِهَا مِن دَابَّةٍ وَلَٰكِن يُؤَخِّرُهُمْ إِلَىٰ أَجَلٍ مُّسَمًّى ۖ فَإِذَا جَاءَ أَجَلُهُمْ فَإِنَّ اللَّهَ كَانَ بِعِبَادِهِ بَصِيرًا","text_tajweed":"وَلَوْ يُؤَاخِذُ [h:7452[ٱ]للَّهُ [h:7453[ٱ][l[ل][g[نّ]َاسَ بِمَا كَسَبُو[s[اْ] مَا تَرَكَ عَلَىٰ ظَهْرِهَا مِ[f:4026[ن د][m[َا]ٓبَّ[a:7455[ةٍ و]َلَ[n[ـٰ]ك[a:7456[ِن ي]ُؤَخِّرُهُمْ إِلَ[o[ىٰٓ] أَجَ[a:1657[لٍ م]ُّسَم[f:7457[ًّىۖ ف]َإِذَا ج[o[َا]ٓءَ أَجَلُهُمْ فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ كَانَ بِعِبَادِه[n[ِۦ] بَصِيرَۢا","translation_en":"And were Allah to punish men for what they earn, He would not leave on the back of it any creature, but He respites them till an appointed term; so when their doom shall come, then surely Allah is Seeing with respect to His servants.","translation_id":"Dan sekiranya Allah menghukum manusia disebabkan apa yang telah mereka perbuat, niscaya Dia tidak akan menyisakan satu pun makhluk bergerak yang bernyawa di bumi ini, tetapi Dia menangguhkan (hukuman)nya, sampai waktu yang sudah ditentukan. Nanti apabila ajal mereka tiba, maka Allah Maha Melihat (keadaan) hamba-hamba-Nya.","hasanah_per_verse":970}]}
