{"chapter_number":47,"name_simple":"Muhammad","name_meaning":{"text":"Muhammad","en":"Muhammad","id":"Muhammad"},"verses_count":38,"hasanah":24230,"verses":[{"text_madani":"الَّذِينَ كَفَرُوا وَصَدُّوا عَن سَبِيلِ اللَّهِ أَضَلَّ أَعْمَالَهُمْ","text_tajweed":"ٱلَّذِينَ كَفَرُو[s[اْ] وَصَدُّو[s[اْ] عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ أَضَلَّ أَعْمَ[n[ـٰ]لَهُمْ","translation_en":"(As for) those who disbelieve and turn away from Allah's way, He shall render their works ineffective.","translation_id":"Orang-orang yang kafir dan menghalang-halangi (manusia) dari jalan Allah, Allah menghapus segala amal mereka.","hasanah_per_verse":350},{"text_madani":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَآمَنُوا بِمَا نُزِّلَ عَلَىٰ مُحَمَّدٍ وَهُوَ الْحَقُّ مِن رَّبِّهِمْ ۙ كَفَّرَ عَنْهُمْ سَيِّئَاتِهِمْ وَأَصْلَحَ بَالَهُمْ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ وَءَامَنُو[s[اْ] بِمَا نُزِّلَ عَلَىٰ مُحَ[g[مّ]َ[a:12527[دٍ و]َهُوَ [h:479[ٱ]لْحَقُّ م[u:22[ِن ر]َّبِّهِمْ‌ۙ كَفَّرَ عَنْهُمْ سَيِّـَٔـاتِهِمْ وَأَصْلَحَ بَالَهُمْ","translation_en":"And (as for) those who believe and do good, and believe in what has been revealed to Muhammad, and it is the very truth from their Lord, He will remove their evil from them and improve their condition.","translation_id":"Dan orang-orang yang beriman (kepada Allah) dan mengerjakan kebajikan serta beriman kepada apa yang diturunkan kepada Muhammad; dan itulah kebenaran dari Tuhan mereka; Allah menghapus kesalahan-kesalahan mereka, dan memperbaiki keadaan mereka.","hasanah_per_verse":810},{"text_madani":"ذَٰلِكَ بِأَنَّ الَّذِينَ كَفَرُوا اتَّبَعُوا الْبَاطِلَ وَأَنَّ الَّذِينَ آمَنُوا اتَّبَعُوا الْحَقَّ مِن رَّبِّهِمْ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ لِلنَّاسِ أَمْثَالَهُمْ","text_tajweed":"ذ[n[َٲ]لِكَ بِأَ[g[نّ]َ [h:12528[ٱ]لَّذِينَ كَفَرُو[s[اْ] [h:12529[ٱ]تَّبَعُو[s[اْ] [h:12530[ٱ]لْبَ[n[ـٰ]طِلَ وَأَ[g[نّ]َ [h:7684[ٱ]لَّذِينَ ءَامَنُو[s[اْ] [h:12531[ٱ]تَّبَعُو[s[اْ] [h:12532[ٱ]لْحَقَّ م[u:22[ِن ر]َّبِّهِمْ‌ۚ كَذ[n[َٲ]لِكَ يَضْرِبُ [h:6944[ٱ]للَّهُ لِل[g[نّ]َاسِ أَمْثَ[n[ـٰ]لَهُمْ","translation_en":"That is because those who disbelieve follow falsehood, and have given them their dowries, taking (them) in marriage, not fornicating nor taking them for paramours in secret; and whoever denies faith, his work indeed is of no account, and in the hereafter he shall be one of the losers.","translation_id":"Yang demikian itu, karena sesungguhnya orang-orang kafir mengikuti yang batil (sesat) dan sesungguhnya orang-orang yang beriman mengikuti kebenaran dari Tuhan mereka. Demikianlah Allah membuat perumpamaan-perumpamaan bagi manusia.","hasanah_per_verse":810},{"text_madani":"فَإِذَا لَقِيتُمُ الَّذِينَ كَفَرُوا فَضَرْبَ الرِّقَابِ حَتَّىٰ إِذَا أَثْخَنتُمُوهُمْ فَشُدُّوا الْوَثَاقَ فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِدَاءً حَتَّىٰ تَضَعَ الْحَرْبُ أَوْزَارَهَا ۚ ذَٰلِكَ وَلَوْ يَشَاءُ اللَّهُ لَانتَصَرَ مِنْهُمْ وَلَٰكِن لِّيَبْلُوَ بَعْضَكُم بِبَعْضٍ ۗ وَالَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ فَلَن يُضِلَّ أَعْمَالَهُمْ","text_tajweed":"فَإِذَا لَقِيتُمُ [h:5274[ٱ]لَّذِينَ كَفَرُو[s[اْ] فَضَرْبَ [h:12533[ٱ][l[ل]رِّقَابِ حَتَّ[o[ىٰٓ] إِذ[o[َآ] أَثْخَ[f:12534[نت]ُمُوهُمْ فَشُدُّو[s[اْ] [h:12535[ٱ]لْوَثَاقَ فَإِ[g[مّ]َا مَ[g[نّ][i:12536[َۢا ب]َعْدُ وَإِ[g[مّ]َا فِد[o[َا]ٓءً حَتَّىٰ تَضَعَ [h:12537[ٱ]لْحَرْبُ أَوْزَارَهَا‌ۚ ذ[n[َٲ]لِكَ وَلَوْ يَش[o[َا]ٓءُ [h:6988[ٱ]للَّهُ لَ[h:12538[ٱ][f:12538[نت]َصَرَ مِنْهُمْ وَلَ[n[ـٰ]ك[u:12539[ِن ل]ِّيَ[q:12540[بْ]لُوَ[s[اْ] بَعْضَك[c:12541[ُم ب]ِبَعْ[a:12542[ضٍ‌ۗ و]َ[h:37[ٱ]لَّذِينَ قُتِلُو[s[اْ] فِى سَبِيلِ [h:788[ٱ]للَّهِ فَل[a:12543[َن ي]ُضِلَّ أَعْمَ[n[ـٰ]لَهُمْ","translation_en":"So when you meet in battle those who disbelieve, then smite the necks until when you have overcome them, then make (them) prisoners, and afterwards either set them free as a favor or let them ransom (themselves) until the war terminates. That (shall be so); and if Allah had pleased He would certainly have exacted what is due from them, but that He may try some of you by means of others; and (as for) those who are slain in the way of Allah, He will by no means allow their deeds to perish.","translation_id":"Maka apabila kamu bertemu dengan orang-orang yang kafir (di medan perang), maka pukullah batang leher mereka. Selanjutnya apabila kamu telah mengalahkan mereka, tawanlah mereka, dan setelah itu kamu boleh membebaskan mereka atau menerima tebusan sampai perang selesai. Demikianlah, dan sekiranya Allah menghendaki niscaya Dia membinasakan mereka, tetapi Dia hendak menguji kamu satu sama lain. Dan orang-orang yang gugur di jalan Allah, Allah tidak menyia-nyiakan amal mereka.","hasanah_per_verse":1670},{"text_madani":"سَيَهْدِيهِمْ وَيُصْلِحُ بَالَهُمْ","text_tajweed":"سَيَهْدِيهِمْ وَيُصْلِحُ بَالَهُمْ","translation_en":"He will guide them and improve their condition.","translation_id":"Allah akan memberi petunjuk kepada mereka dan memperbaiki keadaan mereka,","hasanah_per_verse":170},{"text_madani":"وَيُدْخِلُهُمُ الْجَنَّةَ عَرَّفَهَا لَهُمْ","text_tajweed":"وَيُ[q:12544[دْ]خِلُهُمُ [h:12545[ٱ]لْجَ[g[نّ]َةَ عَرَّفَهَا لَهُمْ","translation_en":"And cause them to enter the garden which He has made known to them.","translation_id":"dan memasukkan mereka ke dalam surga yang telah diperkenalkan-Nya kepada mereka.","hasanah_per_verse":200},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِن تَنصُرُوا اللَّهَ يَنصُرْكُمْ وَيُثَبِّتْ أَقْدَامَكُمْ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِ[f:12546[ن ت]َ[f:12547[نص]ُرُو[s[اْ] [h:12548[ٱ]للَّهَ يَ[f:12549[نص]ُرْكُمْ وَيُثَبِّتْ أَ[q:12550[قْ]دَامَكُمْ","translation_en":"O you who believe! if you help (the cause of) Allah, He will help you and make firm your feet.","translation_id":"Wahai orang-orang yang beriman! Jika kamu menolong (agama) Allah, niscaya Dia akan menolongmu dan meneguhkan kedudukanmu.","hasanah_per_verse":460},{"text_madani":"وَالَّذِينَ كَفَرُوا فَتَعْسًا لَّهُمْ وَأَضَلَّ أَعْمَالَهُمْ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ كَفَرُو[s[اْ] فَتَعْ[u:12551[سًا ل]َّهُمْ وَأَضَلَّ أَعْمَ[n[ـٰ]لَهُمْ","translation_en":"And (as for) those who disbelieve, for them is destruction and He has made their deeds ineffective.","translation_id":"Dan orang-orang yang kafir maka celakalah mereka dan Allah menghapus segala amalnya.","hasanah_per_verse":300},{"text_madani":"ذَٰلِكَ بِأَنَّهُمْ كَرِهُوا مَا أَنزَلَ اللَّهُ فَأَحْبَطَ أَعْمَالَهُمْ","text_tajweed":"ذ[n[َٲ]لِكَ بِأَ[g[نّ]َهُمْ كَرِهُو[s[اْ] م[o[َآ] أَ[f:471[نز]َلَ [h:472[ٱ]للَّهُ فَأَحْبَطَ أَعْمَ[n[ـٰ]لَهُمْ","translation_en":"That is because they hated what Allah revealed, so He rendered their deeds null.","translation_id":"Yang demikian itu karena mereka membenci apa (Al-Qur'an) yang diturunkan Allah, maka Allah menghapus segala amal mereka.","hasanah_per_verse":350},{"text_madani":"أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِن قَبْلِهِمْ ۚ دَمَّرَ اللَّهُ عَلَيْهِمْ ۖ وَلِلْكَافِرِينَ أَمْثَالُهَا","text_tajweed":"۞ أَفَلَمْ يَسِيرُو[s[اْ] فِى [h:44[ٱ]لْأَرْضِ فَيَ[f:6853[نظ]ُرُو[s[اْ] كَيْفَ كَانَ عَ[n[ـٰ]قِبَةُ [h:6854[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ‌ۚ دَ[g[مّ]َرَ [h:12552[ٱ]للَّهُ عَلَيْهِمْ‌ۖ وَلِلْكَ[n[ـٰ]فِرِينَ أَمْثَ[n[ـٰ]لُهَا","translation_en":"Have they not then journeyed in the land and seen how was the end of those before them: Allah brought down destruction upon them, and the unbelievers shall have the like of it.","translation_id":"Maka apakah mereka tidak pernah mengadakan perjalanan di bumi sehingga dapat memperhatikan bagaimana kesudahan orang-orang yang sebelum mereka. Allah telah membinasakan mereka, dan bagi orang-orang kafir akan menerima (nasib) yang serupa itu.","hasanah_per_verse":750},{"text_madani":"ذَٰلِكَ بِأَنَّ اللَّهَ مَوْلَى الَّذِينَ آمَنُوا وَأَنَّ الْكَافِرِينَ لَا مَوْلَىٰ لَهُمْ","text_tajweed":"ذ[n[َٲ]لِكَ بِأَ[g[نّ]َ [h:897[ٱ]للَّهَ مَوْلَى [h:12553[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَأَ[g[نّ]َ [h:12554[ٱ]لْكَ[n[ـٰ]فِرِينَ لَا مَوْلَىٰ لَهُمْ","translation_en":"That is because Allah is the Protector of those who believe, and because the unbelievers shall have no protector for them.","translation_id":"Yang demikian itu karena Allah pelindung bagi orang-orang yang beriman; sedang orang-orang kafir tidak ada pelindung bagi mereka.","hasanah_per_verse":440},{"text_madani":"إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ۖ وَالَّذِينَ كَفَرُوا يَتَمَتَّعُونَ وَيَأْكُلُونَ كَمَا تَأْكُلُ الْأَنْعَامُ وَالنَّارُ مَثْوًى لَّهُمْ","text_tajweed":"إِ[g[نّ]َ [h:80[ٱ]للَّهَ يُ[q:8947[دْ]خِلُ [h:8948[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ جَ[g[نّ]َ[n[ـٰ][f:119[تٍ ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ‌ۖ وَ[h:37[ٱ]لَّذِينَ كَفَرُو[s[اْ] يَتَمَتَّعُونَ وَيَأْكُلُونَ كَمَا تَأْكُلُ [h:12555[ٱ]لْأَنْعَ[n[ـٰ]مُ وَ[h:12556[ٱ][l[ل][g[نّ]َارُ مَثْ[u:12007[وًى ل]َّهُمْ","translation_en":"Surely Allah will make those who believe and do good enter gardens beneath which rivers flow; and those who disbelieve enjoy themselves and eat as the beasts eat, and the fire is their abode.","translation_id":"Sungguh, Allah akan memasukkan orang-orang yang beriman dan mengerjakan kebajikan ke dalam surga yang mengalir di bawahnya sungai-sungai. Dan orang-orang yang kafir menikmati kesenangan (dunia) dan mereka makan seperti hewan makan; dan (kelak) nerakalah tempat tinggal bagi mereka.","hasanah_per_verse":1080},{"text_madani":"وَكَأَيِّن مِّن قَرْيَةٍ هِيَ أَشَدُّ قُوَّةً مِّن قَرْيَتِكَ الَّتِي أَخْرَجَتْكَ أَهْلَكْنَاهُمْ فَلَا نَاصِرَ لَهُمْ","text_tajweed":"وَكَأَيّ[a:2298[ِن م]ِّ[f:4585[ن ق]َرْيَةٍ هِىَ أَشَدُّ قُوَّ[a:12557[ةً م]ِّ[f:12558[ن ق]َرْيَتِكَ [h:12559[ٱ]لَّت[o[ِىٓ] أَخْرَجَتْكَ أَهْلَكْنَ[n[ـٰ]هُمْ فَلَا نَاصِرَ لَهُمْ","translation_en":"And how many a town which was far more powerful than the town of yours which has driven you out: We destroyed them so there was no helper for them.","translation_id":"Dan betapa banyak negeri yang (penduduknya) lebih kuat dari (penduduk) negerimu (Muhammad) yang telah mengusirmu itu. Kami telah membinasakan mereka; maka tidak ada seorang pun yang menolong mereka.","hasanah_per_verse":540},{"text_madani":"أَفَمَن كَانَ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّهِ كَمَن زُيِّنَ لَهُ سُوءُ عَمَلِهِ وَاتَّبَعُوا أَهْوَاءَهُم","text_tajweed":"أَفَمَ[f:6273[ن ك]َانَ عَلَىٰ بَيِّنَ[a:4097[ةٍ م]ّ[u:192[ِن ر]َّبِّه[n[ِۦ] كَمَ[f:12560[ن ز]ُيِّنَ لَهُ[n[ۥ] س[o[ُو]ٓءُ عَمَلِه[n[ِۦ] وَ[h:2433[ٱ]تَّبَع[o[ُوٓ][s[اْ] أَهْو[o[َا]ٓءَهُم","translation_en":"What! is he who has a clear argument from his Lord like him to whom the evil of his work is made fairseeming: and they follow their low desires.","translation_id":"Maka apakah orang yang berpegang pada keterangan yang datang dari Tuhannya sama dengan orang yang dijadikan terasa indah baginya perbuatan buruknya itu dan mengikuti keinginannya?","hasanah_per_verse":480},{"text_madani":"مَّثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ ۖ فِيهَا أَنْهَارٌ مِّن مَّاءٍ غَيْرِ آسِنٍ وَأَنْهَارٌ مِّن لَّبَنٍ لَّمْ يَتَغَيَّرْ طَعْمُهُ وَأَنْهَارٌ مِّنْ خَمْرٍ لَّذَّةٍ لِّلشَّارِبِينَ وَأَنْهَارٌ مِّنْ عَسَلٍ مُّصَفًّى ۖ وَلَهُمْ فِيهَا مِن كُلِّ الثَّمَرَاتِ وَمَغْفِرَةٌ مِّن رَّبِّهِمْ ۖ كَمَنْ هُوَ خَالِدٌ فِي النَّارِ وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ","text_tajweed":"مَّثَلُ [h:7002[ٱ]لْجَ[g[نّ]َةِ [h:7003[ٱ]لَّتِى وُعِدَ [h:7004[ٱ]لْمُتَّقُونَ‌ۖ فِيه[o[َآ] أَنْهَ[n[ـٰ][a:12561[رٌ م]ّ[a:840[ِن م]ّ[o[َا]ٓءٍ غَيْرِ ءَاسِ[a:12562[نٍ و]َأَنْهَ[n[ـٰ][a:12563[رٌ م]ّ[u:12564[ِن ل]َّبَ[u:12565[نٍ ل]َّمْ يَتَغَيَّرْ طَعْمُهُ[n[ۥ] وَأَنْهَ[n[ـٰ][a:12563[رٌ م]ِّنْ خَمْ[u:12566[رٍ ل]َّذَّ[u:11361[ةٍ ل]ِّلشَّ[n[ـٰ]رِبِينَ وَأَنْهَ[n[ـٰ][a:12563[رٌ م]ِّنْ عَسَ[a:12567[لٍ م]ُّصَف[a:12568[ًّى‌ۖ و]َلَهُمْ فِيهَا مِ[f:843[ن ك]ُلِّ [h:1571[ٱ][l[ل]ثَّمَر[n[َٲ]تِ وَمَغْفِرَ[a:12569[ةٌ م]ّ[u:22[ِن ر]َّبِّهِمْ‌ۖ كَمَنْ هُوَ خَ[n[ـٰ]لِ[f:12570[دٌ ف]ِى [h:4674[ٱ][l[ل][g[نّ]َارِ وَسُقُو[s[اْ] م[o[َا]ٓءً حَمِي[f:12571[مًا ف]َقَطَّعَ أَمْع[o[َا]ٓءَهُمْ","translation_en":"A parable of the garden which those guarding (against evil) are promised: Therein are rivers of water that does not alter, and rivers of milk the taste whereof does not change, and rivers of drink delicious to those who drink, and rivers of honey clarified and for them therein are all fruits and protection from their Lord. (Are these) like those who abide in the fire and who are made to drink boiling water so it rends their bowels asunder.","translation_id":"Perumpamaan taman surga yang dijanjikan kepada orang-orang yang bertakwa; di sana ada sungai-sungai yang airnya tidak payau, dan sungai-sungai air susu yang tidak berubah rasanya, dan sungai-sungai khamar (anggur yang tidak memabukkan) yang lezat rasanya bagi peminumnya dan sungai-sungai madu yang murni. Di dalamnya mereka memperoleh segala macam buah-buahan dan ampunan dari Tuhan mereka. Samakah mereka dengan orang yang kekal dalam neraka, dan diberi minuman dengan air yang mendidih sehingga ususnya terpotong-potong?","hasanah_per_verse":1720},{"text_madani":"وَمِنْهُم مَّن يَسْتَمِعُ إِلَيْكَ حَتَّىٰ إِذَا خَرَجُوا مِنْ عِندِكَ قَالُوا لِلَّذِينَ أُوتُوا الْعِلْمَ مَاذَا قَالَ آنِفًا ۚ أُولَٰئِكَ الَّذِينَ طَبَعَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَاتَّبَعُوا أَهْوَاءَهُمْ","text_tajweed":"وَمِنْه[w:1106[ُم م]ّ[a:3986[َن ي]َسْتَمِعُ إِلَيْكَ حَتَّ[o[ىٰٓ] إِذَا خَرَجُو[s[اْ] مِنْ عِ[f:2954[ند]ِكَ قَالُو[s[اْ] لِلَّذِينَ أُوتُو[s[اْ] [h:7379[ٱ]لْعِلْمَ مَاذَا قَالَ ءَانِفًا‌ۚ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ [h:51[ٱ]لَّذِينَ طَبَعَ [h:3271[ٱ]للَّهُ عَلَىٰ قُلُوبِهِمْ وَ[h:2433[ٱ]تَّبَع[o[ُوٓ][s[اْ] أَهْو[o[َا]ٓءَهُمْ","translation_en":"And there are those of them who seek to listen to you, until when they go forth from you, they say to those who have been given the knowledge: What was it that he said just now? These are they upon whose hearts Allah has set a seal and they follow their low desires.","translation_id":"Dan di antara mereka ada orang yang mendengarkan perkataanmu (Muhammad), tetapi apabila mereka telah keluar dari sisimu mereka berkata kepada orang yang telah diberi ilmu (sahabat-sahabat Nabi), “Apakah yang dikatakannya tadi?” Mereka itulah orang-orang yang dikunci hatinya oleh Allah dan mengikuti keinginannya.","hasanah_per_verse":1040},{"text_madani":"وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى وَآتَاهُمْ تَقْوَاهُمْ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ [h:12572[ٱ]هْتَدَوْ[s[اْ] زَادَهُمْ هُ[a:12573[دًى و]َءَاتَ[n[ـٰ]هُمْ تَ[q:12574[قْ]وَ[n[ٮٰ]هُمْ","translation_en":"And (as for) those who follow the right direction, He increases them in guidance and gives them their guarding (against evil).","translation_id":"Dan orang-orang yang mendapat petunjuk, Allah akan menambah petunjuk kepada mereka dan menganugerahi ketakwaan mereka.","hasanah_per_verse":320},{"text_madani":"فَهَلْ يَنظُرُونَ إِلَّا السَّاعَةَ أَن تَأْتِيَهُم بَغْتَةً ۖ فَقَدْ جَاءَ أَشْرَاطُهَا ۚ فَأَنَّىٰ لَهُمْ إِذَا جَاءَتْهُمْ ذِكْرَاهُمْ","text_tajweed":"فَهَلْ يَ[f:1141[نظ]ُرُونَ إِلَّا [h:12296[ٱ][l[ل]سَّاعَةَ أَ[f:6843[ن ت]َأْتِيَه[c:12297[ُم ب]َغْتَ[f:12575[ةً‌ۖ ف]َقَ[q:563[دْ] ج[o[َا]ٓءَ أَشْرَاطُهَا‌ۚ فَأَ[g[نّ]َىٰ لَهُمْ إِذَا ج[o[َا]ٓءَتْهُمْ ذِكْرَ[n[ٮٰ]هُمْ","translation_en":"Do they then wait for aught but the hour that it should come to them all of a sudden? Now indeed the tokens of it have (already) come, but how shall they have their reminder when it comes on them?","translation_id":"Maka apalagi yang mereka tunggu-tunggu selain hari Kiamat, yang akan datang kepada mereka secara tiba-tiba, karena tanda-tandanya sungguh telah datang. Maka apa gunanya bagi mereka kesadaran mereka itu apabila (hari Kiamat) itu sudah datang?","hasanah_per_verse":650},{"text_madani":"فَاعْلَمْ أَنَّهُ لَا إِلَٰهَ إِلَّا اللَّهُ وَاسْتَغْفِرْ لِذَنبِكَ وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ۗ وَاللَّهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوَاكُمْ","text_tajweed":"فَ[h:9999[ٱ]عْلَمْ أَ[g[نّ]َهُ[n[ۥ] ل[o[َآ] إِلَ[n[ـٰ]هَ إِلَّا [h:1742[ٱ]للَّهُ وَ[h:2374[ٱ]سْتَغْفِرْ لِذَ[i:11909[نۢب]ِكَ وَلِلْمُؤْمِنِينَ وَ[h:5718[ٱ]لْمُؤْمِنَ[n[ـٰ]تِ‌ۗ وَ[h:72[ٱ]للَّهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوَ[n[ٮٰ]كُمْ","translation_en":"So know that there is no god but Allah, and, ask protection for your fault and for the believing men and the believing women; and Allah knows the place of your returning and the place of your abiding.","translation_id":"Maka ketahuilah, bahwa tidak ada tuhan (yang patut disembah) selain Allah dan mohonlah ampunan atas dosamu dan atas (dosa) orang-orang mukmin, laki-laki dan perempuan. Dan Allah mengetahui tempat usaha dan tempat tinggalmu.","hasanah_per_verse":730},{"text_madani":"وَيَقُولُ الَّذِينَ آمَنُوا لَوْلَا نُزِّلَتْ سُورَةٌ ۖ فَإِذَا أُنزِلَتْ سُورَةٌ مُّحْكَمَةٌ وَذُكِرَ فِيهَا الْقِتَالُ ۙ رَأَيْتَ الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ يَنظُرُونَ إِلَيْكَ نَظَرَ الْمَغْشِيِّ عَلَيْهِ مِنَ الْمَوْتِ ۖ فَأَوْلَىٰ لَهُمْ","text_tajweed":"وَيَقُولُ [h:3629[ٱ]لَّذِينَ ءَامَنُو[s[اْ] لَوْلَا نُزِّلَتْ سُورَ[f:12576[ةٌ‌ۖ ف]َإِذ[o[َآ] أُ[f:5767[نز]ِلَتْ سُورَ[a:12577[ةٌ م]ُّحْكَمَ[a:12578[ةٌ و]َذُكِرَ فِيهَا [h:12579[ٱ]لْقِتَالُ‌ۙ رَأَيْتَ [h:4150[ٱ]لَّذِينَ فِى قُلُوبِه[w:39[ِم م]َّرَ[a:12580[ضٌ ي]َ[f:1141[نظ]ُرُونَ إِلَيْكَ نَظَرَ [h:12581[ٱ]لْمَغْشِىِّ عَلَيْهِ مِنَ [h:10720[ٱ]لْمَوْتِ‌ۖ فَأَوْلَىٰ لَهُمْ","translation_en":"And those who believe say: Why has not a chapter been revealed? But when a decisive chapter is revealed, and fighting is mentioned therein you see those in whose hearts is a disease look to you with the look of one fainting because of death. Woe to them then!","translation_id":"Dan orang-orang yang beriman berkata, “Mengapa tidak ada suatu surah (tentang perintah jihad) yang diturunkan?” Maka apabila ada suatu surah diturunkan yang jelas maksudnya dan di dalamnya tersebut (perintah) perang, engkau melihat orang-orang yang di dalam hatinya ada penyakit akan memandang kepadamu seperti pandangan orang yang pingsan karena takut mati. Tetapi itu lebih pantas bagi mereka.","hasanah_per_verse":1170},{"text_madani":"طَاعَةٌ وَقَوْلٌ مَّعْرُوفٌ ۚ فَإِذَا عَزَمَ الْأَمْرُ فَلَوْ صَدَقُوا اللَّهَ لَكَانَ خَيْرًا لَّهُمْ","text_tajweed":"طَاعَ[a:12582[ةٌ و]َقَوْ[a:12583[لٌ م]َّعْرُو[f:12584[فٌ‌ۚ ف]َإِذَا عَزَمَ [h:12585[ٱ]لْأَمْرُ فَلَوْ صَدَقُو[s[اْ] [h:12586[ٱ]للَّهَ لَكَانَ خَيْ[u:2160[رًا ل]َّهُمْ","translation_en":"Obedience and a gentle word (was proper); but when the affair becomes settled, then if they remain true to Allah it would certainly be better for them.","translation_id":"(Yang lebih baik bagi mereka adalah) taat (kepada Allah) dan bertutur kata yang baik. Sebab apabila perintah (perang) ditetapkan (mereka tidak menyukainya). Padahal jika mereka benar-benar (beriman) kepada Allah, niscaya yang demikian itu lebih baik bagi mereka.","hasanah_per_verse":480},{"text_madani":"فَهَلْ عَسَيْتُمْ إِن تَوَلَّيْتُمْ أَن تُفْسِدُوا فِي الْأَرْضِ وَتُقَطِّعُوا أَرْحَامَكُمْ","text_tajweed":"فَهَلْ عَسَيْتُمْ إِ[f:12587[ن ت]َوَلَّيْتُمْ أَ[f:12588[ن ت]ُفْسِدُو[s[اْ] فِى [h:44[ٱ]لْأَرْضِ وَتُقَطِّع[o[ُوٓ][s[اْ] أَرْحَامَكُمْ","translation_en":"But if you held command, you were sure to make mischief in the land and cut off the ties of kinship!","translation_id":"Maka apakah sekiranya kamu berkuasa, kamu akan berbuat kerusakan di bumi dan memutuskan hubungan kekeluargaan?","hasanah_per_verse":450},{"text_madani":"أُولَٰئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ فَأَصَمَّهُمْ وَأَعْمَىٰ أَبْصَارَهُمْ","text_tajweed":"أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ [h:51[ٱ]لَّذِينَ لَعَنَهُمُ [h:462[ٱ]للَّهُ فَأَصَ[g[مّ]َهُمْ وَأَعْمَ[o[ىٰٓ] أَ[q:76[بْ]صَ[n[ـٰ]رَهُمْ","translation_en":"Those it is whom Allah has cursed so He has made them deaf and blinded their eyes.","translation_id":"Mereka itulah orang-orang yang dikutuk Allah; lalu dibuat tuli (pendengarannya) dan dibutakan penglihatannya.","hasanah_per_verse":370},{"text_madani":"أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ أَمْ عَلَىٰ قُلُوبٍ أَقْفَالُهَا","text_tajweed":"أَفَلَا يَتَدَبَّرُونَ [h:2968[ٱ]لْقُرْءَانَ أَمْ عَلَىٰ قُلُوبٍ أَ[q:12589[قْ]فَالُهَآ","translation_en":"Do they not then reflect on the Quran? Nay, on the hearts there are locks.","translation_id":"Maka tidakkah mereka menghayati Al-Qur'an ataukah hati mereka sudah terkunci?","hasanah_per_verse":330},{"text_madani":"إِنَّ الَّذِينَ ارْتَدُّوا عَلَىٰ أَدْبَارِهِم مِّن بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَى ۙ الشَّيْطَانُ سَوَّلَ لَهُمْ وَأَمْلَىٰ لَهُمْ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ [h:12590[ٱ]رْتَدُّو[s[اْ] عَلَ[o[ىٰٓ] أَ[q:7778[دْ]بَ[n[ـٰ]رِه[w:12591[ِم م]ّ[i:146[ِنۢ ب]َعْدِ مَا تَبَيَّنَ لَهُمُ [h:12592[ٱ]لْهُدَى‌ۙ [h:12593[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ سَوَّلَ لَهُمْ وَأَمْلَىٰ لَهُمْ","translation_en":"Surely (as for) those who return on their backs after that guidance has become manifest to them, the Shaitan has made it a light matter to them; and He gives them respite.","translation_id":"Sesungguhnya orang-orang yang berbalik (kepada kekafiran) setelah petunjuk itu jelas bagi mereka, setanlah yang merayu mereka dan memanjangkan angan-angan mereka.","hasanah_per_verse":630},{"text_madani":"ذَٰلِكَ بِأَنَّهُمْ قَالُوا لِلَّذِينَ كَرِهُوا مَا نَزَّلَ اللَّهُ سَنُطِيعُكُمْ فِي بَعْضِ الْأَمْرِ ۖ وَاللَّهُ يَعْلَمُ إِسْرَارَهُمْ","text_tajweed":"ذ[n[َٲ]لِكَ بِأَ[g[نّ]َهُمْ قَالُو[s[اْ] لِلَّذِينَ كَرِهُو[s[اْ] مَا نَزَّلَ [h:4797[ٱ]للَّهُ سَنُطِيعُكُمْ فِى بَعْضِ [h:12594[ٱ]لْأَمْرِ‌ۖ وَ[h:72[ٱ]للَّهُ يَعْلَمُ إِسْرَارَهُمْ","translation_en":"That is because they say to those who hate what Allah has revealed: We will obey you in some of the affairs; and Allah knows their secrets.","translation_id":"Yang demikian itu, karena sesungguhnya mereka telah mengatakan kepada orang-orang (Yahudi) yang tidak senang kepada apa yang diturunkan Allah, “Kami akan mematuhi kamu dalam beberapa urusan,” tetapi Allah mengetahui rahasia mereka.","hasanah_per_verse":650},{"text_madani":"فَكَيْفَ إِذَا تَوَفَّتْهُمُ الْمَلَائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ","text_tajweed":"فَكَيْفَ إِذَا تَوَفَّتْهُمُ [h:12595[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَ[q:5380[دْ]بَ[n[ـٰ]رَهُمْ","translation_en":"But how will it be when the angels cause them to die smiting their backs.","translation_id":"Maka bagaimana (nasib mereka) apa-bila malaikat (maut) mencabut nyawa mereka, memukul wajah dan punggung mereka?","hasanah_per_verse":410},{"text_madani":"ذَٰلِكَ بِأَنَّهُمُ اتَّبَعُوا مَا أَسْخَطَ اللَّهَ وَكَرِهُوا رِضْوَانَهُ فَأَحْبَطَ أَعْمَالَهُمْ","text_tajweed":"ذ[n[َٲ]لِكَ بِأَ[g[نّ]َهُمُ [h:12596[ٱ]تَّبَعُو[s[اْ] م[o[َآ] أَسْخَطَ [h:12597[ٱ]للَّهَ وَكَرِهُو[s[اْ] رِضْو[n[َٲ]نَهُ[n[ۥ] فَأَحْبَطَ أَعْمَ[n[ـٰ]لَهُمْ","translation_en":"That is because they follow what is displeasing to Allah and are averse to His pleasure, therefore He has made null their deeds.","translation_id":"Yang demikian itu, karena sesungguhnya mereka mengikuti apa yang menimbulkan kemurkaan Allah dan membenci (apa yang menimbulkan) keridhaan-Nya; sebab itu Allah menghapus segala amal mereka.","hasanah_per_verse":480},{"text_madani":"أَمْ حَسِبَ الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ أَن لَّن يُخْرِجَ اللَّهُ أَضْغَانَهُمْ","text_tajweed":"أَمْ حَسِبَ [h:10282[ٱ]لَّذِينَ فِى قُلُوبِه[w:39[ِم م]َّرَضٌ أ[u:8842[َن ل]ّ[a:12598[َن ي]ُخْرِجَ [h:12599[ٱ]للَّهُ أَضْغَ[n[ـٰ]نَهُمْ","translation_en":"Or do those in whose hearts is a disease think that Allah will not bring forth their spite?","translation_id":"Atau apakah orang-orang yang dalam hatinya ada penyakit mengira bahwa Allah tidak akan menampakkan kedengkian mereka?","hasanah_per_verse":400},{"text_madani":"وَلَوْ نَشَاءُ لَأَرَيْنَاكَهُمْ فَلَعَرَفْتَهُم بِسِيمَاهُمْ ۚ وَلَتَعْرِفَنَّهُمْ فِي لَحْنِ الْقَوْلِ ۚ وَاللَّهُ يَعْلَمُ أَعْمَالَكُمْ","text_tajweed":"وَلَوْ نَش[o[َا]ٓءُ لَأَرَيْنَ[n[ـٰ]كَهُمْ فَلَعَرَفْتَه[c:12600[ُم ب]ِسِيمَ[n[ـٰ]هُمْ‌ۚ وَلَتَعْرِفَ[g[نّ]َهُمْ فِى لَحْنِ [h:12601[ٱ]لْقَوْلِ‌ۚ وَ[h:72[ٱ]للَّهُ يَعْلَمُ أَعْمَ[n[ـٰ]لَكُمْ","translation_en":"And if We please We would have made you know them so that you would certainly have recognized them by their marks and most certainly you can recognize them by the intent of (their) speech; and Allah knows your deeds.","translation_id":"Dan sekiranya Kami menghendaki, niscaya Kami perlihatkan mereka kepadamu (Muhammad) sehingga engkau benar-benar dapat mengenal mereka dengan tanda-tandanya. Dan engkau benar-benar akan mengenal mereka dari nada bicaranya, dan Allah mengetahui segala amal perbuatan kamu.","hasanah_per_verse":660},{"text_madani":"وَلَنَبْلُوَنَّكُمْ حَتَّىٰ نَعْلَمَ الْمُجَاهِدِينَ مِنكُمْ وَالصَّابِرِينَ وَنَبْلُوَ أَخْبَارَكُمْ","text_tajweed":"وَلَنَ[q:791[بْ]لُوَ[g[نّ]َكُمْ حَتَّىٰ نَعْلَمَ [h:12602[ٱ]لْمُجَ[n[ـٰ]هِدِينَ مِ[f:344[نك]ُمْ وَ[h:918[ٱ][l[ل]صَّ[n[ـٰ]بِرِينَ وَنَ[q:12603[بْ]لُو[o[َ[s[اْ]] أَخْبَارَكُمْ","translation_en":"And most certainly We will try you until We have known those among you who exert themselves hard, and the patient, and made your case manifest.","translation_id":"Dan sungguh, Kami benar-benar akan menguji kamu sehingga Kami mengetahui orang-orang yang benar-benar berjihad dan bersabar di antara kamu; dan akan Kami uji perihal kamu.","hasanah_per_verse":500},{"text_madani":"إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَن سَبِيلِ اللَّهِ وَشَاقُّوا الرَّسُولَ مِن بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَىٰ لَن يَضُرُّوا اللَّهَ شَيْئًا وَسَيُحْبِطُ أَعْمَالَهُمْ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ كَفَرُو[s[اْ] وَصَدُّو[s[اْ] عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ وَش[m[َا]ٓقُّو[s[اْ] [h:12604[ٱ][l[ل]رَّسُولَ م[i:146[ِنۢ ب]َعْدِ مَا تَبَيَّنَ لَهُمُ [h:12592[ٱ]لْهُدَىٰ ل[a:2438[َن ي]َضُرُّو[s[اْ] [h:2439[ٱ]للَّهَ شَيْـ[a:12605[ـًٔا و]َسَيُحْبِطُ أَعْمَ[n[ـٰ]لَهُمْ","translation_en":"Surely those who disbelieve and turn away from Allah's way and oppose the Messenger after that guidance has become clear to them cannot harm Allah in any way, and He will make null their deeds.","translation_id":"Sesungguhnya orang-orang yang kafir dan menghalang-halangi (orang lain) dari jalan Allah serta memusuhi rasul setelah ada petunjuk yang jelas bagi mereka, mereka tidak akan dapat memberi mudarat (bahaya) kepada Allah sedikit pun. Dan kelak Allah menghapus segala amal mereka.","hasanah_per_verse":860},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَلَا تُبْطِلُوا أَعْمَالَكُمْ","text_tajweed":"۞ يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] أَطِيعُو[s[اْ] [h:1855[ٱ]للَّهَ وَأَطِيعُو[s[اْ] [h:2865[ٱ][l[ل]رَّسُولَ وَلَا تُ[q:1546[بْ]طِل[o[ُوٓ][s[اْ] أَعْمَ[n[ـٰ]لَكُمْ","translation_en":"O you who believe! obey Allah and obey the Messenger, and do not make your deeds of no effect.","translation_id":"Wahai orang-orang yang beriman! Taatlah kepada Allah dan taatlah kepada Rasul dan janganlah kamu merusakkan segala amalmu.","hasanah_per_verse":550},{"text_madani":"إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَن سَبِيلِ اللَّهِ ثُمَّ مَاتُوا وَهُمْ كُفَّارٌ فَلَن يَغْفِرَ اللَّهُ لَهُمْ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ كَفَرُو[s[اْ] وَصَدُّو[s[اْ] عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ ثُ[g[مّ]َ مَاتُو[s[اْ] وَهُمْ كُفَّا[f:2095[رٌ ف]َل[a:5740[َن ي]َغْفِرَ [h:5741[ٱ]للَّهُ لَهُمْ","translation_en":"Surely those who disbelieve and turn away from Allah's way, then they die while they are unbelievers, Allah will by no means forgive them.","translation_id":"Sesungguhnya orang-orang yang kafir dan menghalang-halangi (orang lain) dari jalan Allah kemudian mereka mati dalam keadaan kafir, maka Allah tidak akan mengampuni mereka.","hasanah_per_verse":550},{"text_madani":"فَلَا تَهِنُوا وَتَدْعُوا إِلَى السَّلْمِ وَأَنتُمُ الْأَعْلَوْنَ وَاللَّهُ مَعَكُمْ وَلَن يَتِرَكُمْ أَعْمَالَكُمْ","text_tajweed":"فَلَا تَهِنُو[s[اْ] وَتَ[q:12606[دْ]ع[o[ُوٓ][s[اْ] إِلَى [h:12607[ٱ][l[ل]سَّلْمِ وَأَ[f:2262[نت]ُمُ [h:2263[ٱ]لْأَعْلَوْنَ وَ[h:72[ٱ]للَّهُ مَعَكُمْ وَل[a:12608[َن ي]َتِرَكُمْ أَعْمَ[n[ـٰ]لَكُمْ","translation_en":"And be not slack so as to cry for peace and you have the upper hand, and Allah is with you, and He will not bring your deeds to naught.","translation_id":"Maka janganlah kamu lemah dan mengajak damai karena kamulah yang lebih unggul dan Allah (pun) beserta kamu dan Dia tidak akan mengurangi segala amalmu.","hasanah_per_verse":580},{"text_madani":"إِنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ ۚ وَإِن تُؤْمِنُوا وَتَتَّقُوا يُؤْتِكُمْ أُجُورَكُمْ وَلَا يَسْأَلْكُمْ أَمْوَالَكُمْ","text_tajweed":"إِ[g[نّ]َمَا [h:12609[ٱ]لْحَيَ[s[و][n[ٲ]ةُ [h:1156[ٱ][l[ل]دُّنْيَا لَعِ[a:4002[بٌ و]َلَهْ[a:12610[وٌ‌ۚ و]َإِ[f:2455[ن ت]ُؤْمِنُو[s[اْ] وَتَتَّقُو[s[اْ] يُؤْتِكُمْ أُجُورَكُمْ وَلَا يَسْــَٔلْكُمْ أَمْو[n[َٲ]لَكُمْ","translation_en":"The life of this world is only idle sport and play, and if you believe and guard (against evil) He will give you your rewards, and will not ask of you your possessions.","translation_id":"Sesungguhnya kehidupan dunia itu hanyalah permainan dan senda gurau. Jika kamu beriman serta bertakwa, Allah akan memberikan pahala kepadamu dan Dia tidak akan meminta hartamu.","hasanah_per_verse":650},{"text_madani":"إِن يَسْأَلْكُمُوهَا فَيُحْفِكُمْ تَبْخَلُوا وَيُخْرِجْ أَضْغَانَكُمْ","text_tajweed":"إ[a:12611[ِن ي]َسْــَٔلْكُمُوهَا فَيُحْفِكُمْ تَ[q:12612[بْ]خَلُو[s[اْ] وَيُخْرِ[q:12613[جْ] أَضْغَ[n[ـٰ]نَكُمْ","translation_en":"If He should ask you for it and urge you, you will be niggardly, and He will bring forth your malice.","translation_id":"Sekiranya Dia meminta harta kepadamu lalu mendesak kamu (agar memberikan semuanya) niscaya kamu akan kikir dan Dia akan menampakkan kedengkianmu.","hasanah_per_verse":350},{"text_madani":"هَا أَنتُمْ هَٰؤُلَاءِ تُدْعَوْنَ لِتُنفِقُوا فِي سَبِيلِ اللَّهِ فَمِنكُم مَّن يَبْخَلُ ۖ وَمَن يَبْخَلْ فَإِنَّمَا يَبْخَلُ عَن نَّفْسِهِ ۚ وَاللَّهُ الْغَنِيُّ وَأَنتُمُ الْفُقَرَاءُ ۚ وَإِن تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُونُوا أَمْثَالَكُم","text_tajweed":"هَ[o[ـٰٓ]أَ[f:1998[نت]ُمْ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ تُ[q:11790[دْ]عَوْنَ لِتُ[f:12614[نف]ِقُو[s[اْ] فِى سَبِيلِ [h:788[ٱ]للَّهِ فَمِ[f:12615[نك][w:12616[ُم م]ّ[a:12617[َن ي]َ[q:12618[بْ]خَلُ‌ۖ وَم[a:12619[َن ي]َ[q:12620[بْ]خَلْ فَإِ[g[نّ]َمَا يَ[q:12618[بْ]خَلُ ع[a:5890[َن ن]َّفْسِه[n[ِۦ]‌ۚ وَ[h:72[ٱ]للَّهُ [h:12621[ٱ]لْغَنِىُّ وَأَ[f:2262[نت]ُمُ [h:12622[ٱ]لْفُقَر[o[َا]ٓءُ‌ۚ وَإِ[f:12623[ن ت]َتَوَلَّوْ[s[اْ] يَسْتَ[q:12624[بْ]دِلْ قَوْمًا غَيْرَكُمْ ثُ[g[مّ]َ لَا يَكُون[o[ُوٓ][s[اْ] أَمْثَ[n[ـٰ]لَكُم","translation_en":"Behold! you are those who are called upon to spend in Allah's way, but among you are those who are niggardly, and whoever is niggardly is niggardly against his own soul; and Allah is Self-sufficient and you have need (of Him), and if you turn back He will bring in your place another people, then they will not be like you.","translation_id":"Ingatlah, kamu adalah orang-orang yang diajak untuk menginfakkan (hartamu) di jalan Allah. Lalu di antara kamu ada orang yang kikir, dan barangsiapa kikir maka sesungguhnya dia kikir terhadap dirinya sendiri. Dan Allah-lah Yang Mahakaya dan kamulah yang membutuhkan (karunia-Nya). Dan jika kamu berpaling (dari jalan yang benar) Dia akan menggantikan (kamu) dengan kaum yang lain, dan mereka tidak akan (durhaka) seperti kamu (ini).","hasanah_per_verse":1290}]}
