{"chapter_number":29,"name_simple":"Al-'Ankabut","name_meaning":{"text":"The Spider","en":"The Spider","id":"Laba-laba"},"verses_count":69,"hasanah":43170,"verses":[{"text_madani":"الم","text_tajweed":"ا[m[لٓ][m[مٓ]","translation_en":"Alif Lam Mim.","translation_id":"Alif Lam Mim","hasanah_per_verse":30},{"text_madani":"أَحَسِبَ النَّاسُ أَن يُتْرَكُوا أَن يَقُولُوا آمَنَّا وَهُمْ لَا يُفْتَنُونَ","text_tajweed":"أَحَسِبَ [h:10277[ٱ][l[ل][g[نّ]َاسُ أ[a:10278[َن ي]ُتْرَك[o[ُوٓ][s[اْ] أ[a:6263[َن ي]َقُول[o[ُوٓ][s[اْ] ءَامَ[g[نّ]َا وَهُمْ لَا يُفْتَن[p[ُو]نَ","translation_en":"Do men think that they will be left alone on saying, We believe, and not be tried?","translation_id":"Apakah manusia mengira bahwa mereka akan dibiarkan hanya dengan mengatakan, “Kami telah beriman,” dan mereka tidak diuji?","hasanah_per_verse":400},{"text_madani":"وَلَقَدْ فَتَنَّا الَّذِينَ مِن قَبْلِهِمْ ۖ فَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ صَدَقُوا وَلَيَعْلَمَنَّ الْكَاذِبِينَ","text_tajweed":"وَلَقَ[q:341[دْ] فَتَ[g[نّ]َا [h:10279[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ‌ۖ فَلَيَعْلَمَ[g[نّ]َ [h:10280[ٱ]للَّهُ [h:1171[ٱ]لَّذِينَ صَدَقُو[s[اْ] وَلَيَعْلَمَ[g[نّ]َ [h:10281[ٱ]لْكَ[n[ـٰ]ذِب[p[ِي]نَ","translation_en":"And certainly We tried those before them, so Allah will certainly know those who are true and He will certainly know the liars.","translation_id":"Dan sungguh, Kami telah menguji orang-orang sebelum mereka, maka Allah pasti mengetahui orang-orang yang benar dan pasti mengetahui orang-orang yang dusta.","hasanah_per_verse":560},{"text_madani":"أَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ أَن يَسْبِقُونَا ۚ سَاءَ مَا يَحْكُمُونَ","text_tajweed":"أَمْ حَسِبَ [h:10282[ٱ]لَّذِينَ يَعْمَلُونَ [h:2655[ٱ][l[ل]سَّيِّـَٔـاتِ أ[a:10283[َن ي]َسْبِقُونَا‌ۚ س[o[َا]ٓءَ مَا يَحْكُم[p[ُو]نَ","translation_en":"Or do they who work evil think that they will escape Us? Evil is it that they judge!","translation_id":"Ataukah orang-orang yang mengerjakan kejahatan itu mengira bahwa mereka akan luput dari (azab) Kami? Sangatlah buruk apa yang mereka tetapkan itu!","hasanah_per_verse":430},{"text_madani":"مَن كَانَ يَرْجُو لِقَاءَ اللَّهِ فَإِنَّ أَجَلَ اللَّهِ لَآتٍ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ","text_tajweed":"مَ[f:506[ن ك]َانَ يَرْجُو[s[اْ] لِق[o[َا]ٓءَ [h:10284[ٱ]للَّهِ فَإِ[g[نّ]َ أَجَلَ [h:10285[ٱ]للَّهِ لَأَ[a:10286[تٍ‌ۚ و]َهُوَ [h:709[ٱ][l[ل]سَّمِيعُ [h:669[ٱ]لْعَل[p[ِي]مُ","translation_en":"Whoever hopes to meet Allah, the term appointed by Allah will then most surely come; and He is the Hearing, the Knowing.","translation_id":"Barangsiapa mengharap pertemuan dengan Allah, maka sesungguhnya waktu (yang dijanjikan) Allah pasti datang. Dan Dia Yang Maha Mendengar, Maha Mengetahui.","hasanah_per_verse":450},{"text_madani":"وَمَن جَاهَدَ فَإِنَّمَا يُجَاهِدُ لِنَفْسِهِ ۚ إِنَّ اللَّهَ لَغَنِيٌّ عَنِ الْعَالَمِينَ","text_tajweed":"وَمَ[f:10287[ن ج]َ[n[ـٰ]هَدَ فَإِ[g[نّ]َمَا يُجَ[n[ـٰ]هِدُ لِنَفْسِه[o[ِۦٓ‌ۚ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَغَنِىٌّ عَنِ [h:2124[ٱ]لْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"And whoever strives hard, he strives only for his own soul; most surely Allah is Self-sufficient, above (need of) the worlds.","translation_id":"Dan barangsiapa berjihad, maka sesungguhnya jihadnya itu untuk dirinya sendiri. Sungguh, Allah Mahakaya (tidak memerlukan sesuatu) dari seluruh alam.","hasanah_per_verse":420},{"text_madani":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَنُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ وَلَنَجْزِيَنَّهُمْ أَحْسَنَ الَّذِي كَانُوا يَعْمَلُونَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ لَنُكَفِّرَ[g[نّ]َ عَنْهُمْ سَيِّـَٔـاتِهِمْ وَلَنَ[q:7579[جْ]زِيَ[g[نّ]َهُمْ أَحْسَنَ [h:10288[ٱ]لَّذِى كَانُو[s[اْ] يَعْمَل[p[ُو]نَ","translation_en":"And (as for) those who believe and do good, We will most certainly do away with their evil deeds and We will most certainly reward them the best of what they did.","translation_id":"Dan orang-orang yang beriman dan mengerjakan kebajikan, pasti akan Ka-mi hapus kesalahan-kesalahannya dan mereka pasti akan Kami beri balasan yang lebih baik dari apa yang mereka kerjakan.","hasanah_per_verse":700},{"text_madani":"وَوَصَّيْنَا الْإِنسَانَ بِوَالِدَيْهِ حُسْنًا ۖ وَإِن جَاهَدَاكَ لِتُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا ۚ إِلَيَّ مَرْجِعُكُمْ فَأُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ","text_tajweed":"وَوَصَّيْنَا [h:10289[ٱ]لْإِ[f:5969[نس]َ[n[ـٰ]نَ بِو[n[َٲ]لِدَيْهِ حُسْ[a:10290[نًا‌ۖ و]َإِ[f:10291[ن ج]َ[n[ـٰ]هَدَاكَ لِتُشْرِكَ بِى مَا لَيْسَ لَكَ بِه[n[ِۦ] عِلْ[f:10292[مٌ ف]َلَا تُطِعْهُم[o[َآ‌ۚ] إِلَىَّ مَرْجِعُكُمْ فَأُنَبِّئُك[c:10293[ُم ب]ِمَا كُ[f:100[نت]ُمْ تَعْمَل[p[ُو]نَ","translation_en":"And We have enjoined on man goodness to his parents, and if they contend with you that you should associate (others) with Me, of which you have no knowledge, do not obey them, to Me is your return, so I will inform you of what you did.","translation_id":"Dan Kami wajibkan kepada manusia agar (berbuat) kebaikan kepada kedua orang tuanya. Dan jika keduanya memaksamu untuk mempersekutukan Aku dengan sesuatu yang engkau tidak mempunyai ilmu tentang itu, maka janganlah engkau patuhi keduanya. Hanya kepada-Ku tempat kembalimu, dan akan Aku beritakan kepadamu apa yang telah kamu kerjakan.","hasanah_per_verse":900},{"text_madani":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَنُدْخِلَنَّهُمْ فِي الصَّالِحِينَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ لَنُ[q:10294[دْ]خِلَ[g[نّ]َهُمْ فِى [h:10295[ٱ][l[ل]صَّ[n[ـٰ]لِح[p[ِي]نَ","translation_en":"And (as for) those who believe and do good, We will most surely cause them to enter among the good.","translation_id":"Dan orang-orang yang beriman dan mengerjakan kebajikan mereka pasti akan Kami masukkan mereka ke dalam (golongan) orang yang shalih.","hasanah_per_verse":430},{"text_madani":"وَمِنَ النَّاسِ مَن يَقُولُ آمَنَّا بِاللَّهِ فَإِذَا أُوذِيَ فِي اللَّهِ جَعَلَ فِتْنَةَ النَّاسِ كَعَذَابِ اللَّهِ وَلَئِن جَاءَ نَصْرٌ مِّن رَّبِّكَ لَيَقُولُنَّ إِنَّا كُنَّا مَعَكُمْ ۚ أَوَلَيْسَ اللَّهُ بِأَعْلَمَ بِمَا فِي صُدُورِ الْعَالَمِينَ","text_tajweed":"وَمِنَ [h:30[ٱ][l[ل][g[نّ]َاسِ م[a:31[َن ي]َقُولُ ءَامَ[g[نّ]َا بِ[h:32[ٱ]للَّهِ فَإِذ[o[َآ] أُوذِىَ فِى [h:714[ٱ]للَّهِ جَعَلَ فِتْنَةَ [h:10296[ٱ][l[ل][g[نّ]َاسِ كَعَذَابِ [h:10297[ٱ]للَّهِ وَلَئِ[f:10298[ن ج][o[َا]ٓءَ نَصْ[a:10299[رٌ م]ّ[u:770[ِن ر]َّبِّكَ لَيَقُولُ[g[نّ]َ إِ[g[نّ]َا كُ[g[نّ]َا مَعَكُمْ‌ۚ أَوَلَيْسَ [h:10300[ٱ]للَّهُ بِأَعْلَمَ بِمَا فِى صُدُورِ [h:10301[ٱ]لْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"And among men is he who says: We believe in Allah; but when he is persecuted in (the way of) Allah he thinks the persecution of men to be as the chastisement of Allah; and if there come assistance from your Lord, they would most certainly say: Surely we were with you. What! is not Allah the best knower of what is in the breasts of mankind.","translation_id":"Dan di antara manusia ada sebagian yang berkata, “Kami beriman kepada Allah,” tetapi apabila dia disakiti (karena dia beriman) kepada Allah, dia menganggap cobaan manusia itu sebagai siksaan Allah. Dan jika datang pertolongan dari Tuhanmu, niscaya mereka akan berkata, “Sesungguhnya kami bersama kamu.” Bukankah Allah lebih mengetahui apa yang ada di dalam dada semua manusia?","hasanah_per_verse":1200},{"text_madani":"وَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ آمَنُوا وَلَيَعْلَمَنَّ الْمُنَافِقِينَ","text_tajweed":"وَلَيَعْلَمَ[g[نّ]َ [h:10302[ٱ]للَّهُ [h:1171[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَلَيَعْلَمَ[g[نّ]َ [h:10303[ٱ]لْمُنَ[n[ـٰ]فِق[p[ِي]نَ","translation_en":"And most certainly Allah will know those who believe and most certainly He will know the hypocrites.","translation_id":"Dan Allah pasti mengetahui orang-orang yang beriman dan Dia pasti mengetahui orang-orang yang munafik.","hasanah_per_verse":370},{"text_madani":"وَقَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا اتَّبِعُوا سَبِيلَنَا وَلْنَحْمِلْ خَطَايَاكُمْ وَمَا هُم بِحَامِلِينَ مِنْ خَطَايَاهُم مِّن شَيْءٍ ۖ إِنَّهُمْ لَكَاذِبُونَ","text_tajweed":"وَقَالَ [h:614[ٱ]لَّذِينَ كَفَرُو[s[اْ] لِلَّذِينَ ءَامَنُو[s[اْ] [h:10304[ٱ]تَّبِعُو[s[اْ] سَبِيلَنَا وَلْنَحْمِلْ خَطَ[n[ـٰ]يَ[n[ـٰ]كُمْ وَمَا ه[c:10305[ُم ب]ِحَ[n[ـٰ]مِلِينَ مِنْ خَطَ[n[ـٰ]يَ[n[ـٰ]ه[w:10306[ُم م]ِّ[f:2103[ن ش]َىْءٍ‌ۖ إِ[g[نّ]َهُمْ لَكَ[n[ـٰ]ذِب[p[ُو]نَ","translation_en":"And those who disbelieve say to those who believe: Follow our path and we will bear your wrongs. And never shall they be the bearers of any of their wrongs; most surely they are liars.","translation_id":"Dan orang-orang yang kafir berkata kepada orang-orang yang beriman, “Ikutilah jalan kami, dan kami akan memikul dosa-dosamu,” padahal mereka sedikit pun tidak (sanggup) memikul dosa-dosa mereka sendiri. Sesungguhnya mereka benar-benar pendusta.","hasanah_per_verse":860},{"text_madani":"وَلَيَحْمِلُنَّ أَثْقَالَهُمْ وَأَثْقَالًا مَّعَ أَثْقَالِهِمْ ۖ وَلَيُسْأَلُنَّ يَوْمَ الْقِيَامَةِ عَمَّا كَانُوا يَفْتَرُونَ","text_tajweed":"وَلَيَحْمِلُ[g[نّ]َ أَثْقَالَهُمْ وَأَثْقَال[a:10307[اً م]َّعَ أَثْقَالِهِمْ‌ۖ وَلَيُسْــَٔلُ[g[نّ]َ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ عَ[g[مّ]َا كَانُو[s[اْ] يَفْتَر[p[ُو]نَ","translation_en":"And most certainly they shall carry their own burdens, and other burdens with their own burdens, and most certainly they shall be questioned on the resurrection day as to what they forged.","translation_id":"Dan mereka benar-benar akan memikul dosa-dosa mereka sendiri, dan dosa-dosa yang lain bersama dosa mereka, dan pada hari Kiamat mereka pasti akan ditanya tentang kebohongan yang selalu mereka ada-adakan.","hasanah_per_verse":610},{"text_madani":"وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا فَأَخَذَهُمُ الطُّوفَانُ وَهُمْ ظَالِمُونَ","text_tajweed":"وَلَقَ[q:341[دْ] أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِه[n[ِۦ] فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَا[f:10308[مًا ف]َأَخَذَهُمُ [h:10309[ٱ][l[ل]طُّوفَانُ وَهُمْ ظَ[n[ـٰ]لِم[p[ُو]نَ","translation_en":"And certainly We sent Nuh to his people, so he remained among them a thousand years save fifty years. And the deluge overtook them, while they were unjust.","translation_id":"Dan sungguh, Kami telah mengutus Nuh kepada kaumnya, maka dia tinggal bersama mereka selama seribu tahun kurang lima puluh tahun. Kemudian mereka dilanda banjir besar, sedangkan mereka adalah orang-orang yang zhalim.","hasanah_per_verse":690},{"text_madani":"فَأَنجَيْنَاهُ وَأَصْحَابَ السَّفِينَةِ وَجَعَلْنَاهَا آيَةً لِّلْعَالَمِينَ","text_tajweed":"فَأَ[f:4779[نج]َيْنَ[n[ـٰ]هُ وَأَصْحَ[n[ـٰ]بَ [h:10310[ٱ][l[ل]سَّفِينَةِ وَجَعَلْنَ[n[ـٰ]ه[o[َآ] ءَايَ[u:8853[ةً ل]ِّلْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"So We delivered him and the inmates of the ark, and made it a sign to the nations.","translation_id":"Maka Kami selamatkan Nuh dan orang-orang yang berada di kapal itu, dan Kami jadikan (peristiwa) itu sebagai pelajaran bagi semua manusia.","hasanah_per_verse":400},{"text_madani":"وَإِبْرَاهِيمَ إِذْ قَالَ لِقَوْمِهِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ ۖ ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ","text_tajweed":"وَإِ[q:10311[بْ]ر[n[َٲ]هِيمَ إِذْ قَالَ لِقَوْمِهِ [h:10312[ٱ]عْبُدُو[s[اْ] [h:3704[ٱ]للَّهَ وَ[h:4181[ٱ]تَّقُوهُ‌ۖ ذ[n[َٲ]لِكُمْ خَيْ[u:263[رٌ ل]َّكُمْ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ تَعْلَم[p[ُو]نَ","translation_en":"And (We sent) Ibrahim, when he said to his people: Serve Allah and be careful of (your duty to) Him; this is best for you, if you did but know:","translation_id":"Dan (ingatlah) Ibrahim, ketika dia berkata kepada kaumnya, “Sembahlah Allah dan bertakwalah kepada-Nya. Yang demikian itu lebih baik bagimu, jika kamu mengetahui.","hasanah_per_verse":560},{"text_madani":"إِنَّمَا تَعْبُدُونَ مِن دُونِ اللَّهِ أَوْثَانًا وَتَخْلُقُونَ إِفْكًا ۚ إِنَّ الَّذِينَ تَعْبُدُونَ مِن دُونِ اللَّهِ لَا يَمْلِكُونَ لَكُمْ رِزْقًا فَابْتَغُوا عِندَ اللَّهِ الرِّزْقَ وَاعْبُدُوهُ وَاشْكُرُوا لَهُ ۖ إِلَيْهِ تُرْجَعُونَ","text_tajweed":"إِ[g[نّ]َمَا تَعْبُدُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ أَوْثَ[n[ـٰ][a:10313[نًا و]َتَخْلُقُونَ إِفْكًا‌ۚ إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ تَعْبُدُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ لَا يَمْلِكُونَ لَكُمْ رِزْ[f:10314[قًا ف]َ[h:10315[ٱ][q:10315[بْ]تَغُو[s[اْ] عِ[f:264[ند]َ [h:408[ٱ]للَّهِ [h:10316[ٱ][l[ل]رِّزْقَ وَ[h:10317[ٱ]عْبُدُوهُ وَ[h:783[ٱ]شْكُرُو[s[اْ] لَهُ[o[ۥٓ‌ۖ] إِلَيْهِ تُرْجَع[p[ُو]نَ","translation_en":"You only worship idols besides Allah and you create a lie surely they whom you serve besides Allah do not control for you any sustenance, therefore seek the sustenance from Allah and serve Him and be grateful to Him; to Him you shall be brought back.","translation_id":"Sesungguhnya yang kamu sembah selain Allah hanyalah berhala-berhala, dan kamu membuat kebohongan. Sesungguhnya apa yang kamu sembah selain Allah itu tidak mampu memberikan rezeki kepadamu; maka mintalah rezeki dari Allah, dan sembahlah Dia dan bersyukurlah kepada-Nya. Hanya kepada-Nya kamu akan dikembalikan.","hasanah_per_verse":1180},{"text_madani":"وَإِن تُكَذِّبُوا فَقَدْ كَذَّبَ أُمَمٌ مِّن قَبْلِكُمْ ۖ وَمَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ الْمُبِينُ","text_tajweed":"وَإِ[f:10318[ن ت]ُكَذِّبُو[s[اْ] فَقَ[q:563[دْ] كَذَّبَ أُمَ[a:10319[مٌ م]ِّ[f:85[ن ق]َ[q:86[بْ]لِكُمْ‌ۖ وَمَا عَلَى [h:3818[ٱ][l[ل]رَّسُولِ إِلَّا [h:3819[ٱ]لْبَلَ[n[ـٰ]غُ [h:3781[ٱ]لْمُب[p[ِي]نُ","translation_en":"And if you reject (the truth), nations before you did indeed reject (the truth); and nothing is incumbent on the messenger but a plain delivering (of the message).","translation_id":"Dan jika kamu (orang kafir) mendustakan, maka sungguh, umat sebelum kamu juga telah mendustakan (para rasul). Dan kewajiban rasul itu hanyalah menyampaikan (agama Allah) dengan jelas.”","hasanah_per_verse":520},{"text_madani":"أَوَلَمْ يَرَوْا كَيْفَ يُبْدِئُ اللَّهُ الْخَلْقَ ثُمَّ يُعِيدُهُ ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ","text_tajweed":"أَوَلَمْ يَرَوْ[s[اْ] كَيْفَ يُ[q:10320[بْ]دِئُ [h:10321[ٱ]للَّهُ [h:10322[ٱ]لْخَلْقَ ثُ[g[مّ]َ يُعِيدُهُ[o[ۥٓ‌ۚ] إِ[g[نّ]َ ذ[n[َٲ]لِكَ عَلَى [h:412[ٱ]للَّهِ يَس[p[ِي]رٌ","translation_en":"What! do they not consider how Allah originates the creation, then reproduces it? Surely that is easy to Allah.","translation_id":"Dan apakah mereka tidak memperhatikan bagaimana Allah memulai penciptaan (makhluk), kemudian Dia mengulanginya (kembali). Sungguh, yang demikian itu mudah bagi Allah.","hasanah_per_verse":470},{"text_madani":"قُلْ سِيرُوا فِي الْأَرْضِ فَانظُرُوا كَيْفَ بَدَأَ الْخَلْقَ ۚ ثُمَّ اللَّهُ يُنشِئُ النَّشْأَةَ الْآخِرَةَ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","text_tajweed":"قُلْ سِيرُو[s[اْ] فِى [h:44[ٱ]لْأَرْضِ فَ[h:2257[ٱ][f:2257[نظ]ُرُو[s[اْ] كَيْفَ بَدَأَ [h:10323[ٱ]لْخَلْقَ‌ۚ ثُ[g[مّ]َ [h:6078[ٱ]للَّهُ يُ[f:10324[نش]ِئُ [h:10325[ٱ][l[ل][g[نّ]َشْأَةَ [h:10326[ٱ]لْأَخِرَةَ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َد[p[ِي]رٌ","translation_en":"Say: Travel in the earth and see how He makes the first creation, then Allah creates the latter creation; surely Allah has power over all things.","translation_id":"Katakanlah, “Berjalanlah di bumi, maka perhatikanlah bagaimana (Allah) memulai penciptaan (makhluk), kemudian Allah menjadikan kejadian yang akhir. Sungguh, Allah Mahakuasa atas segala sesuatu.","hasanah_per_verse":720},{"text_madani":"يُعَذِّبُ مَن يَشَاءُ وَيَرْحَمُ مَن يَشَاءُ ۖ وَإِلَيْهِ تُقْلَبُونَ","text_tajweed":"يُعَذِّبُ م[a:476[َن ي]َش[o[َا]ٓءُ وَيَرْحَمُ م[a:476[َن ي]َش[o[َا]ٓءُ‌ۖ وَإِلَيْهِ تُ[q:10327[قْ]لَب[p[ُو]نَ","translation_en":"He punishes whom He pleases and has mercy on whom He pleases, and to Him you shall be turned back.","translation_id":"Dia (Allah) mengazab siapa yang Dia kehendaki dan memberi rahmat kepada siapa yang Dia kehendaki, dan hanya kepada-Nya kamu akan dikembalikan.","hasanah_per_verse":320},{"text_madani":"وَمَا أَنتُم بِمُعْجِزِينَ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ ۖ وَمَا لَكُم مِّن دُونِ اللَّهِ مِن وَلِيٍّ وَلَا نَصِيرٍ","text_tajweed":"وَم[o[َآ] أَ[f:428[نت][c:4435[ُم ب]ِمُعْجِزِينَ فِى [h:44[ٱ]لْأَرْضِ وَلَا فِى [h:746[ٱ][l[ل]سَّم[o[َا]ٓءِ‌ۖ وَمَا لَك[w:556[ُم م]ِّ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ م[a:557[ِن و]َلِ[a:558[ىٍّ و]َلَا نَص[p[ِي]رٍ","translation_en":"And you shall not escape in the earth nor in the heaven, and you have neither a protector nor a helper besides Allah.","translation_id":"Dan kamu sama sekali tidak dapat melepaskan diri (dari azab Allah) baik di bumi maupun di langit, dan tidak ada pelindung dan penolong bagimu selain Allah.","hasanah_per_verse":590},{"text_madani":"وَالَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ وَلِقَائِهِ أُولَٰئِكَ يَئِسُوا مِن رَّحْمَتِي وَأُولَٰئِكَ لَهُمْ عَذَابٌ أَلِيمٌ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ كَفَرُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ وَلِق[o[َا]ٓئِه[o[ِۦٓ] أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ يَئِسُو[s[اْ] م[u:10328[ِن ر]َّحْمَتِى وَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ لَهُمْ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"And (as to) those who disbelieve in the communications of Allah and His meeting, they have despaired of My mercy, and these it is that shall have a painful punishment.","translation_id":"Dan orang-orang yang mengingkari ayat-ayat Allah dan pertemuan dengan-Nya, mereka berputus asa dari rahmat-Ku, dan mereka itu akan mendapat azab yang pedih.","hasanah_per_verse":600},{"text_madani":"فَمَا كَانَ جَوَابَ قَوْمِهِ إِلَّا أَن قَالُوا اقْتُلُوهُ أَوْ حَرِّقُوهُ فَأَنجَاهُ اللَّهُ مِنَ النَّارِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يُؤْمِنُونَ","text_tajweed":"فَمَا كَانَ جَوَابَ قَوْمِه[o[ِۦٓ] إِلّ[o[َآ] أَ[f:2304[ن ق]َالُو[s[اْ] [h:10329[ٱ][q:10330[قْ]تُلُوهُ أَوْ حَرِّقُوهُ فَأَ[f:10331[نج]َ[n[ـٰ]هُ [h:10332[ٱ]للَّهُ مِنَ [h:869[ٱ][l[ل][g[نّ]َارِ‌ۚ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:849[تٍ ل]ِّقَوْ[a:4294[مٍ ي]ُؤْمِن[p[ُو]نَ","translation_en":"So naught was the answer of his people except that they said: Slay him or burn him; then Allah delivered him from the fire; most surely there are signs in this for a people who believe.","translation_id":"Maka tidak ada jawaban kaumnya (Ibrahim), selain mengatakan, “Bunuhlah atau bakarlah dia,” lalu Allah menyelamatkannya dari api. Sungguh, pada yang demikian itu pasti terdapat tanda-tanda (kebesaran Allah) bagi orang yang beriman.","hasanah_per_verse":760},{"text_madani":"وَقَالَ إِنَّمَا اتَّخَذْتُم مِّن دُونِ اللَّهِ أَوْثَانًا مَّوَدَّةَ بَيْنِكُمْ فِي الْحَيَاةِ الدُّنْيَا ۖ ثُمَّ يَوْمَ الْقِيَامَةِ يَكْفُرُ بَعْضُكُم بِبَعْضٍ وَيَلْعَنُ بَعْضُكُم بَعْضًا وَمَأْوَاكُمُ النَّارُ وَمَا لَكُم مِّن نَّاصِرِينَ","text_tajweed":"وَقَالَ إِ[g[نّ]َمَا [h:10333[ٱ]تَّخَذْت[w:10334[ُم م]ِّ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ أَوْثَ[n[ـٰ][a:10335[نًا م]َّوَدَّةَ بَيْنِكُمْ فِى [h:441[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا‌ۖ ثُ[g[مّ]َ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ يَكْفُرُ بَعْضُك[c:10336[ُم ب]ِبَعْ[a:10337[ضٍ و]َيَلْعَنُ بَعْضُك[c:1697[ُم ب]َعْ[a:10338[ضًا و]َمَأْوَ[n[ٮٰ]كُمُ [h:10339[ٱ][l[ل][g[نّ]َارُ وَمَا لَك[w:556[ُم م]ّ[a:1813[ِن ن]َّ[n[ـٰ]صِر[p[ِي]نَ","translation_en":"And he said: You have only taken for yourselves idols besides Allah by way of friendship between you in this world's life, then on the resurrection day some of you shall deny others, and some of you shall curse others, and your abode is the fire, and you shall not have any helpers.","translation_id":"Dan dia (Ibrahim) berkata, “Sesungguhnya berhala-berhala yang kamu sembah selain Allah, hanya untuk menciptakan perasaan kasih sayang di antara kamu dalam kehidupan di dunia, kemudian pada hari Kiamat sebagian kamu akan saling mengingkari dan saling mengutuk; dan tempat kembalimu ialah neraka, dan sama sekali tidak ada penolong bagimu.”","hasanah_per_verse":1170},{"text_madani":"فَآمَنَ لَهُ لُوطٌ ۘ وَقَالَ إِنِّي مُهَاجِرٌ إِلَىٰ رَبِّي ۖ إِنَّهُ هُوَ الْعَزِيزُ الْحَكِيمُ","text_tajweed":"۞ فَـَٔـامَنَ لَهُ[n[ۥ] لُو[a:10340[طٌ‌ۘ و]َقَالَ إِ[g[نّ]ِى مُهَاجِرٌ إِلَىٰ رَبّ[o[ِىٓ‌ۖ] إِ[g[نّ]َهُ[n[ۥ] هُوَ [h:1734[ٱ]لْعَزِيزُ [h:681[ٱ]لْحَك[p[ِي]مُ","translation_en":"And Lut believed in Him, and he said: I am fleeing to my Lord, surely He is the Mighty, the Wise.","translation_id":"Maka Luth membenarkan (kenabian Ibrahim). Dan dia (Ibrahim) berkata, “Sesungguhnya aku harus berpindah ke (tempat yang diperintahkan) Tuhanku; sungguh, Dialah Yang Mahaperkasa, Mahabijaksana.”","hasanah_per_verse":440},{"text_madani":"وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ وَجَعَلْنَا فِي ذُرِّيَّتِهِ النُّبُوَّةَ وَالْكِتَابَ وَآتَيْنَاهُ أَجْرَهُ فِي الدُّنْيَا ۖ وَإِنَّهُ فِي الْآخِرَةِ لَمِنَ الصَّالِحِينَ","text_tajweed":"وَوَهَ[q:4212[بْ]نَا لَهُ[o[ۥٓ] إِسْحَ[n[ـٰ]قَ وَيَعْقُوبَ وَجَعَلْنَا فِى ذُرِّيَّتِهِ [h:10341[ٱ][l[ل][g[نّ]ُبُوَّةَ وَ[h:10342[ٱ]لْكِتَ[n[ـٰ]بَ وَءَاتَيْنَ[n[ـٰ]هُ أَ[q:10343[جْ]رَهُ[n[ۥ] فِى [h:599[ٱ][l[ل]دُّنْيَا‌ۖ وَإِ[g[نّ]َهُ[n[ۥ] فِى [h:536[ٱ]لْأَخِرَةِ لَمِنَ [h:686[ٱ][l[ل]صَّ[n[ـٰ]لِح[p[ِي]نَ","translation_en":"And We granted him Ishaq and Yaqoub, and caused the t prophethood and the book to remain in his seed, and We gave him his reward in this world, and in the hereafter he will most surely be among the good.","translation_id":"Dan Kami anugerahkan kepada Ibrahim, Ishak dan Yakub, dan Kami jadikan kenabian dan kitab kepada keturunannya, dan Kami berikan kepadanya balasannya di dunia; dan sesungguhnya dia di akhirat, termasuk orang yang shalih.","hasanah_per_verse":870},{"text_madani":"وَلُوطًا إِذْ قَالَ لِقَوْمِهِ إِنَّكُمْ لَتَأْتُونَ الْفَاحِشَةَ مَا سَبَقَكُم بِهَا مِنْ أَحَدٍ مِّنَ الْعَالَمِينَ","text_tajweed":"وَلُوطًا إِذْ قَالَ لِقَوْمِه[o[ِۦٓ] إِ[g[نّ]َكُمْ لَتَأْتُونَ [h:10344[ٱ]لْفَ[n[ـٰ]حِشَةَ مَا سَبَقَك[c:4828[ُم ب]ِهَا مِنْ أَحَ[a:4829[دٍ م]ِّنَ [h:3475[ٱ]لْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"And (We sent) Lut when he said to his people: Most surely you are guilty of an indecency which none of the nations has ever done before you;","translation_id":"Dan (ingatlah) ketika Luth berkata kepada kaumnya, “Kamu benar-benar melakukan perbuatan yang sangat keji (homoseksual) yang belum pernah dilakukan oleh seorang pun dari umat-umat sebelum kamu.","hasanah_per_verse":570},{"text_madani":"أَئِنَّكُمْ لَتَأْتُونَ الرِّجَالَ وَتَقْطَعُونَ السَّبِيلَ وَتَأْتُونَ فِي نَادِيكُمُ الْمُنكَرَ ۖ فَمَا كَانَ جَوَابَ قَوْمِهِ إِلَّا أَن قَالُوا ائْتِنَا بِعَذَابِ اللَّهِ إِن كُنتَ مِنَ الصَّادِقِينَ","text_tajweed":"أَئِ[g[نّ]َكُمْ لَتَأْتُونَ [h:4830[ٱ][l[ل]رِّجَالَ وَتَ[q:10345[قْ]طَعُونَ [h:10346[ٱ][l[ل]سَّبِيلَ وَتَأْتُونَ فِى نَادِيكُمُ [h:10347[ٱ]لْمُ[f:9107[نك]َرَ‌ۖ فَمَا كَانَ جَوَابَ قَوْمِه[o[ِۦٓ] إِلّ[o[َآ] أَ[f:2304[ن ق]َالُو[s[اْ] [h:10348[ٱ]ئْتِنَا بِعَذَابِ [h:10349[ٱ]للَّهِ إِ[f:4792[ن ك]ُ[f:735[نت]َ مِنَ [h:4793[ٱ][l[ل]صَّ[n[ـٰ]دِق[p[ِي]نَ","translation_en":"What! do you come to the males and commit robbery on the highway, and you commit evil deeds in your assemblies? But nothing was the answer of his people except that they said: Bring on us Allah's punishment, if you are one of the truthful.","translation_id":"Apakah pantas kamu mendatangi laki-laki, menyamun dan mengerjakan kemungkaran di tempat-tempat pertemuanmu?” Maka jawaban kaumnya tidak lain hanya mengatakan, “Datangkanlah kepada kami azab Allah, jika engkau termasuk orang-orang yang benar.”","hasanah_per_verse":1030},{"text_madani":"قَالَ رَبِّ انصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ","text_tajweed":"قَالَ رَبِّ [h:9187[ٱ][f:9188[نص]ُرْنِى عَلَى [h:1431[ٱ]لْقَوْمِ [h:10350[ٱ]لْمُفْسِد[p[ِي]نَ","translation_en":"He said: My Lord! help me against the mischievous people.","translation_id":"Dia (Luth) berdoa, “Ya Tuhanku, tolonglah aku (dengan menimpakan azab) atas golongan yang berbuat kerusakan itu.”","hasanah_per_verse":270},{"text_madani":"وَلَمَّا جَاءَتْ رُسُلُنَا إِبْرَاهِيمَ بِالْبُشْرَىٰ قَالُوا إِنَّا مُهْلِكُو أَهْلِ هَٰذِهِ الْقَرْيَةِ ۖ إِنَّ أَهْلَهَا كَانُوا ظَالِمِينَ","text_tajweed":"وَلَ[g[مّ]َا ج[o[َا]ٓءَتْ رُسُلُن[o[َآ] إِ[q:1860[بْ]ر[n[َٲ]هِيمَ بِ[h:6414[ٱ]لْبُشْرَىٰ قَال[o[ُوٓ][s[اْ] إِ[g[نّ]َا مُهْلِك[o[ُوٓ][s[اْ] أَهْلِ هَ[n[ـٰ]ذِهِ [h:2928[ٱ]لْقَرْيَةِ‌ۖ إِ[g[نّ]َ أَهْلَهَا كَانُو[s[اْ] ظَ[n[ـٰ]لِم[p[ِي]نَ","translation_en":"And when Our messengers came to Ibrahim with the good news, they said: Surely we are going to destroy the people of this town, for its people are unjust.","translation_id":"Dan ketika utusan Kami (para malaikat) datang kepada Ibrahim dengan membawa kabar gembira, mereka mengatakan, “Sungguh, kami akan membinasakan penduduk kota (Sodom) ini karena penduduknya sungguh orang-orang zhalim.”","hasanah_per_verse":700},{"text_madani":"قَالَ إِنَّ فِيهَا لُوطًا ۚ قَالُوا نَحْنُ أَعْلَمُ بِمَن فِيهَا ۖ لَنُنَجِّيَنَّهُ وَأَهْلَهُ إِلَّا امْرَأَتَهُ كَانَتْ مِنَ الْغَابِرِينَ","text_tajweed":"قَالَ إِ[g[نّ]َ فِيهَا لُو[f:10351[طًا‌ۚ ق]َالُو[s[اْ] نَحْنُ أَعْلَمُ بِمَ[f:10352[ن ف]ِيهَا‌ۖ لَنُنَجِّيَ[g[نّ]َهُ[n[ۥ] وَأَهْلَهُ[o[ۥٓ] إِلَّا [h:4837[ٱ]مْرَأَتَهُ[n[ۥ] كَانَتْ مِنَ [h:4838[ٱ]لْغَ[n[ـٰ]بِر[p[ِي]نَ","translation_en":"He said: Surely in it is Lut. They said: We know well who is in it; we shall certainly deliver him and his followers, except his wife; she shall be of those who remain behind.","translation_id":"Ibrahim berkata, “Sesungguhnya di kota itu ada Luth.” Mereka (para malaikat) berkata, “Kami lebih mengetahui siapa yang ada di kota itu. Kami pasti akan menyelamatkan dia dan pengikut-pengikutnya kecuali istrinya. Dia termasuk orang-orang yang tertinggal (dibinasakan).”","hasanah_per_verse":670},{"text_madani":"وَلَمَّا أَن جَاءَتْ رُسُلُنَا لُوطًا سِيءَ بِهِمْ وَضَاقَ بِهِمْ ذَرْعًا وَقَالُوا لَا تَخَفْ وَلَا تَحْزَنْ ۖ إِنَّا مُنَجُّوكَ وَأَهْلَكَ إِلَّا امْرَأَتَكَ كَانَتْ مِنَ الْغَابِرِينَ","text_tajweed":"وَلَ[g[مّ][o[َآ] أَ[f:10353[ن ج][o[َا]ٓءَتْ رُسُلُنَا لُو[f:6430[طًا س][o[ِى]ٓءَ بِهِمْ وَضَاقَ بِهِمْ ذَرْ[a:10354[عًا و]َقَالُو[s[اْ] لَا تَخَفْ وَلَا تَحْزَنْ‌ۖ إِ[g[نّ]َا مُنَجُّوكَ وَأَهْلَكَ إِلَّا [h:6440[ٱ]مْرَأَتَكَ كَانَتْ مِنَ [h:4838[ٱ]لْغَ[n[ـٰ]بِر[p[ِي]نَ","translation_en":"And when Our messengers came to Lut he was grieved on account of them, and he felt powerless (to protect) them; and they said: Fear not, nor grieve; surely we will deliver you and your followers, except your wife; she shall be of those who remain behind.","translation_id":"Dan ketika para utusan Kami (para malaikat) datang kepada Luth, dia merasa bersedih hati karena (kedatangan) mereka, dan (merasa) tidak mempunyai kekuatan untuk melindungi mereka, dan mereka (para utusan) berkata, “Janganlah engkau takut dan jangan (pula) bersedih hati. Sesungguhnya Kami akan menyelamatkanmu dan pengikut-pengikutmu, kecuali istrimu, dia termasuk orang-orang yang tinggal (dibinasakan).”","hasanah_per_verse":900},{"text_madani":"إِنَّا مُنزِلُونَ عَلَىٰ أَهْلِ هَٰذِهِ الْقَرْيَةِ رِجْزًا مِّنَ السَّمَاءِ بِمَا كَانُوا يَفْسُقُونَ","text_tajweed":"إِ[g[نّ]َا مُ[f:10355[نز]ِلُونَ عَلَ[o[ىٰٓ] أَهْلِ هَ[n[ـٰ]ذِهِ [h:2928[ٱ]لْقَرْيَةِ رِ[q:290[جْ][a:291[زًا م]ِّنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ بِمَا كَانُو[s[اْ] يَفْسُق[p[ُو]نَ","translation_en":"Surely We will cause to come down upon the people of this town a punishment from heaven, because they transgressed.","translation_id":"Sesungguhnya Kami akan menurunkan azab dari langit kepada penduduk kota ini karena mereka berbuat fasik.","hasanah_per_verse":500},{"text_madani":"وَلَقَد تَّرَكْنَا مِنْهَا آيَةً بَيِّنَةً لِّقَوْمٍ يَعْقِلُونَ","text_tajweed":"وَلَقَ[d:10356[د] تَّرَكْنَا مِنْه[o[َآ] ءَايَ[i:10357[ةَۢ ب]َيِّنَ[u:10358[ةً ل]ِّقَوْ[a:850[مٍ ي]َعْقِل[p[ُو]نَ","translation_en":"And certainly We have left a clear sign of it for a people who understand.","translation_id":"Dan sungguh, tentang itu telah Kami tinggalkan suatu tanda yang nyata bagi orang-orang yang mengerti.","hasanah_per_verse":300},{"text_madani":"وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا فَقَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ وَارْجُوا الْيَوْمَ الْآخِرَ وَلَا تَعْثَوْا فِي الْأَرْضِ مُفْسِدِينَ","text_tajweed":"وَإِلَىٰ مَ[q:4842[دْ]يَنَ أَخَاهُمْ شُعَيْ[f:10359[بًا ف]َقَالَ يَ[n[ـٰ]قَوْمِ [h:4768[ٱ]عْبُدُو[s[اْ] [h:3704[ٱ]للَّهَ وَ[h:10360[ٱ]رْجُو[s[اْ] [h:10361[ٱ]لْيَوْمَ [h:10362[ٱ]لْأَخِرَ وَلَا تَعْثَوْ[s[اْ] فِى [h:44[ٱ]لْأَرْضِ مُفْسِد[p[ِي]نَ","translation_en":"And to Madyan (We sent) their brother Shuaib, so he said: O my people! serve Allah and fear the latter day and do not act corruptly in the land, making mischief.","translation_id":"Dan kepada penduduk Madyan, (Kami telah mengutus) saudara mereka Syuaib, dia berkata, “Wahai kaumku! Sembahlah Allah, harapkanlah (pahala) hari akhir, dan jangan kamu berkeliaran di bumi berbuat kerusakan.”","hasanah_per_verse":740},{"text_madani":"فَكَذَّبُوهُ فَأَخَذَتْهُمُ الرَّجْفَةُ فَأَصْبَحُوا فِي دَارِهِمْ جَاثِمِينَ","text_tajweed":"فَكَذَّبُوهُ فَأَخَذَتْهُمُ [h:4823[ٱ][l[ل]رَّ[q:4824[جْ]فَةُ فَأَصْبَحُو[s[اْ] فِى دَارِهِمْ جَ[n[ـٰ]ثِم[p[ِي]نَ","translation_en":"But they rejected him, so a severe earthquake overtook them, and they became motionless bodies in their abode.","translation_id":"Mereka mendustakannya (Syuaib), maka mereka ditimpa gempa yang dahsyat, lalu jadilah mereka mayat-mayat yang bergelimpangan di tempat-tempat tinggal mereka.","hasanah_per_verse":390},{"text_madani":"وَعَادًا وَثَمُودَ وَقَد تَّبَيَّنَ لَكُم مِّن مَّسَاكِنِهِمْ ۖ وَزَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ وَكَانُوا مُسْتَبْصِرِينَ","text_tajweed":"وَعَا[a:9638[دًا و]َثَمُودَ[s[اْ] وَقَ[d:10363[د] تَّبَيَّنَ لَك[w:556[ُم م]ّ[a:10364[ِن م]َّسَ[n[ـٰ]كِنِهِمْ‌ۖ وَزَيَّنَ لَهُمُ [h:4046[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ أَعْمَ[n[ـٰ]لَهُمْ فَصَدَّهُمْ عَنِ [h:6998[ٱ][l[ل]سَّبِيلِ وَكَانُو[s[اْ] مُسْتَ[q:10365[بْ]صِر[p[ِي]نَ","translation_en":"And (We destroyed) Ad and Samood, and from their dwellings (this) is apparent to you indeed; and the Shaitan made their deeds fair-seeming to them, so he kept them back from the path, though they were endowed with intelligence and skill,","translation_id":"Juga (ingatlah) kaum ’Ad dan Tsamud, sungguh telah nyata bagi kamu (kehancuran mereka) dari (puing-puing) tempat tinggal mereka. Setan telah menjadikan terasa indah bagi mereka perbuatan (buruk) mereka, sehingga menghalangi mereka dari jalan (Allah), sedangkan mereka adalah orang-orang yang berpandangan tajam,","hasanah_per_verse":770},{"text_madani":"وَقَارُونَ وَفِرْعَوْنَ وَهَامَانَ ۖ وَلَقَدْ جَاءَهُم مُّوسَىٰ بِالْبَيِّنَاتِ فَاسْتَكْبَرُوا فِي الْأَرْضِ وَمَا كَانُوا سَابِقِينَ","text_tajweed":"وَقَ[n[ـٰ]رُونَ وَفِرْعَوْنَ وَهَ[n[ـٰ]مَ[n[ـٰ]نَ‌ۖ وَلَقَ[q:341[دْ] ج[o[َا]ٓءَه[w:10161[ُم م]ُّوسَىٰ بِ[h:484[ٱ]لْبَيِّنَ[n[ـٰ]تِ فَ[h:4956[ٱ]سْتَكْبَرُو[s[اْ] فِى [h:44[ٱ]لْأَرْضِ وَمَا كَانُو[s[اْ] سَ[n[ـٰ]بِق[p[ِي]نَ","translation_en":"And (We destroyed) Qaroun and Firon and Haman; and certainly Musa came to them with clear arguments, but they behaved haughtily in the land; yet they could not outstrip (Us).","translation_id":"dan (juga) Karun, Fir‘aun dan Haman. Sungguh, telah datang kepada mereka Musa dengan (membawa) keterangan-keterangan yang nyata. Tetapi mereka berlaku sombong di bumi, dan mereka orang-orang yang tidak luput (dari azab Allah).","hasanah_per_verse":690},{"text_madani":"فَكُلًّا أَخَذْنَا بِذَنبِهِ ۖ فَمِنْهُم مَّنْ أَرْسَلْنَا عَلَيْهِ حَاصِبًا وَمِنْهُم مَّنْ أَخَذَتْهُ الصَّيْحَةُ وَمِنْهُم مَّنْ خَسَفْنَا بِهِ الْأَرْضَ وَمِنْهُم مَّنْ أَغْرَقْنَا ۚ وَمَا كَانَ اللَّهُ لِيَظْلِمَهُمْ وَلَٰكِن كَانُوا أَنفُسَهُمْ يَظْلِمُونَ","text_tajweed":"فَكُلاًّ أَخَذْنَا بِذَ[i:10366[نۢب]ِه[n[ِۦ]‌ۖ فَمِنْه[w:1456[ُم م]َّنْ أَرْسَلْنَا عَلَيْهِ حَاصِ[a:10367[بًا و]َمِنْه[w:1106[ُم م]َّنْ أَخَذَتْهُ [h:10368[ٱ][l[ل]صَّيْحَةُ وَمِنْه[w:1106[ُم م]َّنْ خَسَفْنَا بِهِ [h:842[ٱ]لْأَرْضَ وَمِنْه[w:1106[ُم م]َّنْ أَغْرَ[q:9772[قْ]نَا‌ۚ وَمَا كَانَ [h:742[ٱ]للَّهُ لِيَظْلِمَهُمْ وَلَ[n[ـٰ]كِ[f:276[ن ك]َان[o[ُوٓ][s[اْ] أَ[f:38[نف]ُسَهُمْ يَظْلِم[p[ُو]نَ","translation_en":"So each We punished for his sin; of them was he on whom We sent down a violent storm, and of them was he whom the rumbling overtook, and of them was he whom We made to be swallowed up by the earth, and of them was he whom We drowned; and it did not beseem Allah that He should be unjust to them, but they were unjust to their own souls.","translation_id":"Maka masing-masing (mereka itu) Kami azab karena dosa-dosanya, di antara mereka ada yang Kami timpakan kepadanya hujan batu kerikil, ada yang ditimpa suara keras yang mengguntur, ada yang Kami benamkan ke dalam bumi, dan ada pula yang Kami tenggelamkan. Allah sama sekali tidak hendak menzhalimi mereka, akan tetapi merekalah yang menzhalimi diri mereka sendiri.","hasanah_per_verse":1240},{"text_madani":"مَثَلُ الَّذِينَ اتَّخَذُوا مِن دُونِ اللَّهِ أَوْلِيَاءَ كَمَثَلِ الْعَنكَبُوتِ اتَّخَذَتْ بَيْتًا ۖ وَإِنَّ أَوْهَنَ الْبُيُوتِ لَبَيْتُ الْعَنكَبُوتِ ۖ لَوْ كَانُوا يَعْلَمُونَ","text_tajweed":"مَثَلُ [h:1179[ٱ]لَّذِينَ [h:3645[ٱ]تَّخَذُو[s[اْ] مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ أَوْلِي[o[َا]ٓءَ كَمَثَلِ [h:10369[ٱ]لْعَ[f:10370[نك]َبُوتِ [h:10371[ٱ]تَّخَذَتْ بَيْ[a:10372[تًا‌ۖ و]َإِ[g[نّ]َ أَوْهَنَ [h:10373[ٱ]لْبُيُوتِ لَبَيْتُ [h:10374[ٱ]لْعَ[f:10370[نك]َبُوتِ‌ۖ لَوْ كَانُو[s[اْ] يَعْلَم[p[ُو]نَ","translation_en":"The parable of those who take guardians besides Allah is as the parable of the spider that makes for itself a house; and most surely the frailest of the houses is the spider's house did they but know.","translation_id":"Perumpamaan orang-orang yang mengambil pelindung selain Allah adalah seperti laba-laba yang membuat rumah. Dan sesungguhnya rumah yang paling lemah ialah rumah laba-laba, sekiranya mereka mengetahui.","hasanah_per_verse":880},{"text_madani":"إِنَّ اللَّهَ يَعْلَمُ مَا يَدْعُونَ مِن دُونِهِ مِن شَيْءٍ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ","text_tajweed":"إِ[g[نّ]َ [h:80[ٱ]للَّهَ يَعْلَمُ مَا يَ[q:1240[دْ]عُونَ مِ[f:3136[ن د]ُونِه[n[ِۦ] مِ[f:2103[ن ش][a:4300[َىْءٍ‌ۚ و]َهُوَ [h:7045[ٱ]لْعَزِيزُ [h:681[ٱ]لْحَك[p[ِي]مُ","translation_en":"Surely Allah knows whatever thing they call upon besides Him; and He is the Mighty, the Wise.","translation_id":"Sungguh, Allah mengetahui apa saja yang mereka sembah selain Dia. Dan Dia Mahaperkasa, Mahabijaksana.","hasanah_per_verse":430},{"text_madani":"وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ ۖ وَمَا يَعْقِلُهَا إِلَّا الْعَالِمُونَ","text_tajweed":"وَتِلْكَ [h:10375[ٱ]لْأَمْثَ[n[ـٰ]لُ نَضْرِبُهَا لِل[g[نّ]َاسِ‌ۖ وَمَا يَعْقِلُه[o[َآ] إِلَّا [h:10376[ٱ]لْعَ[n[ـٰ]لِم[p[ُو]نَ","translation_en":"And (as for) these examples, We set them forth for men, and none understand them but the learned.","translation_id":"Dan perumpamaan-perumpamaan ini Kami buat untuk manusia; dan tidak ada yang akan memahaminya kecuali mereka yang berilmu.","hasanah_per_verse":420},{"text_madani":"خَلَقَ اللَّهُ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۚ إِنَّ فِي ذَٰلِكَ لَآيَةً لِّلْمُؤْمِنِينَ","text_tajweed":"خَلَقَ [h:1272[ٱ]للَّهُ [h:10377[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ بِ[h:370[ٱ]لْحَقِّ‌ۚ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[u:7291[ةً ل]ِّلْمُؤْمِن[p[ِي]نَ","translation_en":"Allah created the heavens and the earth with truth; most surely there is a sign in this for the believers.","translation_id":"Allah menciptakan langit dan bumi dengan haq. Sungguh, pada yang demikian itu pasti terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang beriman.","hasanah_per_verse":450},{"text_madani":"اتْلُ مَا أُوحِيَ إِلَيْكَ مِنَ الْكِتَابِ وَأَقِمِ الصَّلَاةَ ۖ إِنَّ الصَّلَاةَ تَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنكَرِ ۗ وَلَذِكْرُ اللَّهِ أَكْبَرُ ۗ وَاللَّهُ يَعْلَمُ مَا تَصْنَعُونَ","text_tajweed":"ٱتْلُ م[o[َآ] أُوحِىَ إِلَيْكَ مِنَ [h:891[ٱ]لْكِتَ[n[ـٰ]بِ وَأَقِمِ [h:6518[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ‌ۖ إِ[g[نّ]َ [h:3096[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ تَنْهَىٰ عَنِ [h:7553[ٱ]لْفَحْش[o[َا]ٓءِ وَ[h:7554[ٱ]لْمُ[f:7554[نك]َرِ‌ۗ وَلَذِكْرُ [h:10378[ٱ]للَّهِ أَكْبَرُ‌ۗ وَ[h:72[ٱ]للَّهُ يَعْلَمُ مَا تَصْنَع[p[ُو]نَ","translation_en":"Recite that which has been revealed to you of the Book and keep up prayer; surely prayer keeps (one) away from indecency and evil, and certainly the remembrance of Allah is the greatest, and Allah knows what you do.","translation_id":"Bacalah Kitab (Al-Qur'an) yang telah diwahyukan kepadamu (Muhammad) dan laksanakanlah shalat. Sesungguhnya shalat itu mencegah dari (perbuatan) keji dan mungkar. Dan (ketahuilah) mengingat Allah (shalat) itu lebih besar (keutamaannya dari ibadah yang lain). Allah mengetahui apa yang kamu kerjakan.","hasanah_per_verse":890},{"text_madani":"وَلَا تُجَادِلُوا أَهْلَ الْكِتَابِ إِلَّا بِالَّتِي هِيَ أَحْسَنُ إِلَّا الَّذِينَ ظَلَمُوا مِنْهُمْ ۖ وَقُولُوا آمَنَّا بِالَّذِي أُنزِلَ إِلَيْنَا وَأُنزِلَ إِلَيْكُمْ وَإِلَٰهُنَا وَإِلَٰهُكُمْ وَاحِدٌ وَنَحْنُ لَهُ مُسْلِمُونَ","text_tajweed":"۞ وَلَا تُجَ[n[ـٰ]دِل[o[ُوٓ][s[اْ] أَهْلَ [h:3678[ٱ]لْكِتَ[n[ـٰ]بِ إِلَّا بِ[h:4526[ٱ]لَّتِى هِىَ أَحْسَنُ إِلَّا [h:778[ٱ]لَّذِينَ ظَلَمُو[s[اْ] مِنْهُمْ‌ۖ وَقُول[o[ُوٓ][s[اْ] ءَامَ[g[نّ]َا بِ[h:315[ٱ]لَّذ[o[ِىٓ] أُ[f:17[نز]ِلَ إِلَيْنَا وَأُ[f:10379[نز]ِلَ إِلَيْكُمْ وَإِلَ[n[ـٰ]هُنَا وَإِلَ[n[ـٰ]هُكُمْ و[n[َٲ]حِ[a:10380[دٌ و]َنَحْنُ لَهُ[n[ۥ] مُسْلِم[p[ُو]نَ","translation_en":"And do not dispute with the followers of the Book except by what is best, except those of them who act unjustly, and say: We believe in that which has been revealed to us and revealed to you, and our Allah and your Allah is One, and to Him do we submit.","translation_id":"Dan janganlah kamu berdebat dengan Ahli Kitab, melainkan dengan cara yang baik, kecuali dengan orang-orang yang zhalim di antara mereka, dan katakanlah, ”Kami telah beriman kepada (kitab-kitab) yang diturunkan kepada kami dan yang diturunkan kepadamu; Tuhan kami dan Tuhan kamu satu; dan hanya kepada-Nya kami berserah diri.”","hasanah_per_verse":1120},{"text_madani":"وَكَذَٰلِكَ أَنزَلْنَا إِلَيْكَ الْكِتَابَ ۚ فَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يُؤْمِنُونَ بِهِ ۖ وَمِنْ هَٰؤُلَاءِ مَن يُؤْمِنُ بِهِ ۚ وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا الْكَافِرُونَ","text_tajweed":"وَكَذ[n[َٲ]لِكَ أَ[f:515[نز]َلْن[o[َآ] إِلَيْكَ [h:3102[ٱ]لْكِتَ[n[ـٰ]بَ‌ۚ فَ[h:2514[ٱ]لَّذِينَ ءَاتَيْنَ[n[ـٰ]هُمُ [h:635[ٱ]لْكِتَ[n[ـٰ]بَ يُؤْمِنُونَ بِه[n[ِۦ]‌ۖ وَمِنْ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ م[a:5799[َن ي]ُؤْمِنُ بِه[n[ِۦ]‌ۚ وَمَا يَ[q:10381[جْ]حَدُ بِـَٔـايَ[n[ـٰ]تِن[o[َآ] إِلَّا [h:10382[ٱ]لْكَ[n[ـٰ]فِر[p[ُو]نَ","translation_en":"And thus have We revealed the Book to you. So those whom We have given the Book believe in it, and of these there are those who believe in it, and none deny Our communications except the unbelievers.","translation_id":"Dan demikianlah Kami turunkan Kitab (Al-Qur'an) kepadamu. Adapun orang-orang yang telah Kami berikan Kitab (Taurat dan Injil) mereka beriman kepadanya (Al-Qur'an), dan di antara mereka (orang-orang kafir Mekah) ada yang beriman kepadanya. Dan hanya orang-orang kafir yang mengingkari ayat-ayat Kami.","hasanah_per_verse":890},{"text_madani":"وَمَا كُنتَ تَتْلُو مِن قَبْلِهِ مِن كِتَابٍ وَلَا تَخُطُّهُ بِيَمِينِكَ ۖ إِذًا لَّارْتَابَ الْمُبْطِلُونَ","text_tajweed":"وَمَا كُ[f:735[نت]َ تَتْلُو[s[اْ] مِ[f:1097[ن ق]َ[q:1098[بْ]لِه[n[ِۦ] مِ[f:2060[ن ك]ِتَ[n[ـٰ][a:10383[بٍ و]َلَا تَخُطُّهُ[n[ۥ] بِيَمِينِكَ‌ۖ إِ[u:10384[ذًا ل]َّ[h:10385[ٱ]رْتَابَ [h:10386[ٱ]لْمُ[q:5131[بْ]طِل[p[ُو]نَ","translation_en":"And you did not recite before it any book, nor did you transcribe one with your right hand, for then could those who say untrue things have doubted.","translation_id":"Dan engkau (Muhammad) tidak pernah membaca sesuatu kitab sebelum (Al-Qur'an) dan engkau tidak (pernah) menulis suatu kitab dengan tangan kananmu; sekiranya (engkau pernah membaca dan menulis), niscaya ragu orang-orang yang mengingkarinya.","hasanah_per_verse":520},{"text_madani":"بَلْ هُوَ آيَاتٌ بَيِّنَاتٌ فِي صُدُورِ الَّذِينَ أُوتُوا الْعِلْمَ ۚ وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا الظَّالِمُونَ","text_tajweed":"بَلْ هُوَ ءَايَ[n[ـٰ][i:2117[تُۢ ب]َيِّنَ[n[ـٰ][f:10387[تٌ ف]ِى صُدُورِ [h:10388[ٱ]لَّذِينَ أُوتُو[s[اْ] [h:7379[ٱ]لْعِلْمَ‌ۚ وَمَا يَ[q:10381[جْ]حَدُ بِـَٔـايَ[n[ـٰ]تِن[o[َآ] إِلَّا [h:10389[ٱ][l[ل]ظَّ[n[ـٰ]لِم[p[ُو]نَ","translation_en":"Nay! these are clear communications in the breasts of those who are granted knowledge; and none deny Our communications except the unjust.","translation_id":"Sebenarnya, (Al-Qur'an) itu adalah ayat-ayat yang jelas di dalam dada orang-orang yang berilmu. Hanya orang-orang yang zhalim yang mengingkari ayat-ayat Kami.","hasanah_per_verse":590},{"text_madani":"وَقَالُوا لَوْلَا أُنزِلَ عَلَيْهِ آيَاتٌ مِّن رَّبِّهِ ۖ قُلْ إِنَّمَا الْآيَاتُ عِندَ اللَّهِ وَإِنَّمَا أَنَا نَذِيرٌ مُّبِينٌ","text_tajweed":"وَقَالُو[s[اْ] لَوْل[o[َآ] أُ[f:17[نز]ِلَ عَلَيْهِ ءَايَ[n[ـٰ][a:10390[تٌ م]ّ[u:192[ِن ر]َّبِّه[n[ِۦ]‌ۖ قُلْ إِ[g[نّ]َمَا [h:4327[ٱ]لْأَيَ[n[ـٰ]تُ عِ[f:264[ند]َ [h:408[ٱ]للَّهِ وَإِ[g[نّ]َم[o[َآ] أَنَا۟ نَذِي[a:5164[رٌ م]ُّب[p[ِي]نٌ","translation_en":"And they say: Why are not signs sent down upon him from his Lord? Say: The signs are only with Allah, and I am only a plain warner.","translation_id":"Dan mereka (orang-orang kafir Mekah) berkata, ”Mengapa tidak diturunkan mukjizat-mukjizat dari Tuhannya?” Katakanlah (Muhammad), ”Mukjizat-mukjizat itu terserah kepada Allah. Aku hanya seorang pemberi peringatan yang jelas.”","hasanah_per_verse":620},{"text_madani":"أَوَلَمْ يَكْفِهِمْ أَنَّا أَنزَلْنَا عَلَيْكَ الْكِتَابَ يُتْلَىٰ عَلَيْهِمْ ۚ إِنَّ فِي ذَٰلِكَ لَرَحْمَةً وَذِكْرَىٰ لِقَوْمٍ يُؤْمِنُونَ","text_tajweed":"أَوَلَمْ يَكْفِهِمْ أَ[g[نّ][o[َآ] أَ[f:515[نز]َلْنَا عَلَيْكَ [h:1723[ٱ]لْكِتَ[n[ـٰ]بَ يُتْلَىٰ عَلَيْهِمْ‌ۚ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَرَحْمَ[a:10391[ةً و]َذِكْرَىٰ لِقَوْ[a:4294[مٍ ي]ُؤْمِن[p[ُو]نَ","translation_en":"Is it not enough for them that We have revealed to you the Book which is recited to them? Most surely there is mercy in this and a reminder for a people who believe.","translation_id":"Apakah tidak cukup bagi mereka bahwa Kami telah menurunkan kepadamu Kitab (Al-Qur'an) yang dibacakan kepada mereka? Sungguh, dalam (Al-Qur'an) itu terdapat rahmat yang besar dan pelajaran bagi orang-orang yang beriman.","hasanah_per_verse":640},{"text_madani":"قُلْ كَفَىٰ بِاللَّهِ بَيْنِي وَبَيْنَكُمْ شَهِيدًا ۖ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۗ وَالَّذِينَ آمَنُوا بِالْبَاطِلِ وَكَفَرُوا بِاللَّهِ أُولَٰئِكَ هُمُ الْخَاسِرُونَ","text_tajweed":"قُلْ كَفَىٰ بِ[h:32[ٱ]للَّهِ بَيْنِى وَبَيْنَكُمْ شَهِي[a:10392[دًا‌ۖ ي]َعْلَمُ مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۗ وَ[h:37[ٱ]لَّذِينَ ءَامَنُو[s[اْ] بِ[h:212[ٱ]لْبَ[n[ـٰ]طِلِ وَكَفَرُو[s[اْ] بِ[h:32[ٱ]للَّهِ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:150[ٱ]لْخَ[n[ـٰ]سِر[p[ُو]نَ","translation_en":"Say: Allah is sufficient as a witness between me and you; He knows what is in the heavens and the earth. And (as for) those who believe in the falsehood and disbelieve in Allah, these it is that are the losers.","translation_id":"Katakanlah (Muhammad), ”Cukuplah Allah menjadi saksi antara aku dan kamu. Dia mengetahui apa yang di langit dan di bumi. Dan orang yang percaya kepada yang batil dan ingkar kepada Allah, mereka itulah orang-orang yang rugi.”","hasanah_per_verse":910},{"text_madani":"وَيَسْتَعْجِلُونَكَ بِالْعَذَابِ ۚ وَلَوْلَا أَجَلٌ مُّسَمًّى لَّجَاءَهُمُ الْعَذَابُ وَلَيَأْتِيَنَّهُم بَغْتَةً وَهُمْ لَا يَشْعُرُونَ","text_tajweed":"وَيَسْتَعْجِلُونَكَ بِ[h:9060[ٱ]لْعَذَابِ‌ۚ وَلَوْل[o[َآ] أَجَ[a:4120[لٌ م]ُّسَم[u:10393[ًّى ل]َّج[o[َا]ٓءَهُمُ [h:10394[ٱ]لْعَذَابُ وَلَيَأْتِيَ[g[نّ]َه[c:10395[ُم ب]َغْتَ[a:4880[ةً و]َهُمْ لَا يَشْعُر[p[ُو]نَ","translation_en":"And they ask you to hasten on the chastisement; and had not a term been appointed, the chastisement would certainly have come to them; and most certainly it will come to them all of a sudden while they will not perceive.","translation_id":"Dan mereka meminta kepadamu agar segera diturunkan azab. Kalau bukan karena waktunya yang telah ditetapkan, niscaya datang azab kepada mereka, dan (azab itu) pasti akan datang kepada mereka dengan tiba-tiba, sedang mereka tidak menyadarinya.","hasanah_per_verse":650},{"text_madani":"يَسْتَعْجِلُونَكَ بِالْعَذَابِ وَإِنَّ جَهَنَّمَ لَمُحِيطَةٌ بِالْكَافِرِينَ","text_tajweed":"يَسْتَعْجِلُونَكَ بِ[h:9060[ٱ]لْعَذَابِ وَإِ[g[نّ]َ جَهَ[g[نّ]َمَ لَمُحِيطَ[i:5639[ةُۢ ب]ِ[h:74[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"They ask you to hasten on the chastisement, and most surely hell encompasses the unbelievers;","translation_id":"Mereka meminta kepadamu agar segera diturunkan azab. Dan sesungguhnya neraka Jahanam itu pasti meliputi orang-orang kafir,","hasanah_per_verse":380},{"text_madani":"يَوْمَ يَغْشَاهُمُ الْعَذَابُ مِن فَوْقِهِمْ وَمِن تَحْتِ أَرْجُلِهِمْ وَيَقُولُ ذُوقُوا مَا كُنتُمْ تَعْمَلُونَ","text_tajweed":"يَوْمَ يَغْشَ[n[ـٰ]هُمُ [h:10396[ٱ]لْعَذَابُ مِ[f:3683[ن ف]َوْقِهِمْ وَمِ[f:3684[ن ت]َحْتِ أَرْجُلِهِمْ وَيَقُولُ ذُوقُو[s[اْ] مَا كُ[f:100[نت]ُمْ تَعْمَل[p[ُو]نَ","translation_en":"On the day when the chastisement shall cover them from above them, and from beneath their feet; and He shall say: Taste what you did.","translation_id":"pada hari (ketika) azab menutup mereka dari atas dan dari bawah kaki mereka dan (Allah) berkata (kepada mereka), ”Rasakanlah (balasan dari) apa yang telah kamu kerjakan!”","hasanah_per_verse":560},{"text_madani":"يَا عِبَادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي وَاسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ","text_tajweed":"يَ[n[ـٰ]عِبَادِىَ [h:10397[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِ[g[نّ]َ أَرْضِى و[n[َٲ]سِعَ[f:10398[ةٌ ف]َإِيَّ[n[ـٰ]ىَ فَ[h:8713[ٱ]عْبُد[p[ُو]نِ","translation_en":"O My servants who believe! surely My earth is vast, therefore Me alone should you serve.","translation_id":"Wahai hamba-hamba-Ku yang beriman! Sungguh, bumi-Ku luas, maka sembahlah Aku (saja).","hasanah_per_verse":400},{"text_madani":"كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ ۖ ثُمَّ إِلَيْنَا تُرْجَعُونَ","text_tajweed":"كُلُّ نَفْ[f:2476[سٍ ذ][o[َا]ٓئِقَةُ [h:2477[ٱ]لْمَوْتِ‌ۖ ثُ[g[مّ]َ إِلَيْنَا تُرْجَع[p[ُو]نَ","translation_en":"Every soul must taste of death, then to Us you shall be brought back.","translation_id":"Setiap yang bernyawa akan merasakan mati. Kemudian hanya kepada Kami kamu dikembalikan.","hasanah_per_verse":280},{"text_madani":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَنُبَوِّئَنَّهُم مِّنَ الْجَنَّةِ غُرَفًا تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ نِعْمَ أَجْرُ الْعَامِلِينَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ لَنُبَوِّئَ[g[نّ]َه[w:10399[ُم م]ِّنَ [h:4643[ٱ]لْجَ[g[نّ]َةِ غُرَ[f:10400[فًا ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ خَ[n[ـٰ]لِدِينَ فِيهَا‌ۚ نِعْمَ أَ[q:2254[جْ]رُ [h:2255[ٱ]لْعَ[n[ـٰ]مِل[p[ِي]نَ","translation_en":"And (as for) those who believe and do good, We will certainly give them abode in the high places in gardens beneath which rivers flow, abiding therein; how good the reward of the workers:","translation_id":"Dan orang-orang yang beriman dan mengerjakan kebajikan, sungguh, mereka akan Kami tempatkan pada tempat-tempat yang tinggi (di dalam surga), yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya. Itulah sebaik-baik balasan bagi orang yang berbuat kebajikan,","hasanah_per_verse":860},{"text_madani":"الَّذِينَ صَبَرُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ","text_tajweed":"ٱلَّذِينَ صَبَرُو[s[اْ] وَعَلَىٰ رَبِّهِمْ يَتَوَكَّل[p[ُو]نَ","translation_en":"Those who are patient, and on their Lord do they rely.","translation_id":"(yaitu) orang-orang yang bersabar dan bertawakal kepada Tuhannya.","hasanah_per_verse":250},{"text_madani":"وَكَأَيِّن مِّن دَابَّةٍ لَّا تَحْمِلُ رِزْقَهَا اللَّهُ يَرْزُقُهَا وَإِيَّاكُمْ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ","text_tajweed":"وَكَأَيّ[a:2298[ِن م]ِّ[f:4026[ن د][m[َا]ٓبَّ[u:10401[ةٍ ل]َّا تَحْمِلُ رِزْقَهَا [h:10402[ٱ]للَّهُ يَرْزُقُهَا وَإِيَّاكُمْ‌ۚ وَهُوَ [h:709[ٱ][l[ل]سَّمِيعُ [h:669[ٱ]لْعَل[p[ِي]مُ","translation_en":"And how many a living creature that does not carry its sustenance: Allah sustains it and yourselves; and He is the Hearing, the Knowing.","translation_id":"Dan berapa banyak makhluk bergerak yang bernyawa yang tidak (dapat) membawa (mengurus) rezekinya sendiri. Allah-lah yang memberi rezeki kepadanya dan kepadamu. Dia Maha Mendengar, Maha Mengetahui.","hasanah_per_verse":530},{"text_madani":"وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ لَيَقُولُنَّ اللَّهُ ۖ فَأَنَّىٰ يُؤْفَكُونَ","text_tajweed":"وَلَئِ[f:5683[ن س]َأَلْتَه[w:10403[ُم م]َّنْ خَلَقَ [h:3913[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ وَسَخَّرَ [h:6864[ٱ][l[ل]شَّمْسَ وَ[h:4265[ٱ]لْقَمَرَ لَيَقُولُ[g[نّ]َ [h:10404[ٱ]للَّهُ‌ۖ فَأَ[g[نّ]َىٰ يُؤْفَك[p[ُو]نَ","translation_en":"And if you ask them, Who created the heavens and the earth and made the sun and the moon subservient, they will certainly say, Allah. Whence are they then turned away?","translation_id":"Dan jika engkau bertanya kepada mereka, ”Siapakah yang menciptakan langit dan bumi dan menundukkan matahari dan bulan?” Pasti mereka akan menjawab, ”Allah.” Maka mengapa mereka bisa dipalingkan (dari kebenaran).","hasanah_per_verse":640},{"text_madani":"اللَّهُ يَبْسُطُ الرِّزْقَ لِمَن يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ لَهُ ۚ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ","text_tajweed":"ٱللَّهُ يَ[q:6968[بْ]سُطُ [h:6969[ٱ][l[ل]رِّزْقَ لِم[a:1537[َن ي]َش[o[َا]ٓءُ مِنْ عِبَادِه[n[ِۦ] وَيَ[q:6970[قْ]دِرُ لَهُ[o[ۥٓ‌ۚ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ بِكُلِّ شَىْءٍ عَل[p[ِي]مٌ","translation_en":"Allah makes abundant the means of subsistence for whom He pleases of His servants, and straitens them for whom (He pleases) surely Allah is Cognizant of all things.","translation_id":"Allah melapangkan rezeki bagi orang yang Dia kehendaki di antara hamba-hamba-Nya dan Dia (pula) yang membatasi baginya. Sungguh, Allah Maha Mengetahui segala sesuatu.","hasanah_per_verse":500},{"text_madani":"وَلَئِن سَأَلْتَهُم مَّن نَّزَّلَ مِنَ السَّمَاءِ مَاءً فَأَحْيَا بِهِ الْأَرْضَ مِن بَعْدِ مَوْتِهَا لَيَقُولُنَّ اللَّهُ ۚ قُلِ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْقِلُونَ","text_tajweed":"وَلَئِ[f:5683[ن س]َأَلْتَه[w:10403[ُم م]ّ[a:10405[َن ن]َّزَّلَ مِنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ م[o[َا]ٓ[f:7464[ءً ف]َأَحْيَا بِهِ [h:842[ٱ]لْأَرْضَ م[i:146[ِنۢ ب]َعْدِ مَوْتِهَا لَيَقُولُ[g[نّ]َ [h:10404[ٱ]للَّهُ‌ۚ قُلِ [h:9994[ٱ]لْحَمْدُ لِلَّهِ‌ۚ بَلْ أَكْثَرُهُمْ لَا يَعْقِل[p[ُو]نَ","translation_en":"And if you ask them Who is it that sends down water from the clouds, then gives life to the earth with it after its death, they will certainly say, Allah. Say: All praise is due to Allah. Nay, most of them do not understand.","translation_id":"Dan jika kamu bertanya kepada mereka, ”Siapakah yang menurunkan air dari langit lalu dengan (air) itu dihidupkannya bumi yang sudah mati?” Pasti mereka akan menjawab, ”Allah.” Katakanlah, ”Segala puji bagi Allah,” tetapi kebanyakan mereka tidak mengerti.","hasanah_per_verse":840},{"text_madani":"وَمَا هَٰذِهِ الْحَيَاةُ الدُّنْيَا إِلَّا لَهْوٌ وَلَعِبٌ ۚ وَإِنَّ الدَّارَ الْآخِرَةَ لَهِيَ الْحَيَوَانُ ۚ لَوْ كَانُوا يَعْلَمُونَ","text_tajweed":"وَمَا هَ[n[ـٰ]ذِهِ [h:10406[ٱ]لْحَيَ[s[و][n[ٲ]ةُ [h:1156[ٱ][l[ل]دُّنْي[o[َآ] إِلَّا لَهْ[a:10407[وٌ و]َلَعِ[a:10408[بٌ‌ۚ و]َإِ[g[نّ]َ [h:10409[ٱ][l[ل]دَّارَ [h:10245[ٱ]لْأَخِرَةَ لَهِىَ [h:10410[ٱ]لْحَيَوَانُ‌ۚ لَوْ كَانُو[s[اْ] يَعْلَم[p[ُو]نَ","translation_en":"And this life of the world is nothing but a sport and a play; and as for the next abode, that most surely is the life-- did they but know!","translation_id":"Dan kehidupan dunia ini hanya senda-gurau dan permainan. Dan sesungguhnya negeri akhirat itulah kehidupan yang sebenarnya, sekiranya mereka mengetahui.","hasanah_per_verse":650},{"text_madani":"فَإِذَا رَكِبُوا فِي الْفُلْكِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ إِذَا هُمْ يُشْرِكُونَ","text_tajweed":"فَإِذَا رَكِبُو[s[اْ] فِى [h:4780[ٱ]لْفُلْكِ دَعَوُ[s[اْ] [h:6002[ٱ]للَّهَ مُخْلِصِينَ لَهُ [h:4649[ٱ][l[ل]دِّينَ فَلَ[g[مّ]َا نَجَّ[n[ـٰ]هُمْ إِلَى [h:7827[ٱ]لْبَرِّ إِذَا هُمْ يُشْرِك[p[ُو]نَ","translation_en":"So when they ride in the ships they call upon Allah, being sincerely obedient to Him, but when He brings them safe to the land, lo! they associate others (with Him);","translation_id":"Maka apabila mereka naik kapal, mereka berdoa kepada Allah dengan penuh rasa pengabdian (ikhlas) kepada-Nya, tetapi ketika Allah menyelamatkan mereka sampai ke darat, malah mereka (kembali) mempersekutukan (Allah),","hasanah_per_verse":640},{"text_madani":"لِيَكْفُرُوا بِمَا آتَيْنَاهُمْ وَلِيَتَمَتَّعُوا ۖ فَسَوْفَ يَعْلَمُونَ","text_tajweed":"لِيَكْفُرُو[s[اْ] بِم[o[َآ] ءَاتَيْنَ[n[ـٰ]هُمْ وَلِيَتَمَتَّعُو[s[اْ‌ۖ] فَسَوْفَ يَعْلَم[p[ُو]نَ","translation_en":"Thus they become ungrateful for what We have given them, so that they may enjoy; but they shall soon know.","translation_id":"biarlah mereka mengingkari nikmat yang telah Kami berikan kepada mereka dan silakan mereka (hidup) bersenang-senang (dalam kekafiran). Maka kelak mereka akan mengetahui (akibat perbuatannya).","hasanah_per_verse":360},{"text_madani":"أَوَلَمْ يَرَوْا أَنَّا جَعَلْنَا حَرَمًا آمِنًا وَيُتَخَطَّفُ النَّاسُ مِنْ حَوْلِهِمْ ۚ أَفَبِالْبَاطِلِ يُؤْمِنُونَ وَبِنِعْمَةِ اللَّهِ يَكْفُرُونَ","text_tajweed":"أَوَلَمْ يَرَوْ[s[اْ] أَ[g[نّ]َا جَعَلْنَا حَرَمًا ءَامِ[a:10411[نًا و]َيُتَخَطَّفُ [h:10412[ٱ][l[ل][g[نّ]َاسُ مِنْ حَوْلِهِمْ‌ۚ أَفَبِ[h:7495[ٱ]لْبَ[n[ـٰ]طِلِ يُؤْمِنُونَ وَبِنِعْمَةِ [h:10413[ٱ]للَّهِ يَكْفُر[p[ُو]نَ","translation_en":"Do they not see that We have made a sacred territory secure, while men are carried off by force from around them? Will they still believe in the falsehood and disbelieve in the favour of Allah?","translation_id":"Tidakkah mereka memperhatikan, bahwa Kami telah menjadikan (negeri mereka) tanah suci yang aman, padahal manusia di sekitarnya saling merampok. Mengapa (setelah nyata kebenaran) mereka masih percaya kepada yang batil dan ingkar kepada nikmat Allah?","hasanah_per_verse":730},{"text_madani":"وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا أَوْ كَذَّبَ بِالْحَقِّ لَمَّا جَاءَهُ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِّلْكَافِرِينَ","text_tajweed":"وَمَنْ أَظْلَمُ مِ[g[مّ]َنِ [h:3980[ٱ]فْتَرَىٰ عَلَى [h:412[ٱ]للَّهِ كَذِبًا أَوْ كَذَّبَ بِ[h:370[ٱ]لْحَقِّ لَ[g[مّ]َا ج[o[َا]ٓءَهُ[o[ۥٓ‌ۚ] أَلَيْسَ فِى جَهَ[g[نّ]َمَ مَثْ[u:10414[وًى ل]ِّلْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"And who is more unjust than one who forges a lie against Allah, or gives the lie to the truth when it has come to him? Will not in hell be the abode of the unbelievers?","translation_id":"Dan siapakah yang lebih zhalim dari-pada orang yang mengada-adakan kebohongan kepada Allah atau orang yang mendustakan yang hak ketika (yang hak) itu datang kepadanya? Bukankah dalam neraka Jahanam ada tempat bagi orang-orang kafir?","hasanah_per_verse":650},{"text_madani":"وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا ۚ وَإِنَّ اللَّهَ لَمَعَ الْمُحْسِنِينَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ جَ[n[ـٰ]هَدُو[s[اْ] فِينَا لَنَهْدِيَ[g[نّ]َهُمْ سُبُلَنَا‌ۚ وَإِ[g[نّ]َ [h:1986[ٱ]للَّهَ لَمَعَ [h:10415[ٱ]لْمُحْسِن[p[ِي]نَ","translation_en":"And (as for) those who strive hard for Us, We will most certainly guide them in Our ways; and Allah is most surely with the doers of good.","translation_id":"Dan orang-orang yang berjihad untuk (mencari keridhaan) Kami, Kami akan tunjukkan kepada mereka jalan-jalan Kami. Dan sungguh, Allah beserta orang-orang yang berbuat baik.","hasanah_per_verse":470}]}
