{"chapter_number":33,"name_simple":"Al-Ahzab","name_meaning":{"text":"The Combined Forces","en":"The Combined Forces","id":"Golongan yang Bersekutu"},"verses_count":73,"hasanah":57880,"verses":[{"text_madani":"يَا أَيُّهَا النَّبِيُّ اتَّقِ اللَّهَ وَلَا تُطِعِ الْكَافِرِينَ وَالْمُنَافِقِينَ ۗ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:5411[ٱ][l[ل][g[نّ]َبِىُّ [h:10671[ٱ]تَّقِ [h:1125[ٱ]للَّهَ وَلَا تُطِعِ [h:9665[ٱ]لْكَ[n[ـٰ]فِرِينَ وَ[h:5724[ٱ]لْمُنَ[n[ـٰ]فِقِينَ‌ۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ كَانَ عَلِيمًا حَكِيمًا","translation_en":"O Prophet! be careful of (your duty to) Allah and do not comply with (the wishes of) the unbelievers and the hypocrites; surely Allah is Knowing, Wise;","translation_id":"Wahai Nabi! Bertakwalah kepada Allah dan janganlah engkau menuruti (keinginan) orang-orang kafir dan orang-orang munafik. Sesungguhnya Allah Maha Mengetahui, Mahabijaksana,","hasanah_per_verse":610},{"text_madani":"وَاتَّبِعْ مَا يُوحَىٰ إِلَيْكَ مِن رَّبِّكَ ۚ إِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا","text_tajweed":"وَ[h:9999[ٱ]تَّبِعْ مَا يُوحَ[o[ىٰٓ] إِلَيْكَ م[u:770[ِن ر]َّبِّكَ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا","translation_en":"And follow what is revealed to you from your Lord; surely Allah is Aware of what you do;","translation_id":"dan ikutilah apa yang diwahyukan Tuhanmu kepadamu. Sungguh, Allah Mahateliti terhadap apa yang kamu kerjakan,","hasanah_per_verse":430},{"text_madani":"وَتَوَكَّلْ عَلَى اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا","text_tajweed":"وَتَوَكَّلْ عَلَى [h:412[ٱ]للَّهِ‌ۚ وَكَفَىٰ بِ[h:32[ٱ]للَّهِ وَكِيلاً","translation_en":"And rely on Allah; and Allah is sufficient for a Protector.","translation_id":"dan bertawakallah kepada Allah. Dan cukuplah Allah sebagai pemelihara.","hasanah_per_verse":260},{"text_madani":"مَّا جَعَلَ اللَّهُ لِرَجُلٍ مِّن قَلْبَيْنِ فِي جَوْفِهِ ۚ وَمَا جَعَلَ أَزْوَاجَكُمُ اللَّائِي تُظَاهِرُونَ مِنْهُنَّ أُمَّهَاتِكُمْ ۚ وَمَا جَعَلَ أَدْعِيَاءَكُمْ أَبْنَاءَكُمْ ۚ ذَٰلِكُمْ قَوْلُكُم بِأَفْوَاهِكُمْ ۖ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ","text_tajweed":"مَّا جَعَلَ [h:2556[ٱ]للَّهُ لِرَجُ[a:10672[لٍ م]ِّ[f:10673[ن ق]َلْبَيْنِ فِى جَوْفِه[n[ِۦ]‌ۚ وَمَا جَعَلَ أَزْو[n[َٲ]جَكُمُ [h:10674[ٱ]لَّ[o[ــٰٓ]ــِٔى تُظَ[n[ـٰ]هِرُونَ مِنْهُ[g[نّ]َ أُ[g[مّ]َهَ[n[ـٰ]تِكُمْ‌ۚ وَمَا جَعَلَ أَ[q:10675[دْ]عِي[o[َا]ٓءَكُمْ أَ[q:240[بْ]ن[o[َا]ٓءَكُمْ‌ۚ ذ[n[َٲ]لِكُمْ قَوْلُك[c:10676[ُم ب]ِأَفْو[n[َٲ]هِكُمْ‌ۖ وَ[h:72[ٱ]للَّهُ يَقُولُ [h:10677[ٱ]لْحَقَّ وَهُوَ يَهْدِى [h:10678[ٱ][l[ل]سَّب[p[ِي]لَ","translation_en":"Allah has not made for any man two hearts within him; nor has He made your wives whose backs you liken to the backs of your mothers as your mothers, nor has He made those whom you assert to be your sons your real sons; these are the words of your mouths; and Allah speaks the truth and He guides to the way.","translation_id":"Allah tidak menjadikan bagi seseorang dua hati dalam rongganya; dan Dia tidak menjadikan istri-istrimu yang kamu zihar itu sebagai ibumu, dan Dia tidak menjadikan anak angkatmu sebagai anak kandungmu (sendiri). Yang demikian itu hanyalah perkataan di mulutmu saja. Allah mengatakan yang sebenarnya dan Dia menunjukkan jalan (yang benar).","hasanah_per_verse":1270},{"text_madani":"ادْعُوهُمْ لِآبَائِهِمْ هُوَ أَقْسَطُ عِندَ اللَّهِ ۚ فَإِن لَّمْ تَعْلَمُوا آبَاءَهُمْ فَإِخْوَانُكُمْ فِي الدِّينِ وَمَوَالِيكُمْ ۚ وَلَيْسَ عَلَيْكُمْ جُنَاحٌ فِيمَا أَخْطَأْتُم بِهِ وَلَٰكِن مَّا تَعَمَّدَتْ قُلُوبُكُمْ ۚ وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا","text_tajweed":"ٱ[q:10679[دْ]عُوهُمْ لِأَب[o[َا]ٓئِهِمْ هُوَ أَ[q:1683[قْ]سَطُ عِ[f:264[ند]َ [h:408[ٱ]للَّهِ‌ۚ فَإ[u:110[ِن ل]َّمْ تَعْلَم[o[ُوٓ][s[اْ] ءَاب[o[َا]ٓءَهُمْ فَإِخْو[n[َٲ]نُكُمْ فِى [h:1477[ٱ][l[ل]دِّينِ وَمَو[n[َٲ]لِيكُمْ‌ۚ وَلَيْسَ عَلَيْكُمْ جُنَا[f:3782[حٌ ف]ِيم[o[َآ] أَخْطَأْت[c:10680[ُم ب]ِه[n[ِۦ] وَلَ[n[ـٰ]ك[a:10681[ِن م]َّا تَعَ[g[مّ]َدَتْ قُلُوبُكُمْ‌ۚ وَكَانَ [h:2653[ٱ]للَّهُ غَفُو[u:2701[رًا ر]َّحِيمًا","translation_en":"Assert their relationship to their fathers; this is more equitable with Allah; but if you do not know their fathers, then they are your brethren in faith and your friends; and there is no blame on you concerning that in which you made a mistake, but (concerning) that which your hearts do purposely (blame may rest on you), and Allah is Forgiving, Merciful.","translation_id":"Panggillah mereka (anak angkat itu) dengan (memakai) nama bapak-bapak mereka; itulah yang adil di sisi Allah, dan jika kamu tidak mengetahui bapak mereka, maka (panggillah mereka sebagai) saudara-saudaramu seagama dan maula-maulamu. Dan tidak ada dosa atasmu jika kamu khilaf tentang itu, tetapi (yang ada dosanya) apa yang disengaja oleh hatimu. Allah Maha Pengampun, Maha Penyayang.","hasanah_per_verse":1260},{"text_madani":"النَّبِيُّ أَوْلَىٰ بِالْمُؤْمِنِينَ مِنْ أَنفُسِهِمْ ۖ وَأَزْوَاجُهُ أُمَّهَاتُهُمْ ۗ وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ فِي كِتَابِ اللَّهِ مِنَ الْمُؤْمِنِينَ وَالْمُهَاجِرِينَ إِلَّا أَن تَفْعَلُوا إِلَىٰ أَوْلِيَائِكُم مَّعْرُوفًا ۚ كَانَ ذَٰلِكَ فِي الْكِتَابِ مَسْطُورًا","text_tajweed":"ٱ[l[ل][g[نّ]َبِىُّ أَوْلَىٰ بِ[h:3560[ٱ]لْمُؤْمِنِينَ مِنْ أَ[f:568[نف]ُسِهِمْ‌ۖ وَأَزْو[n[َٲ]جُهُ[o[ۥٓ] أُ[g[مّ]َهَ[n[ـٰ]تُهُمْ‌ۗ وَأُ[s[وْ]لُو[s[اْ] [h:5446[ٱ]لْأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْ[f:5447[ضٍ ف]ِى كِتَ[n[ـٰ]بِ [h:1816[ٱ]للَّهِ مِنَ [h:3047[ٱ]لْمُؤْمِنِينَ وَ[h:5876[ٱ]لْمُهَ[n[ـٰ]جِرِينَ إِلّ[o[َآ] أَ[f:10682[ن ت]َفْعَل[o[ُوٓ][s[اْ] إِلَ[o[ىٰٓ] أَوْلِي[o[َا]ٓئِك[w:10683[ُم م]َّعْرُو[f:10684[فًا‌ۚ ك]َانَ ذ[n[َٲ]لِكَ فِى [h:818[ٱ]لْكِتَ[n[ـٰ]بِ مَسْطُورًا","translation_en":"The Prophet has a greater claim on the faithful than they have on themselves, and his wives are (as) their mothers; and the possessors of relationship have the better claim in the ordinance of Allah to inheritance, one with respect to another, than (other) believers, and (than) those who have fled (their homes), except that you do some good to your friends; this is written in the Book.","translation_id":"Nabi itu lebih utama bagi orang-orang mukmin dibandingkan diri mereka sendiri dan istri-istrinya adalah ibu-ibu mereka. Orang-orang yang mempunyai hubungan darah satu sama lain lebih berhak (waris-mewarisi) di dalam Kitab Allah daripada orang-orang mukmin dan orang-orang Muhajirin, kecuali kalau kamu hendak berbuat baik kepada saudara-saudaramu (seagama). Demikianlah telah tertulis dalam Kitab (Allah).","hasanah_per_verse":1430},{"text_madani":"وَإِذْ أَخَذْنَا مِنَ النَّبِيِّينَ مِيثَاقَهُمْ وَمِنكَ وَمِن نُّوحٍ وَإِبْرَاهِيمَ وَمُوسَىٰ وَعِيسَى ابْنِ مَرْيَمَ ۖ وَأَخَذْنَا مِنْهُم مِّيثَاقًا غَلِيظًا","text_tajweed":"وَإِذْ أَخَذْنَا مِنَ [h:2902[ٱ][l[ل][g[نّ]َبِيِّـ[n[ـۧ]نَ مِيثَ[n[ـٰ]قَهُمْ وَمِ[f:10685[نك]َ وَم[a:10686[ِن ن]ُّو[a:10687[حٍ و]َإِ[q:10311[بْ]ر[n[َٲ]هِيمَ وَمُوسَىٰ وَعِيسَى [h:3725[ٱ][q:3590[بْ]نِ مَرْيَمَ‌ۖ وَأَخَذْنَا مِنْه[w:3265[ُم م]ِّيثَ[n[ـٰ]قًا غَلِيظًا","translation_en":"And when We made a covenant with the prophets and with you, and with Nuh and Ibrahim and Musa and Isa, son of Marium, and We made with them a strong covenant","translation_id":"Dan (ingatlah) ketika Kami mengambil perjanjian dari para nabi dan dari engkau (sendiri), dari Nuh, Ibrahim, Musa dan Isa putra Maryam, dan Kami telah mengambil dari mereka perjanjian yang teguh,","hasanah_per_verse":800},{"text_madani":"لِّيَسْأَلَ الصَّادِقِينَ عَن صِدْقِهِمْ ۚ وَأَعَدَّ لِلْكَافِرِينَ عَذَابًا أَلِيمًا","text_tajweed":"لِّيَسْــَٔلَ [h:10688[ٱ][l[ل]صَّ[n[ـٰ]دِقِينَ عَ[f:10689[ن ص]ِ[q:10690[دْ]قِهِمْ‌ۚ وَأَعَدَّ لِلْكَ[n[ـٰ]فِرِينَ عَذَابًا أَلِيمًا","translation_en":"That He may question the truthful of their truth, and He has prepared for the unbelievers a painful punishment.","translation_id":"agar Dia menanyakan kepada orang-orang yang benar tentang kebenaran mereka. Dia menyediakan azab yang pedih bagi orang-orang kafir.","hasanah_per_verse":420},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ جَاءَتْكُمْ جُنُودٌ فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا وَجُنُودًا لَّمْ تَرَوْهَا ۚ وَكَانَ اللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] [h:3416[ٱ]ذْكُرُو[s[اْ] نِعْمَةَ [h:1154[ٱ]للَّهِ عَلَيْكُمْ إِذْ ج[o[َا]ٓءَتْكُمْ جُنُو[f:10691[دٌ ف]َأَرْسَلْنَا عَلَيْهِمْ رِي[a:10692[حًا و]َجُنُو[u:10693[دًا ل]َّمْ تَرَوْهَا‌ۚ وَكَانَ [h:2653[ٱ]للَّهُ بِمَا تَعْمَلُونَ بَصِيرًا","translation_en":"O you who believe! call to mind the favor of Allah to you when there came down upon you hosts, so We sent against them a strong wind and hosts, that you saw not, and Allah is Seeing what you do.","translation_id":"Wahai orang-orang yang beriman! Ingatlah akan nikmat Allah (yang telah dikaruniakan) kepadamu ketika bala tentara datang kepadamu, lalu Kami kirimkan kepada mereka angin topan dan bala tentara yang tidak dapat terlihat olehmu. Allah Maha Melihat apa yang kamu kerjakan.","hasanah_per_verse":980},{"text_madani":"إِذْ جَاءُوكُم مِّن فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنكُمْ وَإِذْ زَاغَتِ الْأَبْصَارُ وَبَلَغَتِ الْقُلُوبُ الْحَنَاجِرَ وَتَظُنُّونَ بِاللَّهِ الظُّنُونَا","text_tajweed":"إِذْ ج[o[َا]ٓءُوك[w:10694[ُم م]ِّ[f:4142[ن ف]َوْقِكُمْ وَمِنْ أَسْفَلَ مِ[f:344[نك]ُمْ وَإِذْ زَاغَتِ [h:10695[ٱ]لْأَ[q:4305[بْ]صَ[n[ـٰ]رُ وَبَلَغَتِ [h:10696[ٱ]لْقُلُوبُ [h:10697[ٱ]لْحَنَاجِرَ وَتَظُ[g[نّ]ُونَ بِ[h:32[ٱ]للَّهِ [h:10698[ٱ][l[ل]ظُّنُونَا۟","translation_en":"When they came upon you from above you and from below you, and when the eyes turned dull, and the hearts rose up to the throats, and you began to think diverse thoughts of Allah.","translation_id":"(Yaitu) ketika mereka datang kepadamu dari atas dan dari bawahmu, dan ketika penglihatan(mu) terpana dan hatimu menyesak sampai ke tenggorokan dan kamu berprasangka yang bukan-bukan terhadap Allah.","hasanah_per_verse":760},{"text_madani":"هُنَالِكَ ابْتُلِيَ الْمُؤْمِنُونَ وَزُلْزِلُوا زِلْزَالًا شَدِيدًا","text_tajweed":"هُنَالِكَ [h:10699[ٱ][q:10700[بْ]تُلِىَ [h:10701[ٱ]لْمُؤْمِنُونَ وَزُلْزِلُو[s[اْ] زِلْزَال[f:10702[اً ش]َدِيدًا","translation_en":"There the believers were tried and they were shaken with severe shaking.","translation_id":"Di situlah diuji orang-orang mukmin dan digoncangkan (hatinya) dengan goncangan yang dahsyat.","hasanah_per_verse":360},{"text_madani":"وَإِذْ يَقُولُ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِم مَّرَضٌ مَّا وَعَدَنَا اللَّهُ وَرَسُولُهُ إِلَّا غُرُورًا","text_tajweed":"وَإِذْ يَقُولُ [h:5376[ٱ]لْمُنَ[n[ـٰ]فِقُونَ وَ[h:37[ٱ]لَّذِينَ فِى قُلُوبِه[w:39[ِم م]َّرَ[a:10703[ضٌ م]َّا وَعَدَنَا [h:10704[ٱ]للَّهُ وَرَسُولُهُ[o[ۥٓ] إِلَّا غُرُورًا","translation_en":"And when the hypocrites and those in whose hearts was a disease began to say: Allah and His Messenger did not promise us (victory) but only to deceive.","translation_id":"Dan (ingatlah) ketika orang-orang munafik dan orang-orang yang hatinya berpenyakit berkata, “Yang dijanjikan Allah dan Rasul-Nya kepada kami hanya tipu daya belaka.”","hasanah_per_verse":580},{"text_madani":"وَإِذْ قَالَت طَّائِفَةٌ مِّنْهُمْ يَا أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ فَارْجِعُوا ۚ وَيَسْتَأْذِنُ فَرِيقٌ مِّنْهُمُ النَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ وَمَا هِيَ بِعَوْرَةٍ ۖ إِن يُرِيدُونَ إِلَّا فِرَارًا","text_tajweed":"وَإِذْ قَالَ[d:10705[ت] طّ[o[َا]ٓئِفَ[a:2967[ةٌ م]ِّنْهُمْ يَ[o[ـٰٓ]أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ فَ[h:9386[ٱ]رْجِعُو[s[اْ‌ۚ] وَيَسْتَــْٔذِنُ فَرِي[a:10706[قٌ م]ِّنْهُمُ [h:10707[ٱ][l[ل][g[نّ]َبِىَّ يَقُولُونَ إِ[g[نّ]َ بُيُوتَنَا عَوْرَ[a:10708[ةٌ و]َمَا هِىَ بِعَوْرَةٍ‌ۖ إ[a:10709[ِن ي]ُرِيدُونَ إِلَّا فِرَارًا","translation_en":"And when a party of them said: O people of Yasrib! there is no place to stand for you (here), therefore go back; and a party of them asked permission of the prophet, saying. Surely our houses are exposed; and they were not exposed; they only desired to fly away.","translation_id":"Dan (ingatlah) ketika segolongan di antara mereka berkata, “Wahai penduduk Yasrib (Madinah)! Tidak ada tempat bagimu, maka kembalilah kamu.” Dan sebagian dari mereka meminta izin kepada Nabi (untuk kembali pulang) dengan berkata, “Sesungguhnya rumah-rumah kami terbuka (tidak ada penjaga).” Padahal rumah-rumah itu tidak terbuka, mereka hanyalah hendak lari.","hasanah_per_verse":1050},{"text_madani":"وَلَوْ دُخِلَتْ عَلَيْهِم مِّنْ أَقْطَارِهَا ثُمَّ سُئِلُوا الْفِتْنَةَ لَآتَوْهَا وَمَا تَلَبَّثُوا بِهَا إِلَّا يَسِيرًا","text_tajweed":"وَلَوْ دُخِلَتْ عَلَيْه[w:4082[ِم م]ِّنْ أَ[q:10710[قْ]طَارِهَا ثُ[g[مّ]َ سُئِلُو[s[اْ] [h:10711[ٱ]لْفِتْنَةَ لَأَتَوْهَا وَمَا تَلَبَّثُو[s[اْ] بِه[o[َآ] إِلَّا يَسِيرًا","translation_en":"And if an entry were made upon them from the outlying parts of it, then they were asked to wage war, they would certainly have done it, and they would not have stayed in it but a little while.","translation_id":"Dan kalau (Yasrib) diserang dari segala penjuru, dan mereka diminta agar membuat kekacauan, niscaya mereka mengerjakannya; dan hanya sebentar saja mereka menunggu.","hasanah_per_verse":600},{"text_madani":"وَلَقَدْ كَانُوا عَاهَدُوا اللَّهَ مِن قَبْلُ لَا يُوَلُّونَ الْأَدْبَارَ ۚ وَكَانَ عَهْدُ اللَّهِ مَسْئُولًا","text_tajweed":"وَلَقَ[q:341[دْ] كَانُو[s[اْ] عَ[n[ـٰ]هَدُو[s[اْ] [h:10712[ٱ]للَّهَ مِ[f:128[ن ق]َ[q:129[بْ]لُ لَا يُوَلُّونَ [h:10713[ٱ]لْأَ[q:2168[دْ]بَ[n[ـٰ]رَ‌ۚ وَكَانَ عَهْدُ [h:10714[ٱ]للَّهِ مَسْــُٔولاً","translation_en":"And certainly they had made a covenant with Allah before, that) they would not turn (their) backs; and Allah's covenant shall be inquired of.","translation_id":"Dan sungguh, mereka sebelum itu telah berjanji kepada Allah, tidak akan berbalik ke belakang (mundur). Dan perjanjian dengan Allah akan diminta pertanggungjawabannya.","hasanah_per_verse":550},{"text_madani":"قُل لَّن يَنفَعَكُمُ الْفِرَارُ إِن فَرَرْتُم مِّنَ الْمَوْتِ أَوِ الْقَتْلِ وَإِذًا لَّا تُمَتَّعُونَ إِلَّا قَلِيلًا","text_tajweed":"قُل لّ[a:10715[َن ي]َ[f:10716[نف]َعَكُمُ [h:10717[ٱ]لْفِرَارُ إِ[f:10718[ن ف]َرَرْت[w:10719[ُم م]ِّنَ [h:10720[ٱ]لْمَوْتِ أَوِ [h:10721[ٱ]لْقَتْلِ وَإِ[u:7848[ذًا ل]َّا تُمَتَّعُونَ إِلَّا قَلِيلاً","translation_en":"Say: Flight shall not do you any good if you fly from death or slaughter, and in that case you will not be allowed to enjoy yourselves but a little.","translation_id":"Katakanlah (Muhammad), “Lari tidaklah berguna bagimu, jika kamu melarikan diri dari kematian atau pembunuhan, dan jika demikian (kamu terhindar dari kematian) kamu hanya akan mengecap kesenangan sebentar saja.”","hasanah_per_verse":570},{"text_madani":"قُلْ مَن ذَا الَّذِي يَعْصِمُكُم مِّنَ اللَّهِ إِنْ أَرَادَ بِكُمْ سُوءًا أَوْ أَرَادَ بِكُمْ رَحْمَةً ۚ وَلَا يَجِدُونَ لَهُم مِّن دُونِ اللَّهِ وَلِيًّا وَلَا نَصِيرًا","text_tajweed":"قُلْ مَ[f:1375[ن ذ]َا [h:1376[ٱ]لَّذِى يَعْصِمُك[w:10722[ُم م]ِّنَ [h:321[ٱ]للَّهِ إِنْ أَرَادَ بِكُمْ س[o[ُو]ٓءًا أَوْ أَرَادَ بِكُمْ رَحْمَ[a:10723[ةً‌ۚ و]َلَا يَجِدُونَ لَه[w:1812[ُم م]ِّ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ وَلِي[a:3006[ًّا و]َلَا نَصِيرًا","translation_en":"Say: Who is it that can withhold you from Allah if He intends to do you evil, rather He intends to show you mercy? And they will not find for themselves besides Allah any guardian or a helper.","translation_id":"Katakanlah, “Siapakah yang dapat melindungi kamu dari (ketentuan) Allah jika Dia menghendaki bencana atasmu atau menghendaki rahmat untuk dirimu?” Mereka itu tidak akan mendapatkan pelindung dan penolong selain Allah.","hasanah_per_verse":800},{"text_madani":"قَدْ يَعْلَمُ اللَّهُ الْمُعَوِّقِينَ مِنكُمْ وَالْقَائِلِينَ لِإِخْوَانِهِمْ هَلُمَّ إِلَيْنَا ۖ وَلَا يَأْتُونَ الْبَأْسَ إِلَّا قَلِيلًا","text_tajweed":"۞ قَ[q:298[دْ] يَعْلَمُ [h:2880[ٱ]للَّهُ [h:10724[ٱ]لْمُعَوِّقِينَ مِ[f:344[نك]ُمْ وَ[h:10725[ٱ]لْق[o[َا]ٓئِلِينَ لِإِخْو[n[َٲ]نِهِمْ هَلُ[g[مّ]َ إِلَيْنَا‌ۖ وَلَا يَأْتُونَ [h:10726[ٱ]لْبَأْسَ إِلَّا قَلِيلاً","translation_en":"Allah knows indeed those among you who hinder others and those who say to their brethren: Come to us; and they come not to the fight but a little,","translation_id":"Sungguh, Allah mengetahui orang-orang yang menghalang-halangi di antara kamu dan orang yang berkata kepada saudara-saudaranya, “Marilah bersama kami.” Tetapi mereka datang berperang hanya sebentar,","hasanah_per_verse":680},{"text_madani":"أَشِحَّةً عَلَيْكُمْ ۖ فَإِذَا جَاءَ الْخَوْفُ رَأَيْتَهُمْ يَنظُرُونَ إِلَيْكَ تَدُورُ أَعْيُنُهُمْ كَالَّذِي يُغْشَىٰ عَلَيْهِ مِنَ الْمَوْتِ ۖ فَإِذَا ذَهَبَ الْخَوْفُ سَلَقُوكُم بِأَلْسِنَةٍ حِدَادٍ أَشِحَّةً عَلَى الْخَيْرِ ۚ أُولَٰئِكَ لَمْ يُؤْمِنُوا فَأَحْبَطَ اللَّهُ أَعْمَالَهُمْ ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا","text_tajweed":"أَشِحَّةً عَلَيْكُمْ‌ۖ فَإِذَا ج[o[َا]ٓءَ [h:10727[ٱ]لْخَوْفُ رَأَيْتَهُمْ يَ[f:1141[نظ]ُرُونَ إِلَيْكَ تَدُورُ أَعْيُنُهُمْ كَ[h:1506[ٱ]لَّذِى يُغْشَىٰ عَلَيْهِ مِنَ [h:10720[ٱ]لْمَوْتِ‌ۖ فَإِذَا ذَهَبَ [h:10728[ٱ]لْخَوْفُ سَلَقُوك[c:10729[ُم ب]ِأَلْسِنَةٍ حِدَادٍ أَشِحَّةً عَلَى [h:10730[ٱ]لْخَيْرِ‌ۚ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ لَمْ يُؤْمِنُو[s[اْ] فَأَحْبَطَ [h:10731[ٱ]للَّهُ أَعْمَ[n[ـٰ]لَهُمْ‌ۚ وَكَانَ ذ[n[َٲ]لِكَ عَلَى [h:412[ٱ]للَّهِ يَسِيرًا","translation_en":"Being niggardly with respect to you; but when fear comes, you will see them looking to you, their eyes rolling like one swooning because of death; but when the fear is gone they smite you with sharp tongues, being niggardly of the good things. These have not believed, therefore Allah has made their doing naught; and this is easy to Allah.","translation_id":"mereka kikir terhadapmu. Apabila datang ketakutan (bahaya), kamu lihat mereka itu memandang kepadamu dengan mata yang terbalik-balik seperti orang yang pingsan karena akan mati, dan apabila ketakutan telah hilang, mereka mencaci kamu dengan lidah yang tajam, sedang mereka kikir untuk berbuat kebaikan. Mereka itu tidak beriman, maka Allah menghapus amalnya. Dan yang demikian itu mudah bagi Allah.","hasanah_per_verse":1550},{"text_madani":"يَحْسَبُونَ الْأَحْزَابَ لَمْ يَذْهَبُوا ۖ وَإِن يَأْتِ الْأَحْزَابُ يَوَدُّوا لَوْ أَنَّهُم بَادُونَ فِي الْأَعْرَابِ يَسْأَلُونَ عَنْ أَنبَائِكُمْ ۖ وَلَوْ كَانُوا فِيكُم مَّا قَاتَلُوا إِلَّا قَلِيلًا","text_tajweed":"يَحْسَبُونَ [h:10732[ٱ]لْأَحْزَابَ لَمْ يَذْهَبُو[s[اْ‌ۖ] وَإ[a:10733[ِن ي]َأْتِ [h:10734[ٱ]لْأَحْزَابُ يَوَدُّو[s[اْ] لَوْ أَ[g[نّ]َه[c:10735[ُم ب]َادُونَ فِى [h:10736[ٱ]لْأَعْرَابِ يَسْــَٔلُونَ عَنْ أَ[i:10737[نۢب][o[َا]ٓئِكُمْ‌ۖ وَلَوْ كَانُو[s[اْ] فِيك[w:5627[ُم م]َّا قَ[n[ـٰ]تَل[o[ُوٓ][s[اْ] إِلَّا قَلِيلاً","translation_en":"They think the allies are not gone, and if the allies should come (again) they would fain be in the deserts with the desert Arabs asking for news about you, and if they were among you they would not fight save a little.","translation_id":"Mereka mengira (bahwa) golongan-golongan (yang bersekutu) itu belum pergi, dan jika golongan-golongan (yang bersekutu) itu datang kembali, niscaya mereka ingin berada di dusun-dusun bersama-sama orang Arab Badui, sambil menanyakan berita tentang kamu. Dan sekiranya mereka berada bersamamu, mereka tidak akan berperang, melainkan sebentar saja.","hasanah_per_verse":1020},{"text_madani":"لَّقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ لِّمَن كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الْآخِرَ وَذَكَرَ اللَّهَ كَثِيرًا","text_tajweed":"لَّقَ[q:2389[دْ] كَانَ لَكُمْ فِى رَسُولِ [h:5744[ٱ]للَّهِ أُسْوَةٌ حَسَنَ[u:10738[ةٌ ل]ِّمَ[f:10739[ن ك]َانَ يَرْجُو[s[اْ] [h:10740[ٱ]للَّهَ وَ[h:10741[ٱ]لْيَوْمَ [h:10742[ٱ]لْأَخِرَ وَذَكَرَ [h:10743[ٱ]للَّهَ كَثِيرًا","translation_en":"Certainly you have in the Messenger of Allah an excellent exemplar for him who hopes in Allah and the latter day and remembers Allah much.","translation_id":"Sungguh, telah ada pada (diri) Rasulullah itu suri teladan yang baik bagimu (yaitu) bagi orang yang mengharap (rahmat) Allah dan (kedatangan) hari Kiamat dan yang banyak mengingat Allah.","hasanah_per_verse":650},{"text_madani":"وَلَمَّا رَأَى الْمُؤْمِنُونَ الْأَحْزَابَ قَالُوا هَٰذَا مَا وَعَدَنَا اللَّهُ وَرَسُولُهُ وَصَدَقَ اللَّهُ وَرَسُولُهُ ۚ وَمَا زَادَهُمْ إِلَّا إِيمَانًا وَتَسْلِيمًا","text_tajweed":"وَلَ[g[مّ]َا رَءَا [h:10744[ٱ]لْمُؤْمِنُونَ [h:10745[ٱ]لْأَحْزَابَ قَالُو[s[اْ] هَ[n[ـٰ]ذَا مَا وَعَدَنَا [h:10704[ٱ]للَّهُ وَرَسُولُهُ[n[ۥ] وَصَدَقَ [h:10746[ٱ]للَّهُ وَرَسُولُهُ[n[ۥ]‌ۚ وَمَا زَادَهُمْ إِلّ[o[َآ] إِيمَ[n[ـٰ][a:10747[نًا و]َتَسْلِيمًا","translation_en":"And when the believers saw the allies, they said: This is what Allah and His Messenger promised us, and Allah and His Messenger spoke the truth; and it only increased them in faith and submission.","translation_id":"Dan ketika orang-orang mukmin melihat golongan-golongan (yang bersekutu) itu, mereka berkata, “Inilah yang dijanjikan Allah dan Rasul-Nya kepada kita.” Dan benarlah Allah dan Rasul-Nya. Dan yang demikian itu menambah keimanan dan keislaman mereka.","hasanah_per_verse":850},{"text_madani":"مِّنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ ۖ فَمِنْهُم مَّن قَضَىٰ نَحْبَهُ وَمِنْهُم مَّن يَنتَظِرُ ۖ وَمَا بَدَّلُوا تَبْدِيلًا","text_tajweed":"مِّنَ [h:3047[ٱ]لْمُؤْمِنِينَ رِجَا[f:10748[لٌ ص]َدَقُو[s[اْ] مَا عَ[n[ـٰ]هَدُو[s[اْ] [h:10712[ٱ]للَّهَ عَلَيْهِ‌ۖ فَمِنْه[w:1456[ُم م]َّ[f:10749[ن ق]َضَىٰ نَحْبَهُ[n[ۥ] وَمِنْه[w:1106[ُم م]ّ[a:10750[َن ي]َ[f:10751[نت]َظِرُ‌ۖ وَمَا بَدَّلُو[s[اْ] تَ[q:10752[بْ]دِيلاً","translation_en":"Of the believers are men who are true to the covenant which they made with Allah: so of them is he who accomplished his vow, and of them is he who yet waits, and they have not changed in the least","translation_id":"Di antara orang-orang mukmin itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah. Dan di antara mereka ada yang gugur, dan di antara mereka ada (pula) yang menunggu-nunggu dan mereka sedikit pun tidak mengubah (janjinya),","hasanah_per_verse":750},{"text_madani":"لِّيَجْزِيَ اللَّهُ الصَّادِقِينَ بِصِدْقِهِمْ وَيُعَذِّبَ الْمُنَافِقِينَ إِن شَاءَ أَوْ يَتُوبَ عَلَيْهِمْ ۚ إِنَّ اللَّهَ كَانَ غَفُورًا رَّحِيمًا","text_tajweed":"لِّيَ[q:5945[جْ]زِىَ [h:7189[ٱ]للَّهُ [h:10753[ٱ][l[ل]صَّ[n[ـٰ]دِقِينَ بِصِ[q:10754[دْ]قِهِمْ وَيُعَذِّبَ [h:10755[ٱ]لْمُنَ[n[ـٰ]فِقِينَ إِ[f:364[ن ش][o[َا]ٓءَ أَوْ يَتُوبَ عَلَيْهِمْ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ كَانَ غَفُو[u:2701[رًا ر]َّحِيمًا","translation_en":"That Allah may reward the truthful for their truth, and punish the hypocrites if He please or turn to them (mercifully); surely Allah is Forgiving, Merciful.","translation_id":"agar Allah memberikan balasan kepada orang-orang yang benar itu karena kebenarannya, dan mengazab orang munafik jika Dia kehendaki, atau menerima tobat mereka. Sungguh, Allah Maha Pengampun, Maha Penyayang.","hasanah_per_verse":720},{"text_madani":"وَرَدَّ اللَّهُ الَّذِينَ كَفَرُوا بِغَيْظِهِمْ لَمْ يَنَالُوا خَيْرًا ۚ وَكَفَى اللَّهُ الْمُؤْمِنِينَ الْقِتَالَ ۚ وَكَانَ اللَّهُ قَوِيًّا عَزِيزًا","text_tajweed":"وَرَدَّ [h:10756[ٱ]للَّهُ [h:1171[ٱ]لَّذِينَ كَفَرُو[s[اْ] بِغَيْظِهِمْ لَمْ يَنَالُو[s[اْ] خَيْ[a:10757[رًا‌ۚ و]َكَفَى [h:10758[ٱ]للَّهُ [h:5717[ٱ]لْمُؤْمِنِينَ [h:10759[ٱ]لْقِتَالَ‌ۚ وَكَانَ [h:2653[ٱ]للَّهُ قَوِيًّا عَزِيزًا","translation_en":"And Allah turned back the unbelievers in their rage; they did not obtain any advantage, and Allah sufficed the believers in fighting; and Allah is Strong, Mighty.","translation_id":"Dan Allah menghalau orang-orang kafir itu yang keadaan mereka penuh kejengkelan, karena mereka (juga) tidak memperoleh keuntungan apa pun. Cukuplah Allah (yang menolong) menghindarkan orang-orang mukmin dalam peperangan. Dan Allah Mahakuat, Mahaperkasa.","hasanah_per_verse":740},{"text_madani":"وَأَنزَلَ الَّذِينَ ظَاهَرُوهُم مِّنْ أَهْلِ الْكِتَابِ مِن صَيَاصِيهِمْ وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ فَرِيقًا تَقْتُلُونَ وَتَأْسِرُونَ فَرِيقًا","text_tajweed":"وَأَ[f:91[نز]َلَ [h:10760[ٱ]لَّذِينَ ظَ[n[ـٰ]هَرُوه[w:10761[ُم م]ِّنْ أَهْلِ [h:545[ٱ]لْكِتَ[n[ـٰ]بِ مِ[f:10762[ن ص]َيَاصِيهِمْ وَقَذَفَ فِى قُلُوبِهِمُ [h:10763[ٱ][l[ل]رُّعْبَ فَرِي[f:10764[قًا ت]َ[q:429[قْ]تُلُونَ وَتَأْسِرُونَ فَرِيقًا","translation_en":"And He drove down those of the followers of the Book who backed them from their fortresses and He cast awe into their hearts; some you killed and you took captive another part.","translation_id":"Dan Dia menurunkan orang-orang Ahli Kitab (Bani Quraizah) yang membantu mereka (golongan-golongan yang bersekutu) dari benteng-benteng mereka, dan Dia memasukkan rasa takut ke dalam hati mereka. Sebagian mereka kamu bunuh dan sebagian yang lain kamu tawan.","hasanah_per_verse":770},{"text_madani":"وَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَارَهُمْ وَأَمْوَالَهُمْ وَأَرْضًا لَّمْ تَطَئُوهَا ۚ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرًا","text_tajweed":"وَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَ[n[ـٰ]رَهُمْ وَأَمْو[n[َٲ]لَهُمْ وَأَرْ[u:10765[ضًا ل]َّمْ تَطَــُٔوهَا‌ۚ وَكَانَ [h:2653[ٱ]للَّهُ عَلَىٰ كُلِّ ش[f:10766[َىْءٍ ق]َدِيرًا","translation_en":"And He made you heirs to their land and their dwellings and their property, and (to) a land which you have not yet trodden, and Allah has power over all things.","translation_id":"Dan Dia mewariskan kepadamu tanah-tanah, rumah-rumah dan harta benda mereka, dan (begitu pula) tanah yang belum kamu injak. Dan Allah Mahakuasa terhadap segala sesuatu.","hasanah_per_verse":610},{"text_madani":"يَا أَيُّهَا النَّبِيُّ قُل لِّأَزْوَاجِكَ إِن كُنتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلًا","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:5411[ٱ][l[ل][g[نّ]َبِىُّ قُل لِّأَزْو[n[َٲ]جِكَ إِ[f:10767[ن ك]ُ[f:10768[نت]ُ[g[نّ]َ تُرِ[q:10769[دْ]نَ [h:10770[ٱ]لْحَيَ[s[و][n[ٲ]ةَ [h:446[ٱ][l[ل]دُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُ[g[نّ]َ وَأُسَرِّحْكُ[g[نّ]َ سَرَا[f:10771[حًا ج]َمِيلاً","translation_en":"O Prophet! say to your wives: If you desire this world's life and its adornment, then come, I will give you a provision and allow you to depart a goodly departing","translation_id":"Wahai Nabi! Katakanlah kepada istri-istrimu, “Jika kamu menginginkan kehidupan di dunia dan perhiasannya, maka kemarilah agar kuberikan kepadamu mut‘ah dan aku ceraikan kamu dengan cara yang baik.”","hasanah_per_verse":790},{"text_madani":"وَإِن كُنتُنَّ تُرِدْنَ اللَّهَ وَرَسُولَهُ وَالدَّارَ الْآخِرَةَ فَإِنَّ اللَّهَ أَعَدَّ لِلْمُحْسِنَاتِ مِنكُنَّ أَجْرًا عَظِيمًا","text_tajweed":"وَإِ[f:10772[ن ك]ُ[f:10768[نت]ُ[g[نّ]َ تُرِ[q:10769[دْ]نَ [h:10773[ٱ]للَّهَ وَرَسُولَهُ[n[ۥ] وَ[h:10774[ٱ][l[ل]دَّارَ [h:10775[ٱ]لْأَخِرَةَ فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ أَعَدَّ لِلْمُحْسِنَ[n[ـٰ]تِ مِ[f:10776[نك]ُ[g[نّ]َ أَ[q:2795[جْ]رًا عَظِيمًا","translation_en":"And if you desire Allah and His Messenger and the latter abode, then surely Allah has prepared for the doers of good among you a mighty reward.","translation_id":"Dan jika kamu menginginkan Allah dan Rasul-Nya dan negeri akhirat, maka sesungguhnya Allah menyediakan pahala yang besar bagi siapa yang berbuat baik di antara kamu.","hasanah_per_verse":640},{"text_madani":"يَا نِسَاءَ النَّبِيِّ مَن يَأْتِ مِنكُنَّ بِفَاحِشَةٍ مُّبَيِّنَةٍ يُضَاعَفْ لَهَا الْعَذَابُ ضِعْفَيْنِ ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا","text_tajweed":"يَ[n[ـٰ]نِس[o[َا]ٓءَ [h:10777[ٱ][l[ل][g[نّ]َبِىِّ م[a:8547[َن ي]َأْتِ مِ[f:10776[نك]ُ[g[نّ]َ بِفَ[n[ـٰ]حِشَ[a:2665[ةٍ م]ُّبَيِّنَ[a:10778[ةٍ ي]ُضَ[n[ـٰ]عَفْ لَهَا [h:10779[ٱ]لْعَذَابُ ضِعْفَيْنِ‌ۚ وَكَانَ ذ[n[َٲ]لِكَ عَلَى [h:412[ٱ]للَّهِ يَسِيرًا","translation_en":"O wives of the prophet! whoever of you commits an open indecency, the punishment shall be increased to her doubly; and this is easy to Allah.","translation_id":"Wahai istri-istri Nabi! Barangsiapa di antara kamu yang mengerjakan perbuatan keji yang nyata, niscaya azabnya akan dilipatgandakan dua kali lipat kepadanya. Dan yang demikian itu, mudah bagi Allah.","hasanah_per_verse":690},{"text_madani":"وَمَن يَقْنُتْ مِنكُنَّ لِلَّهِ وَرَسُولِهِ وَتَعْمَلْ صَالِحًا نُّؤْتِهَا أَجْرَهَا مَرَّتَيْنِ وَأَعْتَدْنَا لَهَا رِزْقًا كَرِيمًا","text_tajweed":"۞ وَم[a:10780[َن ي]َ[q:10781[قْ]نُتْ مِ[f:10776[نك]ُ[g[نّ]َ لِلَّهِ وَرَسُولِه[n[ِۦ] وَتَعْمَلْ صَ[n[ـٰ]لِ[a:10782[حًا ن]ُّؤْتِه[o[َآ] أَ[q:10783[جْ]رَهَا مَرَّتَيْنِ وَأَعْتَ[q:2782[دْ]نَا لَهَا رِزْ[f:10784[قًا ك]َرِيمًا","translation_en":"And whoever of you is obedient to Allah and His Messenger and does good, We will give to her her reward doubly, and We have prepared for her an honorable sustenance.","translation_id":"Dan barangsiapa di antara kamu (istri-istri Nabi) tetap taat kepada Allah dan Rasul-Nya dan mengerjakan kebajikan, niscaya Kami berikan pahala kepadanya dua kali lipat dan Kami sediakan rezeki yang mulia baginya.","hasanah_per_verse":640},{"text_madani":"يَا نِسَاءَ النَّبِيِّ لَسْتُنَّ كَأَحَدٍ مِّنَ النِّسَاءِ ۚ إِنِ اتَّقَيْتُنَّ فَلَا تَخْضَعْنَ بِالْقَوْلِ فَيَطْمَعَ الَّذِي فِي قَلْبِهِ مَرَضٌ وَقُلْنَ قَوْلًا مَّعْرُوفًا","text_tajweed":"يَ[n[ـٰ]نِس[o[َا]ٓءَ [h:10777[ٱ][l[ل][g[نّ]َبِىِّ لَسْتُ[g[نّ]َ كَأَحَ[a:10785[دٍ م]ِّنَ [h:1769[ٱ][l[ل][g[نّ]ِس[o[َا]ٓءِۚ إِنِ [h:10786[ٱ]تَّقَيْتُ[g[نّ]َ فَلَا تَخْضَعْنَ بِ[h:7118[ٱ]لْقَوْلِ فَيَ[q:10787[طْ]مَعَ [h:10788[ٱ]لَّذِى فِى قَلْبِه[n[ِۦ] مَرَ[a:10789[ضٌ و]َقُلْنَ قَوْل[a:1331[اً م]َّعْرُوفًا","translation_en":"O wives of the Prophet! you are not like any other of the women; If you will be on your guard, then be not soft in (your) speech, lest he in whose heart is a disease yearn; and speak a good word.","translation_id":"Wahai istri-istri Nabi! Kamu tidak seperti perempuan-perempuan yang lain, jika kamu bertakwa. Maka janganlah kamu tunduk (melemah lembutkan suara) dalam berbicara sehingga bangkit nafsu orang yang ada penyakit dalam hatinya, dan ucapkanlah perkataan yang baik.","hasanah_per_verse":810},{"text_madani":"وَقَرْنَ فِي بُيُوتِكُنَّ وَلَا تَبَرَّجْنَ تَبَرُّجَ الْجَاهِلِيَّةِ الْأُولَىٰ ۖ وَأَقِمْنَ الصَّلَاةَ وَآتِينَ الزَّكَاةَ وَأَطِعْنَ اللَّهَ وَرَسُولَهُ ۚ إِنَّمَا يُرِيدُ اللَّهُ لِيُذْهِبَ عَنكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيرًا","text_tajweed":"وَقَرْنَ فِى بُيُوتِكُ[g[نّ]َ وَلَا تَبَرَّ[q:10790[جْ]نَ تَبَرُّجَ [h:10791[ٱ]لْجَ[n[ـٰ]هِلِيَّةِ [h:10792[ٱ]لْأُولَىٰۖ وَأَقِمْنَ [h:10793[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ وَءَاتِينَ [h:10794[ٱ][l[ل]زَّكَ[s[و][n[ٲ]ةَ وَأَطِعْنَ [h:10795[ٱ]للَّهَ وَرَسُولَهُۚ[o[ۥٓ] إِ[g[نّ]َمَا يُرِيدُ [h:976[ٱ]للَّهُ لِيُذْهِبَ عَ[f:10796[نك]ُمُ [h:10797[ٱ][l[ل]رِّ[q:4401[جْ]سَ أَهْلَ [h:6424[ٱ]لْبَيْتِ وَيُطَهِّرَكُمْ تَ[q:10798[طْ]هِيرًا","translation_en":"And stay in your houses and do not display your finery like the displaying of the ignorance of yore; and keep up prayer, and pay the poor-rate, and obey Allah and His Messenger. Allah only desires to keep away the uncleanness from you, O people of the House! and to purify you a (thorough) purifying.","translation_id":"Dan hendaklah kamu tetap di rumahmu dan janganlah kamu berhias dan (bertingkah laku) seperti orang-orang jahiliah dahulu, dan laksanakanlah shalat, tunaikanlah zakat dan taatilah Allah dan Rasul-Nya. Sesungguhnya Allah bermaksud hendak menghilangkan dosa dari kamu, wahai ahlulbait dan membersihkan kamu sebersih-bersihnya.","hasanah_per_verse":1220},{"text_madani":"وَاذْكُرْنَ مَا يُتْلَىٰ فِي بُيُوتِكُنَّ مِنْ آيَاتِ اللَّهِ وَالْحِكْمَةِ ۚ إِنَّ اللَّهَ كَانَ لَطِيفًا خَبِيرًا","text_tajweed":"وَ[h:9999[ٱ]ذْكُرْنَ مَا يُتْلَىٰ فِى بُيُوتِكُ[g[نّ]َ مِنْ ءَايَ[n[ـٰ]تِ [h:1298[ٱ]للَّهِ وَ[h:1302[ٱ]لْحِكْمَةِۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ كَانَ لَطِيفًا خَبِيرًا","translation_en":"And keep to mind what is recited in your houses of the communications of Allah and the wisdom; surely Allah is Knower of subtleties, Aware.","translation_id":"Dan ingatlah apa yang dibacakan di rumahmu dari ayat-ayat Allah dan hikmah (sunnah Nabimu). Sungguh, Allah Mahalembut, Maha Mengetahui.","hasanah_per_verse":560},{"text_madani":"إِنَّ الْمُسْلِمِينَ وَالْمُسْلِمَاتِ وَالْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَالْقَانِتِينَ وَالْقَانِتَاتِ وَالصَّادِقِينَ وَالصَّادِقَاتِ وَالصَّابِرِينَ وَالصَّابِرَاتِ وَالْخَاشِعِينَ وَالْخَاشِعَاتِ وَالْمُتَصَدِّقِينَ وَالْمُتَصَدِّقَاتِ وَالصَّائِمِينَ وَالصَّائِمَاتِ وَالْحَافِظِينَ فُرُوجَهُمْ وَالْحَافِظَاتِ وَالذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ أَعَدَّ اللَّهُ لَهُم مَّغْفِرَةً وَأَجْرًا عَظِيمًا","text_tajweed":"إِ[g[نّ]َ [h:10799[ٱ]لْمُسْلِمِينَ وَ[h:10800[ٱ]لْمُسْلِمَ[n[ـٰ]تِ وَ[h:10801[ٱ]لْمُؤْمِنِينَ وَ[h:5718[ٱ]لْمُؤْمِنَ[n[ـٰ]تِ وَ[h:1793[ٱ]لْقَ[n[ـٰ]نِتِينَ وَ[h:10802[ٱ]لْقَ[n[ـٰ]نِتَ[n[ـٰ]تِ وَ[h:1792[ٱ][l[ل]صَّ[n[ـٰ]دِقِينَ وَ[h:10803[ٱ][l[ل]صَّ[n[ـٰ]دِقَ[n[ـٰ]تِ وَ[h:918[ٱ][l[ل]صَّ[n[ـٰ]بِرِينَ وَ[h:10804[ٱ][l[ل]صَّ[n[ـٰ]بِر[n[َٲ]تِ وَ[h:10805[ٱ]لْخَ[n[ـٰ]شِعِينَ وَ[h:10806[ٱ]لْخَ[n[ـٰ]شِعَ[n[ـٰ]تِ وَ[h:10807[ٱ]لْمُتَصَدِّقِينَ وَ[h:10808[ٱ]لْمُتَصَدِّقَ[n[ـٰ]تِ وَ[h:10809[ٱ][l[ل]صَّ[o[ـٰٓ]ئِمِينَ وَ[h:10810[ٱ][l[ل]صَّ[o[ـٰٓ]ئِمَ[n[ـٰ]تِ وَ[h:10811[ٱ]لْحَ[n[ـٰ]فِظِينَ فُرُوجَهُمْ وَ[h:10812[ٱ]لْحَ[n[ـٰ]فِظَ[n[ـٰ]تِ وَ[h:10813[ٱ][l[ل]ذّ[n[َٲ]كِرِينَ [h:10814[ٱ]للَّهَ كَثِي[a:10815[رًا و]َ[h:10816[ٱ][l[ل]ذّ[n[َٲ]كِر[n[َٲ]تِ أَعَدَّ [h:5775[ٱ]للَّهُ لَه[w:10817[ُم م]َّغْفِرَ[a:10818[ةً و]َأَ[q:10819[جْ]رًا عَظِيمًا","translation_en":"Surely the men who submit and the women who submit, and the believing men and the believing women, and the obeying men and the obeying women, and the truthful men and the truthful women, and the patient men and the patient women and the humble men and the humble women, and the almsgiving men and the almsgiving women, and the fasting men and the fasting women, and the men who guard their private parts and the women who guard, and the men who remember Allah much and the women who remember-- Allah has prepared for them forgiveness and a mighty reward.","translation_id":"Sungguh, laki-laki dan perempuan muslim, laki-laki dan perempuan mukmin, laki-laki dan perempuan yang tetap dalam ketaatannya, laki-laki dan perempuan yang benar, laki-laki dan perempuan yang sabar, laki-laki dan perempuan yang khusyuk, laki-laki dan perempuan yang bersedekah, laki-laki dan perempuan yang berpuasa, laki-laki dan perempuan yang memelihara kehormatannya, laki-laki dan perempuan yang banyak menyebut (nama) Allah, Allah telah menyediakan untuk mereka ampunan dan pahala yang besar.","hasanah_per_verse":2230},{"text_madani":"وَمَا كَانَ لِمُؤْمِنٍ وَلَا مُؤْمِنَةٍ إِذَا قَضَى اللَّهُ وَرَسُولُهُ أَمْرًا أَن يَكُونَ لَهُمُ الْخِيَرَةُ مِنْ أَمْرِهِمْ ۗ وَمَن يَعْصِ اللَّهَ وَرَسُولَهُ فَقَدْ ضَلَّ ضَلَالًا مُّبِينًا","text_tajweed":"وَمَا كَانَ لِمُؤْمِ[a:10820[نٍ و]َلَا مُؤْمِنَةٍ إِذَا قَضَى [h:10821[ٱ]للَّهُ وَرَسُولُهُ[o[ۥٓ] أَمْرًا أ[a:3312[َن ي]َكُونَ لَهُمُ [h:10226[ٱ]لْخِيَرَةُ مِنْ أَمْرِهِمْۗ وَم[a:2634[َن ي]َعْصِ [h:2635[ٱ]للَّهَ وَرَسُولَهُ[n[ۥ] فَقَ[q:563[دْ] ضَلَّ ضَلَ[n[ـٰ]ل[a:10822[اً م]ُّبِينًا","translation_en":"And it behoves not a believing man and a believing woman that they should have any choice in their matter when Allah and His Messenger have decided a matter; and whoever disobeys Allah and His Messenger, he surely strays off a manifest straying.","translation_id":"Dan tidaklah pantas bagi laki-laki yang mukmin dan perempuan yang mukmin, apabila Allah dan Rasul-Nya telah menetapkan suatu ketetapan, akan ada pilihan (yang lain) bagi mereka tentang urusan mereka. Dan barangsiapa mendurhakai Allah dan Rasul-Nya, maka sungguh, dia telah tersesat, dengan kesesatan yang nyata.","hasanah_per_verse":920},{"text_madani":"وَإِذْ تَقُولُ لِلَّذِي أَنْعَمَ اللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَاتَّقِ اللَّهَ وَتُخْفِي فِي نَفْسِكَ مَا اللَّهُ مُبْدِيهِ وَتَخْشَى النَّاسَ وَاللَّهُ أَحَقُّ أَن تَخْشَاهُ ۖ فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَرًا زَوَّجْنَاكَهَا لِكَيْ لَا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ فِي أَزْوَاجِ أَدْعِيَائِهِمْ إِذَا قَضَوْا مِنْهُنَّ وَطَرًا ۚ وَكَانَ أَمْرُ اللَّهِ مَفْعُولًا","text_tajweed":"وَإِذْ تَقُولُ لِلَّذ[o[ِىٓ] أَنْعَمَ [h:2900[ٱ]للَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَ[h:10823[ٱ]تَّقِ [h:10824[ٱ]للَّهَ وَتُخْفِى فِى نَفْسِكَ مَا [h:10825[ٱ]للَّهُ مُ[q:10826[بْ]دِيهِ وَتَخْشَى [h:10827[ٱ][l[ل][g[نّ]َاسَ وَ[h:72[ٱ]للَّهُ أَحَقُّ أَ[f:10828[ن ت]َخْشَ[n[ـٰ]هُۖ فَلَ[g[مّ]َا قَضَىٰ زَيْ[a:10829[دٌ م]ِّنْهَا وَطَ[f:10830[رًا ز]َوَّ[q:10831[جْ]نَ[n[ـٰ]كَهَا لِكَىْ لَا يَكُونَ عَلَى [h:2329[ٱ]لْمُؤْمِنِينَ حَرَ[f:10832[جٌ ف][o[ِىٓ] أَزْو[n[َٲ]جِ أَ[q:10833[دْ]عِي[o[َا]ٓئِهِمْ إِذَا قَضَوْ[s[اْ] مِنْهُ[g[نّ]َ وَطَ[a:10834[رًاۚ و]َكَانَ أَمْرُ [h:2832[ٱ]للَّهِ مَفْعُولاً","translation_en":"And when you said to him to whom Allah had shown favor and to whom you had shown a favor: Keep your wife to yourself and be careful of (your duty to) Allah; and you concealed in your soul what Allah would bring to light, and you feared men, and Allah had a greater right that you should fear Him. But when Zaid had accomplished his want of her, We gave her to you as a wife, so that there should be no difficulty for the believers in respect of the wives of their adopted sons, when they have accomplished their want of them; and Allah's command shall be performed.","translation_id":"Dan (ingatlah), ketika engkau (Muhammad) berkata kepada orang yang telah diberi nikmat oleh Allah dan engkau (juga) telah memberi nikmat kepadanya, “Pertahankanlah terus istrimu dan bertakwalah kepada Allah,” sedang engkau menyembunyikan di dalam hatimu apa yang akan dinyatakan oleh Allah, dan engkau takut kepada manusia, padahal Allah lebih berhak engkau takuti. Maka ketika Zaid telah mengakhiri keperluan terhadap istrinya (menceraikannya), Kami nikahkan engkau dengan dia (Zainab) agar tidak ada keberatan bagi orang mukmin untuk (menikahi) istri-istri anak-anak angkat mereka, apabila anak-anak angkat itu telah menyelesaikan keperluannya terhadap istrinya. Dan ketetapan Allah itu pasti terjadi.","hasanah_per_verse":1960},{"text_madani":"مَّا كَانَ عَلَى النَّبِيِّ مِنْ حَرَجٍ فِيمَا فَرَضَ اللَّهُ لَهُ ۖ سُنَّةَ اللَّهِ فِي الَّذِينَ خَلَوْا مِن قَبْلُ ۚ وَكَانَ أَمْرُ اللَّهِ قَدَرًا مَّقْدُورًا","text_tajweed":"مَّا كَانَ عَلَى [h:5875[ٱ][l[ل][g[نّ]َبِىِّ مِنْ حَرَ[f:10835[جٍ ف]ِيمَا فَرَضَ [h:10836[ٱ]للَّهُ لَهُۖ[n[ۥ] سُ[g[نّ]َةَ [h:10837[ٱ]للَّهِ فِى [h:6320[ٱ]لَّذِينَ خَلَوْ[s[اْ] مِ[f:128[ن ق]َ[q:129[بْ]لُۚ وَكَانَ أَمْرُ [h:2832[ٱ]للَّهِ قَدَ[a:10838[رًا م]َّ[q:10839[قْ]دُورًا","translation_en":"There is no harm in the Prophet doing that which Allah has ordained for him; such has been the course of Allah with respect to those who have gone before; and the command of Allah is a decree that is made absolute:","translation_id":"Tidak ada keberatan apa pun pada Nabi tentang apa yang telah ditetapkan Allah baginya. (Allah telah menetapkan yang demikian) sebagai sunnah Allah pada nabi-nabi yang telah terdahulu. Dan ketetapan Allah itu suatu ketetapan yang pasti berlaku,","hasanah_per_verse":750},{"text_madani":"الَّذِينَ يُبَلِّغُونَ رِسَالَاتِ اللَّهِ وَيَخْشَوْنَهُ وَلَا يَخْشَوْنَ أَحَدًا إِلَّا اللَّهَ ۗ وَكَفَىٰ بِاللَّهِ حَسِيبًا","text_tajweed":"ٱلَّذِينَ يُبَلِّغُونَ رِسَ[n[ـٰ]لَ[n[ـٰ]تِ [h:10840[ٱ]للَّهِ وَيَخْشَوْنَهُ[n[ۥ] وَلَا يَخْشَوْنَ أَحَدًا إِلَّا [h:416[ٱ]للَّهَۗ وَكَفَىٰ بِ[h:32[ٱ]للَّهِ حَسِيبًا","translation_en":"Those who deliver the messages of Allah and fear Him, and do not fear any one but Allah; and Allah is sufficient to take account.","translation_id":"(yaitu) orang-orang yang menyampaikan risalah-risalah Allah, mereka takut kepada-Nya dan tidak merasa takut kepada siapa pun selain kepada Allah. Dan cukuplah Allah sebagai pembuat perhitungan.","hasanah_per_verse":610},{"text_madani":"مَّا كَانَ مُحَمَّدٌ أَبَا أَحَدٍ مِّن رِّجَالِكُمْ وَلَٰكِن رَّسُولَ اللَّهِ وَخَاتَمَ النَّبِيِّينَ ۗ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا","text_tajweed":"مَّا كَانَ مُحَ[g[مّ]َدٌ أَب[o[َآ] أَحَ[a:1710[دٍ م]ّ[u:1674[ِن ر]ِّجَالِكُمْ وَلَ[n[ـٰ]ك[u:10841[ِن ر]َّسُولَ [h:3273[ٱ]للَّهِ وَخَاتَمَ [h:10842[ٱ][l[ل][g[نّ]َبِيِّـ[n[ـۧ]نَۗ وَكَانَ [h:2653[ٱ]للَّهُ بِكُلِّ شَىْءٍ عَلِيمًا","translation_en":"Muhammad is not the father of any of your men, but he is the Messenger of Allah and the Last of the prophets; and Allah is cognizant of all things.","translation_id":"Muhammad itu bukanlah bapak dari seseorang di antara kamu, tetapi dia adalah utusan Allah dan penutup para nabi. Dan Allah Maha Mengetahui segala sesuatu.","hasanah_per_verse":660},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] [h:3416[ٱ]ذْكُرُو[s[اْ] [h:10843[ٱ]للَّهَ ذِكْ[f:10844[رًا ك]َثِيرًا","translation_en":"O you who believe! remember Allah, remembering frequently,","translation_id":"Wahai orang-orang yang beriman! Ingatlah kepada Allah, dengan mengingat (nama-Nya) sebanyak-banyaknya,","hasanah_per_verse":350},{"text_madani":"وَسَبِّحُوهُ بُكْرَةً وَأَصِيلًا","text_tajweed":"وَسَبِّحُوهُ بُكْرَ[a:9566[ةً و]َأَصِيلاً","translation_en":"And glorify Him morning and evening.","translation_id":"dan bertasbihlah kepada-Nya pada waktu pagi dan petang.","hasanah_per_verse":160},{"text_madani":"هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ وَمَلَائِكَتُهُ لِيُخْرِجَكُم مِّنَ الظُّلُمَاتِ إِلَى النُّورِ ۚ وَكَانَ بِالْمُؤْمِنِينَ رَحِيمًا","text_tajweed":"هُوَ [h:153[ٱ]لَّذِى يُصَلِّى عَلَيْكُمْ وَمَلَ[o[ـٰٓ]ئِكَتُهُ[n[ۥ] لِيُخْرِجَك[w:10845[ُم م]ِّنَ [h:1491[ٱ][l[ل]ظُّلُمَ[n[ـٰ]تِ إِلَى [h:1492[ٱ][l[ل][g[نّ]ُورِۚ وَكَانَ بِ[h:3560[ٱ]لْمُؤْمِنِينَ رَحِيمًا","translation_en":"He it is Who sends His blessings on you, and (so do) His angels, that He may bring you forth out of utter darkness into the light; and He is Merciful to the believers.","translation_id":"Dialah yang memberi rahmat kepadamu dan para malaikat-Nya (memohonkan ampunan untukmu), agar Dia mengeluarkan kamu dari kegelapan kepada cahaya (yang terang). Dan Dia Maha Penyayang kepada orang-orang yang beriman.","hasanah_per_verse":650},{"text_madani":"تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلَامٌ ۚ وَأَعَدَّ لَهُمْ أَجْرًا كَرِيمًا","text_tajweed":"تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ[n[ۥ] سَلَ[n[ـٰ][a:10846[مٌۚ و]َأَعَدَّ لَهُمْ أَ[q:2795[جْ][f:10847[رًا ك]َرِيمًا","translation_en":"Their salutation on the day that they meet Him shall be, Peace, and He has prepared for them an honourable reward.","translation_id":"Penghormatan mereka (orang-orang mukmin itu) ketika mereka menemui-Nya ialah, “Salam,” dan Dia menyediakan pahala yang mulia bagi mereka.","hasanah_per_verse":350},{"text_madani":"يَا أَيُّهَا النَّبِيُّ إِنَّا أَرْسَلْنَاكَ شَاهِدًا وَمُبَشِّرًا وَنَذِيرًا","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:5411[ٱ][l[ل][g[نّ]َبِىُّ إِ[g[نّ][o[َآ] أَرْسَلْنَ[n[ـٰ]كَ شَ[n[ـٰ]هِ[a:10848[دًا و]َمُبَشِّ[a:10849[رًا و]َنَذِيرًا","translation_en":"O Prophet! surely We have sent you as a witness, and as a bearer of good news and as a warner,","translation_id":"Wahai Nabi! Sesungguhnya Kami mengutusmu untuk menjadi saksi, pembawa kabar gembira dan pemberi peringatan,","hasanah_per_verse":380},{"text_madani":"وَدَاعِيًا إِلَى اللَّهِ بِإِذْنِهِ وَسِرَاجًا مُّنِيرًا","text_tajweed":"وَدَاعِيًا إِلَى [h:1637[ٱ]للَّهِ بِإِذْنِه[n[ِۦ] وَسِرَا[a:10850[جًا م]ُّنِيرًا","translation_en":"And as one inviting to Allah by His permission, and as a light-giving torch.","translation_id":"dan untuk menjadi penyeru kepada (agama) Allah dengan izin-Nya dan sebagai cahaya yang menerangi.","hasanah_per_verse":290},{"text_madani":"وَبَشِّرِ الْمُؤْمِنِينَ بِأَنَّ لَهُم مِّنَ اللَّهِ فَضْلًا كَبِيرًا","text_tajweed":"وَبَشِّرِ [h:1257[ٱ]لْمُؤْمِنِينَ بِأَ[g[نّ]َ لَه[w:6026[ُم م]ِّنَ [h:321[ٱ]للَّهِ فَضْل[f:10851[اً ك]َبِيرًا","translation_en":"And give to the believers the good news that they shall have a great grace from Allah.","translation_id":"Dan sampaikanlah kabar gembira kepada orang-orang mukmin bahwa sesungguhnya bagi mereka karunia yang besar dari Allah.","hasanah_per_verse":330},{"text_madani":"وَلَا تُطِعِ الْكَافِرِينَ وَالْمُنَافِقِينَ وَدَعْ أَذَاهُمْ وَتَوَكَّلْ عَلَى اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا","text_tajweed":"وَلَا تُطِعِ [h:9665[ٱ]لْكَ[n[ـٰ]فِرِينَ وَ[h:5724[ٱ]لْمُنَ[n[ـٰ]فِقِينَ وَدَعْ أَذَ[n[ٮٰ]هُمْ وَتَوَكَّلْ عَلَى [h:412[ٱ]للَّهِۚ وَكَفَىٰ بِ[h:32[ٱ]للَّهِ وَكِيلاً","translation_en":"And be not compliant to the unbelievers and the hypocrites, and leave unregarded their annoying talk, and rely on Allah; and Allah is sufficient as a Protector.","translation_id":"Dan janganlah engkau (Muhammad) menuruti orang-orang kafir dan orang-orang munafik itu, janganlah engkau hiraukan gangguan mereka dan bertawakallah kepada Allah. Dan cukuplah Allah sebagai pelindung.","hasanah_per_verse":580},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نَكَحْتُمُ الْمُؤْمِنَاتِ ثُمَّ طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ فَمَا لَكُمْ عَلَيْهِنَّ مِنْ عِدَّةٍ تَعْتَدُّونَهَا ۖ فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحًا جَمِيلًا","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِذَا نَكَحْتُمُ [h:10852[ٱ]لْمُؤْمِنَ[n[ـٰ]تِ ثُ[g[مّ]َ طَلَّ[q:1345[قْ]تُمُوهُ[g[نّ]َ مِ[f:1346[ن ق]َ[q:1347[بْ]لِ أَ[f:1348[ن ت]َمَسُّوهُ[g[نّ]َ فَمَا لَكُمْ عَلَيْهِ[g[نّ]َ مِنْ عِدَّ[f:10853[ةٍ ت]َعْتَدُّونَهَاۖ فَمَتِّعُوهُ[g[نّ]َ وَسَرِّحُوهُ[g[نّ]َ سَرَا[f:10771[حًا ج]َمِيلاً","translation_en":"O you who believe! when you marry the believing women, then divorce them before you touch them, you have in their case no term which you should reckon; so make some provision for them and send them forth a goodly sending forth.","translation_id":"Wahai orang-orang yang beriman! Apabila kamu menikahi perempuan-perempuan mukmin, kemudian kamu ceraikan mereka sebelum kamu mencampurinya maka tidak ada masa idah atas mereka yang perlu kamu perhitungkan. Namun berilah mereka mut’ah dan lepaskanlah mereka itu dengan cara yang sebaik-baiknya.","hasanah_per_verse":1030},{"text_madani":"يَا أَيُّهَا النَّبِيُّ إِنَّا أَحْلَلْنَا لَكَ أَزْوَاجَكَ اللَّاتِي آتَيْتَ أُجُورَهُنَّ وَمَا مَلَكَتْ يَمِينُكَ مِمَّا أَفَاءَ اللَّهُ عَلَيْكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَالَاتِكَ اللَّاتِي هَاجَرْنَ مَعَكَ وَامْرَأَةً مُّؤْمِنَةً إِن وَهَبَتْ نَفْسَهَا لِلنَّبِيِّ إِنْ أَرَادَ النَّبِيُّ أَن يَسْتَنكِحَهَا خَالِصَةً لَّكَ مِن دُونِ الْمُؤْمِنِينَ ۗ قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِي أَزْوَاجِهِمْ وَمَا مَلَكَتْ أَيْمَانُهُمْ لِكَيْلَا يَكُونَ عَلَيْكَ حَرَجٌ ۗ وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:5411[ٱ][l[ل][g[نّ]َبِىُّ إِ[g[نّ][o[َآ] أَحْلَلْنَا لَكَ أَزْو[n[َٲ]جَكَ [h:10854[ٱ]لَّ[n[ـٰ]ت[o[ِىٓ] ءَاتَيْتَ أُجُورَهُ[g[نّ]َ وَمَا مَلَكَتْ يَمِينُكَ مِ[g[مّ][o[َآ] أَف[o[َا]ٓءَ [h:10855[ٱ]للَّهُ عَلَيْكَ وَبَنَاتِ عَ[g[مّ]ِكَ وَبَنَاتِ عَ[g[مّ]َ[n[ـٰ]تِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَ[n[ـٰ]لَ[n[ـٰ]تِكَ [h:10856[ٱ]لَّ[n[ـٰ]تِى هَاجَرْنَ مَعَكَ وَ[h:10857[ٱ]مْرَأَ[a:10858[ةً م]ُّؤْمِنَةً إ[a:10859[ِن و]َهَبَتْ نَفْسَهَا لِل[g[نّ]َبِىِّ إِنْ أَرَادَ [h:10860[ٱ][l[ل][g[نّ]َبِىُّ أ[a:10861[َن ي]َسْتَ[f:10862[نك]ِحَهَا خَالِصَ[u:10863[ةً ل]َّكَ مِ[f:107[ن د]ُونِ [h:1838[ٱ]لْمُؤْمِنِينَۗ قَ[q:298[دْ] عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ ف[o[ِىٓ] أَزْو[n[َٲ]جِهِمْ وَمَا مَلَكَتْ أَيْمَ[n[ـٰ]نُهُمْ لِكَيْلَا يَكُونَ عَلَيْكَ حَرَ[a:10864[جٌۗ و]َكَانَ [h:2653[ٱ]للَّهُ غَفُو[u:2701[رًا ر]َّحِيمًا","translation_en":"O Prophet! surely We have made lawful to you your wives whom you have given their dowries, and those whom your right hand possesses out of those whom Allah has given to you as prisoners of war, and the daughters of your paternal uncles and the daughters of your paternal aunts, and the daughters of your maternal uncles and the daughters of your maternal aunts who fled with you; and a believing woman if she gave herself to the Prophet, if the Prophet desired to marry her-- specially for you, not for the (rest of) believers; We know what We have ordained for them concerning their wives and those whom their right hands possess in order that no blame may attach to you; and Allah is Forgiving, Merciful.","translation_id":"Wahai Nabi! Sesungguhnya Kami telah menghalalkan bagimu istri-istrimu yang telah engkau berikan maskawinnya dan hamba sahaya yang engkau miliki, termasuk apa yang engkau peroleh dalam peperangan yang dikaruniakan Allah untukmu, dan (demikian pula) anak-anak perempuan dari saudara laki-laki bapakmu, anak-anak perempuan dari saudara perempuan bapakmu, anak-anak perempuan dari saudara laki-laki ibumu dan anak-anak perempuan dari saudara perempuan ibumu yang turut hijrah bersamamu, dan perempuan mukmin yang menyerahkan dirinya kepada Nabi kalau Nabi ingin menikahinya, sebagai kekhususan bagimu, bukan untuk semua orang mukmin. Kami telah mengetahui apa yang Kami wajibkan kepada mereka tentang istri-istri mereka dan hamba sahaya yang mereka miliki agar tidak menjadi kesempitan bagimu. Dan Allah Maha Pengampun, Maha Penyayang.","hasanah_per_verse":2670},{"text_madani":"تُرْجِي مَن تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَن تَشَاءُ ۖ وَمَنِ ابْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلَا جُنَاحَ عَلَيْكَ ۚ ذَٰلِكَ أَدْنَىٰ أَن تَقَرَّ أَعْيُنُهُنَّ وَلَا يَحْزَنَّ وَيَرْضَيْنَ بِمَا آتَيْتَهُنَّ كُلُّهُنَّ ۚ وَاللَّهُ يَعْلَمُ مَا فِي قُلُوبِكُمْ ۚ وَكَانَ اللَّهُ عَلِيمًا حَلِيمًا","text_tajweed":"۞ تُرْجِى مَ[f:1823[ن ت]َش[o[َا]ٓءُ مِنْهُ[g[نّ]َ وَتُــْٔو[o[ِىٓ] إِلَيْكَ مَ[f:1823[ن ت]َش[o[َا]ٓءُۖ وَمَنِ [h:10865[ٱ][q:10866[بْ]تَغَيْتَ مِ[g[مّ]َنْ عَزَلْتَ فَلَا جُنَاحَ عَلَيْكَۚ ذ[n[َٲ]لِكَ أَ[q:314[دْ]نَ[o[ىٰٓ] أَ[f:10867[ن ت]َقَرَّ أَعْيُنُهُ[g[نّ]َ وَلَا يَحْزَ[g[نّ]َ وَيَرْضَيْنَ بِم[o[َآ] ءَاتَيْتَهُ[g[نّ]َ كُلُّهُ[g[نّ]َۚ وَ[h:72[ٱ]للَّهُ يَعْلَمُ مَا فِى قُلُوبِكُمْۚ وَكَانَ [h:2653[ٱ]للَّهُ عَلِيمًا حَلِيمًا","translation_en":"You may put off whom you please of them, and you may take to you whom you please, and whom you desire of those whom you had separated provisionally; no blame attaches to you; this is most proper, so that their eyes may be cool and they may not grieve, and that they should be pleased, all of them with what you give them, and Allah knows what is in your hearts; and Allah is Knowing, Forbearing.","translation_id":"Engkau boleh menangguhkan (menggauli) siapa yang engkau kehendaki di antara mereka (para istrimu) dan (boleh pula) menggauli siapa (di antara mereka) yang engkau kehendaki. Dan siapa yang engkau ingini untuk menggaulinya kembali dari istri-istrimu yang telah engkau sisihkan, maka tidak ada dosa bagimu. Yang demikian itu lebih dekat untuk ketenangan hati mereka, dan mereka tidak merasa sedih, dan mereka rela dengan apa yang telah engkau berikan kepada mereka semuanya. Dan Allah mengetahui apa yang (tersimpan) dalam hatimu. Dan Allah Maha Mengetahui, Maha Penyantun.","hasanah_per_verse":1370},{"text_madani":"لَّا يَحِلُّ لَكَ النِّسَاءُ مِن بَعْدُ وَلَا أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ إِلَّا مَا مَلَكَتْ يَمِينُكَ ۗ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ رَّقِيبًا","text_tajweed":"لَّا يَحِلُّ لَكَ [h:10868[ٱ][l[ل][g[نّ]ِس[o[َا]ٓءُ م[i:1287[ِنۢ ب]َعْدُ وَل[o[َآ] أَ[f:10869[ن ت]َبَدَّلَ بِهِ[g[نّ]َ مِنْ أَزْو[n[َٲ][a:10870[جٍ و]َلَوْ أَعْجَبَكَ حُسْنُهُ[g[نّ]َ إِلَّا مَا مَلَكَتْ يَمِينُكَۗ وَكَانَ [h:2653[ٱ]للَّهُ عَلَىٰ كُلِّ ش[u:10871[َىْءٍ ر]َّقِيبًا","translation_en":"It is not allowed to you to take women afterwards, nor that you should change them for other wives, though their beauty be pleasing to you, except what your right hand possesses and Allah is Watchful over all things.","translation_id":"Tidak halal bagimu (Muhammad) menikahi perempuan-perempuan (lain) setelah itu, dan tidak boleh (pula) mengganti mereka dengan istri-istri (yang lain), meskipun kecantikannya menarik hatimu kecuali perempuan-perempuan (hamba sahaya) yang engkau miliki. Dan Allah Maha Mengawasi segala sesuatu.","hasanah_per_verse":850},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَن يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَٰكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا فَإِذَا طَعِمْتُمْ فَانتَشِرُوا وَلَا مُسْتَأْنِسِينَ لِحَدِيثٍ ۚ إِنَّ ذَٰلِكُمْ كَانَ يُؤْذِي النَّبِيَّ فَيَسْتَحْيِي مِنكُمْ ۖ وَاللَّهُ لَا يَسْتَحْيِي مِنَ الْحَقِّ ۚ وَإِذَا سَأَلْتُمُوهُنَّ مَتَاعًا فَاسْأَلُوهُنَّ مِن وَرَاءِ حِجَابٍ ۚ ذَٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ ۚ وَمَا كَانَ لَكُمْ أَن تُؤْذُوا رَسُولَ اللَّهِ وَلَا أَن تَنكِحُوا أَزْوَاجَهُ مِن بَعْدِهِ أَبَدًا ۚ إِنَّ ذَٰلِكُمْ كَانَ عِندَ اللَّهِ عَظِيمًا","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] لَا تَ[q:1176[دْ]خُلُو[s[اْ] بُيُوتَ [h:10872[ٱ][l[ل][g[نّ]َبِىِّ إِلّ[o[َآ] أ[a:10873[َن ي]ُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ غَيْرَ نَ[n[ـٰ]ظِرِينَ إِنَ[n[ـٰ]هُ وَلَ[n[ـٰ]كِنْ إِذَا دُعِيتُمْ فَ[h:7386[ٱ][q:7386[دْ]خُلُو[s[اْ] فَإِذَا طَعِمْتُمْ فَ[h:10874[ٱ][f:10874[نت]َشِرُو[s[اْ] وَلَا مُسْتَــْٔنِسِينَ لِحَدِيثٍۚ إِ[g[نّ]َ ذ[n[َٲ]لِكُمْ كَانَ يُؤْذِى [h:10875[ٱ][l[ل][g[نّ]َبِىَّ فَيَسْتَحْى[n[ِۦ] مِ[f:344[نك]ُمْۖ وَ[h:72[ٱ]للَّهُ لَا يَسْتَحْى[n[ِۦ] مِنَ [h:1173[ٱ]لْحَقِّۚ وَإِذَا سَأَلْتُمُوهُ[g[نّ]َ مَتَ[n[ـٰ][f:10876[عًا ف]َسْــَٔلُوهُ[g[نّ]َ م[a:10877[ِن و]َر[o[َا]ٓءِ حِجَا[f:10878[بٍۚ ذ][n[َٲ]لِكُمْ أَ[q:6433[طْ]هَرُ لِقُلُوبِكُمْ وَقُلُوبِهِ[g[نّ]َۚ وَمَا كَانَ لَكُمْ أَ[f:10879[ن ت]ُؤْذُو[s[اْ] رَسُولَ [h:3273[ٱ]للَّهِ وَل[o[َآ] أَ[f:10880[ن ت]َ[f:1228[نك]ِح[o[ُوٓ][s[اْ] أَزْو[n[َٲ]جَهُ[n[ۥ] م[i:254[ِنۢ ب]َعْدِه[o[ِۦٓ] أَبَدًاۚ إِ[g[نّ]َ ذ[n[َٲ]لِكُمْ كَانَ عِ[f:264[ند]َ [h:408[ٱ]للَّهِ عَظِيمًا","translation_en":"O you who believe! do not enter the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished-- but when you are invited, enter, and when you have taken the food, then disperse-- not seeking to listen to talk; surely this gives the Prophet trouble, but he forbears from you, and Allah does not forbear from the truth And when you ask of them any goods, ask of them from behind a curtain; this is purer for your hearts and (for) their hearts; and it does not behove you that you should give trouble to the Messenger of Allah, nor that you should marry his wives after him ever; surely this is grievous in the sight of Allah.","translation_id":"Wahai orang-orang yang beriman! Janganlah kamu memasuki rumah-rumah Nabi kecuali jika kamu diizinkan untuk makan tanpa menunggu waktu masak (makanannya), tetapi jika kamu dipanggil maka masuklah dan apabila kamu selesai makan, keluarlah kamu tanpa memperpanjang percakapan. Sesungguhnya yang demikian itu adalah mengganggu Nabi sehingga dia (Nabi) malu kepadamu (untuk menyuruhmu keluar), dan Allah tidak malu (menerangkan) yang benar. Apabila kamu meminta sesuatu (keperluan) kepada mereka (istri-istri Nabi), maka mintalah dari belakang tabir. (Cara) yang demikian itu lebih suci bagi hatimu dan hati mereka. Dan tidak boleh kamu menyakiti (hati) Rasulullah dan tidak boleh (pula) menikahi istri-istrinya selama-lamanya setelah (Nabi wafat). Sungguh, yang demikian itu sangat besar (dosanya) di sisi Allah.","hasanah_per_verse":2940},{"text_madani":"إِن تُبْدُوا شَيْئًا أَوْ تُخْفُوهُ فَإِنَّ اللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيمًا","text_tajweed":"إِ[f:1601[ن ت]ُ[q:1602[بْ]دُو[s[اْ] شَيْــًٔا أَوْ تُخْفُوهُ فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ كَانَ بِكُلِّ شَىْءٍ عَلِيمًا","translation_en":"If you do a thing openly or do it in secret, then surely Allah is Cognizant of all things.","translation_id":"Jika kamu menyatakan sesuatu atau menyembunyikannya, maka sesungguhnya Allah Maha Mengetahui segala sesuatu.","hasanah_per_verse":390},{"text_madani":"لَّا جُنَاحَ عَلَيْهِنَّ فِي آبَائِهِنَّ وَلَا أَبْنَائِهِنَّ وَلَا إِخْوَانِهِنَّ وَلَا أَبْنَاءِ إِخْوَانِهِنَّ وَلَا أَبْنَاءِ أَخَوَاتِهِنَّ وَلَا نِسَائِهِنَّ وَلَا مَا مَلَكَتْ أَيْمَانُهُنَّ ۗ وَاتَّقِينَ اللَّهَ ۚ إِنَّ اللَّهَ كَانَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدًا","text_tajweed":"لَّا جُنَاحَ عَلَيْهِ[g[نّ]َ ف[o[ِىٓ] ءَاب[o[َا]ٓئِهِ[g[نّ]َ وَل[o[َآ] أَ[q:9392[بْ]ن[o[َا]ٓئِهِ[g[نّ]َ وَل[o[َآ] إِخْو[n[َٲ]نِهِ[g[نّ]َ وَل[o[َآ] أَ[q:9393[بْ]ن[o[َا]ٓءِ إِخْو[n[َٲ]نِهِ[g[نّ]َ وَل[o[َآ] أَ[q:9393[بْ]ن[o[َا]ٓءِ أَخَو[n[َٲ]تِهِ[g[نّ]َ وَلَا نِس[o[َا]ٓئِهِ[g[نّ]َ وَلَا مَا مَلَكَتْ أَيْمَ[n[ـٰ]نُهُ[g[نّ]َۗ وَ[h:10881[ٱ]تَّقِينَ [h:10882[ٱ]للَّهَۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ كَانَ عَلَىٰ كُلِّ ش[f:2752[َىْءٍ ش]َهِيدًا","translation_en":"There is no blame on them in respect of their fathers, nor their brothers, nor their brothers' sons, nor their sisters' sons nor their own women, nor of what their right hands possess; and be careful of (your duty to) Allah; surely Allah is a witness of all things.","translation_id":"Tidak ada dosa atas istri-istri Nabi (untuk berjumpa tanpa tabir) dengan bapak-bapak mereka, anak laki-laki mereka, saudara laki-laki mereka, anak laki-laki dari saudara laki-laki mereka, anak laki-laki dari saudara perempuan mereka, perempuan-perempuan mereka (yang beriman) dan hamba sahaya yang mereka miliki, dan bertakwalah kamu (istri-istri Nabi) kepada Allah. Sungguh, Allah Maha Menyaksikan segala sesuatu.","hasanah_per_verse":1260},{"text_madani":"إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا","text_tajweed":"إِ[g[نّ]َ [h:80[ٱ]للَّهَ وَمَلَ[o[ـٰٓ]ئِكَتَهُ[n[ۥ] يُصَلُّونَ عَلَى [h:5875[ٱ][l[ل][g[نّ]َبِىِّۚ يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] صَلُّو[s[اْ] عَلَيْهِ وَسَلِّمُو[s[اْ] تَسْلِيمًا","translation_en":"Surely Allah and His angels bless the Prophet; O you who believe! call for (Divine) blessings on him and salute him with a (becoming) salutation.","translation_id":"Sesungguhnya Allah dan para malaikat-Nya bersalawat untuk Nabi. Wahai orang-orang yang beriman! Bersalawatlah kamu untuk Nabi dan ucapkanlah salam dengan penuh penghormatan kepadanya.","hasanah_per_verse":630},{"text_madani":"إِنَّ الَّذِينَ يُؤْذُونَ اللَّهَ وَرَسُولَهُ لَعَنَهُمُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ وَأَعَدَّ لَهُمْ عَذَابًا مُّهِينًا","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ يُؤْذُونَ [h:10883[ٱ]للَّهَ وَرَسُولَهُ[n[ۥ] لَعَنَهُمُ [h:462[ٱ]للَّهُ فِى [h:599[ٱ][l[ل]دُّنْيَا وَ[h:1213[ٱ]لْأَخِرَةِ وَأَعَدَّ لَهُمْ عَذَا[a:2783[بًا م]ُّهِينًا","translation_en":"Surely (as for) those who speak evil things of Allah and His Messenger, Allah has cursed them in this world and the here after, and He has prepared for them a chastisement bringing disgrace.","translation_id":"Sesungguhnya (terhadap) orang-orang yang menyakiti Allah dan Rasul-Nya, Allah akan melaknatnya di dunia dan di akhirat, dan menyediakan azab yang menghinakan bagi mereka.","hasanah_per_verse":630},{"text_madani":"وَالَّذِينَ يُؤْذُونَ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ بِغَيْرِ مَا اكْتَسَبُوا فَقَدِ احْتَمَلُوا بُهْتَانًا وَإِثْمًا مُّبِينًا","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ يُؤْذُونَ [h:10884[ٱ]لْمُؤْمِنِينَ وَ[h:5718[ٱ]لْمُؤْمِنَ[n[ـٰ]تِ بِغَيْرِ مَا [h:10885[ٱ]كْتَسَبُو[s[اْ] فَقَدِ [h:10886[ٱ]حْتَمَلُو[s[اْ] بُهْتَ[n[ـٰ][a:2678[نًا و]َإِثْ[a:2679[مًا م]ُّبِينًا","translation_en":"And those who speak evil things of the believing men and the believing women without their having earned (it), they are guilty indeed of a false accusation and a manifest sin.","translation_id":"Dan orang-orang yang menyakiti orang-orang mukmin laki-laki dan perempuan, tanpa ada kesalahan yang mereka perbuat, maka sungguh, mereka telah memikul kebohongan dan dosa yang nyata.","hasanah_per_verse":670},{"text_madani":"يَا أَيُّهَا النَّبِيُّ قُل لِّأَزْوَاجِكَ وَبَنَاتِكَ وَنِسَاءِ الْمُؤْمِنِينَ يُدْنِينَ عَلَيْهِنَّ مِن جَلَابِيبِهِنَّ ۚ ذَٰلِكَ أَدْنَىٰ أَن يُعْرَفْنَ فَلَا يُؤْذَيْنَ ۗ وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:5411[ٱ][l[ل][g[نّ]َبِىُّ قُل لِّأَزْو[n[َٲ]جِكَ وَبَنَاتِكَ وَنِس[o[َا]ٓءِ [h:10887[ٱ]لْمُؤْمِنِينَ يُ[q:10888[دْ]نِينَ عَلَيْهِ[g[نّ]َ مِ[f:10889[ن ج]َلَ[n[ـٰ]بِيبِهِ[g[نّ]َۚ ذ[n[َٲ]لِكَ أَ[q:314[دْ]نَ[o[ىٰٓ] أ[a:10890[َن ي]ُعْرَفْنَ فَلَا يُؤْذَيْنَۗ وَكَانَ [h:2653[ٱ]للَّهُ غَفُو[u:2701[رًا ر]َّحِيمًا","translation_en":"O Prophet! say to your wives and your daughters and the women of the believers that they let down upon them their over-garments; this will be more proper, that they may be known, and thus they will not be given trouble; and Allah is Forgiving, Merciful.","translation_id":"Wahai Nabi! Katakanlah kepada istri-istrimu, anak-anak perempuanmu dan istri-istri orang mukmin, “Hendaklah mereka menutupkan jilbabnya ke seluruh tubuh mereka.” Yang demikian itu agar mereka lebih mudah untuk dikenali, sehingga mereka tidak diganggu. Dan Allah Maha Pengampun, Maha Penyayang.","hasanah_per_verse":990},{"text_madani":"لَّئِن لَّمْ يَنتَهِ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِم مَّرَضٌ وَالْمُرْجِفُونَ فِي الْمَدِينَةِ لَنُغْرِيَنَّكَ بِهِمْ ثُمَّ لَا يُجَاوِرُونَكَ فِيهَا إِلَّا قَلِيلًا","text_tajweed":"۞ لَّئ[u:4195[ِن ل]َّمْ يَ[f:10891[نت]َهِ [h:10892[ٱ]لْمُنَ[n[ـٰ]فِقُونَ وَ[h:37[ٱ]لَّذِينَ فِى قُلُوبِه[w:39[ِم م]َّرَ[a:10893[ضٌ و]َ[h:10894[ٱ]لْمُرْجِفُونَ فِى [h:4932[ٱ]لْمَدِينَةِ لَنُغْرِيَ[g[نّ]َكَ بِهِمْ ثُ[g[مّ]َ لَا يُجَاوِرُونَكَ فِيه[o[َآ] إِلَّا قَلِيلاً","translation_en":"If the hypocrites and those in whose hearts is a disease and the agitators in the city do not desist, We shall most certainly set you over them, then they shall not be your neighbors in it but for a little while;","translation_id":"Sungguh, jika orang-orang munafik, orang-orang yang berpenyakit dalam hatinya dan orang-orang yang menyebarkan kabar bohong di Madinah tidak berhenti (dari menyakitimu), niscaya Kami perintahkan engkau (untuk memerangi) mereka, kemudian mereka tidak lagi menjadi tetanggamu (di Madinah) kecuali sebentar,","hasanah_per_verse":870},{"text_madani":"مَّلْعُونِينَ ۖ أَيْنَمَا ثُقِفُوا أُخِذُوا وَقُتِّلُوا تَقْتِيلًا","text_tajweed":"مَّلْعُونِينَۖ أَيْنَمَا ثُقِف[o[ُوٓ][s[اْ] أُخِذُو[s[اْ] وَقُتِّلُو[s[اْ] تَ[q:10895[قْ]تِيلاً","translation_en":"Cursed: wherever they are found they shall be seized and murdered, a (horrible) murdering.","translation_id":"dalam keadaan terlaknat. Di mana saja mereka dijumpai, mereka akan ditangkap dan dibunuh tanpa ampun.","hasanah_per_verse":340},{"text_madani":"سُنَّةَ اللَّهِ فِي الَّذِينَ خَلَوْا مِن قَبْلُ ۖ وَلَن تَجِدَ لِسُنَّةِ اللَّهِ تَبْدِيلًا","text_tajweed":"سُ[g[نّ]َةَ [h:10837[ٱ]للَّهِ فِى [h:6320[ٱ]لَّذِينَ خَلَوْ[s[اْ] مِ[f:128[ن ق]َ[q:129[بْ]لُۖ وَلَ[f:3232[ن ت]َجِدَ لِسُ[g[نّ]َةِ [h:10896[ٱ]للَّهِ تَ[q:10752[بْ]دِيلاً","translation_en":"(Such has been) the course of Allah with respect to those who have gone before; and you shall not find any change in the course of Allah.","translation_id":"Sebagai sunnah Allah yang (berlaku juga) bagi orang-orang yang telah terdahulu sebelum(mu), dan engkau tidak akan mendapati perubahan pada sunnah Allah.","hasanah_per_verse":430},{"text_madani":"يَسْأَلُكَ النَّاسُ عَنِ السَّاعَةِ ۖ قُلْ إِنَّمَا عِلْمُهَا عِندَ اللَّهِ ۚ وَمَا يُدْرِيكَ لَعَلَّ السَّاعَةَ تَكُونُ قَرِيبًا","text_tajweed":"يَسْــَٔلُكَ [h:10897[ٱ][l[ل][g[نّ]َاسُ عَنِ [h:5172[ٱ][l[ل]سَّاعَةِۖ قُلْ إِ[g[نّ]َمَا عِلْمُهَا عِ[f:264[ند]َ [h:408[ٱ]للَّهِۚ وَمَا يُ[q:10898[دْ]رِيكَ لَعَلَّ [h:10899[ٱ][l[ل]سَّاعَةَ تَكُونُ قَرِيبًا","translation_en":"Men ask you about the hour; say: The knowledge of it is only with Allah, and what will make you comprehend that the hour may be nigh.","translation_id":"Manusia bertanya kepadamu (Muhammad) tentang hari Kiamat. Katakanlah, “Ilmu tentang hari Kiamat itu hanya di sisi Allah.” Dan tahukah engkau, boleh jadi hari Kiamat itu sudah dekat waktunya.","hasanah_per_verse":620},{"text_madani":"إِنَّ اللَّهَ لَعَنَ الْكَافِرِينَ وَأَعَدَّ لَهُمْ سَعِيرًا","text_tajweed":"إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَعَنَ [h:10900[ٱ]لْكَ[n[ـٰ]فِرِينَ وَأَعَدَّ لَهُمْ سَعِيرًا","translation_en":"Surely Allah has cursed the unbelievers and has prepared for them a burning fire,","translation_id":"Sungguh, Allah melaknat orang-orang kafir dan menyediakan bagi mereka api yang menyala-nyala (neraka),","hasanah_per_verse":290},{"text_madani":"خَالِدِينَ فِيهَا أَبَدًا ۖ لَّا يَجِدُونَ وَلِيًّا وَلَا نَصِيرًا","text_tajweed":"خَ[n[ـٰ]لِدِينَ فِيه[o[َآ] أَبَ[u:10901[دًاۖ ل]َّا يَجِدُونَ وَلِي[a:3006[ًّا و]َلَا نَصِيرًا","translation_en":"To abide therein for a long time; they shall not find a protector or a helper.","translation_id":"mereka kekal di dalamnya selama-lamanya; mereka tidak akan mendapatkan pelindung dan penolong.","hasanah_per_verse":330},{"text_madani":"يَوْمَ تُقَلَّبُ وُجُوهُهُمْ فِي النَّارِ يَقُولُونَ يَا لَيْتَنَا أَطَعْنَا اللَّهَ وَأَطَعْنَا الرَّسُولَا","text_tajweed":"يَوْمَ تُقَلَّبُ وُجُوهُهُمْ فِى [h:4674[ٱ][l[ل][g[نّ]َارِ يَقُولُونَ يَ[n[ـٰ]لَيْتَن[o[َآ] أَطَعْنَا [h:10902[ٱ]للَّهَ وَأَطَعْنَا [h:10903[ٱ][l[ل]رَّسُولَا۟","translation_en":"On the day when their faces shall be turned back into the fire, they shall say: O would that we had obeyed Allah and obeyed the Messenger!","translation_id":"Pada hari (ketika) wajah mereka dibolak-balikkan dalam neraka, mereka berkata, “Wahai, kiranya dahulu kami taat kepada Allah dan taat (pula) kepada Rasul.”","hasanah_per_verse":550},{"text_madani":"وَقَالُوا رَبَّنَا إِنَّا أَطَعْنَا سَادَتَنَا وَكُبَرَاءَنَا فَأَضَلُّونَا السَّبِيلَا","text_tajweed":"وَقَالُو[s[اْ] رَبَّن[o[َآ] إِ[g[نّ][o[َآ] أَطَعْنَا سَادَتَنَا وَكُبَر[o[َا]ٓءَنَا فَأَضَلُّونَا [h:10904[ٱ][l[ل]سَّبِيلَا۟","translation_en":"And they shall say: O our Lord! surely we obeyed our leaders and our great men, so they led us astray from the path;","translation_id":"Dan mereka berkata, “Ya Tuhan kami, sesungguhnya kami telah menaati para pemimpin dan para pembesar kami, lalu mereka menyesatkan kami dari jalan (yang benar).","hasanah_per_verse":460},{"text_madani":"رَبَّنَا آتِهِمْ ضِعْفَيْنِ مِنَ الْعَذَابِ وَالْعَنْهُمْ لَعْنًا كَبِيرًا","text_tajweed":"رَبَّن[o[َآ] ءَاتِهِمْ ضِعْفَيْنِ مِنَ [h:503[ٱ]لْعَذَابِ وَ[h:10905[ٱ]لْعَنْهُمْ لَعْ[f:10906[نًا ك]َبِيرًا","translation_en":"O our Lord! give them a double punishment and curse them with a great curse.","translation_id":"Ya Tuhan kami, timpakanlah kepada mereka azab dua kali lipat dan laknatlah mereka dengan laknat yang besar.”","hasanah_per_verse":370},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَكُونُوا كَالَّذِينَ آذَوْا مُوسَىٰ فَبَرَّأَهُ اللَّهُ مِمَّا قَالُوا ۚ وَكَانَ عِندَ اللَّهِ وَجِيهًا","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] لَا تَكُونُو[s[اْ] كَ[h:2146[ٱ]لَّذِينَ ءَاذَوْ[s[اْ] مُوسَىٰ فَبَرَّأَهُ [h:10907[ٱ]للَّهُ مِ[g[مّ]َا قَالُو[s[اْۚ] وَكَانَ عِ[f:264[ند]َ [h:408[ٱ]للَّهِ وَجِيهًا","translation_en":"O you who believe! be not like those who spoke evil things of Musa, but Allah cleared him of what they said, and he was worthy of regard with Allah.","translation_id":"Wahai orang-orang yang beriman! Janganlah kamu seperti orang-orang yang menyakiti Musa, maka Allah membersihkannya dari tuduhan-tuduhan yang mereka lontarkan. Dan dia seorang yang mempunyai kedudukan terhormat di sisi Allah.","hasanah_per_verse":710},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] [h:1643[ٱ]تَّقُو[s[اْ] [h:1644[ٱ]للَّهَ وَقُولُو[s[اْ] قَوْل[f:2581[اً س]َدِيدًا","translation_en":"O you who believe! be careful of (your duty to) Allah and speak the right word,","translation_id":"Wahai orang-orang yang beriman! Bertakwalah kamu kepada Allah dan ucapkanlah perkataan yang benar,","hasanah_per_verse":400},{"text_madani":"يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَمَن يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا","text_tajweed":"يُصْلِحْ لَكُمْ أَعْمَ[n[ـٰ]لَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْۗ وَم[a:2629[َن ي]ُطِعِ [h:2630[ٱ]للَّهَ وَرَسُولَهُ[n[ۥ] فَقَ[q:563[دْ] فَازَ فَوْزًا عَظِيمًا","translation_en":"He will put your deeds into a right state for you, and forgive you your faults; and whoever obeys Allah and His Messenger, he indeed achieves a mighty success.","translation_id":"niscaya Allah akan memperbaiki amal-amalmu dan mengampuni dosa-dosamu. Dan barangsiapa menaati Allah dan Rasul-Nya, maka sungguh, dia menang dengan kemenangan yang agung.","hasanah_per_verse":590},{"text_madani":"إِنَّا عَرَضْنَا الْأَمَانَةَ عَلَى السَّمَاوَاتِ وَالْأَرْضِ وَالْجِبَالِ فَأَبَيْنَ أَن يَحْمِلْنَهَا وَأَشْفَقْنَ مِنْهَا وَحَمَلَهَا الْإِنسَانُ ۖ إِنَّهُ كَانَ ظَلُومًا جَهُولًا","text_tajweed":"إِ[g[نّ]َا عَرَضْنَا [h:10908[ٱ]لْأَمَانَةَ عَلَى [h:10909[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ وَ[h:10910[ٱ]لْجِبَالِ فَأَبَيْنَ أ[a:10911[َن ي]َحْمِلْنَهَا وَأَشْفَ[q:10912[قْ]نَ مِنْهَا وَحَمَلَهَا [h:10913[ٱ]لْإِ[f:2732[نس]َ[n[ـٰ]نُۖ إِ[g[نّ]َهُ[n[ۥ] كَانَ ظَلُو[f:10914[مًا ج]َهُولاً","translation_en":"Surely We offered the trust to the heavens and the earth and the mountains, but they refused to be unfaithful to it and feared from it, and man has turned unfaithful to it; surely he is unjust, ignorant;","translation_id":"Sesungguhnya Kami telah menawarkan amanat kepada langit, bumi dan gunung-gunung; tetapi semuanya enggan untuk memikul amanat itu dan mereka khawatir tidak akan melaksanakannya (berat), lalu dipikullah amanat itu oleh manusia. Sungguh, manusia itu sangat zhalim dan sangat bodoh,","hasanah_per_verse":920},{"text_madani":"لِّيُعَذِّبَ اللَّهُ الْمُنَافِقِينَ وَالْمُنَافِقَاتِ وَالْمُشْرِكِينَ وَالْمُشْرِكَاتِ وَيَتُوبَ اللَّهُ عَلَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ۗ وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا","text_tajweed":"لِّيُعَذِّبَ [h:10915[ٱ]للَّهُ [h:5698[ٱ]لْمُنَ[n[ـٰ]فِقِينَ وَ[h:5699[ٱ]لْمُنَ[n[ـٰ]فِقَ[n[ـٰ]تِ وَ[h:10916[ٱ]لْمُشْرِكِينَ وَ[h:10917[ٱ]لْمُشْرِكَ[n[ـٰ]تِ وَيَتُوبَ [h:10918[ٱ]للَّهُ عَلَى [h:2329[ٱ]لْمُؤْمِنِينَ وَ[h:5718[ٱ]لْمُؤْمِنَ[n[ـٰ]تِۗ وَكَانَ [h:2653[ٱ]للَّهُ غَفُو[u:2701[رًا ر]َّحِيمَۢا","translation_en":"So Allah will chastise the hypocritical men and the hypocritical women and the polytheistic men and the polytheistic women, and Allah will turn (mercifully) to the believing women, and Allah is Forgiving, Merciful.","translation_id":"sehingga Allah akan mengazab orang-orang munafik laki-laki dan perempuan, orang-orang musyrik, laki-laki dan perempuan; dan Allah akan menerima tobat orang-orang mukmin laki-laki dan perempuan. Dan Allah Maha Pengampun, Maha Penyayang.","hasanah_per_verse":930}]}
