{"chapter_number":22,"name_simple":"Al-Haj","name_meaning":{"text":"The Pilgrimage","en":"The Pilgrimage","id":"Haji"},"verses_count":78,"hasanah":53140,"verses":[{"text_madani":"يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ ۚ إِنَّ زَلْزَلَةَ السَّاعَةِ شَيْءٌ عَظِيمٌ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:82[ٱ][l[ل][g[نّ]َاسُ [h:2529[ٱ]تَّقُو[s[اْ] رَبَّكُمْ‌ۚ إِ[g[نّ]َ زَلْزَلَةَ [h:8897[ٱ][l[ل]سَّاعَةِ شَىْءٌ عَظ[p[ِي]مٌ","translation_en":"O people! guard against (the punishment from) your Lord; surely the violence of the hour is a grievous thing.","translation_id":"Wahai manusia! Bertakwalah kepada Tuhanmu; sungguh, guncangan (hari) Kiamat itu adalah suatu (kejadian) yang sangat besar.","hasanah_per_verse":400},{"text_madani":"يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّا أَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى النَّاسَ سُكَارَىٰ وَمَا هُم بِسُكَارَىٰ وَلَٰكِنَّ عَذَابَ اللَّهِ شَدِيدٌ","text_tajweed":"يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَ[g[مّ][o[َآ] أَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى [h:8898[ٱ][l[ل][g[نّ]َاسَ سُكَ[n[ـٰ]رَىٰ وَمَا ه[c:8899[ُم ب]ِسُكَ[n[ـٰ]رَىٰ وَلَ[n[ـٰ]كِ[g[نّ]َ عَذَابَ [h:8900[ٱ]للَّهِ شَد[p[ِي][q[د]ٌ","translation_en":"On the day when you shall see it, every woman giving suck shall quit in confusion what she suckled, and every pregnant woman shall lay down her burden, and you shall see men intoxicated, and they shall not be intoxicated but the chastisement of Allah will be severe.","translation_id":"(Ingatlah) pada hari ketika kamu melihatnya (goncangan itu), semua perempuan yang menyusui anaknya akan lalai terhadap anak yang disusuinya, dan setiap perempuan yang hamil akan keguguran kandungannya, dan kamu melihat manusia dalam keadaan mabuk, padahal sebenarnya mereka tidak mabuk, tetapi azab Allah itu sangat keras.","hasanah_per_verse":860},{"text_madani":"وَمِنَ النَّاسِ مَن يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ وَيَتَّبِعُ كُلَّ شَيْطَانٍ مَّرِيدٍ","text_tajweed":"وَمِنَ [h:30[ٱ][l[ل][g[نّ]َاسِ م[a:8901[َن ي]ُجَ[n[ـٰ]دِلُ فِى [h:714[ٱ]للَّهِ بِغَيْرِ عِلْ[a:8902[مٍ و]َيَتَّبِعُ كُلَّ شَيْطَ[n[ـٰ][a:8903[نٍ م]َّر[p[ِي][q[د]ٍ","translation_en":"And among men there is he who disputes about Allah without knowledge and follows every rebellious Shaitan;","translation_id":"Dan di antara manusia ada yang berbantahan tentang Allah tanpa ilmu dan hanya mengikuti para setan yang sangat jahat.","hasanah_per_verse":440},{"text_madani":"كُتِبَ عَلَيْهِ أَنَّهُ مَن تَوَلَّاهُ فَأَنَّهُ يُضِلُّهُ وَيَهْدِيهِ إِلَىٰ عَذَابِ السَّعِيرِ","text_tajweed":"كُتِبَ عَلَيْهِ أَ[g[نّ]َهُ[n[ۥ] مَ[f:8904[ن ت]َوَلَّاهُ فَأَ[g[نّ]َهُ[n[ۥ] يُضِلُّهُ[n[ۥ] وَيَهْدِيهِ إِلَىٰ عَذَابِ [h:8905[ٱ][l[ل]سَّع[p[ِي]رِ","translation_en":"Against him it is written down that whoever takes him for a friend, he shall lead him astray and conduct him to the chastisement of the burning fire.","translation_id":"(Tentang setan), telah ditetapkan bahwa siapa yang berkawan dengan dia, maka dia akan menyesatkannya, dan membawanya ke azab neraka.","hasanah_per_verse":440},{"text_madani":"يَا أَيُّهَا النَّاسُ إِن كُنتُمْ فِي رَيْبٍ مِّنَ الْبَعْثِ فَإِنَّا خَلَقْنَاكُم مِّن تُرَابٍ ثُمَّ مِن نُّطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ مِن مُّضْغَةٍ مُّخَلَّقَةٍ وَغَيْرِ مُخَلَّقَةٍ لِّنُبَيِّنَ لَكُمْ ۚ وَنُقِرُّ فِي الْأَرْحَامِ مَا نَشَاءُ إِلَىٰ أَجَلٍ مُّسَمًّى ثُمَّ نُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوا أَشُدَّكُمْ ۖ وَمِنكُم مَّن يُتَوَفَّىٰ وَمِنكُم مَّن يُرَدُّ إِلَىٰ أَرْذَلِ الْعُمُرِ لِكَيْلَا يَعْلَمَ مِن بَعْدِ عِلْمٍ شَيْئًا ۚ وَتَرَى الْأَرْضَ هَامِدَةً فَإِذَا أَنزَلْنَا عَلَيْهَا الْمَاءَ اهْتَزَّتْ وَرَبَتْ وَأَنبَتَتْ مِن كُلِّ زَوْجٍ بَهِيجٍ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:82[ٱ][l[ل][g[نّ]َاسُ إِ[f:109[ن ك]ُ[f:100[نت]ُمْ فِى رَيْ[a:8906[بٍ م]ِّنَ [h:8907[ٱ]لْبَعْثِ فَإِ[g[نّ]َا خَلَ[q:4250[قْ]نَ[n[ـٰ]ك[w:8908[ُم م]ِّ[f:1972[ن ت]ُرَا[f:1973[بٍ ث]ُ[g[مّ]َ م[a:7325[ِن ن]ُّ[q:7326[طْ]فَ[f:8077[ةٍ ث]ُ[g[مّ]َ مِنْ عَلَقَ[f:8909[ةٍ ث]ُ[g[مّ]َ م[a:8910[ِن م]ُّضْغَ[a:8911[ةٍ م]ُّخَلَّقَ[a:8912[ةٍ و]َغَيْرِ مُخَلَّقَ[u:8913[ةٍ ل]ِّنُبَيِّنَ لَكُمْ‌ۚ وَنُقِرُّ فِى [h:1733[ٱ]لْأَرْحَامِ مَا نَش[o[َا]ٓءُ إِلَ[o[ىٰٓ] أَجَ[a:1657[لٍ م]ُّسَم[f:4121[ًّى ث]ُ[g[مّ]َ نُخْرِجُكُمْ طِفْل[f:8914[اً ث]ُ[g[مّ]َ لِتَ[q:8915[بْ]لُغ[o[ُوٓ][s[اْ] أَشُدَّكُمْ‌ۖ وَمِ[f:2325[نك][w:2326[ُم م]ّ[a:8916[َن ي]ُتَوَفَّىٰ وَمِ[f:2325[نك][w:2326[ُم م]ّ[a:7485[َن ي]ُرَدُّ إِلَ[o[ىٰٓ] أَرْذَلِ [h:7486[ٱ]لْعُمُرِ لِكَيْلَا يَعْلَمَ م[i:146[ِنۢ ب]َعْدِ عِلْ[f:7487[مٍ ش]َيْـ[a:8917[ـًٔا‌ۚ و]َتَرَى [h:8108[ٱ]لْأَرْضَ هَامِدَ[f:8918[ةً ف]َإِذ[o[َآ] أَ[f:515[نز]َلْنَا عَلَيْهَا [h:8919[ٱ]لْم[o[َا]ٓءَ [h:8920[ٱ]هْتَزَّتْ وَرَبَتْ وَأَ[i:8921[نۢب]َتَتْ مِ[f:843[ن ك]ُلِّ زَوْ[i:8922[جِۭ ب]َه[p[ِي][q[ج]ٍ","translation_en":"O people! if you are in doubt about the raising, then surely We created you from dust, then from a small seed, then from a clot, then from a lump of flesh, complete in make and incomplete, that We may make clear to you; and We cause what We please to stay in the wombs till an appointed time, then We bring you forth as babies, then that you may attain your maturity; and of you is he who is caused to die, and of you is he who is brought back to the worst part of life, so that after having knowledge he does not know anything; and you see the earth sterile land, but when We send down on it the water, it stirs and swells and brings forth of every kind a beautiful herbage.","translation_id":"Wahai manusia! Jika kamu meragukan (hari) kebangkitan, maka sesungguhnya Kami telah menjadikan kamu dari tanah, kemudian dari setetes mani, kemudian dari segumpal darah, kemudian dari segumpal daging yang sempurna kejadiannya dan yang tidak sempurna, agar Kami jelaskan kepada kamu; dan Kami tetapkan dalam rahim menurut kehendak Kami sampai waktu yang sudah ditentukan, kemudian Kami keluarkan kamu sebagai bayi, kemudian (dengan berangsur-angsur) kamu sampai kepada usia dewasa, dan di antara kamu ada yang diwafatkan dan (ada pula) di antara kamu yang dikembalikan sampai usia sangat tua (pikun), sehingga dia tidak mengetahui lagi sesuatu yang telah diketahuinya. Dan kamu lihat bumi ini kering, kemudian apabila telah Kami turunkan air (hujan) di atasnya, hiduplah bumi itu dan menjadi subur dan menumbuhkan berbagai jenis pasangan tetumbuhan yang indah.","hasanah_per_verse":2620},{"text_madani":"ذَٰلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّهُ يُحْيِي الْمَوْتَىٰ وَأَنَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","text_tajweed":"ذ[n[َٲ]لِكَ بِأَ[g[نّ]َ [h:897[ٱ]للَّهَ هُوَ [h:8923[ٱ]لْحَقُّ وَأَ[g[نّ]َهُ[n[ۥ] يُحْىِ [h:8924[ٱ]لْمَوْتَىٰ وَأَ[g[نّ]َهُ[n[ۥ] عَلَىٰ كُلِّ ش[f:81[َىْءٍ ق]َد[p[ِي]رٌ","translation_en":"This is because Allah is the Truth and because He gives life to the dead and because He has power over all things","translation_id":"Yang demikian itu karena sungguh, Allah, Dialah yang hak dan sungguh, Dialah yang menghidupkan segala yang telah mati, dan sungguh, Dia Mahakuasa atas segala sesuatu.","hasanah_per_verse":460},{"text_madani":"وَأَنَّ السَّاعَةَ آتِيَةٌ لَّا رَيْبَ فِيهَا وَأَنَّ اللَّهَ يَبْعَثُ مَن فِي الْقُبُورِ","text_tajweed":"وَأَ[g[نّ]َ [h:8014[ٱ][l[ل]سَّاعَةَ ءَاتِيَ[u:8925[ةٌ ل]َّا رَيْبَ فِيهَا وَأَ[g[نّ]َ [h:859[ٱ]للَّهَ يَ[q:7405[بْ]عَثُ مَ[f:2074[ن ف]ِى [h:8926[ٱ]لْقُب[p[ُو]رِ","translation_en":"And because the hour is coming, there is no doubt about it; and because Allah shall raise up those who are in the graves.","translation_id":"Dan sungguh, (hari) Kiamat itu pasti datang, tidak ada keraguan padanya; dan sungguh, Allah akan membangkitkan siapa pun yang di dalam kubur.","hasanah_per_verse":430},{"text_madani":"وَمِنَ النَّاسِ مَن يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ وَلَا هُدًى وَلَا كِتَابٍ مُّنِيرٍ","text_tajweed":"وَمِنَ [h:30[ٱ][l[ل][g[نّ]َاسِ م[a:8901[َن ي]ُجَ[n[ـٰ]دِلُ فِى [h:714[ٱ]للَّهِ بِغَيْرِ عِلْ[a:7953[مٍ و]َلَا هُ[a:8927[دًى و]َلَا كِتَ[n[ـٰ][a:8928[بٍ م]ُّن[p[ِي]رٍ","translation_en":"And among men there is he who disputes about Allah without knowledge and without guidance and without an illuminating book,","translation_id":"Dan di antara manusia ada yang berbantahan tentang Allah tanpa ilmu, tanpa petunjuk dan tanpa kitab (wahyu) yang memberi penerangan.","hasanah_per_verse":450},{"text_madani":"ثَانِيَ عِطْفِهِ لِيُضِلَّ عَن سَبِيلِ اللَّهِ ۖ لَهُ فِي الدُّنْيَا خِزْيٌ ۖ وَنُذِيقُهُ يَوْمَ الْقِيَامَةِ عَذَابَ الْحَرِيقِ","text_tajweed":"ثَانِىَ عِ[q:8929[طْ]فِه[n[ِۦ] لِيُضِلَّ عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ‌ۖ لَهُ[n[ۥ] فِى [h:599[ٱ][l[ل]دُّنْيَا خِزْ[a:8930[ىٌ‌ۖ و]َنُذِيقُهُ[n[ۥ] يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ عَذَابَ [h:2465[ٱ]لْحَر[p[ِي][q[ق]ِ","translation_en":"Turning away haughtily that he may lead (others) astray from the way of Allah; for him is disgrace in this world, and on the day of resurrection We will make him taste the punishment of burning:","translation_id":"Sambil memalingkan lambungnya (dengan congkak) untuk menyesatkan manusia dari jalan Allah. Dia mendapat kehinaan di dunia, dan pada hari Kiamat Kami berikan kepadanya rasa azab neraka yang membakar.","hasanah_per_verse":610},{"text_madani":"ذَٰلِكَ بِمَا قَدَّمَتْ يَدَاكَ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيدِ","text_tajweed":"ذ[n[َٲ]لِكَ بِمَا قَدَّمَتْ يَدَاكَ وَأَ[g[نّ]َ [h:859[ٱ]للَّهَ لَيْسَ بِظَلَّ[n[ـٰ][u:2466[مٍ ل]ِّلْعَب[p[ِي][q[د]ِ","translation_en":"This is due to what your two hands have sent before, and because Allah is not in the least unjust to the servants.","translation_id":"(Akan dikatakan kepadanya), “Itu karena perbuatan yang dilakukan dahulu oleh kedua tanganmu, dan Allah sekali-kali tidak menzhalimi hamba-hamba-Nya.","hasanah_per_verse":350},{"text_madani":"وَمِنَ النَّاسِ مَن يَعْبُدُ اللَّهَ عَلَىٰ حَرْفٍ ۖ فَإِنْ أَصَابَهُ خَيْرٌ اطْمَأَنَّ بِهِ ۖ وَإِنْ أَصَابَتْهُ فِتْنَةٌ انقَلَبَ عَلَىٰ وَجْهِهِ خَسِرَ الدُّنْيَا وَالْآخِرَةَ ۚ ذَٰلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ","text_tajweed":"وَمِنَ [h:30[ٱ][l[ل][g[نّ]َاسِ م[a:8931[َن ي]َعْبُدُ [h:8932[ٱ]للَّهَ عَلَىٰ حَرْ[f:8933[فٍ‌ۖ ف]َإِنْ أَصَابَهُ[n[ۥ] خَيْرٌ [h:8934[ٱ][q:8935[طْ]مَأَ[g[نّ]َ بِه[n[ِۦ]‌ۖ وَإِنْ أَصَابَتْهُ فِتْنَةٌ [h:8936[ٱ][f:8937[نق]َلَبَ عَلَىٰ وَ[q:6818[جْ]هِه[n[ِۦ] خَسِرَ [h:8938[ٱ][l[ل]دُّنْيَا وَ[h:8939[ٱ]لْأَخِرَةَ‌ۚ ذ[n[َٲ]لِكَ هُوَ [h:8940[ٱ]لْخُسْرَانُ [h:8941[ٱ]لْمُب[p[ِي]نُ","translation_en":"And among men is he who serves Allah (standing) on the verge, so that if good befalls him he is satisfied therewith, but if a trial afflict him he turns back headlong; he loses this world as well as the hereafter; that is a manifest loss.","translation_id":"Dan di antara manusia ada yang menyembah Allah hanya di tepi; maka jika dia memperoleh kebajikan, dia merasa puas, dan jika dia ditimpa suatu cobaan, dia berbalik ke belakang. Dia rugi di dunia dan di akhirat. Itulah kerugian yang nyata.","hasanah_per_verse":1010},{"text_madani":"يَدْعُو مِن دُونِ اللَّهِ مَا لَا يَضُرُّهُ وَمَا لَا يَنفَعُهُ ۚ ذَٰلِكَ هُوَ الضَّلَالُ الْبَعِيدُ","text_tajweed":"يَ[q:1242[دْ]عُو[s[اْ] مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ مَا لَا يَضُرُّهُ[n[ۥ] وَمَا لَا يَ[f:8942[نف]َعُهُ[n[ۥ]‌ۚ ذ[n[َٲ]لِكَ هُوَ [h:7084[ٱ][l[ل]ضَّلَ[n[ـٰ]لُ [h:7085[ٱ]لْبَع[p[ِي][q[د]ُ","translation_en":"He calls besides Allah upon that which does not harm him and that which does not profit him, that is the great straying.","translation_id":"Dia menyeru kepada selain Allah sesuatu yang tidak dapat mendatangkan bencana dan tidak (pula) memberi manfaat kepadanya. Itulah kesesatan yang jauh.","hasanah_per_verse":480},{"text_madani":"يَدْعُو لَمَن ضَرُّهُ أَقْرَبُ مِن نَّفْعِهِ ۚ لَبِئْسَ الْمَوْلَىٰ وَلَبِئْسَ الْعَشِيرُ","text_tajweed":"يَ[q:1242[دْ]عُو[s[اْ] لَمَ[f:8943[ن ض]َرُّهُ[o[ۥٓ] أَ[q:1355[قْ]رَبُ م[a:8944[ِن ن]َّفْعِه[n[ِۦ]‌ۚ لَبِئْسَ [h:8945[ٱ]لْمَوْلَىٰ وَلَبِئْسَ [h:8946[ٱ]لْعَش[p[ِي]رُ","translation_en":"He calls upon him whose harm is nearer than his profit; evil certainly is the guardian and evil certainly is the associate.","translation_id":"Dia menyeru kepada sesuatu yang (sebenarnya) bencananya lebih dekat daripada manfaatnya. Sungguh, itu seburuk-buruk penolong dan sejahat-jahat kawan.","hasanah_per_verse":410},{"text_madani":"إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ۚ إِنَّ اللَّهَ يَفْعَلُ مَا يُرِيدُ","text_tajweed":"إِ[g[نّ]َ [h:80[ٱ]للَّهَ يُ[q:8947[دْ]خِلُ [h:8948[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ جَ[g[نّ]َ[n[ـٰ][f:119[تٍ ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ يَفْعَلُ مَا يُر[p[ِي][q[د]ُ","translation_en":"Surely Allah will cause those who believe and do good deeds to enter gardens beneath which rivers flow, surely Allah does what He pleases.","translation_id":"(Sungguh,) Allah akan memasukkan orang-orang yang beriman dan mengerjakan kebajikan ke dalam surga-surga yang mengalir di bawahnya sungai-sungai. Sungguh, Allah berbuat apa yang Dia kehendaki.","hasanah_per_verse":720},{"text_madani":"مَن كَانَ يَظُنُّ أَن لَّن يَنصُرَهُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ فَلْيَمْدُدْ بِسَبَبٍ إِلَى السَّمَاءِ ثُمَّ لْيَقْطَعْ فَلْيَنظُرْ هَلْ يُذْهِبَنَّ كَيْدُهُ مَا يَغِيظُ","text_tajweed":"مَ[f:506[ن ك]َانَ يَظُ[g[نّ]ُ أ[u:8842[َن ل]ّ[a:8949[َن ي]َ[f:8950[نص]ُرَهُ [h:8951[ٱ]للَّهُ فِى [h:599[ٱ][l[ل]دُّنْيَا وَ[h:1213[ٱ]لْأَخِرَةِ فَلْيَمْدُ[q:8398[دْ] بِسَبَبٍ إِلَى [h:157[ٱ][l[ل]سَّم[o[َا]ٓءِ ثُ[g[مّ]َ لْيَ[q:8952[قْ]طَعْ فَلْيَ[f:8007[نظ]ُرْ هَلْ يُذْهِبَ[g[نّ]َ كَيْدُهُ[n[ۥ] مَا يَغ[p[ِي]ظُ","translation_en":"Whoever thinks that Allah will not assist him in this life and the hereafter, let him stretch a rope to the ceiling, then let him cut (it) off, then let him see if his struggle will take away that at which he is enraged.","translation_id":"Barangsiapa menyangka bahwa Allah tidak akan menolongnya (Muhammad) di dunia dan di akhirat, maka hendaklah dia merentangkan tali ke langit-langit, lalu menggantung (diri), kemudian pikirkanlah apakah tipu dayanya itu dapat melenyapkan apa yang menyakitkan hatinya.","hasanah_per_verse":850},{"text_madani":"وَكَذَٰلِكَ أَنزَلْنَاهُ آيَاتٍ بَيِّنَاتٍ وَأَنَّ اللَّهَ يَهْدِي مَن يُرِيدُ","text_tajweed":"وَكَذ[n[َٲ]لِكَ أَ[f:4236[نز]َلْنَ[n[ـٰ]هُ ءَايَ[n[ـٰ][i:516[تِۭ ب]َيِّنَ[n[ـٰ][a:8953[تٍ و]َأَ[g[نّ]َ [h:859[ٱ]للَّهَ يَهْدِى م[a:2323[َن ي]ُر[p[ِي][q[د]ُ","translation_en":"And thus have We revealed it, being clear arguments, and because Allah guides whom He intends.","translation_id":"Dan demikianlah Kami telah menurunkannya (Al-Qur'an) yang merupakan ayat-ayat yang nyata; sesungguhnya Allah memberikan petunjuk kepada siapa yang Dia kehendaki.","hasanah_per_verse":380},{"text_madani":"إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالصَّابِئِينَ وَالنَّصَارَىٰ وَالْمَجُوسَ وَالَّذِينَ أَشْرَكُوا إِنَّ اللَّهَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَ[h:37[ٱ]لَّذِينَ هَادُو[s[اْ] وَ[h:327[ٱ][l[ل]صَّ[n[ـٰ]بِــِٔينَ وَ[h:326[ٱ][l[ل][g[نّ]َصَ[n[ـٰ]رَىٰ وَ[h:8954[ٱ]لْمَجُوسَ وَ[h:37[ٱ]لَّذِينَ أَشْرَك[o[ُوٓ][s[اْ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ يَفْصِلُ بَيْنَهُمْ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ عَلَىٰ كُلِّ ش[f:3903[َىْءٍ ش]َه[p[ِي][q[د]ٌ","translation_en":"Surely those who believe and those who are Jews and the Sabeans and the Christians and the Magians and those who associate (others with Allah)-- surely Allah will decide between them on the day of resurrection; surely Allah is a witness over all things.","translation_id":"Sesungguhnya orang-orang beriman, orang Yahudi, orang Sabiin, orang Nasrani, orang Majusi dan orang musyrik, Allah pasti memberi keputusan di antara mereka pada hari Kiamat. Sungguh, Allah menjadi saksi atas segala sesuatu.","hasanah_per_verse":1020},{"text_madani":"أَلَمْ تَرَ أَنَّ اللَّهَ يَسْجُدُ لَهُ مَن فِي السَّمَاوَاتِ وَمَن فِي الْأَرْضِ وَالشَّمْسُ وَالْقَمَرُ وَالنُّجُومُ وَالْجِبَالُ وَالشَّجَرُ وَالدَّوَابُّ وَكَثِيرٌ مِّنَ النَّاسِ ۖ وَكَثِيرٌ حَقَّ عَلَيْهِ الْعَذَابُ ۗ وَمَن يُهِنِ اللَّهُ فَمَا لَهُ مِن مُّكْرِمٍ ۚ إِنَّ اللَّهَ يَفْعَلُ مَا يَشَاءُ","text_tajweed":"أَلَمْ تَرَ أَ[g[نّ]َ [h:394[ٱ]للَّهَ يَسْجُدُ لَهُ[n[ۥ] مَ[f:2074[ن ف]ِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَ[f:3453[ن ف]ِى [h:44[ٱ]لْأَرْضِ وَ[h:8955[ٱ][l[ل]شَّمْسُ وَ[h:8956[ٱ]لْقَمَرُ وَ[h:7346[ٱ][l[ل][g[نّ]ُجُومُ وَ[h:8957[ٱ]لْجِبَالُ وَ[h:8958[ٱ][l[ل]شَّجَرُ وَ[h:8959[ٱ][l[ل]دَّو[m[َا]ٓبُّ وَكَثِي[a:8960[رٌ م]ِّنَ [h:721[ٱ][l[ل][g[نّ]َاسِ‌ۖ وَكَثِيرٌ حَقَّ عَلَيْهِ [h:8961[ٱ]لْعَذَابُ‌ۗ وَم[a:8962[َن ي]ُهِنِ [h:8963[ٱ]للَّهُ فَمَا لَهُ[n[ۥ] م[a:8964[ِن م]ُّكْرِمٍ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ يَفْعَلُ مَا يَش[o[َا]ٓءُ ۩","translation_en":"Do you not see that Allah is He, Whom obeys whoever is in the heavens and whoever is in the earth, and the sun and the moon and the stars, and the mountains and the trees, and the animals and many of the people; and many there are against whom chastisement has become necessary; and whomsoever Allah abases, there is none who can make him honorable; surely Allah does what He pleases.","translation_id":"Tidakkah engkau tahu bahwa siapa yang ada di langit dan siapa yang ada di bumi bersujud kepada Allah, juga matahari, bulan, bintang, gunung-gunung, pohon-pohon, hewan-hewan yang melata dan banyak di antara manusia? Tetapi banyak (manusia) yang pantas mendapatkan azab. Barangsiapa dihinakan Allah, tidak seorang pun yang akan memuliakannya. Sungguh, Allah berbuat apa saja yang Dia kehendaki.","hasanah_per_verse":1440},{"text_madani":"هَٰذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ ۖ فَالَّذِينَ كَفَرُوا قُطِّعَتْ لَهُمْ ثِيَابٌ مِّن نَّارٍ يُصَبُّ مِن فَوْقِ رُءُوسِهِمُ الْحَمِيمُ","text_tajweed":"۞ هَ[n[ـٰ]ذَانِ خَصْمَانِ [h:8965[ٱ]خْتَصَمُو[s[اْ] فِى رَبِّهِمْ‌ۖ فَ[h:2514[ٱ]لَّذِينَ كَفَرُو[s[اْ] قُطِّعَتْ لَهُمْ ثِيَا[a:8966[بٌ م]ّ[a:4598[ِن ن]َّا[a:8967[رٍ ي]ُصَبُّ مِ[f:7114[ن ف]َوْقِ رُءُوسِهِمُ [h:8968[ٱ]لْحَم[p[ِي]مُ","translation_en":"These are two adversaries who dispute about their Lord; then (as to) those who disbelieve, for them are cut out garments of fire, boiling water shall be poured over their heads.","translation_id":"Inilah dua golongan (golongan mukmin dan kafir) yang bertengkar, mereka bertengkar mengenai Tuhan mereka. Maka bagi orang kafir akan dibuatkan pakaian-pakaian dari api (neraka) untuk mereka. Ke atas kepala mereka akan disiramkan air yang mendidih.","hasanah_per_verse":690},{"text_madani":"يُصْهَرُ بِهِ مَا فِي بُطُونِهِمْ وَالْجُلُودُ","text_tajweed":"يُصْهَرُ بِه[n[ِۦ] مَا فِى بُطُونِهِمْ وَ[h:8969[ٱ]لْجُل[p[ُو][q[د]ُ","translation_en":"With it shall be melted what is in their bellies and (their) skins as well.","translation_id":"Dengan (air mendidih) itu akan dihancurluluhkan apa yang ada dalam perut dan kulit mereka.","hasanah_per_verse":230},{"text_madani":"وَلَهُم مَّقَامِعُ مِنْ حَدِيدٍ","text_tajweed":"وَلَه[w:8970[ُم م]َّقَ[n[ـٰ]مِعُ مِنْ حَد[p[ِي][q[د]ٍ","translation_en":"And for them are whips of iron.","translation_id":"Dan (azab) untuk mereka cambuk-cambuk dari besi.","hasanah_per_verse":150},{"text_madani":"كُلَّمَا أَرَادُوا أَن يَخْرُجُوا مِنْهَا مِنْ غَمٍّ أُعِيدُوا فِيهَا وَذُوقُوا عَذَابَ الْحَرِيقِ","text_tajweed":"كُلَّم[o[َآ] أَرَاد[o[ُوٓ][s[اْ] أ[a:3533[َن ي]َخْرُجُو[s[اْ] مِنْهَا مِنْ غَ[g[مّ]ٍ أُعِيدُو[s[اْ] فِيهَا وَذُوقُو[s[اْ] عَذَابَ [h:2465[ٱ]لْحَر[p[ِي][q[ق]ِ","translation_en":"Whenever they will desire to go forth from it, from grief, they shall be turned back into it, and taste the chastisement of burning.","translation_id":"Setiap kali mereka hendak keluar darinya (neraka) karena tersiksa, mereka dikembalikan (lagi) ke dalamnya. (Kepada mereka dikatakan), “Rasakanlah azab yang membakar ini!”","hasanah_per_verse":520},{"text_madani":"إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍ وَلُؤْلُؤًا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌ","text_tajweed":"إِ[g[نّ]َ [h:80[ٱ]للَّهَ يُ[q:8947[دْ]خِلُ [h:8948[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ جَ[g[نّ]َ[n[ـٰ][f:119[تٍ ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِ[f:8050[ن ذ]َهَ[a:8971[بٍ و]َلُؤْلُ[a:8972[ؤًا‌ۖ و]َلِبَاسُهُمْ فِيهَا حَر[p[ِي]رٌ","translation_en":"Surely Allah will make those who believe and do good deeds enter gardens beneath which rivers flow; they shall be adorned therein with bracelets of gold and (with) pearls, and their garments therein shall be of silk.","translation_id":"Sungguh, Allah akan memasukkan orang-orang yang beriman dan mengerjakan kebajikan ke dalam surga-surga yang mengalir di bawahnya sungai-sungai. Di sana mereka diberi perhiasan gelang-gelang emas dan mutiara, dan pakaian mereka dari sutera.","hasanah_per_verse":980},{"text_madani":"وَهُدُوا إِلَى الطَّيِّبِ مِنَ الْقَوْلِ وَهُدُوا إِلَىٰ صِرَاطِ الْحَمِيدِ","text_tajweed":"وَهُد[o[ُوٓ][s[اْ] إِلَى [h:8973[ٱ][l[ل]طَّيِّبِ مِنَ [h:3107[ٱ]لْقَوْلِ وَهُد[o[ُوٓ][s[اْ] إِلَىٰ صِر[n[َٲ]طِ [h:8974[ٱ]لْحَم[p[ِي][q[د]ِ","translation_en":"And they are guided to goodly words and they are guided into the path of the Praised One.","translation_id":"Dan mereka diberi petunjuk kepada ucapan-ucapan yang baik dan diberi petunjuk (pula) kepada jalan (Allah) yang terpuji.","hasanah_per_verse":380},{"text_madani":"إِنَّ الَّذِينَ كَفَرُوا وَيَصُدُّونَ عَن سَبِيلِ اللَّهِ وَالْمَسْجِدِ الْحَرَامِ الَّذِي جَعَلْنَاهُ لِلنَّاسِ سَوَاءً الْعَاكِفُ فِيهِ وَالْبَادِ ۚ وَمَن يُرِدْ فِيهِ بِإِلْحَادٍ بِظُلْمٍ نُّذِقْهُ مِنْ عَذَابٍ أَلِيمٍ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ كَفَرُو[s[اْ] وَيَصُدُّونَ عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ وَ[h:1205[ٱ]لْمَسْجِدِ [h:1206[ٱ]لْحَرَامِ [h:8975[ٱ]لَّذِى جَعَلْنَ[n[ـٰ]هُ لِل[g[نّ]َاسِ سَو[o[َا]ٓءً [h:8976[ٱ]لْعَ[n[ـٰ]كِفُ فِيهِ وَ[h:8977[ٱ]لْبَادِ‌ۚ وَم[a:2292[َن ي]ُرِ[q:2293[دْ] فِيهِ بِإِلْحَا[i:8978[دِۭ ب]ِظُلْ[a:8979[مٍ ن]ُّذِ[q:8980[قْ]هُ مِنْ عَذَابٍ أَل[p[ِي]مٍ","translation_en":"Surely (as for) those who disbelieve, and hinder (men) from Allah's way and from the Sacred Mosque which We have made equally for all men, (for) the dweller therein and (for) the visitor, and whoever shall incline therein to wrong unjustly, We will make him taste of a painful chastisement.","translation_id":"Sungguh, orang-orang kafir dan yang menghalangi (manusia) dari jalan Allah dan dari Masjidilharam yang telah Kami jadikan terbuka untuk semua manusia, baik yang bermukim di sana maupun yang datang dari luar dan si-apa saja yang bermaksud melakukan kejahatan secara zhalim di dalamnya, niscaya akan Kami rasakan kepadanya siksa yang pedih.","hasanah_per_verse":1080},{"text_madani":"وَإِذْ بَوَّأْنَا لِإِبْرَاهِيمَ مَكَانَ الْبَيْتِ أَن لَّا تُشْرِكْ بِي شَيْئًا وَطَهِّرْ بَيْتِيَ لِلطَّائِفِينَ وَالْقَائِمِينَ وَالرُّكَّعِ السُّجُودِ","text_tajweed":"وَإِذْ بَوَّأْنَا لِإِ[q:8981[بْ]ر[n[َٲ]هِيمَ مَكَانَ [h:8982[ٱ]لْبَيْتِ أ[u:4908[َن ل]َّا تُشْرِكْ بِى شَيْـ[a:8983[ـًٔا و]َطَهِّرْ بَيْتِىَ لِلطّ[o[َا]ٓئِفِينَ وَ[h:8984[ٱ]لْق[o[َا]ٓئِمِينَ وَ[h:654[ٱ][l[ل]رُّكَّعِ [h:655[ٱ][l[ل]سُّج[p[ُو][q[د]ِ","translation_en":"And when We assigned to Ibrahim the place of the House, saying: Do not associate with Me aught, and purify My House for those who make the circuit and stand to pray and bow and prostrate themselves.","translation_id":"Dan (ingatlah), ketika Kami tempatkan Ibrahim di tempat Baitullah (dengan mengatakan), “Janganlah engkau mempersekutukan Aku dengan apa pun dan sucikanlah rumah-Ku bagi orang-orang yang tawaf, dan orang yang beribadah dan orang yang rukuk dan sujud.","hasanah_per_verse":760},{"text_madani":"وَأَذِّن فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجَالًا وَعَلَىٰ كُلِّ ضَامِرٍ يَأْتِينَ مِن كُلِّ فَجٍّ عَمِيقٍ","text_tajweed":"وَأَذِّ[f:8985[ن ف]ِى [h:4380[ٱ][l[ل][g[نّ]َاسِ بِ[h:8986[ٱ]لْحَجِّ يَأْتُوكَ رِجَال[a:8987[اً و]َعَلَىٰ كُلِّ ضَامِ[a:8988[رٍ ي]َأْتِينَ مِ[f:843[ن ك]ُلِّ فَجٍّ عَم[p[ِي][q[ق]ٍ","translation_en":"And proclaim among men the Pilgrimage: they will come to you on foot and on every lean camel, coming from every remote path,","translation_id":"Dan serulah manusia untuk mengerjakan haji, niscaya mereka akan datang kepadamu dengan berjalan kaki, atau mengendarai setiap unta yang kurus, mereka datang dari segenap penjuru yang jauh.","hasanah_per_verse":510},{"text_madani":"لِّيَشْهَدُوا مَنَافِعَ لَهُمْ وَيَذْكُرُوا اسْمَ اللَّهِ فِي أَيَّامٍ مَّعْلُومَاتٍ عَلَىٰ مَا رَزَقَهُم مِّن بَهِيمَةِ الْأَنْعَامِ ۖ فَكُلُوا مِنْهَا وَأَطْعِمُوا الْبَائِسَ الْفَقِيرَ","text_tajweed":"لِّيَشْهَدُو[s[اْ] مَنَ[n[ـٰ]فِعَ لَهُمْ وَيَذْكُرُو[s[اْ] [h:8989[ٱ]سْمَ [h:3393[ٱ]للَّهِ ف[o[ِىٓ] أَيَّا[a:8990[مٍ م]َّعْلُومَ[n[ـٰ]تٍ عَلَىٰ مَا رَزَقَه[w:8991[ُم م]ّ[i:8992[ِنۢ ب]َهِيمَةِ [h:8993[ٱ]لْأَنْعَ[n[ـٰ]مِ‌ۖ فَكُلُو[s[اْ] مِنْهَا وَأَ[q:8994[طْ]عِمُو[s[اْ] [h:8995[ٱ]لْب[o[َا]ٓئِسَ [h:8996[ٱ]لْفَق[p[ِي]رَ","translation_en":"That they may witness advantages for them and mention the name of Allah during stated days over what He has given them of the cattle quadrupeds, then eat of them and feed the distressed one, the needy.","translation_id":"Agar mereka menyaksikan berbagai manfaat untuk mereka dan agar mere-ka menyebut nama Allah pada beberapa hari yang telah ditentukan atas rezeki yang diberikan Dia kepada mereka berupa hewan ternak. Maka makanlah sebagian darinya dan (sebagian lagi) berikanlah untuk dimakan orang-orang yang sengsara dan fakir.","hasanah_per_verse":940},{"text_madani":"ثُمَّ لْيَقْضُوا تَفَثَهُمْ وَلْيُوفُوا نُذُورَهُمْ وَلْيَطَّوَّفُوا بِالْبَيْتِ الْعَتِيقِ","text_tajweed":"ثُ[g[مّ]َ لْيَ[q:8997[قْ]ضُو[s[اْ] تَفَثَهُمْ وَلْيُوفُو[s[اْ] نُذُورَهُمْ وَلْيَطَّوَّفُو[s[اْ] بِ[h:8998[ٱ]لْبَيْتِ [h:8999[ٱ]لْعَت[p[ِي][q[ق]ِ","translation_en":"Then let them accomplish their needful acts of shaving and cleansing, and let them fulfil their vows and let them go round the Ancient House.","translation_id":"Kemudian, hendaklah mereka menghilangkan kotoran (yang ada di badan) mereka, menyempurnakan nazar-nazar mereka dan melakukan tawaf sekeliling rumah tua (Baitullah).","hasanah_per_verse":460},{"text_madani":"ذَٰلِكَ وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ فَهُوَ خَيْرٌ لَّهُ عِندَ رَبِّهِ ۗ وَأُحِلَّتْ لَكُمُ الْأَنْعَامُ إِلَّا مَا يُتْلَىٰ عَلَيْكُمْ ۖ فَاجْتَنِبُوا الرِّجْسَ مِنَ الْأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ","text_tajweed":"ذ[n[َٲ]لِكَ وَم[a:9000[َن ي]ُعَظِّمْ حُرُمَ[n[ـٰ]تِ [h:9001[ٱ]للَّهِ فَهُوَ خَيْ[u:964[رٌ ل]َّهُ[n[ۥ] عِ[f:264[ند]َ رَبِّه[n[ِۦ]‌ۗ وَأُحِلَّتْ لَكُمُ [h:9002[ٱ]لْأَنْعَ[n[ـٰ]مُ إِلَّا مَا يُتْلَىٰ عَلَيْكُمْ‌ۖ فَ[h:9003[ٱ][q:9003[جْ]تَنِبُو[s[اْ] [h:9004[ٱ][l[ل]رِّ[q:4401[جْ]سَ مِنَ [h:9005[ٱ]لْأَوْثَ[n[ـٰ]نِ وَ[h:7400[ٱ][q:7400[جْ]تَنِبُو[s[اْ] قَوْلَ [h:9006[ٱ][l[ل]زّ[p[ُو]رِ","translation_en":"That (shall be so); and whoever respects the sacred ordinances of Allah, it is better for him with his Lord; and the cattle are made lawful for you, except that which is recited to you, therefore avoid the uncleanness of the idols and avoid false words,","translation_id":"Demikianlah (perintah Allah). Dan barang siapa mengagungkan apa yang terhormat di sisi Allah (hurumat) maka itu lebih baik baginya di sisi Tuhannya. Dan dihalalkan bagi kamu semua hewan ternak, kecuali yang diterangkan kepadamu (keharamannya), maka jauhilah olehmu (penyembahan) berhala-berhala yang najis itu dan jauhilah perkataan dusta.","hasanah_per_verse":1000},{"text_madani":"حُنَفَاءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بِهِ ۚ وَمَن يُشْرِكْ بِاللَّهِ فَكَأَنَّمَا خَرَّ مِنَ السَّمَاءِ فَتَخْطَفُهُ الطَّيْرُ أَوْ تَهْوِي بِهِ الرِّيحُ فِي مَكَانٍ سَحِيقٍ","text_tajweed":"حُنَف[o[َا]ٓءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بِه[n[ِۦ]‌ۚ وَم[a:2834[َن ي]ُشْرِكْ بِ[h:32[ٱ]للَّهِ فَكَأَ[g[نّ]َمَا خَرَّ مِنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ فَتَخْطَفُهُ [h:9007[ٱ][l[ل]طَّيْرُ أَوْ تَهْوِى بِهِ [h:7082[ٱ][l[ل]رِّيحُ فِى مَكَا[f:9008[نٍ س]َح[p[ِي][q[ق]ٍ","translation_en":"Being upright for Allah, not associating aught with Him and whoever associates (others) with Allah, it is as though he had fallen from on high, then the birds snatch him away or the wind carries him off to a far-distant place.","translation_id":"(Beribadahlah) dengan ikhlas kepada Allah, tanpa mempersekutukan-Nya. Barangsiapa mempersekutukan Allah, maka seakan-akan dia jatuh dari langit lalu disambar oleh burung, atau diterbangkan angin ke tempat yang jauh.","hasanah_per_verse":810},{"text_madani":"ذَٰلِكَ وَمَن يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِن تَقْوَى الْقُلُوبِ","text_tajweed":"ذ[n[َٲ]لِكَ وَم[a:9000[َن ي]ُعَظِّمْ شَعَ[o[ـٰٓ]ئِرَ [h:3349[ٱ]للَّهِ فَإِ[g[نّ]َهَا مِ[f:9009[ن ت]َ[q:5843[قْ]وَى [h:9010[ٱ]لْقُل[p[ُو][q[ب]ِ","translation_en":"That (shall be so); and whoever respects the signs of Allah, this surely is (the outcome) of the piety of hearts.","translation_id":"Demikianlah (perintah Allah). Dan barangsiapa mengagungkan syiar-syiar Allah, maka sesungguhnya hal itu timbul dari ketakwaan hati.","hasanah_per_verse":360},{"text_madani":"لَكُمْ فِيهَا مَنَافِعُ إِلَىٰ أَجَلٍ مُّسَمًّى ثُمَّ مَحِلُّهَا إِلَى الْبَيْتِ الْعَتِيقِ","text_tajweed":"لَكُمْ فِيهَا مَنَ[n[ـٰ]فِعُ إِلَ[o[ىٰٓ] أَجَ[a:1657[لٍ م]ُّسَم[f:4121[ًّى ث]ُ[g[مّ]َ مَحِلُّه[o[َآ] إِلَى [h:9011[ٱ]لْبَيْتِ [h:9012[ٱ]لْعَت[p[ِي][q[ق]ِ","translation_en":"You have advantages in them till a fixed time, then their place of sacrifice is the Ancient House.","translation_id":"Bagi kamu padanya (hewan hadyu) ada beberapa manfaat, sampai waktu yang ditentukan, kemudian tempat penyembelihannya adalah di sekitar Baitul Atiq (Baitullah).","hasanah_per_verse":430},{"text_madani":"وَلِكُلِّ أُمَّةٍ جَعَلْنَا مَنسَكًا لِّيَذْكُرُوا اسْمَ اللَّهِ عَلَىٰ مَا رَزَقَهُم مِّن بَهِيمَةِ الْأَنْعَامِ ۗ فَإِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ فَلَهُ أَسْلِمُوا ۗ وَبَشِّرِ الْمُخْبِتِينَ","text_tajweed":"وَلِكُلِّ أُ[g[مّ]َ[f:9013[ةٍ ج]َعَلْنَا مَ[f:9014[نس]َ[u:9015[كًا ل]ِّيَذْكُرُو[s[اْ] [h:9016[ٱ]سْمَ [h:3393[ٱ]للَّهِ عَلَىٰ مَا رَزَقَه[w:8991[ُم م]ّ[i:8992[ِنۢ ب]َهِيمَةِ [h:8993[ٱ]لْأَنْعَ[n[ـٰ]مِ‌ۗ فَإِلَ[n[ـٰ]هُكُمْ إِلَ[n[ـٰ][a:827[هٌ و][n[َٲ]حِ[f:9017[دٌ ف]َلَهُ[o[ۥٓ] أَسْلِمُو[s[اْ‌ۗ] وَبَشِّرِ [h:9018[ٱ]لْمُخْبِت[p[ِي]نَ","translation_en":"And to every nation We appointed acts of devotion that they may mention the name of Allah on what He has given them of the cattle quadrupeds; so your god is One God, therefore to Him should you submit, and give good news to the humble,","translation_id":"Dan bagi setiap umat telah Kami syariatkan penyembelihan (kurban), agar mereka menyebut nama Allah atas rezeki yang dikaruniakan Allah kepada mereka berupa hewan ternak. Maka Tuhanmu ialah Tuhan Yang Maha Esa, karena itu berserahdirilah kamu kepada-Nya. Dan sampaikanlah (Muhammad) kabar gembira kepada orang-orang yang tunduk patuh (kepada Allah),","hasanah_per_verse":890},{"text_madani":"الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَالصَّابِرِينَ عَلَىٰ مَا أَصَابَهُمْ وَالْمُقِيمِي الصَّلَاةِ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ","text_tajweed":"ٱلَّذِينَ إِذَا ذُكِرَ [h:5234[ٱ]للَّهُ وَجِلَتْ قُلُوبُهُمْ وَ[h:918[ٱ][l[ل]صَّ[n[ـٰ]بِرِينَ عَلَىٰ م[o[َآ] أَصَابَهُمْ وَ[h:9019[ٱ]لْمُقِيمِى [h:9020[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةِ وَمِ[g[مّ]َا رَزَ[q:15[قْ]نَ[n[ـٰ]هُمْ يُ[f:16[نف]ِق[p[ُو]نَ","translation_en":"(To) those whose hearts tremble when Allah is mentioned, and those who are patient under that which afflicts them, and those who keep up prayer, and spend (benevolently) out of what We have given them.","translation_id":"(yaitu) orang-orang yang apabila disebut nama Allah hati mereka berge-tar, orang yang sabar atas apa yang menimpa mereka, dan orang yang melaksanakan shalat dan orang yang menginfakkan sebagian rezeki yang Kami karuniakan kepada mereka.","hasanah_per_verse":760},{"text_madani":"وَالْبُدْنَ جَعَلْنَاهَا لَكُم مِّن شَعَائِرِ اللَّهِ لَكُمْ فِيهَا خَيْرٌ ۖ فَاذْكُرُوا اسْمَ اللَّهِ عَلَيْهَا صَوَافَّ ۖ فَإِذَا وَجَبَتْ جُنُوبُهَا فَكُلُوا مِنْهَا وَأَطْعِمُوا الْقَانِعَ وَالْمُعْتَرَّ ۚ كَذَٰلِكَ سَخَّرْنَاهَا لَكُمْ لَعَلَّكُمْ تَشْكُرُونَ","text_tajweed":"وَ[h:9999[ٱ]لْبُ[q:9021[دْ]نَ جَعَلْنَ[n[ـٰ]هَا لَك[w:556[ُم م]ِّ[f:809[ن ش]َعَ[o[ـٰٓ]ئِرِ [h:810[ٱ]للَّهِ لَكُمْ فِيهَا خَيْ[f:9022[رٌ‌ۖ ف]َ[h:1091[ٱ]ذْكُرُو[s[اْ] [h:9023[ٱ]سْمَ [h:3393[ٱ]للَّهِ عَلَيْهَا صَو[m[َا]ٓفَّ‌ۖ فَإِذَا وَجَبَتْ جُنُوبُهَا فَكُلُو[s[اْ] مِنْهَا وَأَ[q:8994[طْ]عِمُو[s[اْ] [h:9024[ٱ]لْقَانِعَ وَ[h:9025[ٱ]لْمُعْتَرَّ‌ۚ كَذ[n[َٲ]لِكَ سَخَّرْنَ[n[ـٰ]هَا لَكُمْ لَعَلَّكُمْ تَشْكُر[p[ُو]نَ","translation_en":"And (as for) the camels, We have made them of the signs of the religion of Allah for you; for you therein is much good; therefore mention the name of Allah on them as they stand in a row, then when they fall down eat of them and feed the poor man who is contented and the beggar; thus have We made them subservient to you, that you may be grateful.","translation_id":"Dan unta-unta itu Kami jadikan untuk-mu bagian dari syiar agama Allah, kamu banyak memperoleh kebaikan padanya. Maka sebutlah nama Allah (ketika kamu akan menyembelihnya) da-lam keadaan berdiri dan kaki-kaki telah terikat). Kemudian apabila telah rebah (mati), maka makanlah seba-giannya dan berilah makanlah orang yang merasa cukup dengan apa yang ada padanya (tidak meminta-minta) dan orang yang meminta. Demikianlah Kami tundukkan (unta-unta itu) untukmu, agar kamu bersyukur.","hasanah_per_verse":1280},{"text_madani":"لَن يَنَالَ اللَّهَ لُحُومُهَا وَلَا دِمَاؤُهَا وَلَٰكِن يَنَالُهُ التَّقْوَىٰ مِنكُمْ ۚ كَذَٰلِكَ سَخَّرَهَا لَكُمْ لِتُكَبِّرُوا اللَّهَ عَلَىٰ مَا هَدَاكُمْ ۗ وَبَشِّرِ الْمُحْسِنِينَ","text_tajweed":"ل[a:9026[َن ي]َنَالَ [h:9027[ٱ]للَّهَ لُحُومُهَا وَلَا دِم[o[َا]ٓؤُهَا وَلَ[n[ـٰ]ك[a:9028[ِن ي]َنَالُهُ [h:9029[ٱ][l[ل]تَّ[q:1084[قْ]وَىٰ مِ[f:344[نك]ُمْ‌ۚ كَذ[n[َٲ]لِكَ سَخَّرَهَا لَكُمْ لِتُكَبِّرُو[s[اْ] [h:9030[ٱ]للَّهَ عَلَىٰ مَا هَدَ[n[ٮٰ]كُمْ‌ۗ وَبَشِّرِ [h:9031[ٱ]لْمُحْسِن[p[ِي]نَ","translation_en":"There does not reach Allah their flesh nor their blood, but to Him is acceptable the guarding (against evil) on your part; thus has He made them subservient to you, that you may magnify Allah because He has guided you aright; and give good news to those who do good (to others).","translation_id":"Daging (hewan kurban) dan darahnya itu sekali-kali tidak akan sampai kepada Allah, tetapi yang sampai kepada-Nya adalah ketakwaan kamu. Demi-kianlah Dia menundukkannya untuk-mu agar kamu mengagungkan Allah atas petunjuk yang Dia berikan kepadamu. Dan sampaikanlah kabar gembira kepada orang-orang yang berbuat baik.","hasanah_per_verse":890},{"text_madani":"إِنَّ اللَّهَ يُدَافِعُ عَنِ الَّذِينَ آمَنُوا ۗ إِنَّ اللَّهَ لَا يُحِبُّ كُلَّ خَوَّانٍ كَفُورٍ","text_tajweed":"۞ إِ[g[نّ]َ [h:80[ٱ]للَّهَ يُد[n[َٲ]فِعُ عَنِ [h:3106[ٱ]لَّذِينَ ءَامَن[o[ُوٓ[s[اْ]‌ۗ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَا يُحِبُّ كُلَّ خَوَّا[f:9032[نٍ ك]َف[p[ُو]رٍ","translation_en":"Surely Allah will defend those who believe; surely Allah does not love any one who is unfaithful, ungrateful.","translation_id":"Sesungguhnya Allah membela orang yang beriman. Sungguh, Allah tidak menyukai setiap orang yang berkhia-nat dan kufur nikmat.","hasanah_per_verse":440},{"text_madani":"أُذِنَ لِلَّذِينَ يُقَاتَلُونَ بِأَنَّهُمْ ظُلِمُوا ۚ وَإِنَّ اللَّهَ عَلَىٰ نَصْرِهِمْ لَقَدِيرٌ","text_tajweed":"أُذِنَ لِلَّذِينَ يُقَ[n[ـٰ]تَلُونَ بِأَ[g[نّ]َهُمْ ظُلِمُو[s[اْ‌ۚ] وَإِ[g[نّ]َ [h:1986[ٱ]للَّهَ عَلَىٰ نَصْرِهِمْ لَقَد[p[ِي]رٌ","translation_en":"Permission (to fight) is given to those upon whom war is made because they are oppressed, and most surely Allah is well able to assist them;","translation_id":"Diizinkan (berperang) kepada orang-orang yang diperangi, karena sesung-guhnya mereka dizhalimi. Dan sung-guh, Allah Mahakuasa menolong mereka itu,","hasanah_per_verse":450},{"text_madani":"الَّذِينَ أُخْرِجُوا مِن دِيَارِهِم بِغَيْرِ حَقٍّ إِلَّا أَن يَقُولُوا رَبُّنَا اللَّهُ ۗ وَلَوْلَا دَفْعُ اللَّهِ النَّاسَ بَعْضَهُم بِبَعْضٍ لَّهُدِّمَتْ صَوَامِعُ وَبِيَعٌ وَصَلَوَاتٌ وَمَسَاجِدُ يُذْكَرُ فِيهَا اسْمُ اللَّهِ كَثِيرًا ۗ وَلَيَنصُرَنَّ اللَّهُ مَن يَنصُرُهُ ۗ إِنَّ اللَّهَ لَقَوِيٌّ عَزِيزٌ","text_tajweed":"ٱلَّذِينَ أُخْرِجُو[s[اْ] مِ[f:432[ن د]ِيَ[n[ـٰ]رِه[c:9033[ِم ب]ِغَيْرِ حَقٍّ إِلّ[o[َآ] أ[a:6263[َن ي]َقُولُو[s[اْ] رَبُّنَا [h:9034[ٱ]للَّهُ‌ۗ وَلَوْلَا دَفْعُ [h:1436[ٱ]للَّهِ [h:1437[ٱ][l[ل][g[نّ]َاسَ بَعْضَه[c:1438[ُم ب]ِبَعْ[u:9035[ضٍ ل]َّهُدِّمَتْ صَو[n[َٲ]مِعُ وَبِيَ[a:9036[عٌ و]َصَلَو[n[َٲ][a:9037[تٌ و]َمَسَ[n[ـٰ]جِدُ يُذْكَرُ فِيهَا [h:9038[ٱ]سْمُ [h:4364[ٱ]للَّهِ كَثِي[a:9039[رًا‌ۗ و]َلَيَ[f:9040[نص]ُرَ[g[نّ]َ [h:9041[ٱ]للَّهُ م[a:9042[َن ي]َ[f:9043[نص]ُرُهُ[o[ۥٓ‌ۗ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَقَوِىٌّ عَز[p[ِي]زٌ","translation_en":"Those who have been expelled from their homes without a just cause except that they say: Our Lord is Allah. And had there not been Allah's repelling some people by others, certainly there would have been pulled down cloisters and churches and synagogues and mosques in which Allah's name is much remembered; and surely Allah will help him who helps His cause; most surely Allah is Strong, Mighty.","translation_id":"(yaitu) orang-orang yang diusir dari kampung halamannya tanpa alasan yang benar, hanya karena mereka berkata, “Tuhan kami ialah Allah.” Seandainya Allah tidak menolak (keganasan) seba-gian manusia dengan sebagian yang lain, tentu telah dirobohkan biara-biara Nasrani, gereja-gereja, rumah-rumah ibadah orang Yahudi dan masjid-mas-jid, yang di dalamnya banyak disebut nama Allah. Allah pasti akan meno-long orang yang menolong (agama)-Nya. Sungguh, Allah Mahakuat, Ma-haperkasa.","hasanah_per_verse":1480},{"text_madani":"الَّذِينَ إِن مَّكَّنَّاهُمْ فِي الْأَرْضِ أَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ وَأَمَرُوا بِالْمَعْرُوفِ وَنَهَوْا عَنِ الْمُنكَرِ ۗ وَلِلَّهِ عَاقِبَةُ الْأُمُورِ","text_tajweed":"ٱلَّذِينَ إ[a:9044[ِن م]َّكَّ[g[نّ]َ[n[ـٰ]هُمْ فِى [h:44[ٱ]لْأَرْضِ أَقَامُو[s[اْ] [h:9045[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ وَءَاتَوُ[s[اْ] [h:1642[ٱ][l[ل]زَّكَ[s[و][n[ٲ]ةَ وَأَمَرُو[s[اْ] بِ[h:934[ٱ]لْمَعْرُوفِ وَنَهَوْ[s[اْ] عَنِ [h:2144[ٱ]لْمُ[f:2145[نك]َرِ‌ۗ وَلِلَّهِ عَ[n[ـٰ]قِبَةُ [h:9046[ٱ]لْأُم[p[ُو]رِ","translation_en":"Those who, should We establish them in the land, will keep up prayer and pay the poor-rate and enjoin good and forbid evil; and Allah's is the end of affairs.","translation_id":"(Yaitu) orang-orang yang jika Kami beri kedudukan di bumi, mereka melaksanakan shalat, menunaikan zakat, dan menyuruh berbuat yang makruf dan mencegah dari yang mungkar; dan kepada Allah-lah kembali segala urusan.","hasanah_per_verse":850},{"text_madani":"وَإِن يُكَذِّبُوكَ فَقَدْ كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ وَثَمُودُ","text_tajweed":"وَإ[a:9047[ِن ي]ُكَذِّبُوكَ فَقَ[q:563[دْ] كَذَّبَتْ قَ[q:8394[بْ]لَهُمْ قَوْمُ نُو[a:9048[حٍ و]َعَا[a:9049[دٌ و]َثَم[p[ُو][q[د]ُ","translation_en":"And if they reject you, then already before you did the people of Nuh and Ad and Samood reject (prophets).","translation_id":"Dan jika mereka (orang-orang musy-rik) mendustakan engkau (Muhammad), begitu pulalah kaum-kaum yang sebe-lum mereka, kaum Nuh, ‘Ad, dan Tsamud (juga telah mendustakan rasul-rasul-Nya),","hasanah_per_verse":360},{"text_madani":"وَقَوْمُ إِبْرَاهِيمَ وَقَوْمُ لُوطٍ","text_tajweed":"وَقَوْمُ إِ[q:1860[بْ]ر[n[َٲ]هِيمَ وَقَوْمُ ل[p[ُو][q[ط]ٍ","translation_en":"And the people of Ibrahim and the people of Lut,","translation_id":"dan (demikian juga) kaum Ibrahim dan kaum Luth,","hasanah_per_verse":180},{"text_madani":"وَأَصْحَابُ مَدْيَنَ ۖ وَكُذِّبَ مُوسَىٰ فَأَمْلَيْتُ لِلْكَافِرِينَ ثُمَّ أَخَذْتُهُمْ ۖ فَكَيْفَ كَانَ نَكِيرِ","text_tajweed":"وَأَصْحَ[n[ـٰ]بُ مَ[q:4842[دْ]يَنَ‌ۖ وَكُذِّبَ مُوسَىٰ فَأَمْلَيْتُ لِلْكَ[n[ـٰ]فِرِينَ ثُ[g[مّ]َ أَخَذْتُهُمْ‌ۖ فَكَيْفَ كَانَ نَك[p[ِي]رِ","translation_en":"As well as those of Madyan and Musa (too) was rejected, but I gave respite to the unbelievers, then did I overtake them, so how (severe) was My disapproval.","translation_id":"dan penduduk Madyan. Dan Musa (juga) telah didustakan, namun Aku beri tenggang waktu kepada orang-orang kafir, kemudian Aku siksa mereka, maka betapa hebatnya siksaan-Ku.","hasanah_per_verse":510},{"text_madani":"فَكَأَيِّن مِّن قَرْيَةٍ أَهْلَكْنَاهَا وَهِيَ ظَالِمَةٌ فَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَبِئْرٍ مُّعَطَّلَةٍ وَقَصْرٍ مَّشِيدٍ","text_tajweed":"فَكَأَيّ[a:9050[ِن م]ِّ[f:4585[ن ق]َرْيَةٍ أَهْلَكْنَ[n[ـٰ]هَا وَهِىَ ظَالِمَ[f:9051[ةٌ ف]َهِىَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَبِئْ[a:9052[رٍ م]ُّعَطَّلَ[a:9053[ةٍ و]َقَصْ[a:9054[رٍ م]َّش[p[ِي][q[د]ٍ","translation_en":"So how many a town did We destroy while it was unjust, so it was fallen down upon its roofs, and (how many a) deserted well and palace raised high.","translation_id":"Maka betapa banyak negeri yang telah Kami binasakan karena (penduduk)nya dalam keadaan zhalim, sehingga runtuh bangunan-bangunannya dan (betapa banyak pula) sumur yang telah ditinggalkan dan istana yang tinggi (ti-dak ada penghuninya).","hasanah_per_verse":610},{"text_madani":"أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَتَكُونَ لَهُمْ قُلُوبٌ يَعْقِلُونَ بِهَا أَوْ آذَانٌ يَسْمَعُونَ بِهَا ۖ فَإِنَّهَا لَا تَعْمَى الْأَبْصَارُ وَلَٰكِن تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُورِ","text_tajweed":"أَفَلَمْ يَسِيرُو[s[اْ] فِى [h:44[ٱ]لْأَرْضِ فَتَكُونَ لَهُمْ قُلُو[a:9055[بٌ ي]َعْقِلُونَ بِه[o[َآ] أَوْ ءَاذَا[a:5198[نٌ ي]َسْمَعُونَ بِهَا‌ۖ فَإِ[g[نّ]َهَا لَا تَعْمَى [h:9056[ٱ]لْأَ[q:4305[بْ]صَ[n[ـٰ]رُ وَلَ[n[ـٰ]كِ[f:9057[ن ت]َعْمَى [h:9058[ٱ]لْقُلُوبُ [h:9059[ٱ]لَّتِى فِى [h:6095[ٱ][l[ل]صُّد[p[ُو]رِ","translation_en":"Have they not travelled in the land so that they should have hearts with which to understand, or ears with which to hear? For surely it is not the eyes that are blind, but blind are the hearts which are in the breasts.","translation_id":"Maka tidak pernahkah mereka berjalan di bumi, sehingga hati (akal) mereka dapat memahami, telinga mereka dapat mendengar? Sebenarnya bukan mata itu yang buta, tetapi yang buta ialah hati yang di dalam dada.","hasanah_per_verse":970},{"text_madani":"وَيَسْتَعْجِلُونَكَ بِالْعَذَابِ وَلَن يُخْلِفَ اللَّهُ وَعْدَهُ ۚ وَإِنَّ يَوْمًا عِندَ رَبِّكَ كَأَلْفِ سَنَةٍ مِّمَّا تَعُدُّونَ","text_tajweed":"وَيَسْتَعْجِلُونَكَ بِ[h:9060[ٱ]لْعَذَابِ وَل[a:9061[َن ي]ُخْلِفَ [h:411[ٱ]للَّهُ وَعْدَهُ[n[ۥ]‌ۚ وَإِ[g[نّ]َ يَوْمًا عِ[f:264[ند]َ رَبِّكَ كَأَلْفِ سَنَ[a:9062[ةٍ م]ِّ[g[مّ]َا تَعُدّ[p[ُو]نَ","translation_en":"And they ask you to hasten on the punishment, and Allah will by no means fail in His promise, and surely a day with your Lord is as a thousand years of what you number.","translation_id":"Dan mereka meminta kepadamu (Muhammad) agar azab itu disegerakan, padahal Allah tidak akan menyalahi janji-Nya. Dan sesungguhnya sehari di sisi Tuhanmu adalah seperti seribu tahun menurut perhitunganmu.","hasanah_per_verse":600},{"text_madani":"وَكَأَيِّن مِّن قَرْيَةٍ أَمْلَيْتُ لَهَا وَهِيَ ظَالِمَةٌ ثُمَّ أَخَذْتُهَا وَإِلَيَّ الْمَصِيرُ","text_tajweed":"وَكَأَيّ[a:2298[ِن م]ِّ[f:4585[ن ق]َرْيَةٍ أَمْلَيْتُ لَهَا وَهِىَ ظَالِمَ[f:9063[ةٌ ث]ُ[g[مّ]َ أَخَذْتُهَا وَإِلَىَّ [h:9064[ٱ]لْمَص[p[ِي]رُ","translation_en":"And how many a town to which I gave respite while it was unjust, then I overtook it, and to Me is the return.","translation_id":"Dan berapa banyak negeri yang Aku tangguhkan (penghancuran)nya, karena penduduknya berbuat zhalim, kemudian Aku azab mereka, dan hanya kepada-Kulah tempat kembali (segala sesuatu).","hasanah_per_verse":450},{"text_madani":"قُلْ يَا أَيُّهَا النَّاسُ إِنَّمَا أَنَا لَكُمْ نَذِيرٌ مُّبِينٌ","text_tajweed":"قُلْ يَ[o[ـٰٓ]أَيُّهَا [h:82[ٱ][l[ل][g[نّ]َاسُ إِ[g[نّ]َم[o[َآ] أَنَا۟ لَكُمْ نَذِي[a:5164[رٌ م]ُّب[p[ِي]نٌ","translation_en":"Say: O people! I am only a plain warner to you.","translation_id":"Katakanlah (Muhammad), “Wahai manusia! Sesungguhnya aku (diutus) kepadamu sebagai pemberi peringatan yang nyata.”","hasanah_per_verse":310},{"text_madani":"فَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُم مَّغْفِرَةٌ وَرِزْقٌ كَرِيمٌ","text_tajweed":"فَ[h:9999[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ لَه[w:3412[ُم م]َّغْفِرَ[a:5445[ةٌ و]َرِزْ[f:5239[قٌ ك]َر[p[ِي]مٌ","translation_en":"Then (as for) those who believe and do good, they shall have forgiveness and an honorable sustenance.","translation_id":"Maka orang-orang yang beriman dan mengerjakan kebajikan, mereka mem-peroleh ampunan dan rezeki yang mulia.","hasanah_per_verse":410},{"text_madani":"وَالَّذِينَ سَعَوْا فِي آيَاتِنَا مُعَاجِزِينَ أُولَٰئِكَ أَصْحَابُ الْجَحِيمِ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ سَعَوْ[s[اْ] ف[o[ِىٓ] ءَايَ[n[ـٰ]تِنَا مُعَ[n[ـٰ]جِزِينَ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ أَصْحَ[n[ـٰ]بُ [h:3415[ٱ]لْجَح[p[ِي]مِ","translation_en":"And (as for) those who strive to oppose Our communications, they shall be the inmates of the flaming fire.","translation_id":"Tetapi orang-orang yang berusaha menentang ayat-ayat Kami dengan maksud melemahkan (kemauan untuk beriman), mereka itu adalah penghuni-penghuni neraka Jahim.","hasanah_per_verse":410},{"text_madani":"وَمَا أَرْسَلْنَا مِن قَبْلِكَ مِن رَّسُولٍ وَلَا نَبِيٍّ إِلَّا إِذَا تَمَنَّىٰ أَلْقَى الشَّيْطَانُ فِي أُمْنِيَّتِهِ فَيَنسَخُ اللَّهُ مَا يُلْقِي الشَّيْطَانُ ثُمَّ يُحْكِمُ اللَّهُ آيَاتِهِ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","text_tajweed":"وَم[o[َآ] أَرْسَلْنَا مِ[f:18[ن ق]َ[q:19[بْ]لِكَ م[u:2882[ِن ر]َّسُو[a:9065[لٍ و]َلَا نَبِىٍّ إِلّ[o[َآ] إِذَا تَمَ[g[نّ]َ[o[ىٰٓ] أَلْقَى [h:9066[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ ف[o[ِىٓ] أُمْنِيَّتِه[n[ِۦ] فَيَ[f:9067[نس]َخُ [h:9068[ٱ]للَّهُ مَا يُلْقِى [h:9069[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ ثُ[g[مّ]َ يُحْكِمُ [h:9070[ٱ]للَّهُ ءَايَ[n[ـٰ]تِه[n[ِۦ]‌ۗ وَ[h:72[ٱ]للَّهُ عَلِيمٌ حَك[p[ِي]مٌ","translation_en":"And We did not send before you any messenger or prophet, but when he desired, the Shaitan made a suggestion respecting his desire; but Allah annuls that which the Shaitan casts, then does Allah establish His communications, and Allah is Knowing, Wise,","translation_id":"Dan Kami tidak mengutus seorang rasul dan tidak (pula) seorang nabi sebelum engkau (Muhammad), mela-inkan apabila dia mempunyai suatu keinginan, setan pun memasukkan godaan-godaan ke dalam keinginannya itu. Tetapi Allah menghilangkan apa yang dimasukkan setan itu, dan Allah akan menguatkan ayat-ayat-Nya. Dan Allah Maha Mengetahui, Mahabijaksana,","hasanah_per_verse":1060},{"text_madani":"لِّيَجْعَلَ مَا يُلْقِي الشَّيْطَانُ فِتْنَةً لِّلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ وَالْقَاسِيَةِ قُلُوبُهُمْ ۗ وَإِنَّ الظَّالِمِينَ لَفِي شِقَاقٍ بَعِيدٍ","text_tajweed":"لِّيَ[q:2360[جْ]عَلَ مَا يُلْقِى [h:9069[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ فِتْنَ[u:9071[ةً ل]ِّلَّذِينَ فِى قُلُوبِه[w:39[ِم م]َّرَ[a:9072[ضٌ و]َ[h:9073[ٱ]لْقَاسِيَةِ قُلُوبُهُمْ‌ۗ وَإِ[g[نّ]َ [h:9074[ٱ][l[ل]ظَّ[n[ـٰ]لِمِينَ لَفِى شِقَا[i:900[قِۭ ب]َع[p[ِي][q[د]ٍ","translation_en":"So that He may make what the Shaitan casts a trial for those in whose hearts is disease and those whose hearts are hard; and most surely the unjust are in a great opposition,","translation_id":"Dia (Allah) ingin menjadikan godaan yang ditimbulkan setan itu, sebagai cobaan bagi orang-orang yang dalam hatinya ada penyakit dan orang yang berhati keras. Dan orang-orang yang zhalim itu benar-benar dalam permu-suhan yang jauh,","hasanah_per_verse":740},{"text_madani":"وَلِيَعْلَمَ الَّذِينَ أُوتُوا الْعِلْمَ أَنَّهُ الْحَقُّ مِن رَّبِّكَ فَيُؤْمِنُوا بِهِ فَتُخْبِتَ لَهُ قُلُوبُهُمْ ۗ وَإِنَّ اللَّهَ لَهَادِ الَّذِينَ آمَنُوا إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ","text_tajweed":"وَلِيَعْلَمَ [h:2400[ٱ]لَّذِينَ أُوتُو[s[اْ] [h:7379[ٱ]لْعِلْمَ أَ[g[نّ]َهُ [h:137[ٱ]لْحَقُّ م[u:770[ِن ر]َّبِّكَ فَيُؤْمِنُو[s[اْ] بِه[n[ِۦ] فَتُخْبِتَ لَهُ[n[ۥ] قُلُوبُهُمْ‌ۗ وَإِ[g[نّ]َ [h:1986[ٱ]للَّهَ لَهَادِ [h:9075[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِلَىٰ صِر[n[َٲ][a:726[طٍ م]ُّسْتَق[p[ِي]مٍ","translation_en":"And that those who have been given the knowledge may know that it is the truth from your Lord, so they may believe in it and their hearts may be lowly before it; and most surely Allah is the Guide of those who believe into a right path.","translation_id":"dan agar orang-orang yang telah dibe-ri ilmu, meyakini bahwa (Al-Qur'an) itu benar dari Tuhanmu lalu mereka beriman dan hati mereka tunduk kepadanya. Dan sungguh, Allah pemberi petunjuk bagi orang-orang yang beriman kepada jalan yang lurus.","hasanah_per_verse":890},{"text_madani":"وَلَا يَزَالُ الَّذِينَ كَفَرُوا فِي مِرْيَةٍ مِّنْهُ حَتَّىٰ تَأْتِيَهُمُ السَّاعَةُ بَغْتَةً أَوْ يَأْتِيَهُمْ عَذَابُ يَوْمٍ عَقِيمٍ","text_tajweed":"وَلَا يَزَالُ [h:6990[ٱ]لَّذِينَ كَفَرُو[s[اْ] فِى مِرْيَ[a:6279[ةٍ م]ِّنْهُ حَتَّىٰ تَأْتِيَهُمُ [h:6846[ٱ][l[ل]سَّاعَةُ بَغْتَةً أَوْ يَأْتِيَهُمْ عَذَابُ يَوْمٍ عَق[p[ِي]مٍ","translation_en":"And those who disbelieve shall not cease to be in doubt concerning it until the hour overtakes them suddenly, or there comes on them the chastisement of a destructive day.","translation_id":"Dan orang-orang kafir itu senantiasa ragu mengenai hal itu (Al-Qur'an), hingga saat (kematiannya) datang kepada mereka dengan tiba-tiba, atau azab hari Kiamat yang datang kepada mereka.","hasanah_per_verse":640},{"text_madani":"الْمُلْكُ يَوْمَئِذٍ لِّلَّهِ يَحْكُمُ بَيْنَهُمْ ۚ فَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فِي جَنَّاتِ النَّعِيمِ","text_tajweed":"ٱلْمُلْكُ يَوْمَئِ[u:9076[ذٍ ل]ِّلَّهِ يَحْكُمُ بَيْنَهُمْ‌ۚ فَ[h:2514[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَعَمِلُو[s[اْ] [h:118[ٱ][l[ل]صَّ[n[ـٰ]لِحَ[n[ـٰ]تِ فِى جَ[g[نّ]َ[n[ـٰ]تِ [h:3680[ٱ][l[ل][g[نّ]َع[p[ِي]مِ","translation_en":"The kingdom on that day shall be Allah's; He will judge between them; so those who believe and do good will be in gardens of bliss.","translation_id":"Kekuasaan pada hari itu ada pada Allah, Dia memberi keputusan di an-tara mereka. Maka orang-orang yang beriman dan mengerjakan kebajikan berada dalam surga-surga yang penuh kenikmatan.","hasanah_per_verse":590},{"text_madani":"وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا فَأُولَٰئِكَ لَهُمْ عَذَابٌ مُّهِينٌ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ كَفَرُو[s[اْ] وَكَذَّبُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِنَا فَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ لَهُمْ عَذَا[a:478[بٌ م]ُّه[p[ِي]نٌ","translation_en":"And (as for) those who disbelieve in and reject Our communications, these it is who shall have a disgraceful chastisement.","translation_id":"Dan orang-orang kafir dan yang men-dustakan ayat-ayat Kami, maka mere-ka akan merasakan azab yang meng-hinakan.","hasanah_per_verse":410},{"text_madani":"وَالَّذِينَ هَاجَرُوا فِي سَبِيلِ اللَّهِ ثُمَّ قُتِلُوا أَوْ مَاتُوا لَيَرْزُقَنَّهُمُ اللَّهُ رِزْقًا حَسَنًا ۚ وَإِنَّ اللَّهَ لَهُوَ خَيْرُ الرَّازِقِينَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ هَاجَرُو[s[اْ] فِى سَبِيلِ [h:788[ٱ]للَّهِ ثُ[g[مّ]َ قُتِل[o[ُوٓ][s[اْ] أَوْ مَاتُو[s[اْ] لَيَرْزُقَ[g[نّ]َهُمُ [h:9077[ٱ]للَّهُ رِزْقًا حَسَ[a:9078[نًا‌ۚ و]َإِ[g[نّ]َ [h:1986[ٱ]للَّهَ لَهُوَ خَيْرُ [h:3894[ٱ][l[ل]رّ[n[َٲ]زِق[p[ِي]نَ","translation_en":"And (as for) those who fly in Allah's way and are then slain or die, Allah will most certainly grant them a goodly sustenance, and most surely Allah is the best Giver of sustenance.","translation_id":"Dan orang-orang yang berhijrah di ja-lan Allah, kemudian mereka terbunuh atau mati, sungguh, Allah akan mem-berikan kepada mereka rezeki yang baik (surga). Dan sesungguhnya Allah adalah pemberi rezeki yang terbaik.","hasanah_per_verse":770},{"text_madani":"لَيُدْخِلَنَّهُم مُّدْخَلًا يَرْضَوْنَهُ ۗ وَإِنَّ اللَّهَ لَعَلِيمٌ حَلِيمٌ","text_tajweed":"لَيُ[q:9079[دْ]خِلَ[g[نّ]َه[w:9080[ُم م]ُّ[q:2743[دْ]خَل[a:9081[اً ي]َرْضَوْنَهُ[n[ۥ]‌ۗ وَإِ[g[نّ]َ [h:1986[ٱ]للَّهَ لَعَلِيمٌ حَل[p[ِي]مٌ","translation_en":"He will certainly cause them to enter a place of entrance which they shall be well pleased with, and most surely Allah is Knowing, Forbearing.","translation_id":"Sungguh, Dia (Allah) pasti akan memasukkan mereka ke tempat masuk (surga) yang mereka sukai. Dan sesungguhnya Allah Maha Mengetahui, Maha Penyantun.","hasanah_per_verse":350},{"text_madani":"ذَٰلِكَ وَمَنْ عَاقَبَ بِمِثْلِ مَا عُوقِبَ بِهِ ثُمَّ بُغِيَ عَلَيْهِ لَيَنصُرَنَّهُ اللَّهُ ۗ إِنَّ اللَّهَ لَعَفُوٌّ غَفُورٌ","text_tajweed":"۞ ذ[n[َٲ]لِكَ وَمَنْ عَاقَبَ بِمِثْلِ مَا عُوقِبَ بِه[n[ِۦ] ثُ[g[مّ]َ بُغِىَ عَلَيْهِ لَيَ[f:9082[نص]ُرَ[g[نّ]َهُ [h:9083[ٱ]للَّهُ‌ۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَعَفُوٌّ غَف[p[ُو]رٌ","translation_en":"That (shall be so); and he who retaliates with the like of that with which he has been afflicted and he has been oppressed, Allah will most certainly aid him; most surely Allah is Pardoning, Forgiving.","translation_id":"Demikianlah, dan barangsiapa mem-balas seimbang dengan (kezhaliman) penganiayaan yang pernah dia derita kemudian dia dizhalimi (lagi), pasti Allah akan menolongnya. Sungguh, Allah Maha Pemaaf, Maha Pengam-pun.","hasanah_per_verse":560},{"text_madani":"ذَٰلِكَ بِأَنَّ اللَّهَ يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ وَأَنَّ اللَّهَ سَمِيعٌ بَصِيرٌ","text_tajweed":"ذ[n[َٲ]لِكَ بِأَ[g[نّ]َ [h:897[ٱ]للَّهَ يُولِجُ [h:9084[ٱ]لَّيْلَ فِى [h:1829[ٱ][l[ل][g[نّ]َهَارِ وَيُولِجُ [h:9085[ٱ][l[ل][g[نّ]َهَارَ فِى [h:1831[ٱ]لَّيْلِ وَأَ[g[نّ]َ [h:859[ٱ]للَّهَ سَمِي[i:9086[عُۢ ب]َص[p[ِي]رٌ","translation_en":"That is because Allah causes the night to enter into the day and causes the day to enter into the night, and because Allah is Hearing, Seeing.","translation_id":"Demikianlah karena Allah (kuasa) memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam dan sungguh, Allah Maha Mendengar, Maha Melihat.","hasanah_per_verse":600},{"text_madani":"ذَٰلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّ مَا يَدْعُونَ مِن دُونِهِ هُوَ الْبَاطِلُ وَأَنَّ اللَّهَ هُوَ الْعَلِيُّ الْكَبِيرُ","text_tajweed":"ذ[n[َٲ]لِكَ بِأَ[g[نّ]َ [h:897[ٱ]للَّهَ هُوَ [h:8923[ٱ]لْحَقُّ وَأَ[g[نّ]َ مَا يَ[q:1240[دْ]عُونَ مِ[f:3136[ن د]ُونِه[n[ِۦ] هُوَ [h:9087[ٱ]لْبَ[n[ـٰ]طِلُ وَأَ[g[نّ]َ [h:859[ٱ]للَّهَ هُوَ [h:9088[ٱ]لْعَلِىُّ [h:9089[ٱ]لْكَب[p[ِي]رُ","translation_en":"That is because Allah is the Truth, and that what they call upon besides Him-- that is the falsehood, and because Allah is the High, the Great.","translation_id":"Demikianlah (kebesaran Allah) karena Allah, Dialah (Tuhan) Yang Hak. Dan apa saja yang mereka seru selain Dia, itulah yang batil, dan sungguh Allah, Dialah Yang Mahatinggi, Mahabesar.","hasanah_per_verse":600},{"text_madani":"أَلَمْ تَرَ أَنَّ اللَّهَ أَنزَلَ مِنَ السَّمَاءِ مَاءً فَتُصْبِحُ الْأَرْضُ مُخْضَرَّةً ۗ إِنَّ اللَّهَ لَطِيفٌ خَبِيرٌ","text_tajweed":"أَلَمْ تَرَ أَ[g[نّ]َ [h:394[ٱ]للَّهَ أَ[f:471[نز]َلَ مِنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ م[o[َا]ٓ[f:9090[ءً ف]َتُصْبِحُ [h:9091[ٱ]لْأَرْضُ مُخْضَرَّةً‌ۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَطِيفٌ خَب[p[ِي]رٌ","translation_en":"Do you not see that Allah sends down water from the cloud so the earth becomes green? Surely Allah is Benignant, Aware.","translation_id":"Tidakkah engkau memperhatikan, bahwa Allah menurunkan air (hujan) dari langit, sehingga bumi menjadi hi-jau? Sungguh, Allah Mahahalus, Maha Mengetahui.","hasanah_per_verse":550},{"text_madani":"لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَإِنَّ اللَّهَ لَهُوَ الْغَنِيُّ الْحَمِيدُ","text_tajweed":"لَّهُ[n[ۥ] مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَا فِى [h:44[ٱ]لْأَرْضِ‌ۗ وَإِ[g[نّ]َ [h:1986[ٱ]للَّهَ لَهُوَ [h:9092[ٱ]لْغَنِىُّ [h:9093[ٱ]لْحَم[p[ِي][q[د]ُ","translation_en":"His is whatsoever is in the heavens and whatsoever is in the earth; and most surely Allah is the Self-sufficient, the Praised.","translation_id":"Milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Dan Allah benar-benar Mahakaya, Maha Terpuji.","hasanah_per_verse":450},{"text_madani":"أَلَمْ تَرَ أَنَّ اللَّهَ سَخَّرَ لَكُم مَّا فِي الْأَرْضِ وَالْفُلْكَ تَجْرِي فِي الْبَحْرِ بِأَمْرِهِ وَيُمْسِكُ السَّمَاءَ أَن تَقَعَ عَلَى الْأَرْضِ إِلَّا بِإِذْنِهِ ۗ إِنَّ اللَّهَ بِالنَّاسِ لَرَءُوفٌ رَّحِيمٌ","text_tajweed":"أَلَمْ تَرَ أَ[g[نّ]َ [h:394[ٱ]للَّهَ سَخَّرَ لَك[w:154[ُم م]َّا فِى [h:44[ٱ]لْأَرْضِ وَ[h:9094[ٱ]لْفُلْكَ تَ[q:120[جْ]رِى فِى [h:837[ٱ]لْبَحْرِ بِأَمْرِه[n[ِۦ] وَيُمْسِكُ [h:9095[ٱ][l[ل]سَّم[o[َا]ٓءَ أَ[f:9096[ن ت]َقَعَ عَلَى [h:7958[ٱ]لْأَرْضِ إِلَّا بِإِذْنِه[o[ِۦٓ‌ۗ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ بِ[h:743[ٱ][l[ل][g[نّ]َاسِ لَرَءُو[u:744[فٌ ر]َّح[p[ِي]مٌ","translation_en":"Do you not see that Allah has made subservient to you whatsoever is in the earth and the ships running in the sea by His command? And He withholds the heaven from falling on the earth except with His permission; most surely Allah is Compassionate, Merciful to men.","translation_id":"Tidakkah engkau memperhatikan bahwa Allah menundukkan bagimu (ma-nusia) apa yang ada di bumi dan kapal yang berlayar di lautan dengan perin-tah-Nya. Dan Dia menahan (benda-benda) langit agar tidak jatuh ke bumi, melainkan dengan izin-Nya? Sungguh, Allah Maha Pengasih, Maha Penya-yang kepada manusia.","hasanah_per_verse":1010},{"text_madani":"وَهُوَ الَّذِي أَحْيَاكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ۗ إِنَّ الْإِنسَانَ لَكَفُورٌ","text_tajweed":"وَهُوَ [h:4114[ٱ]لَّذ[o[ِىٓ] أَحْيَاكُمْ ثُ[g[مّ]َ يُمِيتُكُمْ ثُ[g[مّ]َ يُحْيِيكُمْ‌ۗ إِ[g[نّ]َ [h:7137[ٱ]لْإِ[f:5969[نس]َ[n[ـٰ]نَ لَكَف[p[ُو]رٌ","translation_en":"And He it is Who has brought you to life, then He will cause you to die, then bring you to life (again); most surely man is ungrateful.","translation_id":"Dan Dialah yang menghidupkan kamu, kemudian mematikan kamu, kemudian menghidupkan kamu kembali (pada hari kebangkitan). Sungguh, manusia itu sangat kufur nikmat.","hasanah_per_verse":430},{"text_madani":"لِّكُلِّ أُمَّةٍ جَعَلْنَا مَنسَكًا هُمْ نَاسِكُوهُ ۖ فَلَا يُنَازِعُنَّكَ فِي الْأَمْرِ ۚ وَادْعُ إِلَىٰ رَبِّكَ ۖ إِنَّكَ لَعَلَىٰ هُدًى مُّسْتَقِيمٍ","text_tajweed":"لِّكُلِّ أُ[g[مّ]َ[f:9013[ةٍ ج]َعَلْنَا مَ[f:9014[نس]َكًا هُمْ نَاسِكُوهُ‌ۖ فَلَا يُنَ[n[ـٰ]زِعُ[g[نّ]َكَ فِى [h:2319[ٱ]لْأَمْرِ‌ۚ وَ[h:9097[ٱ][q:9097[دْ]عُ إِلَىٰ رَبِّكَ‌ۖ إِ[g[نّ]َكَ لَعَلَىٰ هُ[a:9098[دًى م]ُّسْتَق[p[ِي]مٍ","translation_en":"To every nation We appointed acts of devotion which they observe, therefore they should not dispute with you about the matter and call to your Lord; most surely you are on a right way.","translation_id":"Bagi setiap umat telah Kami tetapkan syariat tertentu yang (harus) mereka amalkan, maka tidak sepantasnya mereka berbantahan dengan engkau da-lam urusan (syariat) ini dan serulah (mereka) kepada Tuhanmu. Sungguh, engkau (Muhammad) berada di jalan yang lurus.","hasanah_per_verse":670},{"text_madani":"وَإِن جَادَلُوكَ فَقُلِ اللَّهُ أَعْلَمُ بِمَا تَعْمَلُونَ","text_tajweed":"وَإِ[f:9099[ن ج]َ[n[ـٰ]دَلُوكَ فَقُلِ [h:9100[ٱ]للَّهُ أَعْلَمُ بِمَا تَعْمَل[p[ُو]نَ","translation_en":"And if they contend with you, say: Allah best knows what you do.","translation_id":"Dan jika mereka membantah engkau, maka katakanlah, “Allah lebih tahu tentang apa yang kamu kerjakan.”","hasanah_per_verse":290},{"text_madani":"اللَّهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ الْقِيَامَةِ فِيمَا كُنتُمْ فِيهِ تَخْتَلِفُونَ","text_tajweed":"ٱللَّهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ فِيمَا كُ[f:100[نت]ُمْ فِيهِ تَخْتَلِف[p[ُو]نَ","translation_en":"Allah will judge between you on the day of resurrection respecting that in which you differ.","translation_id":"Allah akan mengadili di antara kamu pada hari Kiamat tentang apa yang dahulu kamu memperselisihkannya.","hasanah_per_verse":410},{"text_madani":"أَلَمْ تَعْلَمْ أَنَّ اللَّهَ يَعْلَمُ مَا فِي السَّمَاءِ وَالْأَرْضِ ۗ إِنَّ ذَٰلِكَ فِي كِتَابٍ ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ","text_tajweed":"أَلَمْ تَعْلَمْ أَ[g[نّ]َ [h:394[ٱ]للَّهَ يَعْلَمُ مَا فِى [h:746[ٱ][l[ل]سَّم[o[َا]ٓءِ وَ[h:177[ٱ]لْأَرْضِ‌ۗ إِ[g[نّ]َ ذ[n[َٲ]لِكَ فِى كِتَ[n[ـٰ]بٍ‌ۚ إِ[g[نّ]َ ذ[n[َٲ]لِكَ عَلَى [h:412[ٱ]للَّهِ يَس[p[ِي]رٌ","translation_en":"Do you not know that Allah knows what is in the heaven and the earth? Surely this is in a book; surely this is easy to Allah.","translation_id":"Tidakkah engkau tahu bahwa Allah mengetahui apa yang di langit dan di bumi? Sungguh, yang demikian itu su-dah terdapat dalam sebuah Kitab (Lauh Mahfuzh). Sesungguhnya yang demiki-an itu sangat mudah bagi Allah.","hasanah_per_verse":600},{"text_madani":"وَيَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَمْ يُنَزِّلْ بِهِ سُلْطَانًا وَمَا لَيْسَ لَهُم بِهِ عِلْمٌ ۗ وَمَا لِلظَّالِمِينَ مِن نَّصِيرٍ","text_tajweed":"وَيَعْبُدُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ مَا لَمْ يُنَزِّلْ بِه[n[ِۦ] سُلْطَ[n[ـٰ][a:9101[نًا و]َمَا لَيْسَ لَه[c:3276[ُم ب]ِه[n[ِۦ] عِلْ[a:9102[مٌ‌ۗ و]َمَا لِلظَّ[n[ـٰ]لِمِينَ م[a:9103[ِن ن]َّص[p[ِي]رٍ","translation_en":"And they serve besides Allah that for which He has not sent any authority, and that of which they have no knowledge; and for the unjust there shall be no helper.","translation_id":"Dan mereka menyembah selain Allah, tanpa dasar yang jelas tentang itu, dan mereka tidak mempunyai pengetahuan (pula) tentang itu. Bagi orang-orang yang zhalim tidak ada seorang penolong pun.","hasanah_per_verse":630},{"text_madani":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ تَعْرِفُ فِي وُجُوهِ الَّذِينَ كَفَرُوا الْمُنكَرَ ۖ يَكَادُونَ يَسْطُونَ بِالَّذِينَ يَتْلُونَ عَلَيْهِمْ آيَاتِنَا ۗ قُلْ أَفَأُنَبِّئُكُم بِشَرٍّ مِّن ذَٰلِكُمُ ۗ النَّارُ وَعَدَهَا اللَّهُ الَّذِينَ كَفَرُوا ۖ وَبِئْسَ الْمَصِيرُ","text_tajweed":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ ءَايَ[n[ـٰ]تُنَا بَيِّنَ[n[ـٰ][f:9104[تٍ ت]َعْرِفُ فِى وُجُوهِ [h:9105[ٱ]لَّذِينَ كَفَرُو[s[اْ] [h:9106[ٱ]لْمُ[f:9107[نك]َرَ‌ۖ يَكَادُونَ يَسْطُونَ بِ[h:2413[ٱ]لَّذِينَ يَتْلُونَ عَلَيْهِمْ ءَايَ[n[ـٰ]تِنَا‌ۗ قُلْ أَفَأُنَبِّئُك[c:9108[ُم ب]ِشَ[a:3654[رٍّ م]ِّ[f:9109[ن ذ][n[َٲ]لِكُمُ‌ۗ [h:9110[ٱ][l[ل][g[نّ]َارُ وَعَدَهَا [h:9111[ٱ]للَّهُ [h:1171[ٱ]لَّذِينَ كَفَرُو[s[اْ‌ۖ] وَبِئْسَ [h:665[ٱ]لْمَص[p[ِي]رُ","translation_en":"And when Our clear communications are recited to them you will find denial on the faces of those who disbelieve; they almost spring upon those who recite to them Our communications. Say: Shall I inform you of what is worse than this? The fire; Allah has promised it to those who disbelieve; and how evil the resort!","translation_id":"Dan apabila dibacakan di hadapan mereka ayat-ayat Kami yang terang, niscaya engkau akan melihat (tanda-tanda) keingkaran pada wajah orang-orang yang kafir itu. Hampir-hampir mereka menyerang orang-orang yang membacakan ayat-ayat Kami kepada mereka. Katakanlah (Muhammad), “Apakah akan aku kabarkan kepada-mu (mengenai sesuatu) yang lebih buruk dari itu, (yaitu) neraka?” Allah telah mengancamkannya (neraka) kepada orang-orang kafir. Dan (neraka itu) seburuk-buruk tempat kembali.","hasanah_per_verse":1360},{"text_madani":"يَا أَيُّهَا النَّاسُ ضُرِبَ مَثَلٌ فَاسْتَمِعُوا لَهُ ۚ إِنَّ الَّذِينَ تَدْعُونَ مِن دُونِ اللَّهِ لَن يَخْلُقُوا ذُبَابًا وَلَوِ اجْتَمَعُوا لَهُ ۖ وَإِن يَسْلُبْهُمُ الذُّبَابُ شَيْئًا لَّا يَسْتَنقِذُوهُ مِنْهُ ۚ ضَعُفَ الطَّالِبُ وَالْمَطْلُوبُ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:82[ٱ][l[ل][g[نّ]َاسُ ضُرِبَ مَثَ[f:9112[لٌ ف]َ[h:5220[ٱ]سْتَمِعُو[s[اْ] لَهُ[o[ۥٓ‌ۚ] إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ تَ[q:4040[دْ]عُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ ل[a:9113[َن ي]َخْلُقُو[s[اْ] ذُبَا[a:9114[بًا و]َلَوِ [h:9115[ٱ][q:9116[جْ]تَمَعُو[s[اْ] لَهُ[n[ۥ]‌ۖ وَإ[a:9117[ِن ي]َسْلُ[q:9118[بْ]هُمُ [h:9119[ٱ][l[ل]ذُّبَابُ شَيْـ[u:9120[ـًٔا ل]َّا يَسْتَ[f:9121[نق]ِذُوهُ مِنْهُ‌ۚ ضَعُفَ [h:9122[ٱ][l[ل]طَّالِبُ وَ[h:9123[ٱ]لْمَ[q:9123[طْ]ل[p[ُو][q[ب]ُ","translation_en":"O people! a parable is set forth, therefore listen to it: surely those whom you call upon besides Allah cannot create fly, though they should all gather for it, and should the fly snatch away anything from them, they could not take it back from i weak are the invoker and the invoked.","translation_id":"Wahai manusia! Telah dibuat suatu perumpamaan. Maka dengarkanlah! Sesungguhnya segala yang kamu seru selain Allah tidak dapat menciptakan seekor lalat pun, walaupun mereka bersatu untuk menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, mereka tidak akan dapat merebutnya kembali dari lalat itu. Sama lemahnya yang menyembah dan yang disembah.","hasanah_per_verse":1220},{"text_madani":"مَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ ۗ إِنَّ اللَّهَ لَقَوِيٌّ عَزِيزٌ","text_tajweed":"مَا قَدَرُو[s[اْ] [h:4225[ٱ]للَّهَ حَقَّ قَ[q:4226[دْ]رِه[o[ِۦٓ‌ۗ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَقَوِىٌّ عَز[p[ِي]زٌ","translation_en":"They have not estimated Allah with the estimation that i due to Him; most surely Allah is Strong, Mighty.","translation_id":"Mereka tidak mengagungkan Allah dengan sebenar-benarnya. Sungguh, Allah Mahakuat, Mahaperkasa.","hasanah_per_verse":310},{"text_madani":"اللَّهُ يَصْطَفِي مِنَ الْمَلَائِكَةِ رُسُلًا وَمِنَ النَّاسِ ۚ إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ","text_tajweed":"ٱللَّهُ يَصْطَفِى مِنَ [h:2217[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةِ رُسُل[a:9124[اً و]َمِنَ [h:30[ٱ][l[ل][g[نّ]َاسِ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ سَمِي[i:9086[عُۢ ب]َص[p[ِي]رٌ","translation_en":"Allah chooses messengers from among the angels and from among the men; surely Allah is Hearing, Seeing.","translation_id":"Allah memilih para utusan(-Nya) dari malaikat dan dari manusia. Sesung-guhnya Allah Maha Mendengar, Maha Melihat.","hasanah_per_verse":450},{"text_madani":"يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۗ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ","text_tajweed":"يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ‌ۗ وَإِلَى [h:1148[ٱ]للَّهِ تُرْجَعُ [h:1149[ٱ]لْأُم[p[ُو]رُ","translation_en":"He knows what is before them and what is behind them and to Allah are all affairs turned back.","translation_id":"Dia (Allah) mengetahui apa yang di hadapan mereka dan apa yang di belakang mereka. Dan hanya kepada Allah dikembalikan segala urusan.","hasanah_per_verse":410},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا ارْكَعُوا وَاسْجُدُوا وَاعْبُدُوا رَبَّكُمْ وَافْعَلُوا الْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَنُو[s[اْ] [h:9125[ٱ]رْكَعُو[s[اْ] وَ[h:9126[ٱ]سْجُدُو[s[اْ] وَ[h:9127[ٱ]عْبُدُو[s[اْ] رَبَّكُمْ وَ[h:9128[ٱ]فْعَلُو[s[اْ] [h:9129[ٱ]لْخَيْرَ لَعَلَّكُمْ تُفْلِحُ[p[و]نَ ۩","translation_en":"O you who believe! bow down and prostrate yourselves and serve your Lord, and do good that you may succeed.","translation_id":"Wahai orang-orang yang beriman! Rukuklah, sujudlah, dan sembahlah Tuhanmu; dan berbuatlah kebaikan, agar kamu beruntung.","hasanah_per_verse":630},{"text_madani":"وَجَاهِدُوا فِي اللَّهِ حَقَّ جِهَادِهِ ۚ هُوَ اجْتَبَاكُمْ وَمَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ ۚ مِّلَّةَ أَبِيكُمْ إِبْرَاهِيمَ ۚ هُوَ سَمَّاكُمُ الْمُسْلِمِينَ مِن قَبْلُ وَفِي هَٰذَا لِيَكُونَ الرَّسُولُ شَهِيدًا عَلَيْكُمْ وَتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ ۚ فَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَاعْتَصِمُوا بِاللَّهِ هُوَ مَوْلَاكُمْ ۖ فَنِعْمَ الْمَوْلَىٰ وَنِعْمَ النَّصِيرُ","text_tajweed":"وَجَ[n[ـٰ]هِدُو[s[اْ] فِى [h:714[ٱ]للَّهِ حَقَّ جِهَادِه[n[ِۦ]‌ۚ هُوَ [h:9130[ٱ][q:9131[جْ]تَبَ[n[ـٰ]كُمْ وَمَا جَعَلَ عَلَيْكُمْ فِى [h:1477[ٱ][l[ل]دِّينِ مِنْ حَرَ[a:9132[جٍ‌ۚ م]ِّلَّةَ أَبِيكُمْ إِ[q:1860[بْ]ر[n[َٲ]هِيمَ‌ۚ هُوَ سَ[g[مّ]َ[n[ـٰ]كُمُ [h:9133[ٱ]لْمُسْلِمِينَ مِ[f:128[ن ق]َ[q:129[بْ]لُ وَفِى هَ[n[ـٰ]ذَا لِيَكُونَ [h:9134[ٱ][l[ل]رَّسُولُ شَهِيدًا عَلَيْكُمْ وَتَكُونُو[s[اْ] شُهَد[o[َا]ٓءَ عَلَى [h:729[ٱ][l[ل][g[نّ]َاسِ‌ۚ فَأَقِيمُو[s[اْ] [h:3095[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ وَءَاتُو[s[اْ] [h:215[ٱ][l[ل]زَّكَ[s[و][n[ٲ]ةَ وَ[h:9135[ٱ]عْتَصِمُو[s[اْ] بِ[h:32[ٱ]للَّهِ هُوَ مَوْلَ[n[ـٰ]كُمْ‌ۖ فَنِعْمَ [h:9136[ٱ]لْمَوْلَىٰ وَنِعْمَ [h:5337[ٱ][l[ل][g[نّ]َص[p[ِي]رُ","translation_en":"And strive hard in (the way of) Allah, (such) a striving a is due to Him; He has chosen you and has not laid upon you an hardship in religion; the faith of your father Ibrahim; He named you Muslims before and in this, that the Messenger may be a bearer of witness to you, and you may be bearers of witness to the people; therefore keep up prayer and pay the poor-rate and hold fast by Allah; He is your Guardian; how excellent the Guardian and how excellent the Helper!","translation_id":"Dan berjihadlah kamu di jalan Allah dengan jihad yang sebenar-benarnya. Dia telah memilih kamu, dan Dia tidak menjadikan kesukaran untukmu dalam agama. (Ikutilah) agama nenek mo-yangmu Ibrahim. Dia (Allah) telah menamakan kamu orang-orang muslim sejak dahulu, dan (begitu pula) dalam (Al-Qur'an) ini, agar Rasul (Mu-hammad) itu menjadi saksi atas dirimu dan agar kamu semua menjadi saksi atas segenap manusia. Maka laksanakanlah shalat; tunaikanlah zakat, dan berpegangteguhlah kepada Allah. Dialah Pelindungmu; Dia sebaik-baik pe-lindung dan sebaik-baik penolong.","hasanah_per_verse":1990}]}
