{"chapter_number":39,"name_simple":"Az-Zumar","name_meaning":{"text":"The Troops","en":"The Troops","id":"Para Rombongan"},"verses_count":75,"hasanah":48690,"verses":[{"text_madani":"تَنزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ","text_tajweed":"تَ[f:10623[نز]ِيلُ [h:10624[ٱ]لْكِتَ[n[ـٰ]بِ مِنَ [h:321[ٱ]للَّهِ [h:11613[ٱ]لْعَزِيزِ [h:2229[ٱ]لْحَك[p[ِي]مِ","translation_en":"The revelation of the Book is from Allah, the Mighty, the Wise.","translation_id":"Kitab (Al-Qur'an) ini diturunkan oleh Allah Yang Mahamulia, Mahabijaksana.","hasanah_per_verse":290},{"text_madani":"إِنَّا أَنزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ فَاعْبُدِ اللَّهَ مُخْلِصًا لَّهُ الدِّينَ","text_tajweed":"إِ[g[نّ][o[َآ] أَ[f:515[نز]َلْن[o[َآ] إِلَيْكَ [h:3102[ٱ]لْكِتَ[n[ـٰ]بَ بِ[h:370[ٱ]لْحَقِّ فَ[h:11614[ٱ]عْبُدِ [h:11615[ٱ]للَّهَ مُخْلِ[u:11616[صًا ل]َّهُ [h:4649[ٱ][l[ل]دّ[p[ِي]نَ","translation_en":"Surely We have revealed to you the Book with the truth, therefore serve Allah, being sincere to Him in obedience.","translation_id":"Sesungguhnya Kami menurunkan Kitab (Al-Qur'an) kepadamu (Muhammad) dengan (membawa) kebenaran. Maka sembahlah Allah dengan tulus ikhlas beragama kepada-Nya.","hasanah_per_verse":450},{"text_madani":"أَلَا لِلَّهِ الدِّينُ الْخَالِصُ ۚ وَالَّذِينَ اتَّخَذُوا مِن دُونِهِ أَوْلِيَاءَ مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَىٰ إِنَّ اللَّهَ يَحْكُمُ بَيْنَهُمْ فِي مَا هُمْ فِيهِ يَخْتَلِفُونَ ۗ إِنَّ اللَّهَ لَا يَهْدِي مَنْ هُوَ كَاذِبٌ كَفَّارٌ","text_tajweed":"أَلَا لِلَّهِ [h:11617[ٱ][l[ل]دِّينُ [h:11618[ٱ]لْخَالِصُ‌ۚ وَ[h:37[ٱ]لَّذِينَ [h:5828[ٱ]تَّخَذُو[s[اْ] مِ[f:3136[ن د]ُونِه[o[ِۦٓ] أَوْلِي[o[َا]ٓءَ مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُون[o[َآ] إِلَى [h:1637[ٱ]للَّهِ زُلْفَ[o[ىٰٓ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ يَحْكُمُ بَيْنَهُمْ فِى مَا هُمْ فِيهِ يَخْتَلِفُونَ‌ۗ إِ[g[نّ]َ [h:80[ٱ]للَّهَ لَا يَهْدِى مَنْ هُوَ كَ[n[ـٰ]ذِ[f:11619[بٌ ك]َفّ[p[َا]رٌ","translation_en":"Now, surely, sincere obedience is due to Allah (alone) and (as for) those who take guardians besides Him, (saying), We do not serve them save that they may make us nearer to Allah, surely Allah will judge between them in that in which they differ; surely Allah does not guide him aright who is a liar, ungrateful.","translation_id":"Ingatlah! Hanya milik Allah agama yang murni (dari syirik). Dan orang-orang yang mengambil pelindung selain Dia (berkata), “Kami tidak menyembah mereka melainkan (berharap) agar mereka mendekatkan kami kepada Allah dengan sedekat-dekatnya.” Sungguh, Allah akan memberi putusan di antara mereka tentang apa yang mereka perselisihkan. Sungguh, Allah tidak memberi petunjuk kepada pendusta dan orang yang sangat ingkar.","hasanah_per_verse":1260},{"text_madani":"لَّوْ أَرَادَ اللَّهُ أَن يَتَّخِذَ وَلَدًا لَّاصْطَفَىٰ مِمَّا يَخْلُقُ مَا يَشَاءُ ۚ سُبْحَانَهُ ۖ هُوَ اللَّهُ الْوَاحِدُ الْقَهَّارُ","text_tajweed":"لَّوْ أَرَادَ [h:139[ٱ]للَّهُ أ[a:8331[َن ي]َتَّخِذَ وَلَ[u:11620[دًا ل]َّ[h:11621[ٱ]صْطَفَىٰ مِ[g[مّ]َا يَخْلُقُ مَا يَش[o[َا]ٓءُ‌ۚ سُ[q:608[بْ]حَ[n[ـٰ]نَهُ[n[ۥ]‌ۖ هُوَ [h:8078[ٱ]للَّهُ [h:11597[ٱ]لْو[n[َٲ]حِدُ [h:6662[ٱ]لْقَهّ[p[َا]رُ","translation_en":"If Allah desire to take a son to Himself, He will surely choose those He pleases from what He has created. Glory be to Him: He is Allah, the One, the Subduer (of all).","translation_id":"Sekiranya Allah hendak mengambil anak, tentu Dia akan memilih apa yang Dia kehendaki dari apa yang telah diciptakan-Nya. Mahasuci Dia. Dialah Allah Yang Maha Esa, Mahaperkasa.","hasanah_per_verse":630},{"text_madani":"خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۖ يُكَوِّرُ اللَّيْلَ عَلَى النَّهَارِ وَيُكَوِّرُ النَّهَارَ عَلَى اللَّيْلِ ۖ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ۖ كُلٌّ يَجْرِي لِأَجَلٍ مُّسَمًّى ۗ أَلَا هُوَ الْعَزِيزُ الْغَفَّارُ","text_tajweed":"خَلَقَ [h:3913[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ بِ[h:370[ٱ]لْحَقِّ‌ۖ يُكَوِّرُ [h:11622[ٱ]لَّيْلَ عَلَى [h:11623[ٱ][l[ل][g[نّ]َهَارِ وَيُكَوِّرُ [h:11624[ٱ][l[ل][g[نّ]َهَارَ عَلَى [h:11625[ٱ]لَّيْلِ‌ۖ وَسَخَّرَ [h:6864[ٱ][l[ل]شَّمْسَ وَ[h:4265[ٱ]لْقَمَرَ‌ۖ كُ[a:6865[لٌّ ي]َ[q:6866[جْ]رِى لِأَجَ[a:6867[لٍ م]ُّسَ[g[مّ]ًى‌ۗ أَلَا هُوَ [h:1734[ٱ]لْعَزِيزُ [h:11599[ٱ]لْغَفَّ[p[ـٰ]رُ","translation_en":"He has created the heavens and the earth with the truth; He makes the night cover the day and makes the day overtake the night, and He has made the sun and the moon subservient; each one runs on to an assigned term; now surely He is the Mighty, the great Forgiver.","translation_id":"Dia menciptakan langit dan bumi dengan (tujuan) yang benar; Dia memasukkan malam atas siang dan memasukkan siang atas malam dan menundukkan matahari dan bulan, masing-masing berjalan menurut waktu yang ditentukan. Ingatlah! Dialah Yang Mahamulia, Maha Pengampun.","hasanah_per_verse":1050},{"text_madani":"خَلَقَكُم مِّن نَّفْسٍ وَاحِدَةٍ ثُمَّ جَعَلَ مِنْهَا زَوْجَهَا وَأَنزَلَ لَكُم مِّنَ الْأَنْعَامِ ثَمَانِيَةَ أَزْوَاجٍ ۚ يَخْلُقُكُمْ فِي بُطُونِ أُمَّهَاتِكُمْ خَلْقًا مِّن بَعْدِ خَلْقٍ فِي ظُلُمَاتٍ ثَلَاثٍ ۚ ذَٰلِكُمُ اللَّهُ رَبُّكُمْ لَهُ الْمُلْكُ ۖ لَا إِلَٰهَ إِلَّا هُوَ ۖ فَأَنَّىٰ تُصْرَفُونَ","text_tajweed":"خَلَقَك[w:2530[ُم م]ّ[a:2531[ِن ن]َّفْ[a:2532[سٍ و][n[َٲ]حِدَ[f:11626[ةٍ ث]ُ[g[مّ]َ جَعَلَ مِنْهَا زَوْجَهَا وَأَ[f:91[نز]َلَ لَك[w:1578[ُم م]ِّنَ [h:11627[ٱ]لْأَنْعَ[n[ـٰ]مِ ثَمَ[n[ـٰ]نِيَةَ أَزْو[n[َٲ][a:11628[جٍ‌ۚ ي]َخْلُقُكُمْ فِى بُطُونِ أُ[g[مّ]َهَ[n[ـٰ]تِكُمْ خَلْ[a:11629[قًا م]ّ[i:146[ِنۢ ب]َعْدِ خَلْ[f:11630[قٍ ف]ِى ظُلُمَ[n[ـٰ][f:11631[تٍ ث]َلَ[n[ـٰ][f:11632[ثٍ‌ۚ ذ][n[َٲ]لِكُمُ [h:4260[ٱ]للَّهُ رَبُّكُمْ لَهُ [h:1397[ٱ]لْمُلْكُ‌ۖ ل[o[َآ] إِلَ[n[ـٰ]هَ إِلَّا هُوَ‌ۖ فَأَ[g[نّ]َىٰ تُصْرَف[p[ُو]نَ","translation_en":"He has created you from a single being, then made its mate of the same (kind), and He has made for you eight of the cattle in pairs. He creates you in the wombs of your mothers-- a creation after a creation-- in triple darkness; that is Allah your Lord, His is the kingdom; there is no god but He; whence are you then turned away?","translation_id":"Dia menciptakan kamu dari diri yang satu (Adam) kemudian darinya Dia jadikan pasangannya dan Dia menurunkan delapan pasang hewan ternak untukmu. Dia menjadikan kamu dalam perut ibumu kejadian demi kejadian dalam tiga kegelapan. Yang (berbuat) demikian itu adalah Allah, Tuhan kamu, Tuhan yang memiliki kerajaan. Tidak ada tuhan selain Dia; maka mengapa kamu dapat dipalingkan?","hasanah_per_verse":1380},{"text_madani":"إِن تَكْفُرُوا فَإِنَّ اللَّهَ غَنِيٌّ عَنكُمْ ۖ وَلَا يَرْضَىٰ لِعِبَادِهِ الْكُفْرَ ۖ وَإِن تَشْكُرُوا يَرْضَهُ لَكُمْ ۗ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۗ ثُمَّ إِلَىٰ رَبِّكُم مَّرْجِعُكُمْ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","text_tajweed":"إِ[f:7056[ن ت]َكْفُرُو[s[اْ] فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ غَنِىٌّ عَ[f:255[نك]ُمْ‌ۖ وَلَا يَرْضَىٰ لِعِبَادِهِ [h:11633[ٱ]لْكُفْرَ‌ۖ وَإِ[f:11634[ن ت]َشْكُرُو[s[اْ] يَرْضَهُ لَكُمْ‌ۗ وَلَا تَزِرُ وَازِرَ[a:4572[ةٌ و]ِزْرَ أُخْرَىٰ‌ۗ ثُ[g[مّ]َ إِلَىٰ رَبِّك[w:4573[ُم م]َّرْجِعُكُمْ فَيُنَبِّئُك[c:3605[ُم ب]ِمَا كُ[f:100[نت]ُمْ تَعْمَلُونَ‌ۚ إِ[g[نّ]َهُ[n[ۥ] عَلِي[i:2196[مُۢ ب]ِذَاتِ [h:2197[ٱ][l[ل]صُّد[p[ُو]رِ","translation_en":"If you are ungrateful, then surely Allah is Self-sufficient above all need of you; and He does not like ungratefulness in His servants; and if you are grateful, He likes it in you; and no bearer of burden shall bear the burden of another; then to your Lord is your return, then will He inform you of what you did; surely He is Cognizant of what is in the breasts.","translation_id":"Jika kamu kafir (ketahuilah) maka sesungguhnya Allah tidak memerlukanmu dan Dia tidak meridhai kekafiran hamba-hamba-Nya. Jika kamu bersyukur, Dia meridhai kesyukuranmu itu. Seseorang yang berdosa tidak memikul dosa orang lain. Kemudian kepada Tuhanmulah kembalimu lalu Dia beritakan kepadamu apa yang telah kamu kerjakan. Sungguh, Dia Maha Mengetahui apa yang tersimpan dalam dada(mu).","hasanah_per_verse":1260},{"text_madani":"وَإِذَا مَسَّ الْإِنسَانَ ضُرٌّ دَعَا رَبَّهُ مُنِيبًا إِلَيْهِ ثُمَّ إِذَا خَوَّلَهُ نِعْمَةً مِّنْهُ نَسِيَ مَا كَانَ يَدْعُو إِلَيْهِ مِن قَبْلُ وَجَعَلَ لِلَّهِ أَندَادًا لِّيُضِلَّ عَن سَبِيلِهِ ۚ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيلًا ۖ إِنَّكَ مِنْ أَصْحَابِ النَّارِ","text_tajweed":"۞ وَإِذَا مَسَّ [h:5968[ٱ]لْإِ[f:5969[نس]َ[n[ـٰ]نَ ضُ[f:11635[رٌّ د]َعَا رَبَّهُ[n[ۥ] مُنِيبًا إِلَيْهِ ثُ[g[مّ]َ إِذَا خَوَّلَهُ[n[ۥ] نِعْمَ[a:11636[ةً م]ِّنْهُ نَسِىَ مَا كَانَ يَ[q:1242[دْ]ع[o[ُوٓ][s[اْ] إِلَيْهِ مِ[f:128[ن ق]َ[q:129[بْ]لُ وَجَعَلَ لِلَّهِ أَ[f:96[ند]َا[u:11637[دًا ل]ِّيُضِلَّ عَ[f:4361[ن س]َبِيلِه[n[ِۦ]‌ۚ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيلاً‌ۖ إِ[g[نّ]َكَ مِنْ أَصْحَ[n[ـٰ]بِ [h:3507[ٱ][l[ل][g[نّ][p[َا]رِ","translation_en":"And when distress afflicts a man he calls upon his Lord turning to Him frequently; then when He makes him possess a favor from Him, he forgets that for which he called upon Him before, and sets up rivals to Allah that he may cause (men) to stray off from His path. Say: Enjoy yourself in your ungratefulness a little, surely you are of the inmates of the fire.","translation_id":"Dan apabila manusia ditimpa bencana, dia memohon (pertolongan) kepada Tuhannya dengan kembali (taat) kepada-Nya; tetapi apabila Dia memberikan nikmat kepadanya dia lupa (akan bencana) yang pernah dia berdoa kepada Allah sebelum itu, dan diadakannya sekutu-sekutu bagi Allah untuk menyesatkan (manusia) dari jalan-Nya. Katakanlah, “Bersenang-senanglah kamu dengan kekafiranmu itu untuk sementara waktu. Sungguh, kamu termasuk penghuni neraka.”","hasanah_per_verse":1220},{"text_madani":"أَمَّنْ هُوَ قَانِتٌ آنَاءَ اللَّيْلِ سَاجِدًا وَقَائِمًا يَحْذَرُ الْآخِرَةَ وَيَرْجُو رَحْمَةَ رَبِّهِ ۗ قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ ۗ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ","text_tajweed":"أَ[g[مّ]َنْ هُوَ قَ[n[ـٰ]نِتٌ ءَان[o[َا]ٓءَ [h:2180[ٱ]لَّيْلِ سَاجِ[a:11638[دًا و]َق[o[َا]ٓئِ[a:11639[مًا ي]َحْذَرُ [h:11640[ٱ]لْأَخِرَةَ وَيَرْجُو[s[اْ] رَحْمَةَ رَبِّه[n[ِۦ]‌ۗ قُلْ هَلْ يَسْتَوِى [h:11641[ٱ]لَّذِينَ يَعْلَمُونَ وَ[h:37[ٱ]لَّذِينَ لَا يَعْلَمُونَ‌ۗ إِ[g[نّ]َمَا يَتَذَكَّرُ أُ[s[وْ]لُو[s[اْ] [h:1595[ٱ]لْأَلْبَ[p[ـٰ][q[ب]ِ","translation_en":"What! he who is obedient during hours of the night, prostrating himself and standing, takes care of the hereafter and hopes for the mercy of his Lord! Say: Are those who know and those who do not know alike? Only the men of understanding are mindful.","translation_id":"(Apakah kamu orang musyrik yang lebih beruntung) ataukah orang yang beribadah pada waktu malam dengan sujud dan berdiri, karena takut kepada (azab) akhirat dan mengharapkan rahmat Tuhannya? Katakanlah, “Apakah sama orang-orang yang mengetahui dengan orang-orang yang tidak mengetahui?” Sebenarnya hanya orang yang berakal sehat yang dapat menerima pelajaran.","hasanah_per_verse":1050},{"text_madani":"قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ اللَّهِ وَاسِعَةٌ ۗ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ","text_tajweed":"قُلْ يَ[n[ـٰ]عِبَادِ [h:11642[ٱ]لَّذِينَ ءَامَنُو[s[اْ] [h:1643[ٱ]تَّقُو[s[اْ] رَبَّكُمْ‌ۚ لِلَّذِينَ أَحْسَنُو[s[اْ] فِى هَ[n[ـٰ]ذِهِ [h:5052[ٱ][l[ل]دُّنْيَا حَسَنَ[a:11643[ةٌ‌ۗ و]َأَرْضُ [h:11644[ٱ]للَّهِ و[n[َٲ]سِعَةٌ‌ۗ إِ[g[نّ]َمَا يُوَفَّى [h:11645[ٱ][l[ل]صَّ[n[ـٰ]بِرُونَ أَ[q:7573[جْ]رَه[c:11646[ُم ب]ِغَيْرِ حِس[p[َا][q[ب]ٍ","translation_en":"Say: O my servants who believe! be careful of (your duty to) your Lord; for those who do good in this world is good, and Allah's earth is spacious; only the patient will be paid back their reward in full without measure.","translation_id":"Katakanlah (Muhammad), “Wahai hamba-hamba-Ku yang beriman! Bertakwalah kepada Tuhanmu.” Bagi orang-orang yang berbuat baik di dunia ini akan memperoleh kebaikan. Dan bumi Allah itu luas. Hanya orang-orang yang bersabarlah yang disempurnakan pahalanya tanpa batas.","hasanah_per_verse":950},{"text_madani":"قُلْ إِنِّي أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ مُخْلِصًا لَّهُ الدِّينَ","text_tajweed":"قُلْ إِ[g[نّ][o[ِىٓ] أُمِرْتُ أَنْ أَعْبُدَ [h:7014[ٱ]للَّهَ مُخْلِ[u:11616[صًا ل]َّهُ [h:4649[ٱ][l[ل]دّ[p[ِي]نَ","translation_en":"Say: I am commanded that I should serve Allah, being sincere to Him in obedience.","translation_id":"Katakanlah, “Sesungguhnya aku diperintahkan agar menyembah Allah dengan penuh ketaatan kepada-Nya dalam (menjalankan) agama.","hasanah_per_verse":310},{"text_madani":"وَأُمِرْتُ لِأَنْ أَكُونَ أَوَّلَ الْمُسْلِمِينَ","text_tajweed":"وَأُمِرْتُ لِأَنْ أَكُونَ أَوَّلَ [h:11647[ٱ]لْمُسْلِم[p[ِي]نَ","translation_en":"And I am commanded that I shall be the first of those who submit.","translation_id":"Dan aku diperintahkan agar menjadi orang yang pertama-tama berserah diri.”","hasanah_per_verse":230},{"text_madani":"قُلْ إِنِّي أَخَافُ إِنْ عَصَيْتُ رَبِّي عَذَابَ يَوْمٍ عَظِيمٍ","text_tajweed":"قُلْ إِ[g[نّ][o[ِىٓ] أَخَافُ إِنْ عَصَيْتُ رَبِّى عَذَابَ يَوْمٍ عَظ[p[ِي]مٍ","translation_en":"Say: I fear, if I disobey my Lord, the chastisement of a grievous day.","translation_id":"Katakanlah, “Sesungguhnya aku takut akan azab pada hari yang besar jika aku durhaka kepada Tuhanku.”","hasanah_per_verse":290},{"text_madani":"قُلِ اللَّهَ أَعْبُدُ مُخْلِصًا لَّهُ دِينِي","text_tajweed":"قُلِ [h:11648[ٱ]للَّهَ أَعْبُدُ مُخْلِ[u:11616[صًا ل]َّهُ[n[ۥ] دِينِى","translation_en":"Say: Allah (it is Whom) I serve, being sincere to Him in my obedience:","translation_id":"Katakanlah, “Hanya Allah yang aku sembah dengan penuh ketaatan kepada-Nya dalam (menjalankan) agamaku.”","hasanah_per_verse":210},{"text_madani":"فَاعْبُدُوا مَا شِئْتُم مِّن دُونِهِ ۗ قُلْ إِنَّ الْخَاسِرِينَ الَّذِينَ خَسِرُوا أَنفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيَامَةِ ۗ أَلَا ذَٰلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ","text_tajweed":"فَ[h:9999[ٱ]عْبُدُو[s[اْ] مَا شِئْت[w:11649[ُم م]ِّ[f:3136[ن د]ُونِه[n[ِۦ]‌ۗ قُلْ إِ[g[نّ]َ [h:11650[ٱ]لْخَ[n[ـٰ]سِرِينَ [h:11651[ٱ]لَّذِينَ خَسِر[o[ُوٓ][s[اْ] أَ[f:38[نف]ُسَهُمْ وَأَهْلِيهِمْ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ‌ۗ أَلَا ذ[n[َٲ]لِكَ هُوَ [h:8940[ٱ]لْخُسْرَانُ [h:8941[ٱ]لْمُب[p[ِي]نُ","translation_en":"Serve then what you like besides Him. Say: The losers surely are those who shall have lost themselves and their families on the day of resurrection; now surely that is the clear loss.","translation_id":"Maka sembahlah selain Dia sesukamu! (wahai orang-orang musyrik). Katakanlah, “Sesungguhnya orang-orang yang rugi ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya pada hari Kiamat.” Ingatlah! Yang demikian itu adalah kerugian yang nyata.","hasanah_per_verse":850},{"text_madani":"لَهُم مِّن فَوْقِهِمْ ظُلَلٌ مِّنَ النَّارِ وَمِن تَحْتِهِمْ ظُلَلٌ ۚ ذَٰلِكَ يُخَوِّفُ اللَّهُ بِهِ عِبَادَهُ ۚ يَا عِبَادِ فَاتَّقُونِ","text_tajweed":"لَه[w:1812[ُم م]ِّ[f:3683[ن ف]َوْقِهِمْ ظُلَ[a:11652[لٌ م]ِّنَ [h:869[ٱ][l[ل][g[نّ]َارِ وَمِ[f:11653[ن ت]َحْتِهِمْ ظُلَ[f:11654[لٌ‌ۚ ذ][n[َٲ]لِكَ يُخَوِّفُ [h:11655[ٱ]للَّهُ بِه[n[ِۦ] عِبَادَهُ[n[ۥ]‌ۚ يَ[n[ـٰ]عِبَادِ فَ[h:210[ٱ]تَّق[p[ُو]نِ","translation_en":"They shall have coverings of fire above them and coverings beneath them; with that Allah makes His servants to fear, so be careful of (your duty to) Me, O My servants!","translation_id":"Di atas mereka ada lapisan-lapisan dari api dan di bawahnya juga ada lapisan-lapisan yang disediakan bagi mereka. Demikianlah Allah mengancam hamba-hamba-Nya (dengan azab itu). “Wahai hamba-hamba-Ku, maka bertakwalah kepada-Ku.”","hasanah_per_verse":610},{"text_madani":"وَالَّذِينَ اجْتَنَبُوا الطَّاغُوتَ أَن يَعْبُدُوهَا وَأَنَابُوا إِلَى اللَّهِ لَهُمُ الْبُشْرَىٰ ۚ فَبَشِّرْ عِبَادِ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ [h:11656[ٱ][q:11657[جْ]تَنَبُو[s[اْ] [h:11658[ٱ][l[ل]طَّ[n[ـٰ]غُوتَ أ[a:11659[َن ي]َعْبُدُوهَا وَأَنَاب[o[ُوٓ][s[اْ] إِلَى [h:1637[ٱ]للَّهِ لَهُمُ [h:6112[ٱ]لْبُشْرَىٰ‌ۚ فَبَشِّرْ عِب[p[َا][q[د]ِ","translation_en":"And (as for) those who keep off from the worship of the idols and turn to Allah, they shall have good news, therefore give good news to My servants,","translation_id":"Dan orang-orang yang menjauhi °agut (yaitu) tidak menyembahnya dan kembali kepada Allah, mereka pantas mendapat berita gembira; sebab itu sampaikanlah kabar gembira itu kepada hamba-hamba-Ku,","hasanah_per_verse":600},{"text_madani":"الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ ۚ أُولَٰئِكَ الَّذِينَ هَدَاهُمُ اللَّهُ ۖ وَأُولَٰئِكَ هُمْ أُولُو الْأَلْبَابِ","text_tajweed":"ٱلَّذِينَ يَسْتَمِعُونَ [h:11660[ٱ]لْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ[o[ۥٓ‌ۚ] أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ [h:51[ٱ]لَّذِينَ هَدَ[n[ٮٰ]هُمُ [h:11661[ٱ]للَّهُ‌ۖ وَأُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمْ أُ[s[وْ]لُو[s[اْ] [h:1595[ٱ]لْأَلْبَ[p[ـٰ][q[ب]ِ","translation_en":"Those who listen to the word, then follow the best of it; those are they whom Allah has guided, and those it is who are the men of understanding.","translation_id":"(yaitu) mereka yang mendengarkan perkataan lalu mengikuti apa yang paling baik di antaranya. Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah dan mereka itulah orang-orang yang mempunyai akal sehat.","hasanah_per_verse":670},{"text_madani":"أَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذَابِ أَفَأَنتَ تُنقِذُ مَن فِي النَّارِ","text_tajweed":"أَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ [h:11662[ٱ]لْعَذَابِ أَفَأَ[f:6069[نت]َ تُ[f:11663[نق]ِذُ مَ[f:2074[ن ف]ِى [h:4674[ٱ][l[ل][g[نّ][p[َا]رِ","translation_en":"What! as for him then against whom the sentence of chastisement is due: What! can you save him who is in the fire?","translation_id":"Maka apakah (engkau hendak mengubah nasib) orang-orang yang telah dipastikan mendapat azab? Apakah engkau (Muhammad) akan menyelamatkan orang yang berada dalam api neraka?","hasanah_per_verse":380},{"text_madani":"لَٰكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ غُرَفٌ مِّن فَوْقِهَا غُرَفٌ مَّبْنِيَّةٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ۖ وَعْدَ اللَّهِ ۖ لَا يُخْلِفُ اللَّهُ الْمِيعَادَ","text_tajweed":"لَ[n[ـٰ]كِنِ [h:2522[ٱ]لَّذِينَ [h:2523[ٱ]تَّقَوْ[s[اْ] رَبَّهُمْ لَهُمْ غُرَ[a:11664[فٌ م]ِّ[f:11665[ن ف]َوْقِهَا غُرَ[a:11666[فٌ م]َّ[q:11667[بْ]نِيَّ[f:11668[ةٌ ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ‌ۖ وَعْدَ [h:3149[ٱ]للَّهِ‌ۖ لَا يُخْلِفُ [h:10424[ٱ]للَّهُ [h:11669[ٱ]لْمِيع[p[َا][q[د]َ","translation_en":"But (as for) those who are careful of (their duty to) their Lord, they shall have high places, above them higher places, built (for them), beneath which flow rivers; (this is) the promise of Allah: Allah will not fail in (His) promise.","translation_id":"Tetapi orang-orang yang bertakwa kepada Tuhannya, mereka mendapat kamar-kamar (di surga), di atasnya terdapat pula kamar-kamar yang dibangun (bertingkat-tingkat), yang mengalir di bawahnya sungai-sungai. (Itulah) janji Allah. Allah tidak akan memungkiri janji(-Nya).","hasanah_per_verse":800},{"text_madani":"أَلَمْ تَرَ أَنَّ اللَّهَ أَنزَلَ مِنَ السَّمَاءِ مَاءً فَسَلَكَهُ يَنَابِيعَ فِي الْأَرْضِ ثُمَّ يُخْرِجُ بِهِ زَرْعًا مُّخْتَلِفًا أَلْوَانُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَجْعَلُهُ حُطَامًا ۚ إِنَّ فِي ذَٰلِكَ لَذِكْرَىٰ لِأُولِي الْأَلْبَابِ","text_tajweed":"أَلَمْ تَرَ أَ[g[نّ]َ [h:394[ٱ]للَّهَ أَ[f:471[نز]َلَ مِنَ [h:64[ٱ][l[ل]سَّم[o[َا]ٓءِ م[o[َا]ٓ[f:11670[ءً ف]َسَلَكَهُ[n[ۥ] يَنَ[n[ـٰ]بِيعَ فِى [h:44[ٱ]لْأَرْضِ ثُ[g[مّ]َ يُخْرِجُ بِه[n[ِۦ] زَرْ[a:11671[عًا م]ُّخْتَلِفًا أَلْو[n[َٲ]نُهُ[n[ۥ] ثُ[g[مّ]َ يَهِيجُ فَتَرَ[n[ٮٰ]هُ مُصْفَر[f:11672[ًّا ث]ُ[g[مّ]َ يَ[q:9467[جْ]عَلُهُ[n[ۥ] حُطَ[n[ـٰ]مًا‌ۚ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَذِكْرَىٰ لِأُ[s[وْ]لِى [h:11555[ٱ]لْأَلْبَ[p[ـٰ][q[ب]ِ","translation_en":"Do you not see that Allah sends down water from the cloud, then makes it go along in the earth in springs, then brings forth therewith herbage of various colors, then it withers so that you see it becoming yellow, then He makes it a thing crushed and broken into pieces? Most surely there is a reminder in this for the men of understanding.","translation_id":"Apakah engkau tidak memperhatikan, bahwa Allah menurunkan air dari langit, lalu diaturnya menjadi sumber-sumber air di bumi, kemudian dengan air itu ditumbuhkan-Nya tanam-tanaman yang bermacam-macam warnanya, kemudian menjadi kering, lalu engkau melihatnya kekuning-kuningan, kemudian dijadikan-Nya hancur berderai-derai. Sungguh, pada yang demikian itu terdapat pelajaran bagi orang-orang yang mempunyai akal sehat.","hasanah_per_verse":1200},{"text_madani":"أَفَمَن شَرَحَ اللَّهُ صَدْرَهُ لِلْإِسْلَامِ فَهُوَ عَلَىٰ نُورٍ مِّن رَّبِّهِ ۚ فَوَيْلٌ لِّلْقَاسِيَةِ قُلُوبُهُم مِّن ذِكْرِ اللَّهِ ۚ أُولَٰئِكَ فِي ضَلَالٍ مُّبِينٍ","text_tajweed":"أَفَمَ[f:11673[ن ش]َرَحَ [h:11674[ٱ]للَّهُ صَ[q:4395[دْ]رَهُ[n[ۥ] لِلْإِسْلَ[n[ـٰ]مِ فَهُوَ عَلَىٰ نُو[a:11675[رٍ م]ّ[u:192[ِن ر]َّبِّه[n[ِۦ]‌ۚ فَوَيْ[u:11676[لٌ ل]ِّلْقَ[n[ـٰ]سِيَةِ قُلُوبُه[w:11677[ُم م]ِّ[f:11678[ن ذ]ِكْرِ [h:3774[ٱ]للَّهِ‌ۚ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ فِى ضَلَ[n[ـٰ][a:2393[لٍ م]ُّب[p[ِي]نٍ","translation_en":"What! is he whose heart Allah has opened for Islam so that he is in a light from his Lord (like the hard-hearted)? Nay, woe to those whose hearts are hard against the remembrance of Allah; those are in clear error.","translation_id":"Maka apakah orang-orang yang dibukakan hatinya oleh Allah untuk (menerima) agama Islam lalu dia mendapat cahaya dari Tuhannya (sama dengan orang yang hatinya membatu)? Maka celakalah mereka yang hatinya telah membatu untuk mengingat Allah. Mereka itu dalam kesesatan yang nyata.","hasanah_per_verse":770},{"text_madani":"اللَّهُ نَزَّلَ أَحْسَنَ الْحَدِيثِ كِتَابًا مُّتَشَابِهًا مَّثَانِيَ تَقْشَعِرُّ مِنْهُ جُلُودُ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ ثُمَّ تَلِينُ جُلُودُهُمْ وَقُلُوبُهُمْ إِلَىٰ ذِكْرِ اللَّهِ ۚ ذَٰلِكَ هُدَى اللَّهِ يَهْدِي بِهِ مَن يَشَاءُ ۚ وَمَن يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ","text_tajweed":"ٱللَّهُ نَزَّلَ أَحْسَنَ [h:11679[ٱ]لْحَدِيثِ كِتَ[n[ـٰ][a:11680[بًا م]ُّتَشَ[n[ـٰ]بِ[a:11681[هًا م]َّثَانِىَ تَ[q:11682[قْ]شَعِرُّ مِنْهُ جُلُودُ [h:11683[ٱ]لَّذِينَ يَخْشَوْنَ رَبَّهُمْ ثُ[g[مّ]َ تَلِينُ جُلُودُهُمْ وَقُلُوبُهُمْ إِلَىٰ ذِكْرِ [h:3774[ٱ]للَّهِ‌ۚ ذ[n[َٲ]لِكَ هُدَى [h:629[ٱ]للَّهِ يَهْدِى بِه[n[ِۦ] م[a:476[َن ي]َش[o[َا]ٓءُ‌ۚ وَم[a:3002[َن ي]ُضْلِلِ [h:3003[ٱ]للَّهُ فَمَا لَهُ[n[ۥ] مِنْ ه[p[َا][q[د]ٍ","translation_en":"Allah has revealed the best announcement, a book conformable in its various parts, repeating, whereat do shudder the skins of those who fear their Lord, then their skins and their hearts become pliant to the remembrance of Allah; this is Allah's guidance, He guides with it whom He pleases; and (as for) him whom Allah makes err, there is no guide for him.","translation_id":"Allah telah menurunkan perkataan yang paling baik (yaitu) Al-Qur'an yang serupa (ayat-ayatnya) lagi berulang-ulang, gemetar karenanya kulit orang-orang yang takut kepada Tuhannya, kemudian menjadi tenang kulit dan hati mereka ketika mengingat Allah. Itulah petunjuk Allah, dengan Kitab itu Dia memberi petunjuk kepada siapa yang Dia kehendaki. Dan barangsiapa dibiarkan sesat oleh Allah, maka tidak seorang pun yang dapat memberi petunjuk.","hasanah_per_verse":1320},{"text_madani":"أَفَمَن يَتَّقِي بِوَجْهِهِ سُوءَ الْعَذَابِ يَوْمَ الْقِيَامَةِ ۚ وَقِيلَ لِلظَّالِمِينَ ذُوقُوا مَا كُنتُمْ تَكْسِبُونَ","text_tajweed":"أَفَم[a:11684[َن ي]َتَّقِى بِوَ[q:11685[جْ]هِه[n[ِۦ] س[o[ُو]ٓءَ [h:239[ٱ]لْعَذَابِ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ‌ۚ وَقِيلَ لِلظَّ[n[ـٰ]لِمِينَ ذُوقُو[s[اْ] مَا كُ[f:100[نت]ُمْ تَكْسِب[p[ُو]نَ","translation_en":"Is he then who has to guard himself with his own person against the evil chastisement on the resurrection day? And it will be said to the unjust: Taste what you earned.","translation_id":"Maka apakah orang-orang yang melindungi wajahnya menghindari azab yang buruk pada hari Kiamat (sama dengan orang mukmin yang tidak kena azab)? Dan dikatakan kepada orang-orang yang zhalim, “Rasakanlah olehmu balasan apa yang telah kamu kerjakan.”","hasanah_per_verse":610},{"text_madani":"كَذَّبَ الَّذِينَ مِن قَبْلِهِمْ فَأَتَاهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ","text_tajweed":"كَذَّبَ [h:4507[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ فَأَتَ[n[ـٰ]هُمُ [h:11686[ٱ]لْعَذَابُ مِنْ حَيْثُ لَا يَشْعُر[p[ُو]نَ","translation_en":"Those before them rejected (prophets), therefore there came to them the chastisement from whence they perceived not.","translation_id":"Orang-orang yang sebelum mereka telah mendustakan (rasul-rasul), maka datanglah kepada mereka azab dari arah yang tidak mereka sangka.","hasanah_per_verse":400},{"text_madani":"فَأَذَاقَهُمُ اللَّهُ الْخِزْيَ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا يَعْلَمُونَ","text_tajweed":"فَأَذَاقَهُمُ [h:11687[ٱ]للَّهُ [h:11688[ٱ]لْخِزْىَ فِى [h:441[ٱ]لْحَيَ[s[و][n[ٲ]ةِ [h:442[ٱ][l[ل]دُّنْيَا‌ۖ وَلَعَذَابُ [h:7000[ٱ]لْأَخِرَةِ أَكْبَرُ‌ۚ لَوْ كَانُو[s[اْ] يَعْلَم[p[ُو]نَ","translation_en":"So Allah made them taste the disgrace in this world's life, and certainly the punishment of the hereafter is greater; did they but know!","translation_id":"Maka Allah menimpakan kepada mereka kehinaan pada kehidupan dunia. Dan sungguh, azab akhirat lebih besar, kalau (saja) mereka mengetahui.","hasanah_per_verse":590},{"text_madani":"وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِي هَٰذَا الْقُرْآنِ مِن كُلِّ مَثَلٍ لَّعَلَّهُمْ يَتَذَكَّرُونَ","text_tajweed":"وَلَقَ[q:341[دْ] ضَرَ[q:9642[بْ]نَا لِل[g[نّ]َاسِ فِى هَ[n[ـٰ]ذَا [h:7765[ٱ]لْقُرْءَانِ مِ[f:843[ن ك]ُلِّ مَثَ[u:11689[لٍ ل]َّعَلَّهُمْ يَتَذَكَّر[p[ُو]نَ","translation_en":"And certainly We have set forth to men in this Quran similitudes of every sort that they may mind.","translation_id":"Dan sungguh, telah Kami buatkan dalam Al-Qur'an ini segala macam perumpamaan bagi manusia agar mereka dapat pelajaran.","hasanah_per_verse":440},{"text_madani":"قُرْآنًا عَرَبِيًّا غَيْرَ ذِي عِوَجٍ لَّعَلَّهُمْ يَتَّقُونَ","text_tajweed":"قُرْءَانًا عَرَبِيًّا غَيْرَ ذِى عِوَ[u:11690[جٍ ل]َّعَلَّهُمْ يَتَّق[p[ُو]نَ","translation_en":"An Arabic Quran without any crookedness, that they may guard (against evil).","translation_id":"(Yaitu) Al-Qur'an dalam bahasa Arab, tidak ada kebengkokan (di dalamnya) agar mereka bertakwa.","hasanah_per_verse":280},{"text_madani":"ضَرَبَ اللَّهُ مَثَلًا رَّجُلًا فِيهِ شُرَكَاءُ مُتَشَاكِسُونَ وَرَجُلًا سَلَمًا لِّرَجُلٍ هَلْ يَسْتَوِيَانِ مَثَلًا ۚ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ","text_tajweed":"ضَرَبَ [h:7103[ٱ]للَّهُ مَثَل[u:11691[اً ر]َّجُل[f:11692[اً ف]ِيهِ شُرَك[o[َا]ٓءُ مُتَشَ[n[ـٰ]كِسُونَ وَرَجُل[f:11693[اً س]َلَ[u:11694[مًا ل]ِّرَجُلٍ هَلْ يَسْتَوِيَانِ مَثَلاً‌ۚ [h:11695[ٱ]لْحَمْدُ لِلَّهِ‌ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَم[p[ُو]نَ","translation_en":"Allah sets forth an example: There is a slave in whom are (several) partners differing with one another, and there is another slave wholly owned by one man. Are the two alike in condition? (All) praise is due to Allah. Nay! most of them do not know.","translation_id":"Allah membuat perumpamaan (yaitu) seorang laki-laki (hamba sahaya) yang dimiliki oleh beberapa orang yang berserikat yang dalam perselisihan, dan seorang hamba sahaya yang menjadi milik penuh dari seorang (saja). Adakah kedua hamba sahaya itu sama keadaannya? Segala puji bagi Allah, tetapi kebanyakan mereka tidak mengetahui.","hasanah_per_verse":810},{"text_madani":"إِنَّكَ مَيِّتٌ وَإِنَّهُم مَّيِّتُونَ","text_tajweed":"إِ[g[نّ]َكَ مَيِّ[a:11696[تٌ و]َإِ[g[نّ]َه[w:11697[ُم م]َّيِّت[p[ُو]نَ","translation_en":"Surely you shall die and they (too) shall surely die.","translation_id":"Sesungguhnya engkau (Muhammad) akan mati dan mereka akan mati (pula).","hasanah_per_verse":160},{"text_madani":"ثُمَّ إِنَّكُمْ يَوْمَ الْقِيَامَةِ عِندَ رَبِّكُمْ تَخْتَصِمُونَ","text_tajweed":"ثُ[g[مّ]َ إِ[g[نّ]َكُمْ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ عِ[f:264[ند]َ رَبِّكُمْ تَخْتَصِم[p[ُو]نَ","translation_en":"Then surely on the day of resurrection you will contend one with another before. your Lord.","translation_id":"Kemudian sesungguhnya kamu pada hari Kiamat akan berbantah-bantahan di hadapan Tuhanmu.","hasanah_per_verse":300},{"text_madani":"فَمَنْ أَظْلَمُ مِمَّن كَذَبَ عَلَى اللَّهِ وَكَذَّبَ بِالصِّدْقِ إِذْ جَاءَهُ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِّلْكَافِرِينَ","text_tajweed":"۞ فَمَنْ أَظْلَمُ مِ[g[مّ]َ[f:11698[ن ك]َذَبَ عَلَى [h:412[ٱ]للَّهِ وَكَذَّبَ بِ[h:11699[ٱ][l[ل]صِّ[q:11699[دْ]قِ إِذْ ج[o[َا]ٓءَهُ[o[ۥٓ‌ۚ] أَلَيْسَ فِى جَهَ[g[نّ]َمَ مَثْ[u:10414[وًى ل]ِّلْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"Who is then more unjust than he who utters a lie against Allah and (he who) gives the lie to the truth when it comes to him; is there not in hell an abode for the unbelievers?","translation_id":"Maka siapakah yang lebih zhalim daripada orang yang membuat-buat kebohongan terhadap Allah dan mendustakan kebenaran yang datang kepadanya? Bukankah di neraka Jahanam tempat tinggal bagi orang-orang kafir?","hasanah_per_verse":580},{"text_madani":"وَالَّذِي جَاءَ بِالصِّدْقِ وَصَدَّقَ بِهِ ۙ أُولَٰئِكَ هُمُ الْمُتَّقُونَ","text_tajweed":"وَ[h:9999[ٱ]لَّذِى ج[o[َا]ٓءَ بِ[h:11699[ٱ][l[ل]صِّ[q:11699[دْ]قِ وَصَدَّقَ بِه[o[ِۦٓ‌ۙ] أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:922[ٱ]لْمُتَّق[p[ُو]نَ","translation_en":"And he who brings the truth and (he who) accepts it as the truth-- these are they that guard (against evil).","translation_id":"Dan orang yang membawa kebenaran (Muhammad) dan orang yang membenarkannya, mereka itulah orang yang bertakwa.","hasanah_per_verse":340},{"text_madani":"لَهُم مَّا يَشَاءُونَ عِندَ رَبِّهِمْ ۚ ذَٰلِكَ جَزَاءُ الْمُحْسِنِينَ","text_tajweed":"لَه[w:3531[ُم م]َّا يَش[o[َا]ٓءُونَ عِ[f:264[ند]َ رَبِّهِمْ‌ۚ ذ[n[َٲ]لِكَ جَز[o[َا]ٓءُ [h:3749[ٱ]لْمُحْسِن[p[ِي]نَ","translation_en":"They shall have with their Lord what they please; that is the reward of the doers of good;","translation_id":"Mereka memperoleh apa yang mereka kehendaki di sisi Tuhannya. Demikianlah balasan bagi orang-orang yang berbuat baik,","hasanah_per_verse":330},{"text_madani":"لِيُكَفِّرَ اللَّهُ عَنْهُمْ أَسْوَأَ الَّذِي عَمِلُوا وَيَجْزِيَهُمْ أَجْرَهُم بِأَحْسَنِ الَّذِي كَانُوا يَعْمَلُونَ","text_tajweed":"لِيُكَفِّرَ [h:11700[ٱ]للَّهُ عَنْهُمْ أَسْوَأَ [h:11701[ٱ]لَّذِى عَمِلُو[s[اْ] وَيَ[q:11702[جْ]زِيَهُمْ أَ[q:7573[جْ]رَه[c:7574[ُم ب]ِأَحْسَنِ [h:11703[ٱ]لَّذِى كَانُو[s[اْ] يَعْمَل[p[ُو]نَ","translation_en":"So that Allah will do away with the worst of what they did and give them their reward for the best of what they do.","translation_id":"agar Allah menghapus perbuatan mereka yang paling buruk yang pernah mereka lakukan dan memberi pahala kepada mereka dengan yang lebih baik daripada apa yang mereka kerjakan.","hasanah_per_verse":580},{"text_madani":"أَلَيْسَ اللَّهُ بِكَافٍ عَبْدَهُ ۖ وَيُخَوِّفُونَكَ بِالَّذِينَ مِن دُونِهِ ۚ وَمَن يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ","text_tajweed":"أَلَيْسَ [h:4087[ٱ]للَّهُ بِكَافٍ عَ[q:8257[بْ]دَهُ[n[ۥ]‌ۖ وَيُخَوِّفُونَكَ بِ[h:2413[ٱ]لَّذِينَ مِ[f:3136[ن د]ُونِه[n[ِۦ]‌ۚ وَم[a:3002[َن ي]ُضْلِلِ [h:3003[ٱ]للَّهُ فَمَا لَهُ[n[ۥ] مِنْ ه[p[َا][q[د]ٍ","translation_en":"Is not Allah sufficient for His servant? And they seek to frighten you with those besides Him; and whomsoever Allah makes err, there is no guide for him.","translation_id":"Bukankah Allah yang mencukupi hamba-Nya? Mereka menakut-nakutimu dengan (sesembahan) yang selain Dia. Barangsiapa dibiarkan sesat oleh Allah maka tidak seorang pun yang dapat memberi petunjuk kepadanya.","hasanah_per_verse":570},{"text_madani":"وَمَن يَهْدِ اللَّهُ فَمَا لَهُ مِن مُّضِلٍّ ۗ أَلَيْسَ اللَّهُ بِعَزِيزٍ ذِي انتِقَامٍ","text_tajweed":"وَم[a:7905[َن ي]َهْدِ [h:5147[ٱ]للَّهُ فَمَا لَهُ[n[ۥ] م[a:11704[ِن م]ُّضِلٍّ‌ۗ أَلَيْسَ [h:4087[ٱ]للَّهُ بِعَزِي[f:11705[زٍ ذ]ِى [h:11706[ٱ][f:1731[نت]ِق[p[َا]مٍ","translation_en":"And whom Allah guides, there is none that can lead him astray; is not Allah Mighty, the Lord of retribution?","translation_id":"Dan barangsiapa diberi petunjuk oleh Allah, maka tidak seorang pun yang dapat menyesatkannya. Bukankah Allah Mahaperkasa dan mempunyai (kekuasaan untuk) menghukum?","hasanah_per_verse":410},{"text_madani":"وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ ۚ قُلْ أَفَرَأَيْتُم مَّا تَدْعُونَ مِن دُونِ اللَّهِ إِنْ أَرَادَنِيَ اللَّهُ بِضُرٍّ هَلْ هُنَّ كَاشِفَاتُ ضُرِّهِ أَوْ أَرَادَنِي بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكَاتُ رَحْمَتِهِ ۚ قُلْ حَسْبِيَ اللَّهُ ۖ عَلَيْهِ يَتَوَكَّلُ الْمُتَوَكِّلُونَ","text_tajweed":"وَلَئِ[f:5683[ن س]َأَلْتَه[w:10403[ُم م]َّنْ خَلَقَ [h:3913[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:1474[ٱ]لْأَرْضَ لَيَقُولُ[g[نّ]َ [h:10404[ٱ]للَّهُ‌ۚ قُلْ أَفَرَءَيْت[w:9776[ُم م]َّا تَ[q:4040[دْ]عُونَ مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ إِنْ أَرَادَنِىَ [h:11707[ٱ]للَّهُ بِضُرٍّ هَلْ هُ[g[نّ]َ كَ[n[ـٰ]شِفَ[n[ـٰ]تُ ضُرِّه[o[ِۦٓ] أَوْ أَرَادَنِى بِرَحْمَةٍ هَلْ هُ[g[نّ]َ مُمْسِكَ[n[ـٰ]تُ رَحْمَتِه[n[ِۦ]‌ۚ قُلْ حَسْبِىَ [h:5929[ٱ]للَّهُ‌ۖ عَلَيْهِ يَتَوَكَّلُ [h:11708[ٱ]لْمُتَوَكِّل[p[ُو]نَ","translation_en":"And should you ask them, Who created the heavens and the earth? They would most certainly say: Allah. Say: Have you then considered that what you call upon besides Allah, would they, if Allah desire to afflict me with harm, be the removers of His harm, or (would they), if Allah desire to show me mercy, be the withholders of His mercy? Say: Allah is sufficient for me; on Him do the reliant rely.","translation_id":"Dan sungguh, jika engkau tanyakan kepada mereka, “Siapakah yang menciptakan langit dan bumi?” Niscaya mereka menjawab, “Allah.” Katakanlah, “Kalau begitu tahukah kamu tentang apa yang kamu sembah selain Allah, jika Allah hendak mendatangkan bencana kepadaku, apakah mereka mampu menghilangkan bencana itu, atau jika Allah hendak memberi rahmat kepadaku, apakah mereka dapat mencegah rahmat-Nya?” Katakanlah, “Cukuplah Allah bagiku. Kepada-Nyalah orang-orang yang bertawakal berserah diri.”","hasanah_per_verse":1480},{"text_madani":"قُلْ يَا قَوْمِ اعْمَلُوا عَلَىٰ مَكَانَتِكُمْ إِنِّي عَامِلٌ ۖ فَسَوْفَ تَعْلَمُونَ","text_tajweed":"قُلْ يَ[n[ـٰ]قَوْمِ [h:4436[ٱ]عْمَلُو[s[اْ] عَلَىٰ مَكَانَتِكُمْ إِ[g[نّ]ِى عَ[n[ـٰ]مِ[f:4437[لٌ‌ۖ ف]َسَوْفَ تَعْلَم[p[ُو]نَ","translation_en":"Say: O my people! work in your place, surely I am a worker, so you will come to know.","translation_id":"Katakanlah (Muhammad), “Wahai kaumku! Berbuatlah menurut kedudukanmu, aku pun berbuat (demikian). Kelak kamu akan mengetahui,","hasanah_per_verse":400},{"text_madani":"مَن يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيمٌ","text_tajweed":"م[a:6325[َن ي]َأْتِيهِ عَذَا[a:6326[بٌ ي]ُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَا[a:3534[بٌ م]ُّق[p[ِي]مٌ","translation_en":"Who it is to whom there shall come a punishment which will disgrace him and to whom will be due a lasting punishment.","translation_id":"siapa yang mendapat siksa yang menghinakan dan kepadanya ditimpakan azab yang kekal.”","hasanah_per_verse":320},{"text_madani":"إِنَّا أَنزَلْنَا عَلَيْكَ الْكِتَابَ لِلنَّاسِ بِالْحَقِّ ۖ فَمَنِ اهْتَدَىٰ فَلِنَفْسِهِ ۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۖ وَمَا أَنتَ عَلَيْهِم بِوَكِيلٍ","text_tajweed":"إِ[g[نّ][o[َآ] أَ[f:515[نز]َلْنَا عَلَيْكَ [h:1723[ٱ]لْكِتَ[n[ـٰ]بَ لِل[g[نّ]َاسِ بِ[h:370[ٱ]لْحَقِّ‌ۖ فَمَنِ [h:6230[ٱ]هْتَدَىٰ فَلِنَفْسِه[n[ِۦ]‌ۖ وَمَ[f:6231[ن ض]َلَّ فَإِ[g[نّ]َمَا يَضِلُّ عَلَيْهَا‌ۖ وَم[o[َآ] أَ[f:169[نت]َ عَلَيْه[c:4316[ِم ب]ِوَك[p[ِي]لٍ","translation_en":"Surely We have revealed to you the Book with the truth for the sake of men; so whoever follows the right way, it is for his own soul and whoever errs, he errs only to its detriment; and you are not a custodian over them.","translation_id":"Sungguh, Kami menurunkan kepadamu Kitab (Al-Qur'an) dengan membawa kebenaran untuk manusia; barangsiapa mendapat petunjuk maka (petunjuk itu) untuk dirinya sendiri, dan siapa sesat maka sesungguhnya kesesatan itu untuk dirinya sendiri, dan engkau bukanlah orang yang bertanggung jawab terhadap mereka.","hasanah_per_verse":770},{"text_madani":"اللَّهُ يَتَوَفَّى الْأَنفُسَ حِينَ مَوْتِهَا وَالَّتِي لَمْ تَمُتْ فِي مَنَامِهَا ۖ فَيُمْسِكُ الَّتِي قَضَىٰ عَلَيْهَا الْمَوْتَ وَيُرْسِلُ الْأُخْرَىٰ إِلَىٰ أَجَلٍ مُّسَمًّى ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَتَفَكَّرُونَ","text_tajweed":"ٱللَّهُ يَتَوَفَّى [h:11709[ٱ]لْأَ[f:11710[نف]ُسَ حِينَ مَوْتِهَا وَ[h:11711[ٱ]لَّتِى لَمْ تَمُتْ فِى مَنَامِهَا‌ۖ فَيُمْسِكُ [h:11712[ٱ]لَّتِى قَضَىٰ عَلَيْهَا [h:11713[ٱ]لْمَوْتَ وَيُرْسِلُ [h:11714[ٱ]لْأُخْرَ[o[ىٰٓ] إِلَ[o[ىٰٓ] أَجَ[a:1657[لٍ م]ُّسَ[g[مّ]ًى‌ۚ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:849[تٍ ل]ِّقَوْ[a:6018[مٍ ي]َتَفَكَّر[p[ُو]نَ","translation_en":"Allah takes the souls at the time of their death, and those that die not during their sleep; then He withholds those on whom He has passed the decree of death and sends the others back till an appointed term; most surely there are signs in this for a people who reflect.","translation_id":"Allah memegang nyawa (seseorang) pada saat kematiannya dan nyawa (seseorang) yang belum mati ketika dia tidur; maka Dia tahan nyawa (orang) yang telah Dia tetapkan kematiannya dan Dia lepaskan nyawa yang lain sampai waktu yang ditentukan. Sungguh, pada yang demikian itu terdapat tanda-tanda (kebesaran) Allah bagi kaum yang berpikir.","hasanah_per_verse":1070},{"text_madani":"أَمِ اتَّخَذُوا مِن دُونِ اللَّهِ شُفَعَاءَ ۚ قُلْ أَوَلَوْ كَانُوا لَا يَمْلِكُونَ شَيْئًا وَلَا يَعْقِلُونَ","text_tajweed":"أَمِ [h:8702[ٱ]تَّخَذُو[s[اْ] مِ[f:107[ن د]ُونِ [h:108[ٱ]للَّهِ شُفَع[o[َا]ٓءَ‌ۚ قُلْ أَوَلَوْ كَانُو[s[اْ] لَا يَمْلِكُونَ شَيْـ[a:232[ـًٔا و]َلَا يَعْقِل[p[ُو]نَ","translation_en":"Or have they taken intercessors besides Allah? Say: what! even though they did not ever have control over anything, nor do they understand.","translation_id":"Ataukah mereka mengambil penolong selain Allah. Katakanlah, “Apakah (kamu mengambilnya juga) meskipun mereka tidak memiliki sesuatu apa pun dan tidak mengerti?”","hasanah_per_verse":540},{"text_madani":"قُل لِّلَّهِ الشَّفَاعَةُ جَمِيعًا ۖ لَّهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ ثُمَّ إِلَيْهِ تُرْجَعُونَ","text_tajweed":"قُل لِّلَّهِ [h:11715[ٱ][l[ل]شَّفَ[n[ـٰ]عَةُ جَمِي[u:11716[عًا‌ۖ ل]َّهُ[n[ۥ] مُلْكُ [h:555[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۖ ثُ[g[مّ]َ إِلَيْهِ تُرْجَع[p[ُو]نَ","translation_en":"Say: Allah's is the intercession altogether; His is the kingdom of the heavens and the earth, then to Him you shall be brought back.","translation_id":"Katakanlah, “Pertolongan itu hanya milik Allah semuanya. Dia memiliki kerajaan langit dan bumi. Kemudian kepada-Nya kamu dikembalikan.”","hasanah_per_verse":480},{"text_madani":"وَإِذَا ذُكِرَ اللَّهُ وَحْدَهُ اشْمَأَزَّتْ قُلُوبُ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ ۖ وَإِذَا ذُكِرَ الَّذِينَ مِن دُونِهِ إِذَا هُمْ يَسْتَبْشِرُونَ","text_tajweed":"وَإِذَا ذُكِرَ [h:5234[ٱ]للَّهُ وَحْدَهُ [h:11717[ٱ]شْمَأَزَّتْ قُلُوبُ [h:11718[ٱ]لَّذِينَ لَا يُؤْمِنُونَ بِ[h:447[ٱ]لْأَخِرَةِ‌ۖ وَإِذَا ذُكِرَ [h:11719[ٱ]لَّذِينَ مِ[f:3136[ن د]ُونِه[o[ِۦٓ] إِذَا هُمْ يَسْتَ[q:2415[بْ]شِر[p[ُو]نَ","translation_en":"And when Allah alone is mentioned, the hearts of those who do not believe in the hereafter shrink, and when those besides Him are mentioned, lo! they are joyful.","translation_id":"Dan apabila yang disebut hanya nama Allah, kesal sekali hati orang-orang yang tidak beriman kepada akhirat. Namun apabila nama-nama sembahan selain Allah yang disebut, tiba-tiba mereka menjadi bergembira.","hasanah_per_verse":760},{"text_madani":"قُلِ اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِي مَا كَانُوا فِيهِ يَخْتَلِفُونَ","text_tajweed":"قُلِ [h:1820[ٱ][l[ل]لَّهُ[g[مّ]َ فَاطِرَ [h:6833[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ عَ[n[ـٰ]لِمَ [h:11720[ٱ]لْغَيْبِ وَ[h:4187[ٱ][l[ل]شَّهَ[n[ـٰ]دَةِ أَ[f:169[نت]َ تَحْكُمُ بَيْنَ عِبَادِكَ فِى مَا كَانُو[s[اْ] فِيهِ يَخْتَلِف[p[ُو]نَ","translation_en":"Say: O Allah! Originator of the heavens and the earth, Knower of the unseen and the seen! Thou (only) judgest between Thy servants as to that wherein they differ.","translation_id":"Katakanlah, “Ya Allah, Pencipta langit dan bumi, yang mengetahui segala yang gaib dan yang nyata, Engkaulah yang memutuskan di antara hamba-hamba-Mu tentang apa yang selalu mereka perselisihkan.”","hasanah_per_verse":760},{"text_madani":"وَلَوْ أَنَّ لِلَّذِينَ ظَلَمُوا مَا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ مِن سُوءِ الْعَذَابِ يَوْمَ الْقِيَامَةِ ۚ وَبَدَا لَهُم مِّنَ اللَّهِ مَا لَمْ يَكُونُوا يَحْتَسِبُونَ","text_tajweed":"وَلَوْ أَ[g[نّ]َ لِلَّذِينَ ظَلَمُو[s[اْ] مَا فِى [h:44[ٱ]لْأَرْضِ جَمِي[a:3532[عًا و]َمِثْلَهُ[n[ۥ] مَعَهُ[n[ۥ] لَ[h:6951[ٱ]فْتَدَوْ[s[اْ] بِه[n[ِۦ] مِ[f:7447[ن س][o[ُو]ٓءِ [h:11721[ٱ]لْعَذَابِ يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ‌ۚ وَبَدَا لَه[w:6026[ُم م]ِّنَ [h:321[ٱ]للَّهِ مَا لَمْ يَكُونُو[s[اْ] يَحْتَسِب[p[ُو]نَ","translation_en":"And had those who are unjust all that is in the earth and the like of it with it, they would certainly offer it as ransom (to be saved) from the evil of the punishment on the day of resurrection; and what they never thought of shall become plain to them from Allah.","translation_id":"Dan sekiranya orang-orang yang zhalim mempunyai segala apa yang ada di bumi dan ditambah lagi sebanyak itu, niscaya mereka akan menebus dirinya dengan itu dari azab yang buruk pada hari Kiamat. Dan jelaslah bagi mereka azab dari Allah yang dahulu tidak pernah mereka perkirakan.","hasanah_per_verse":970},{"text_madani":"وَبَدَا لَهُمْ سَيِّئَاتُ مَا كَسَبُوا وَحَاقَ بِهِم مَّا كَانُوا بِهِ يَسْتَهْزِئُونَ","text_tajweed":"وَبَدَا لَهُمْ سَيِّـَٔـاتُ مَا كَسَبُو[s[اْ] وَحَاقَ بِه[w:6252[ِم م]َّا كَانُو[s[اْ] بِه[n[ِۦ] يَسْتَهْزِء[p[ُو]نَ","translation_en":"And the evil (consequences) of what they wrought shall become plain to them, and the very thing they mocked at shall beset them.","translation_id":"Dan jelaslah bagi mereka kejahatan apa yang telah mereka kerjakan dan mereka diliputi oleh apa yang dahulu mereka selalu memperolok-olokkannya.","hasanah_per_verse":430},{"text_madani":"فَإِذَا مَسَّ الْإِنسَانَ ضُرٌّ دَعَانَا ثُمَّ إِذَا خَوَّلْنَاهُ نِعْمَةً مِّنَّا قَالَ إِنَّمَا أُوتِيتُهُ عَلَىٰ عِلْمٍ ۚ بَلْ هِيَ فِتْنَةٌ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ","text_tajweed":"فَإِذَا مَسَّ [h:5968[ٱ]لْإِ[f:5969[نس]َ[n[ـٰ]نَ ضُ[f:11722[رٌّ د]َعَانَا ثُ[g[مّ]َ إِذَا خَوَّلْنَ[n[ـٰ]هُ نِعْمَ[a:11723[ةً م]ِّ[g[نّ]َا قَالَ إِ[g[نّ]َم[o[َآ] أُوتِيتُهُ[n[ۥ] عَلَىٰ عِلْ[i:11724[مِۭ‌ۚ ب]َلْ هِىَ فِتْنَ[a:11725[ةٌ و]َلَ[n[ـٰ]كِ[g[نّ]َ أَكْثَرَهُمْ لَا يَعْلَم[p[ُو]نَ","translation_en":"So when harm afflicts a man he calls upon Us; then, when We give him a favor from Us, he says: I have been given it only by means of knowledge. Nay, it is a trial, but most of them do not know.","translation_id":"Maka apabila manusia ditimpa bencana dia menyeru Kami, kemudian apabila Kami berikan nikmat Kami kepadanya dia berkata, “Sesungguhnya aku diberi nikmat ini hanyalah karena kepintaranku.” Sebenarnya, itu adalah ujian, tetapi kebanyakan mereka tidak mengetahui.","hasanah_per_verse":830},{"text_madani":"قَدْ قَالَهَا الَّذِينَ مِن قَبْلِهِمْ فَمَا أَغْنَىٰ عَنْهُم مَّا كَانُوا يَكْسِبُونَ","text_tajweed":"قَ[q:298[دْ] قَالَهَا [h:11726[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ فَم[o[َآ] أَغْنَىٰ عَنْه[w:3985[ُم م]َّا كَانُو[s[اْ] يَكْسِب[p[ُو]نَ","translation_en":"Those before them did say it indeed, but what they earned availed them not.","translation_id":"Sungguh, orang-orang yang sebelum mereka pun telah mengatakan hal itu, maka tidak berguna lagi bagi mereka apa yang dahulu mereka kerjakan.","hasanah_per_verse":430},{"text_madani":"فَأَصَابَهُمْ سَيِّئَاتُ مَا كَسَبُوا ۚ وَالَّذِينَ ظَلَمُوا مِنْ هَٰؤُلَاءِ سَيُصِيبُهُمْ سَيِّئَاتُ مَا كَسَبُوا وَمَا هُم بِمُعْجِزِينَ","text_tajweed":"فَأَصَابَهُمْ سَيِّـَٔـاتُ مَا كَسَبُو[s[اْ‌ۚ] وَ[h:37[ٱ]لَّذِينَ ظَلَمُو[s[اْ] مِنْ هَ[o[ـٰٓ]ؤُل[o[َا]ٓءِ سَيُصِيبُهُمْ سَيِّـَٔـاتُ مَا كَسَبُو[s[اْ] وَمَا ه[c:7421[ُم ب]ِمُعْجِز[p[ِي]نَ","translation_en":"So there befell them the evil (consequences) of what they earned; and (as for) those who are unjust from among these, there shall befall them the evil (consequences) of what they earn, and they shall not escape.","translation_id":"Lalu mereka ditimpa (bencana) dari akibat buruk apa yang mereka perbuat. Dan orang-orang yang zhalim di antara mereka juga akan ditimpa (bencana) dari akibat buruk apa yang mereka kerjakan dan mereka tidak dapat melepaskan diri.","hasanah_per_verse":680},{"text_madani":"أَوَلَمْ يَعْلَمُوا أَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَن يَشَاءُ وَيَقْدِرُ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يُؤْمِنُونَ","text_tajweed":"أَوَلَمْ يَعْلَم[o[ُوٓ][s[اْ] أَ[g[نّ]َ [h:394[ٱ]للَّهَ يَ[q:6968[بْ]سُطُ [h:6969[ٱ][l[ل]رِّزْقَ لِم[a:1537[َن ي]َش[o[َا]ٓءُ وَيَ[q:6970[قْ]دِرُ‌ۚ إِ[g[نّ]َ فِى ذ[n[َٲ]لِكَ لَأَيَ[n[ـٰ][u:849[تٍ ل]ِّقَوْ[a:4294[مٍ ي]ُؤْمِن[p[ُو]نَ","translation_en":"Do they not know that Allah makes ample the means of subsistence to whom He pleases, and He straitens; most surely there are signs in this for a people who believe.","translation_id":"Dan tidakkah mereka mengetahui bahwa Allah melapangkan rezeki bagi siapa yang Dia kehendaki dan membatasinya (bagi siapa yang Dia kehendaki)? Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang beriman.","hasanah_per_verse":590},{"text_madani":"قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ","text_tajweed":"۞ قُلْ يَ[n[ـٰ]عِبَادِىَ [h:10397[ٱ]لَّذِينَ أَسْرَفُو[s[اْ] عَلَ[o[ىٰٓ] أَ[f:568[نف]ُسِهِمْ لَا تَ[q:11727[قْ]نَطُو[s[اْ] م[u:7271[ِن ر]َّحْمَةِ [h:2157[ٱ]للَّهِ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ يَغْفِرُ [h:2250[ٱ][l[ل]ذُّنُوبَ جَمِيعًا‌ۚ إِ[g[نّ]َهُ[n[ۥ] هُوَ [h:6822[ٱ]لْغَفُورُ [h:6228[ٱ][l[ل]رَّح[p[ِي]مُ","translation_en":"Say: O my servants! who have acted extravagantly against their own souls, do not despair of the mercy of Allah; surely Allah forgives the faults altogether; surely He is the Forgiving the Merciful.","translation_id":"Katakanlah, “Wahai hamba-hamba-Ku yang melampaui batas terhadap diri mereka sendiri! Janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya. Sungguh, Dialah Yang Maha Pengampun, Maha Penyayang.","hasanah_per_verse":850},{"text_madani":"وَأَنِيبُوا إِلَىٰ رَبِّكُمْ وَأَسْلِمُوا لَهُ مِن قَبْلِ أَن يَأْتِيَكُمُ الْعَذَابُ ثُمَّ لَا تُنصَرُونَ","text_tajweed":"وَأَنِيب[o[ُوٓ][s[اْ] إِلَىٰ رَبِّكُمْ وَأَسْلِمُو[s[اْ] لَهُ[n[ۥ] مِ[f:1346[ن ق]َ[q:1347[بْ]لِ أ[a:1405[َن ي]َأْتِيَكُمُ [h:11728[ٱ]لْعَذَابُ ثُ[g[مّ]َ لَا تُ[f:6517[نص]َر[p[ُو]نَ","translation_en":"And return to your Lord time after time and submit to Him before there comes to you the punishment, then you shall not be helped.","translation_id":"Dan kembalilah kamu kepada Tuhanmu, dan berserah dirilah kepada-Nya sebelum datang azab kepadamu, kemudian kamu tidak dapat ditolong.","hasanah_per_verse":520},{"text_madani":"وَاتَّبِعُوا أَحْسَنَ مَا أُنزِلَ إِلَيْكُم مِّن رَّبِّكُم مِّن قَبْلِ أَن يَأْتِيَكُمُ الْعَذَابُ بَغْتَةً وَأَنتُمْ لَا تَشْعُرُونَ","text_tajweed":"وَ[h:9999[ٱ]تَّبِع[o[ُوٓ][s[اْ] أَحْسَنَ م[o[َآ] أُ[f:17[نز]ِلَ إِلَيْك[w:3691[ُم م]ّ[u:243[ِن ر]َّبِّك[w:11729[ُم م]ِّ[f:1346[ن ق]َ[q:1347[بْ]لِ أ[a:1405[َن ي]َأْتِيَكُمُ [h:11728[ٱ]لْعَذَابُ بَغْتَ[a:11730[ةً و]َأَ[f:98[نت]ُمْ لَا تَشْعُر[p[ُو]نَ","translation_en":"And follow the best that has been revealed to you from your Lord before there comes to you the punishment all of a sudden while you do not even perceive;","translation_id":"Dan ikutilah sebaik-baik apa yang telah diturunkan kepadamu (Al-Qur'an) dari Tuhanmu sebelum datang azab kepadamu secara mendadak, sedang kamu tidak menyadarinya,","hasanah_per_verse":640},{"text_madani":"أَن تَقُولَ نَفْسٌ يَا حَسْرَتَا عَلَىٰ مَا فَرَّطتُ فِي جَنبِ اللَّهِ وَإِن كُنتُ لَمِنَ السَّاخِرِينَ","text_tajweed":"أَ[f:8589[ن ت]َقُولَ نَفْ[a:11731[سٌ ي]َ[n[ـٰ]حَسْرَتَىٰ عَلَىٰ مَا فَرَّطتُ فِى جَ[i:11732[نۢب]ِ [h:11733[ٱ]للَّهِ وَإِ[f:11734[ن ك]ُ[f:2917[نت]ُ لَمِنَ [h:11735[ٱ][l[ل]سَّ[n[ـٰ]خِر[p[ِي]نَ","translation_en":"Lest a soul should say: O woe to me! for what I fell short of my duty to Allah, and most surely I was of those who laughed to scorn;","translation_id":"agar jangan ada orang yang mengatakan, ‘Alangkah besar penyesalanku atas kelalaianku dalam (menunaikan kewajiban) terhadap Allah, dan sesungguhnya aku termasuk orang-orang yang memperolok-olokkan (agama Allah),’","hasanah_per_verse":510},{"text_madani":"أَوْ تَقُولَ لَوْ أَنَّ اللَّهَ هَدَانِي لَكُنتُ مِنَ الْمُتَّقِينَ","text_tajweed":"أَوْ تَقُولَ لَوْ أَ[g[نّ]َ [h:394[ٱ]للَّهَ هَدَ[n[ٮٰ]نِى لَكُ[f:11372[نت]ُ مِنَ [h:3499[ٱ]لْمُتَّق[p[ِي]نَ","translation_en":"Or it should say: Had Allah guided me, I would certainly have been of those who guard (against evil);","translation_id":"atau (agar jangan) ada yang berkata, ‘Sekiranya Allah memberi petunjuk kepadaku tentulah aku termasuk orang-orang yang bertakwa,’","hasanah_per_verse":320},{"text_madani":"أَوْ تَقُولَ حِينَ تَرَى الْعَذَابَ لَوْ أَنَّ لِي كَرَّةً فَأَكُونَ مِنَ الْمُحْسِنِينَ","text_tajweed":"أَوْ تَقُولَ حِينَ تَرَى [h:11736[ٱ]لْعَذَابَ لَوْ أَ[g[نّ]َ لِى كَرَّ[f:11737[ةً ف]َأَكُونَ مِنَ [h:4754[ٱ]لْمُحْسِن[p[ِي]نَ","translation_en":"Or it should say when it sees the punishment: Were there only a returning for me, I should be of the doers of good.","translation_id":"atau (agar jangan) ada yang berkata ketika melihat azab, ‘Sekiranya aku dapat kembali (ke dunia), tentu aku termasuk orang-orang yang berbuat baik.’","hasanah_per_verse":420},{"text_madani":"بَلَىٰ قَدْ جَاءَتْكَ آيَاتِي فَكَذَّبْتَ بِهَا وَاسْتَكْبَرْتَ وَكُنتَ مِنَ الْكَافِرِينَ","text_tajweed":"بَلَىٰ قَ[q:298[دْ] ج[o[َا]ٓءَتْكَ ءَايَ[n[ـٰ]تِى فَكَذَّ[q:11738[بْ]تَ بِهَا وَ[h:11739[ٱ]سْتَكْبَرْتَ وَكُ[f:6187[نت]َ مِنَ [h:182[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"Aye! My communications came to you, but you rejected them, and you were proud and you were one of the unbelievers.","translation_id":"Sungguh, sebenarnya keterangan-keterangan-Ku telah datang kepadamu, tetapi kamu mendustakannya, malah kamu menyombongkan diri dan termasuk orang kafir.”","hasanah_per_verse":450},{"text_madani":"وَيَوْمَ الْقِيَامَةِ تَرَى الَّذِينَ كَذَبُوا عَلَى اللَّهِ وُجُوهُهُم مُّسْوَدَّةٌ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِّلْمُتَكَبِّرِينَ","text_tajweed":"وَيَوْمَ [h:443[ٱ]لْقِيَ[n[ـٰ]مَةِ تَرَى [h:11740[ٱ]لَّذِينَ كَذَبُو[s[اْ] عَلَى [h:412[ٱ]للَّهِ وُجُوهُه[w:11741[ُم م]ُّسْوَدَّةٌ‌ۚ أَلَيْسَ فِى جَهَ[g[نّ]َمَ مَثْ[u:11742[وًى ل]ِّلْمُتَكَبِّر[p[ِي]نَ","translation_en":"And on the day of resurrection you shall see those who lied against Allah; their faces shall be blackened. Is there not in hell an abode for the proud?","translation_id":"Dan pada hari Kiamat engkau akan melihat orang-orang yang berbuat dusta terhadap Allah, wajahnya menghitam. Bukankah neraka Jahanam itu tempat tinggal bagi orang yang menyombongkan diri?","hasanah_per_verse":650},{"text_madani":"وَيُنَجِّي اللَّهُ الَّذِينَ اتَّقَوْا بِمَفَازَتِهِمْ لَا يَمَسُّهُمُ السُّوءُ وَلَا هُمْ يَحْزَنُونَ","text_tajweed":"وَيُنَجِّى [h:11743[ٱ]للَّهُ [h:1171[ٱ]لَّذِينَ [h:2523[ٱ]تَّقَوْ[s[اْ] بِمَفَازَتِهِمْ لَا يَمَسُّهُمُ [h:11744[ٱ][l[ل]سّ[o[ُو]ٓءُ وَلَا هُمْ يَحْزَن[p[ُو]نَ","translation_en":"And Allah shall deliver those who guard (against evil) with their achievement; evil shall not touch them, nor shall they grieve.","translation_id":"Dan Allah menyelamatkan orang-orang yang bertakwa karena kemenangan mereka. Mereka tidak disentuh oleh azab dan tidak bersedih hati.","hasanah_per_verse":500},{"text_madani":"اللَّهُ خَالِقُ كُلِّ شَيْءٍ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ وَكِيلٌ","text_tajweed":"ٱللَّهُ خَ[n[ـٰ]لِقُ كُلِّ ش[a:4300[َىْءٍ‌ۖ و]َهُوَ عَلَىٰ كُلِّ ش[a:4302[َىْءٍ و]َك[p[ِي]لٌ","translation_en":"Allah is the Creator of every thing and He has charge over every thing.","translation_id":"Allah pencipta segala sesuatu dan Dia Maha Pemelihara atas segala sesuatu.","hasanah_per_verse":280},{"text_madani":"لَّهُ مَقَالِيدُ السَّمَاوَاتِ وَالْأَرْضِ ۗ وَالَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ أُولَٰئِكَ هُمُ الْخَاسِرُونَ","text_tajweed":"لَّهُ[n[ۥ] مَقَالِيدُ [h:11745[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَ[h:177[ٱ]لْأَرْضِ‌ۗ وَ[h:37[ٱ]لَّذِينَ كَفَرُو[s[اْ] بِـَٔـايَ[n[ـٰ]تِ [h:322[ٱ]للَّهِ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ هُمُ [h:150[ٱ]لْخَ[n[ـٰ]سِر[p[ُو]نَ","translation_en":"His are the treasures of the heavens and the earth; and (as for) those who disbelieve in the communications of Allah, these it is that are the losers.","translation_id":"Milik-Nyalah kunci-kunci (perbenda-haraan) langit dan bumi. Dan orang-orang yang kafir terhadap ayat-ayat Allah, mereka itulah orang yang rugi.","hasanah_per_verse":570},{"text_madani":"قُلْ أَفَغَيْرَ اللَّهِ تَأْمُرُونِّي أَعْبُدُ أَيُّهَا الْجَاهِلُونَ","text_tajweed":"قُلْ أَفَغَيْرَ [h:4347[ٱ]للَّهِ تَأْمُر[m[ُو]ٓ[g[نّ][o[ِىٓ] أَعْبُدُ أَيُّهَا [h:11746[ٱ]لْجَ[n[ـٰ]هِل[p[ُو]نَ","translation_en":"Say: What! Do you then bid me serve others than Allah, O ignorant men?","translation_id":"Katakanlah (Muhammad), “Apakah kamu menyuruh aku menyembah selain Allah, wahai orang-orang yang bodoh?”","hasanah_per_verse":340},{"text_madani":"وَلَقَدْ أُوحِيَ إِلَيْكَ وَإِلَى الَّذِينَ مِن قَبْلِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَلَتَكُونَنَّ مِنَ الْخَاسِرِينَ","text_tajweed":"وَلَقَ[q:341[دْ] أُوحِىَ إِلَيْكَ وَإِلَى [h:11747[ٱ]لَّذِينَ مِ[f:18[ن ق]َ[q:19[بْ]لِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَ[g[نّ]َ عَمَلُكَ وَلَتَكُونَ[g[نّ]َ مِنَ [h:340[ٱ]لْخَ[n[ـٰ]سِر[p[ِي]نَ","translation_en":"And certainly, it has been revealed to you and to those before you: Surely if you associate (with Allah), your work would certainly come to naught and you would certainly be of the losers.","translation_id":"Dan sungguh, telah diwahyukan kepadamu dan kepada (nabi-nabi) yang sebelummu, “Sungguh, jika engkau mempersekutukan (Allah), niscaya akan hapuslah amalmu dan tentulah engkau termasuk orang yang rugi.","hasanah_per_verse":620},{"text_madani":"بَلِ اللَّهَ فَاعْبُدْ وَكُن مِّنَ الشَّاكِرِينَ","text_tajweed":"بَلِ [h:11748[ٱ]للَّهَ فَ[h:11749[ٱ]عْبُ[q:11749[دْ] وَك[a:5006[ُن م]ِّنَ [h:4134[ٱ][l[ل]شَّ[n[ـٰ]كِر[p[ِي]نَ","translation_en":"Nay! but serve Allah alone and be of the thankful.","translation_id":"Karena itu, hendaklah Allah saja yang engkau sembah dan hendaklah engkau termasuk orang yang bersyukur.”","hasanah_per_verse":240},{"text_madani":"وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَالْأَرْضُ جَمِيعًا قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ","text_tajweed":"وَمَا قَدَرُو[s[اْ] [h:4225[ٱ]للَّهَ حَقَّ قَ[q:4226[دْ]رِه[n[ِۦ] وَ[h:2241[ٱ]لْأَرْضُ جَمِي[f:11750[عًا ق]َ[q:11751[بْ]ضَتُهُ[n[ۥ] يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ وَ[h:7179[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تُ مَ[q:11752[طْ]وِيَّ[n[ـٰ][i:11753[تُۢ ب]ِيَمِينِه[n[ِۦ]‌ۚ سُ[q:608[بْ]حَ[n[ـٰ]نَهُ[n[ۥ] وَتَعَ[n[ـٰ]لَىٰ عَ[g[مّ]َا يُشْرِك[p[ُو]نَ","translation_en":"And they have not honored Allah with the honor that is due to Him; and the whole earth shall be in His grip on the day of resurrection and the heavens rolled up in His right hand; glory be to Him, and may He be exalted above what they associate (with Him).","translation_id":"Dan mereka tidak mengagungkan Allah sebagaimana mestinya padahal bumi seluruhnya dalam genggaman-Nya pada hari Kiamat dan langit digulung dengan tangan kanan-Nya. Mahasuci Dia dan Mahatinggi Dia dari apa yang mereka persekutukan.","hasanah_per_verse":860},{"text_madani":"وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَن فِي السَّمَاوَاتِ وَمَن فِي الْأَرْضِ إِلَّا مَن شَاءَ اللَّهُ ۖ ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ فَإِذَا هُمْ قِيَامٌ يَنظُرُونَ","text_tajweed":"وَنُفِخَ فِى [h:4185[ٱ][l[ل]صُّورِ فَصَعِقَ مَ[f:2074[ن ف]ِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَ[f:3453[ن ف]ِى [h:44[ٱ]لْأَرْضِ إِلَّا مَ[f:9680[ن ش][o[َا]ٓءَ [h:78[ٱ]للَّهُ‌ۖ ثُ[g[مّ]َ نُفِخَ فِيهِ أُخْرَىٰ فَإِذَا هُمْ قِيَا[a:11754[مٌ ي]َ[f:1141[نظ]ُر[p[ُو]نَ","translation_en":"And the trumpet shall be blown, so all those that are in the heavens and all those that are in the earth shall swoon, except such as Allah please; then it shall be blown again, then lo! they shall stand up awaiting.","translation_id":"Dan sangkakala pun ditiup, maka matilah semua (makhluk) yang di langit dan di bumi kecuali mereka yang dikehendaki Allah. Kemudian ditiup sekali lagi (sangkakala itu) maka seketika itu mereka bangun (dari kuburnya) menunggu (keputusan Allah).","hasanah_per_verse":770},{"text_madani":"وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّهَا وَوُضِعَ الْكِتَابُ وَجِيءَ بِالنَّبِيِّينَ وَالشُّهَدَاءِ وَقُضِيَ بَيْنَهُم بِالْحَقِّ وَهُمْ لَا يُظْلَمُونَ","text_tajweed":"وَأَشْرَقَتِ [h:11755[ٱ]لْأَرْضُ بِنُورِ رَبِّهَا وَوُضِعَ [h:8115[ٱ]لْكِتَ[n[ـٰ]بُ وَجِ[s[اْ][o[ىٓ]ءَ بِ[h:11756[ٱ][l[ل][g[نّ]َبِيِّـ[n[ـۧ]نَ وَ[h:2904[ٱ][l[ل]شُّهَد[o[َا]ٓءِ وَقُضِىَ بَيْنَه[c:11757[ُم ب]ِ[h:370[ٱ]لْحَقِّ وَهُمْ لَا يُظْلَم[p[ُو]نَ","translation_en":"And the earth shall beam with the light of its Lord, and the Book shall be laid down, and the prophets and the witnesses shall be brought up, and judgment shall be given between them with justice, and they shall not be dealt with unjustly.","translation_id":"Dan bumi (padang Mahsyar) menjadi terang benderang dengan cahaya (keadilan) Tuhannya; dan buku-buku (perhitungan perbuatan mereka) diberikan (kepada masing-masing), nabi-nabi dan saksi-saksi pun dihadirkan, lalu diberikan keputusan di antara mereka secara adil, sedang mereka tidak dirugikan.","hasanah_per_verse":740},{"text_madani":"وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا عَمِلَتْ وَهُوَ أَعْلَمُ بِمَا يَفْعَلُونَ","text_tajweed":"وَوُفِّيَتْ كُلُّ نَفْ[a:1654[سٍ م]َّا عَمِلَتْ وَهُوَ أَعْلَمُ بِمَا يَفْعَل[p[ُو]نَ","translation_en":"And every soul shall be paid back fully what it has done, and He knows best what they do.","translation_id":"Dan kepada setiap jiwa diberi balasan dengan sempurna sesuai dengan apa yang telah dikerjakannya dan Dia lebih mengetahui apa yang mereka kerjakan.","hasanah_per_verse":320},{"text_madani":"وَسِيقَ الَّذِينَ كَفَرُوا إِلَىٰ جَهَنَّمَ زُمَرًا ۖ حَتَّىٰ إِذَا جَاءُوهَا فُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا أَلَمْ يَأْتِكُمْ رُسُلٌ مِّنكُمْ يَتْلُونَ عَلَيْكُمْ آيَاتِ رَبِّكُمْ وَيُنذِرُونَكُمْ لِقَاءَ يَوْمِكُمْ هَٰذَا ۚ قَالُوا بَلَىٰ وَلَٰكِنْ حَقَّتْ كَلِمَةُ الْعَذَابِ عَلَى الْكَافِرِينَ","text_tajweed":"وَسِيقَ [h:11758[ٱ]لَّذِينَ كَفَر[o[ُوٓ][s[اْ] إِلَىٰ جَهَ[g[نّ]َمَ زُمَرًا‌ۖ حَتَّ[o[ىٰٓ] إِذَا ج[o[َا]ٓءُوهَا فُتِحَتْ أَ[q:11759[بْ]و[n[َٲ]بُهَا وَقَالَ لَهُمْ خَزَنَتُه[o[َآ] أَلَمْ يَأْتِكُمْ رُسُ[a:4419[لٌ م]ِّ[f:344[نك]ُمْ يَتْلُونَ عَلَيْكُمْ ءَايَ[n[ـٰ]تِ رَبِّكُمْ وَيُ[f:4420[نذ]ِرُونَكُمْ لِق[o[َا]ٓءَ يَوْمِكُمْ هَ[n[ـٰ]ذَا‌ۚ قَالُو[s[اْ] بَلَىٰ وَلَ[n[ـٰ]كِنْ حَقَّتْ كَلِمَةُ [h:11662[ٱ]لْعَذَابِ عَلَى [h:468[ٱ]لْكَ[n[ـٰ]فِر[p[ِي]نَ","translation_en":"And those who disbelieve shall be driven to hell in companies; until, when they come to it, its doors shall be opened, and the keepers of it shall say to them: Did not there come to you messengers from among you reciting to you the communications of your Lord and warning you of the meeting of this day of yours? They shall say: Yea! But the sentence of punishment was due against the unbelievers.","translation_id":"Orang-orang yang kafir digiring ke neraka Jahanam secara berombongan. Sehingga apabila mereka sampai kepadanya (neraka) pintu-pintunya dibukakan dan penjaga-penjaga berkata kepada mereka, “Apakah belum pernah datang kepadamu rasul-rasul dari kalangan kamu yang membacakan ayat-ayat Tuhanmu dan memperingatkan kepadamu akan pertemuan (dengan) harimu ini?” Mereka menjawab, “Benar, ada,” tetapi ketetapan azab pasti berlaku terhadap orang-orang kafir.","hasanah_per_verse":1510},{"text_madani":"قِيلَ ادْخُلُوا أَبْوَابَ جَهَنَّمَ خَالِدِينَ فِيهَا ۖ فَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ","text_tajweed":"قِيلَ [h:11760[ٱ][q:278[دْ]خُل[o[ُوٓ][s[اْ] أَ[q:4047[بْ]و[n[َٲ]بَ جَهَ[g[نّ]َمَ خَ[n[ـٰ]لِدِينَ فِيهَا‌ۖ فَبِئْسَ مَثْوَى [h:7387[ٱ]لْمُتَكَبِّر[p[ِي]نَ","translation_en":"It shall be said: Enter the gates of hell to abide therein; so evil is the abode of the proud.","translation_id":"Dikatakan (kepada mereka), “Masukilah pintu-pintu neraka Jahanam itu, (kamu) kekal di dalamnya.” Maka (neraka Jahanam) itulah seburuk-buruk tempat tinggal bagi orang-orang yang menyombongkan diri.","hasanah_per_verse":450},{"text_madani":"وَسِيقَ الَّذِينَ اتَّقَوْا رَبَّهُمْ إِلَى الْجَنَّةِ زُمَرًا ۖ حَتَّىٰ إِذَا جَاءُوهَا وَفُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلَامٌ عَلَيْكُمْ طِبْتُمْ فَادْخُلُوهَا خَالِدِينَ","text_tajweed":"وَسِيقَ [h:11758[ٱ]لَّذِينَ [h:2523[ٱ]تَّقَوْ[s[اْ] رَبَّهُمْ إِلَى [h:1243[ٱ]لْجَ[g[نّ]َةِ زُمَرًا‌ۖ حَتَّ[o[ىٰٓ] إِذَا ج[o[َا]ٓءُوهَا وَفُتِحَتْ أَ[q:11759[بْ]و[n[َٲ]بُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلَ[n[ـٰ]مٌ عَلَيْكُمْ طِ[q:11761[بْ]تُمْ فَ[h:11762[ٱ][q:11762[دْ]خُلُوهَا خَ[n[ـٰ]لِد[p[ِي]نَ","translation_en":"And those who are careful of (their duty to) their Lord shall be conveyed to the garden in companies; until when they come to it, and its doors shall be opened, and the keepers of it shall say to them: Peace be on you, you shall be happy; therefore enter it to abide.","translation_id":"Dan orang-orang yang bertakwa kepada Tuhannya diantar ke dalam surga secara berombongan. Sehingga apabila mereka sampai kepadanya (surga) dan pintu-pintunya telah dibukakan, penjaga-penjaganya berkata kepada mereka, “Kesejahteraan (dilimpahkan) atasmu, berbahagialah kamu! Maka masuklah, kamu kekal di dalamnya.”","hasanah_per_verse":940},{"text_madani":"وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي صَدَقَنَا وَعْدَهُ وَأَوْرَثَنَا الْأَرْضَ نَتَبَوَّأُ مِنَ الْجَنَّةِ حَيْثُ نَشَاءُ ۖ فَنِعْمَ أَجْرُ الْعَامِلِينَ","text_tajweed":"وَقَالُو[s[اْ] [h:4698[ٱ]لْحَمْدُ لِلَّهِ [h:3912[ٱ]لَّذِى صَدَقَنَا وَعْدَهُ[n[ۥ] وَأَوْرَثَنَا [h:11763[ٱ]لْأَرْضَ نَتَبَوَّأُ مِنَ [h:4643[ٱ]لْجَ[g[نّ]َةِ حَيْثُ نَش[o[َا]ٓءُ‌ۖ فَنِعْمَ أَ[q:2254[جْ]رُ [h:2255[ٱ]لْعَ[n[ـٰ]مِل[p[ِي]نَ","translation_en":"And they shall say: (All) praise is due to Allah, Who has made good to us His promise, and He has made us inherit the land; we may abide in the garden where we please; so goodly is the reward of the workers.","translation_id":"Dan mereka berkata, “Segala puji bagi Allah yang telah memenuhi janji-Nya kepada kami dan telah memberikan tempat ini kepada kami sedang kami (diperkenankan) menempati surga di mana saja yang kami kehendaki.” Maka (surga itulah) sebaik-baik balasan bagi orang-orang yang beramal.","hasanah_per_verse":730},{"text_madani":"وَتَرَى الْمَلَائِكَةَ حَافِّينَ مِنْ حَوْلِ الْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ ۖ وَقُضِيَ بَيْنَهُم بِالْحَقِّ وَقِيلَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ","text_tajweed":"وَتَرَى [h:11764[ٱ]لْمَلَ[o[ـٰٓ]ئِكَةَ ح[m[َا]ٓفِّينَ مِنْ حَوْلِ [h:11765[ٱ]لْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ‌ۖ وَقُضِىَ بَيْنَه[c:11757[ُم ب]ِ[h:370[ٱ]لْحَقِّ وَقِيلَ [h:11766[ٱ]لْحَمْدُ لِلَّهِ رَبِّ [h:4[ٱ]لْعَ[n[ـٰ]لَم[p[ِي]نَ","translation_en":"And you shall see the angels going round about the throne glorifying the praise of their Lord; and judgment shall be given between them with justice, and it shall be said: All praise is due to Allah, the Lord of the worlds.","translation_id":"Dan engkau (Muhammad) akan melihat malaikat-malaikat melingkar di sekeliling ‘Arsy, bertasbih sambil memuji Tuhannya; lalu diberikan keputusan di antara mereka (hamba-hamba Allah) secara adil dan dikatakan, “Segala puji bagi Allah, Tuhan seluruh alam.”","hasanah_per_verse":770}]}
