{"chapter_number":58,"name_simple":"Al-Mujadila","name_meaning":{"text":"The Pleading Woman","en":"The Pleading Woman","id":"Wanita yang Menggugat"},"verses_count":22,"hasanah":20460,"verses":[{"text_madani":"قَدْ سَمِعَ اللَّهُ قَوْلَ الَّتِي تُجَادِلُكَ فِي زَوْجِهَا وَتَشْتَكِي إِلَى اللَّهِ وَاللَّهُ يَسْمَعُ تَحَاوُرَكُمَا ۚ إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ","text_tajweed":"قَ[q:298[دْ] سَمِعَ [h:2460[ٱ]للَّهُ قَوْلَ [h:13384[ٱ]لَّتِى تُجَ[n[ـٰ]دِلُكَ فِى زَوْجِهَا وَتَشْتَك[o[ِىٓ] إِلَى [h:1637[ٱ]للَّهِ وَ[h:72[ٱ]للَّهُ يَسْمَعُ تَحَاوُرَكُم[o[َآ‌ۚ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ سَمِي[i:9086[عُۢ ب]َص[p[ِي]رٌ","translation_en":"Allah indeed knows the plea of her who pleads with you about her husband and complains to Allah, and Allah knows the contentions of both of you; surely Allah is Hearing, Seeing.","translation_id":"Sungguh, Allah telah mendengar ucapan perempuan yang mengajukan gugatan kepadamu (Muhammad) tentang suaminya, dan mengadukan (halnya) kepada Allah, dan Allah mendengar percakapan antara kamu berdua. Sesungguhnya Allah Maha Mendengar, Maha Melihat.","hasanah_per_verse":730},{"text_madani":"الَّذِينَ يُظَاهِرُونَ مِنكُم مِّن نِّسَائِهِم مَّا هُنَّ أُمَّهَاتِهِمْ ۖ إِنْ أُمَّهَاتُهُمْ إِلَّا اللَّائِي وَلَدْنَهُمْ ۚ وَإِنَّهُمْ لَيَقُولُونَ مُنكَرًا مِّنَ الْقَوْلِ وَزُورًا ۚ وَإِنَّ اللَّهَ لَعَفُوٌّ غَفُورٌ","text_tajweed":"ٱلَّذِينَ يُظَ[n[ـٰ]هِرُونَ مِ[f:344[نك][w:431[ُم م]ّ[a:1265[ِن ن]ِّس[o[َا]ٓئِه[w:13385[ِم م]َّا هُ[g[نّ]َ أُ[g[مّ]َهَ[n[ـٰ]تِهِمْ‌ۖ إِنْ أُ[g[مّ]َهَ[n[ـٰ]تُهُمْ إِلَّا [h:13386[ٱ]لَّ[o[ــٰٓ]ــِٔى وَلَ[q:13387[دْ]نَهُمْ‌ۚ وَإِ[g[نّ]َهُمْ لَيَقُولُونَ مُ[f:13388[نك]َ[a:13389[رًا م]ِّنَ [h:3107[ٱ]لْقَوْلِ وَزُو[a:13390[رًا‌ۚ و]َإِ[g[نّ]َ [h:1986[ٱ]للَّهَ لَعَفُوٌّ غَف[p[ُو]رٌ","translation_en":"(As for) those of you who put away their wives by likening their backs to the backs of their mothers, they are not their mothers; their mothers are no others than those who gave them birth; and most surely they utter a hateful word and a falsehood and most surely Allah is Pardoning, Forgiving.","translation_id":"Orang-orang di antara kamu yang menzihar istrinya, (menganggap istrinya sebagai ibunya, padahal) istri mereka itu bukanlah ibunya. Ibu-ibu mereka hanyalah perempuan yang melahirkannya. Dan sesungguhnya mereka benar-benar telah mengucapkan suatu perkataan yang mungkar dan dusta. Dan sesungguhnya Allah Maha Pemaaf, Maha Pengampun.","hasanah_per_verse":1030},{"text_madani":"وَالَّذِينَ يُظَاهِرُونَ مِن نِّسَائِهِمْ ثُمَّ يَعُودُونَ لِمَا قَالُوا فَتَحْرِيرُ رَقَبَةٍ مِّن قَبْلِ أَن يَتَمَاسَّا ۚ ذَٰلِكُمْ تُوعَظُونَ بِهِ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ","text_tajweed":"وَ[h:9999[ٱ]لَّذِينَ يُظَ[n[ـٰ]هِرُونَ م[a:1265[ِن ن]ِّس[o[َا]ٓئِهِمْ ثُ[g[مّ]َ يَعُودُونَ لِمَا قَالُو[s[اْ] فَتَحْرِيرُ رَقَبَ[a:13391[ةٍ م]ِّ[f:1346[ن ق]َ[q:1347[بْ]لِ أ[a:13392[َن ي]َتَم[m[َا]ٓسَّا‌ۚ ذ[n[َٲ]لِكُمْ تُوعَظُونَ بِه[n[ِۦ]‌ۚ وَ[h:72[ٱ]للَّهُ بِمَا تَعْمَلُونَ خَب[p[ِي]رٌ","translation_en":"And (as for) those who put away their wives by likening their backs to the backs of their mothers then would recall what they said, they should free a captive before they touch each other; to that you are admonished (to conform); and Allah is Aware of what you do.","translation_id":"Dan mereka yang menzihar istrinya, kemudian menarik kembali apa yang telah mereka ucapkan, maka (mereka diwajibkan) memerdekakan seorang budak sebelum kedua suami istri itu bercampur. Demikianlah yang diajarkan kepadamu, dan Allah Mahateliti terhadap apa yang kamu kerjakan.","hasanah_per_verse":900},{"text_madani":"فَمَن لَّمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ مِن قَبْلِ أَن يَتَمَاسَّا ۖ فَمَن لَّمْ يَسْتَطِعْ فَإِطْعَامُ سِتِّينَ مِسْكِينًا ۚ ذَٰلِكَ لِتُؤْمِنُوا بِاللَّهِ وَرَسُولِهِ ۚ وَتِلْكَ حُدُودُ اللَّهِ ۗ وَلِلْكَافِرِينَ عَذَابٌ أَلِيمٌ","text_tajweed":"فَم[u:1066[َن ل]َّمْ يَجِ[q:1067[دْ] فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ مِ[f:1346[ن ق]َ[q:1347[بْ]لِ أ[a:13392[َن ي]َتَم[m[َا]ٓسَّا‌ۖ فَم[u:1066[َن ل]َّمْ يَسْتَطِعْ فَإِ[q:13393[طْ]عَامُ سِتِّينَ مِسْكِي[f:13394[نًا‌ۚ ذ][n[َٲ]لِكَ لِتُؤْمِنُو[s[اْ] بِ[h:32[ٱ]للَّهِ وَرَسُولِه[n[ِۦ]‌ۚ وَتِلْكَ حُدُودُ [h:1000[ٱ]للَّهِ‌ۗ وَلِلْكَ[n[ـٰ]فِرِينَ عَذَابٌ أَل[p[ِي]مٌ","translation_en":"But whoever has not the means, let him fast for two months successively before they touch each other; then as for him who is not able, let him feed sixty needy ones; that is in order that you may have faith in Allah and His Messenger, and these are Allah's limits, and the unbelievers shall have a painful punishment.","translation_id":"Maka barangsiapa tidak dapat (memerdekakan hamba sahaya), maka (dia wajib) berpuasa dua bulan berturut-turut sebelum keduanya bercampur. Tetapi barangsiapa tidak mampu, maka (wajib) memberi makan enam puluh orang miskin. Demikianlah agar kamu beriman kepada Allah dan Rasul-Nya. Itulah hukum-hukum Allah, dan bagi orang-orang yang mengingkarinya akan mendapat azab yang sangat pedih.","hasanah_per_verse":1150},{"text_madani":"إِنَّ الَّذِينَ يُحَادُّونَ اللَّهَ وَرَسُولَهُ كُبِتُوا كَمَا كُبِتَ الَّذِينَ مِن قَبْلِهِمْ ۚ وَقَدْ أَنزَلْنَا آيَاتٍ بَيِّنَاتٍ ۚ وَلِلْكَافِرِينَ عَذَابٌ مُّهِينٌ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ يُح[m[َا]ٓدُّونَ [h:13395[ٱ]للَّهَ وَرَسُولَهُ[n[ۥ] كُبِتُو[s[اْ] كَمَا كُبِتَ [h:13396[ٱ]لَّذِينَ مِ[f:617[ن ق]َ[q:618[بْ]لِهِمْ‌ۚ وَقَ[q:387[دْ] أَ[f:515[نز]َلْن[o[َآ] ءَايَ[n[ـٰ][i:516[تِۭ ب]َيِّنَ[n[ـٰ][a:13397[تٍ‌ۚ و]َلِلْكَ[n[ـٰ]فِرِينَ عَذَا[a:478[بٌ م]ُّه[p[ِي]نٌ","translation_en":"Surely those who act in opposition to Allah and His Messenger shall be laid down prostrate as those before them were laid down prostrate; and indeed We have revealed clear communications, and the unbelievers shall have an abasing chastisement.","translation_id":"Sesungguhnya orang-orang yang menentang Allah dan Rasul-Nya pasti mendapat kehinaan sebagaimana kehinaan yang telah didapat oleh orang-orang sebelum mereka. Dan sungguh, Kami telah menurunkan bukti-bukti yang nyata. Dan bagi orang-orang yang mengingkarinya akan mendapat azab yang menghinakan.","hasanah_per_verse":810},{"text_madani":"يَوْمَ يَبْعَثُهُمُ اللَّهُ جَمِيعًا فَيُنَبِّئُهُم بِمَا عَمِلُوا ۚ أَحْصَاهُ اللَّهُ وَنَسُوهُ ۚ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ","text_tajweed":"يَوْمَ يَ[q:4022[بْ]عَثُهُمُ [h:4023[ٱ]للَّهُ جَمِي[f:13398[عًا ف]َيُنَبِّئُه[c:4323[ُم ب]ِمَا عَمِل[o[ُوٓ[s[اْ]‌ۚ] أَحْصَ[n[ـٰ]هُ [h:13399[ٱ]للَّهُ وَنَسُوهُ‌ۚ وَ[h:72[ٱ]للَّهُ عَلَىٰ كُلِّ ش[f:3903[َىْءٍ ش]َه[p[ِي][q[د]ٌ","translation_en":"On the day when Allah will raise them up all together, then inform them of what they did: Allah has recorded it while they have forgotten it; and Allah is a witness of all things.","translation_id":"Pada hari itu mereka semuanya dibangkitkan Allah, lalu diberitakan-Nya kepada mereka apa yang telah mereka kerjakan. Allah menghitungnya (semua amal perbuatan itu), meskipun mereka telah melupakannya. Dan Allah Maha Menyaksikan segala sesuatu.","hasanah_per_verse":640},{"text_madani":"أَلَمْ تَرَ أَنَّ اللَّهَ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ مَا يَكُونُ مِن نَّجْوَىٰ ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَلَا أَدْنَىٰ مِن ذَٰلِكَ وَلَا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا ۖ ثُمَّ يُنَبِّئُهُم بِمَا عَمِلُوا يَوْمَ الْقِيَامَةِ ۚ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ","text_tajweed":"أَلَمْ تَرَ أَ[g[نّ]َ [h:394[ٱ]للَّهَ يَعْلَمُ مَا فِى [h:609[ٱ][l[ل]سَّمَ[n[ـٰ]و[n[َٲ]تِ وَمَا فِى [h:44[ٱ]لْأَرْضِ‌ۖ مَا يَكُونُ م[a:13400[ِن ن]َّ[q:7779[جْ]وَىٰ ثَلَ[n[ـٰ]ثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَل[o[َآ] أَ[q:314[دْ]نَىٰ مِ[f:2624[ن ذ][n[َٲ]لِكَ وَل[o[َآ] أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُو[s[اْ‌ۖ] ثُ[g[مّ]َ يُنَبِّئُه[c:4559[ُم ب]ِمَا عَمِلُو[s[اْ] يَوْمَ [h:592[ٱ]لْقِيَ[n[ـٰ]مَةِ‌ۚ إِ[g[نّ]َ [h:80[ٱ]للَّهَ بِكُلِّ شَىْءٍ عَل[p[ِي]مٌ","translation_en":"Do you not see that Allah knows whatever is in the heavens and whatever is in the earth? Nowhere is there a secret counsel between three persons but He is the fourth of them, nor (between) five but He is the sixth of them, nor less than that nor more but He is with them wheresoever they are; then He will inform them of what they did on the day of resurrection: surely Allah is Cognizant of all things.","translation_id":"Tidakkah engkau perhatikan, bahwa Allah mengetahui apa yang ada di langit dan apa yang ada di bumi? Tidak ada pembicaraan rahasia antara tiga orang, melainkan Dialah yang keempatnya. Dan tidak ada lima orang, melainkan Dialah yang keenamnya. Dan tidak ada yang kurang dari itu atau lebih banyak, melainkan Dia pasti ada bersama mereka di mana pun mereka berada. Kemudian Dia akan memberitakan kepada mereka pada hari Kiamat apa yang telah mereka kerjakan. Sesungguhnya Allah Maha Mengetahui segala sesuatu.","hasanah_per_verse":1630},{"text_madani":"أَلَمْ تَرَ إِلَى الَّذِينَ نُهُوا عَنِ النَّجْوَىٰ ثُمَّ يَعُودُونَ لِمَا نُهُوا عَنْهُ وَيَتَنَاجَوْنَ بِالْإِثْمِ وَالْعُدْوَانِ وَمَعْصِيَتِ الرَّسُولِ وَإِذَا جَاءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ اللَّهُ وَيَقُولُونَ فِي أَنفُسِهِمْ لَوْلَا يُعَذِّبُنَا اللَّهُ بِمَا نَقُولُ ۚ حَسْبُهُمْ جَهَنَّمُ يَصْلَوْنَهَا ۖ فَبِئْسَ الْمَصِيرُ","text_tajweed":"أَلَمْ تَرَ إِلَى [h:1372[ٱ]لَّذِينَ نُهُو[s[اْ] عَنِ [h:13401[ٱ][l[ل][g[نّ]َ[q:8519[جْ]وَىٰ ثُ[g[مّ]َ يَعُودُونَ لِمَا نُهُو[s[اْ] عَنْهُ وَيَتَنَ[n[ـٰ]جَوْنَ بِ[h:434[ٱ]لْإِثْمِ وَ[h:435[ٱ]لْعُ[q:435[دْ]و[n[َٲ]نِ وَمَعْصِيَتِ [h:13402[ٱ][l[ل]رَّسُولِ وَإِذَا ج[o[َا]ٓءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ [h:1707[ٱ]للَّهُ وَيَقُولُونَ ف[o[ِىٓ] أَ[f:568[نف]ُسِهِمْ لَوْلَا يُعَذِّبُنَا [h:13403[ٱ]للَّهُ بِمَا نَقُولُ‌ۚ حَسْبُهُمْ جَهَ[g[نّ]َمُ يَصْلَوْنَهَا‌ۖ فَبِئْسَ [h:13404[ٱ]لْمَص[p[ِي]رُ","translation_en":"Have you not seen those who are forbidden secret counsels, then they return to what they are forbidden, and they hold secret counsels for sin and revolt and disobedience to the Messenger, and when they come to you they greet you with a greeting with which Allah does not greet you, and they say in themselves: Why does not Allah punish us for what we say? Hell is enough for them; they shall enter it, and evil is the resort.","translation_id":"Tidakkah engkau perhatikan orang-orang yang telah dilarang mengadakan pembicaraan rahasia, kemudian mereka kembali (mengerjakan) larangan itu dan mereka mengadakan pembicaraan rahasia untuk berbuat dosa, permusuhan dan durhaka kepada Rasul. Dan apabila mereka datang kepadamu (Muhammad), mereka mengucapkan salam dengan cara yang bukan seperti yang ditentukan Allah untukmu. Dan mereka mengatakan pada diri mereka sendiri, “Mengapa Allah tidak menyiksa kita atas apa yang kita katakan itu?” Cukuplah bagi mereka neraka Jahanam yang akan mereka masuki. Maka neraka itu seburuk-buruk tempat kembali.","hasanah_per_verse":1670},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا تَنَاجَيْتُمْ فَلَا تَتَنَاجَوْا بِالْإِثْمِ وَالْعُدْوَانِ وَمَعْصِيَتِ الرَّسُولِ وَتَنَاجَوْا بِالْبِرِّ وَالتَّقْوَىٰ ۖ وَاتَّقُوا اللَّهَ الَّذِي إِلَيْهِ تُحْشَرُونَ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِذَا تَنَ[n[ـٰ]جَيْتُمْ فَلَا تَتَنَ[n[ـٰ]جَوْ[s[اْ] بِ[h:434[ٱ]لْإِثْمِ وَ[h:435[ٱ]لْعُ[q:435[دْ]و[n[َٲ]نِ وَمَعْصِيَتِ [h:13402[ٱ][l[ل]رَّسُولِ وَتَنَ[n[ـٰ]جَوْ[s[اْ] بِ[h:219[ٱ]لْبِرِّ وَ[h:3365[ٱ][l[ل]تَّ[q:3365[قْ]وَىٰ‌ۖ وَ[h:1018[ٱ]تَّقُو[s[اْ] [h:1019[ٱ]للَّهَ [h:2537[ٱ]لَّذ[o[ِىٓ] إِلَيْهِ تُحْشَر[p[ُو]نَ","translation_en":"O you who believe! when you confer together in private, do not give to each other counsel of sin and revolt and disobedience to the Messenger, and give to each other counsel of goodness and guarding (against evil); and be careful of (your duty to) Allah, to Whom you shall be gathered together.","translation_id":"Wahai orang-orang yang beriman! Apabila kamu mengadakan pembicaraan rahasia, janganlah kamu membicarakan perbuatan dosa, permusuhan dan durhaka kepada Rasul. Tetapi bicarakanlah tentang perbuatan kebajikan dan takwa. Dan bertakwalah kepada Allah yang kepada-Nya kamu akan dikumpulkan kembali.","hasanah_per_verse":1050},{"text_madani":"إِنَّمَا النَّجْوَىٰ مِنَ الشَّيْطَانِ لِيَحْزُنَ الَّذِينَ آمَنُوا وَلَيْسَ بِضَارِّهِمْ شَيْئًا إِلَّا بِإِذْنِ اللَّهِ ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ","text_tajweed":"إِ[g[نّ]َمَا [h:13405[ٱ][l[ل][g[نّ]َ[q:8519[جْ]وَىٰ مِنَ [h:1870[ٱ][l[ل]شَّيْطَ[n[ـٰ]نِ لِيَحْزُنَ [h:13406[ٱ]لَّذِينَ ءَامَنُو[s[اْ] وَلَيْسَ بِض[m[َا]ٓرِّهِمْ شَيْــًٔا إِلَّا بِإِذْنِ [h:509[ٱ]للَّهِ‌ۚ وَعَلَى [h:2207[ٱ]للَّهِ فَلْيَتَوَكَّلِ [h:2208[ٱ]لْمُؤْمِن[p[ُو]نَ","translation_en":"Secret counsels are only (the work) of the Shaitan that he may cause to grieve those who believe, and he cannot hurt them in the least except with Allah's permission, and on Allah let the believers rely.","translation_id":"Sesungguhnya pembicaraan rahasia itu termasuk (perbuatan) setan, agar orang-orang yang beriman itu bersedih hati, sedang (pembicaraan) itu tidaklah memberi bencana sedikit pun kepada mereka, kecuali dengan izin Allah. Dan kepada Allah hendaknya orang-orang yang beriman bertawakal.","hasanah_per_verse":820},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قِيلَ لَكُمْ تَفَسَّحُوا فِي الْمَجَالِسِ فَافْسَحُوا يَفْسَحِ اللَّهُ لَكُمْ ۖ وَإِذَا قِيلَ انشُزُوا فَانشُزُوا يَرْفَعِ اللَّهُ الَّذِينَ آمَنُوا مِنكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِذَا قِيلَ لَكُمْ تَفَسَّحُو[s[اْ] فِى [h:13407[ٱ]لْمَجَ[n[ـٰ]لِسِ فَ[h:13408[ٱ]فْسَحُو[s[اْ] يَفْسَحِ [h:13409[ٱ]للَّهُ لَكُمْ‌ۖ وَإِذَا قِيلَ [h:13410[ٱ][f:13411[نش]ُزُو[s[اْ] فَ[h:13412[ٱ][f:13412[نش]ُزُو[s[اْ] يَرْفَعِ [h:13413[ٱ]للَّهُ [h:2273[ٱ]لَّذِينَ ءَامَنُو[s[اْ] مِ[f:344[نك]ُمْ وَ[h:37[ٱ]لَّذِينَ أُوتُو[s[اْ] [h:7379[ٱ]لْعِلْمَ دَرَجَ[n[ـٰ][a:13414[تٍ‌ۚ و]َ[h:72[ٱ]للَّهُ بِمَا تَعْمَلُونَ خَب[p[ِي]رٌ","translation_en":"O you who believe! when it is said to you, Make room in (your) assemblies, then make ample room, Allah will give you ample, and when it is said: Rise up, then rise up. Allah will exalt those of you who believe, and those who are given knowledge, in high degrees; and Allah is Aware of what you do.","translation_id":"Wahai orang-orang yang beriman! Apabila dikatakan kepadamu, “Berilah kelapangan di dalam majelis-majelis,” maka lapangkanlah, niscaya Allah akan memberi kelapangan untukmu. Dan apabila dikatakan, “Berdirilah kamu,” maka berdirilah, niscaya Allah akan mengangkat (derajat) orang-orang yang beriman di antaramu dan orang-orang yang diberi ilmu beberapa derajat. Dan Allah Mahateliti apa yang kamu kerjakan.","hasanah_per_verse":1390},{"text_madani":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نَاجَيْتُمُ الرَّسُولَ فَقَدِّمُوا بَيْنَ يَدَيْ نَجْوَاكُمْ صَدَقَةً ۚ ذَٰلِكَ خَيْرٌ لَّكُمْ وَأَطْهَرُ ۚ فَإِن لَّمْ تَجِدُوا فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ","text_tajweed":"يَ[o[ـٰٓ]أَيُّهَا [h:541[ٱ]لَّذِينَ ءَامَن[o[ُوٓ][s[اْ] إِذَا نَ[n[ـٰ]جَيْتُمُ [h:13415[ٱ][l[ل]رَّسُولَ فَقَدِّمُو[s[اْ] بَيْنَ يَدَىْ نَ[q:13416[جْ]وَ[n[ٮٰ]كُمْ صَدَقَ[f:13417[ةً‌ۚ ذ][n[َٲ]لِكَ خَيْ[u:263[رٌ ل]َّكُمْ وَأَ[q:1307[طْ]هَرُ‌ۚ فَإ[u:110[ِن ل]َّمْ تَجِدُو[s[اْ] فَإِ[g[نّ]َ [h:513[ٱ]للَّهَ غَفُو[u:890[رٌ ر]َّح[p[ِي]مٌ","translation_en":"O you who believe! when you consult the Messenger, then offer something in charity before your consultation; that is better for you and purer; but if you do not find, then surely Allah is Forgiving, Merciful.","translation_id":"Wahai orang-orang yang beriman! Apabila kamu mengadakan pembicaraan khusus dengan Rasul, hendaklah kamu mengeluarkan sedekah (kepada orang miskin) sebelum (melakukan) pembicaraan itu. Yang demikian itu lebih baik bagimu dan lebih bersih. Tetapi jika kamu tidak memperoleh (yang akan disedekahkan) maka sungguh, Allah Maha Pengampun, Maha Penyayang.","hasanah_per_verse":920},{"text_madani":"أَأَشْفَقْتُمْ أَن تُقَدِّمُوا بَيْنَ يَدَيْ نَجْوَاكُمْ صَدَقَاتٍ ۚ فَإِذْ لَمْ تَفْعَلُوا وَتَابَ اللَّهُ عَلَيْكُمْ فَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَطِيعُوا اللَّهَ وَرَسُولَهُ ۚ وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ","text_tajweed":"ءَأَشْفَ[q:13418[قْ]تُمْ أَ[f:13419[ن ت]ُقَدِّمُو[s[اْ] بَيْنَ يَدَىْ نَ[q:13416[جْ]وَ[n[ٮٰ]كُمْ صَدَقَ[n[ـٰ][f:13420[تٍ‌ۚ ف]َإِذْ لَمْ تَفْعَلُو[s[اْ] وَتَابَ [h:13421[ٱ]للَّهُ عَلَيْكُمْ فَأَقِيمُو[s[اْ] [h:3095[ٱ][l[ل]صَّلَ[s[و][n[ٲ]ةَ وَءَاتُو[s[اْ] [h:215[ٱ][l[ل]زَّكَ[s[و][n[ٲ]ةَ وَأَطِيعُو[s[اْ] [h:2238[ٱ]للَّهَ وَرَسُولَهُ[n[ۥ]‌ۚ وَ[h:72[ٱ]للَّهُ خَبِي[i:2335[رُۢ ب]ِمَا تَعْمَل[p[ُو]نَ","translation_en":"Do you fear that you will not (be able to) give in charity before your consultation? So when you do not do it and Allah has turned to you (mercifully), then keep up prayer and pay the poor-rate and obey Allah and His Messenger; and Allah is Aware of what you do.","translation_id":"Apakah kamu takut akan (menjadi miskin) karena kamu memberikan sedekah sebelum (melakukan) pembicaraan dengan Rasul? Tetapi jika kamu tidak melakukannya dan Allah telah memberi ampun kepadamu, maka laksanakanlah shalat, dan tunaikanlah zakat serta taatlah kepada Allah dan Rasul-Nya! Dan Allah Mahateliti terhadap apa yang kamu kerjakan.","hasanah_per_verse":1150},{"text_madani":"أَلَمْ تَرَ إِلَى الَّذِينَ تَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِم مَّا هُم مِّنكُمْ وَلَا مِنْهُمْ وَيَحْلِفُونَ عَلَى الْكَذِبِ وَهُمْ يَعْلَمُونَ","text_tajweed":"۞ أَلَمْ تَرَ إِلَى [h:1372[ٱ]لَّذِينَ تَوَلَّوْ[s[اْ] قَوْمًا غَضِبَ [h:13422[ٱ]للَّهُ عَلَيْه[w:3946[ِم م]َّا ه[w:5658[ُم م]ِّ[f:344[نك]ُمْ وَلَا مِنْهُمْ وَيَحْلِفُونَ عَلَى [h:13423[ٱ]لْكَذِبِ وَهُمْ يَعْلَم[p[ُو]نَ","translation_en":"Have you not seen those who befriend a people with whom Allah is wroth? They are neither of you nor of them, and they swear falsely while they know.","translation_id":"Tidakkah engkau perhatikan orang-orang (munafik) yang menjadikan suatu kaum yang telah dimurkai Allah sebagai sahabat? Orang-orang itu bukan dari (kaum) kamu dan bukan dari (kaum) mereka. Dan mereka bersumpah atas kebohongan, sedang mereka mengetahuinya.","hasanah_per_verse":730},{"text_madani":"أَعَدَّ اللَّهُ لَهُمْ عَذَابًا شَدِيدًا ۖ إِنَّهُمْ سَاءَ مَا كَانُوا يَعْمَلُونَ","text_tajweed":"أَعَدَّ [h:5775[ٱ]للَّهُ لَهُمْ عَذَا[f:1966[بًا ش]َدِيدًا‌ۖ إِ[g[نّ]َهُمْ س[o[َا]ٓءَ مَا كَانُو[s[اْ] يَعْمَل[p[ُو]نَ","translation_en":"Allah has prepared for them a severe punishment; surely what they do is evil.","translation_id":"Allah telah menyediakan azab yang sangat keras bagi mereka. Sungguh, betapa buruknya apa yang telah mereka kerjakan.","hasanah_per_verse":400},{"text_madani":"اتَّخَذُوا أَيْمَانَهُمْ جُنَّةً فَصَدُّوا عَن سَبِيلِ اللَّهِ فَلَهُمْ عَذَابٌ مُّهِينٌ","text_tajweed":"ٱتَّخَذ[o[ُوٓ][s[اْ] أَيْمَ[n[ـٰ]نَهُمْ جُ[g[نّ]َ[f:13424[ةً ف]َصَدُّو[s[اْ] عَ[f:1203[ن س]َبِيلِ [h:788[ٱ]للَّهِ فَلَهُمْ عَذَا[a:478[بٌ م]ُّه[p[ِي]نٌ","translation_en":"They make their oaths to serve as a cover so they turn away from Allah's way; therefore they shall have an abasing chastisement.","translation_id":"Mereka menjadikan sumpah-sumpah mereka sebagai perisai, lalu mereka menghalang-halangi (manusia) dari jalan Allah; maka bagi mereka azab yang menghinakan.","hasanah_per_verse":430},{"text_madani":"لَّن تُغْنِيَ عَنْهُمْ أَمْوَالُهُمْ وَلَا أَوْلَادُهُم مِّنَ اللَّهِ شَيْئًا ۚ أُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ","text_tajweed":"لَّ[f:1752[ن ت]ُغْنِىَ عَنْهُمْ أَمْو[n[َٲ]لُهُمْ وَل[o[َآ] أَوْلَ[n[ـٰ]دُه[w:1753[ُم م]ِّنَ [h:321[ٱ]للَّهِ شَيْــًٔا‌ۚ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ أَصْحَ[n[ـٰ]بُ [h:201[ٱ][l[ل][g[نّ]َارِ‌ۖ هُمْ فِيهَا خَ[n[ـٰ]لِد[p[ُو]نَ","translation_en":"Neither their wealth nor their children shall avail them aught against Allah; they are the inmates of the fire, therein they shall abide.","translation_id":"Harta benda dan anak-anak mereka tidak berguna sedikit pun (untuk menolong) mereka dari azab Allah. Mereka itulah penghuni neraka, mereka kekal di dalamnya.","hasanah_per_verse":640},{"text_madani":"يَوْمَ يَبْعَثُهُمُ اللَّهُ جَمِيعًا فَيَحْلِفُونَ لَهُ كَمَا يَحْلِفُونَ لَكُمْ ۖ وَيَحْسَبُونَ أَنَّهُمْ عَلَىٰ شَيْءٍ ۚ أَلَا إِنَّهُمْ هُمُ الْكَاذِبُونَ","text_tajweed":"يَوْمَ يَ[q:4022[بْ]عَثُهُمُ [h:4023[ٱ]للَّهُ جَمِي[f:13425[عًا ف]َيَحْلِفُونَ لَهُ[n[ۥ] كَمَا يَحْلِفُونَ لَكُمْ‌ۖ وَيَحْسَبُونَ أَ[g[نّ]َهُمْ عَلَىٰ شَىْءٍ‌ۚ أَل[o[َآ] إِ[g[نّ]َهُمْ هُمُ [h:7594[ٱ]لْكَ[n[ـٰ]ذِب[p[ُو]نَ","translation_en":"On the day that Allah will raise them up all, then they will swear to Him as they swear to you, and they think that they have something; now surely they are the liars.","translation_id":"(Ingatlah) pada hari (ketika) mereka semua dibangkitkan Allah, lalu mereka bersumpah kepada-Nya (bahwa mereka bukan orang musyrik) sebagaimana mereka bersumpah kepadamu; dan mereka menyangka bahwa mereka akan memperoleh sesuatu (manfaat). Ketahuilah, bahwa mereka orang-orang pendusta.","hasanah_per_verse":730},{"text_madani":"اسْتَحْوَذَ عَلَيْهِمُ الشَّيْطَانُ فَأَنسَاهُمْ ذِكْرَ اللَّهِ ۚ أُولَٰئِكَ حِزْبُ الشَّيْطَانِ ۚ أَلَا إِنَّ حِزْبَ الشَّيْطَانِ هُمُ الْخَاسِرُونَ","text_tajweed":"ٱسْتَحْوَذَ عَلَيْهِمُ [h:13426[ٱ][l[ل]شَّيْطَ[n[ـٰ]نُ فَأَ[f:13427[نس]َ[n[ـٰ]هُمْ ذِكْرَ [h:13428[ٱ]للَّهِ‌ۚ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ حِزْبُ [h:13429[ٱ][l[ل]شَّيْطَ[n[ـٰ]نِ‌ۚ أَل[o[َآ] إِ[g[نّ]َ حِزْبَ [h:13430[ٱ][l[ل]شَّيْطَ[n[ـٰ]نِ هُمُ [h:150[ٱ]لْخَ[n[ـٰ]سِر[p[ُو]نَ","translation_en":"The Shaitan has gained the mastery over them, so he has made them forget the remembrance of Allah; they are the Shaitan's party; now surely the Shaitan's party are the losers.","translation_id":"Setan telah menguasai mereka, lalu menjadikan mereka lupa mengingat Allah; mereka itulah golongan setan. Ketahuilah, bahwa golongan setan itulah golongan yang rugi.","hasanah_per_verse":720},{"text_madani":"إِنَّ الَّذِينَ يُحَادُّونَ اللَّهَ وَرَسُولَهُ أُولَٰئِكَ فِي الْأَذَلِّينَ","text_tajweed":"إِ[g[نّ]َ [h:24[ٱ]لَّذِينَ يُح[m[َا]ٓدُّونَ [h:13395[ٱ]للَّهَ وَرَسُولَهُ[o[ۥٓ] أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ فِى [h:13431[ٱ]لْأَذَلّ[p[ِي]نَ","translation_en":"Surely (as for) those who are in opposition to Allah and His Messenger; they shall be among the most abased.","translation_id":"Sesungguhnya orang-orang yang menentang Allah dan Rasul-Nya, mereka termasuk orang-orang yang sangat hina.","hasanah_per_verse":370},{"text_madani":"كَتَبَ اللَّهُ لَأَغْلِبَنَّ أَنَا وَرُسُلِي ۚ إِنَّ اللَّهَ قَوِيٌّ عَزِيزٌ","text_tajweed":"كَتَبَ [h:989[ٱ]للَّهُ لَأَغْلِبَ[g[نّ]َ أَنَا۟ وَرُسُل[o[ِىٓ‌ۚ] إِ[g[نّ]َ [h:80[ٱ]للَّهَ قَوِىٌّ عَز[p[ِي]زٌ","translation_en":"Allah has written down: I will most certainly prevail, I and My messengers; surely Allah is Strong, Mighty.","translation_id":"Allah telah menetapkan, “Aku dan rasul-rasul-Ku pasti menang.” Sungguh, Allah Mahakuat, Mahaperkasa.","hasanah_per_verse":340},{"text_madani":"لَّا تَجِدُ قَوْمًا يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ يُوَادُّونَ مَنْ حَادَّ اللَّهَ وَرَسُولَهُ وَلَوْ كَانُوا آبَاءَهُمْ أَوْ أَبْنَاءَهُمْ أَوْ إِخْوَانَهُمْ أَوْ عَشِيرَتَهُمْ ۚ أُولَٰئِكَ كَتَبَ فِي قُلُوبِهِمُ الْإِيمَانَ وَأَيَّدَهُم بِرُوحٍ مِّنْهُ ۖ وَيُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ۚ أُولَٰئِكَ حِزْبُ اللَّهِ ۚ أَلَا إِنَّ حِزْبَ اللَّهِ هُمُ الْمُفْلِحُونَ","text_tajweed":"لَّا تَجِدُ قَوْ[a:13432[مًا ي]ُؤْمِنُونَ بِ[h:32[ٱ]للَّهِ وَ[h:328[ٱ]لْيَوْمِ [h:329[ٱ]لْأَخِرِ يُو[m[َا]ٓدُّونَ مَنْ ح[m[َا]ٓدَّ [h:13433[ٱ]للَّهَ وَرَسُولَهُ[n[ۥ] وَلَوْ كَان[o[ُوٓ][s[اْ] ءَاب[o[َا]ٓءَهُمْ أَوْ أَ[q:767[بْ]ن[o[َا]ٓءَهُمْ أَوْ إِخْو[n[َٲ]نَهُمْ أَوْ عَشِيرَتَهُمْ‌ۚ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ كَتَبَ فِى قُلُوبِهِمُ [h:13434[ٱ]لْإِيمَ[n[ـٰ]نَ وَأَيَّدَه[c:13435[ُم ب]ِرُو[a:13436[حٍ م]ِّنْهُ‌ۖ وَيُ[q:13437[دْ]خِلُهُمْ جَ[g[نّ]َ[n[ـٰ][f:119[تٍ ت]َ[q:120[جْ]رِى مِ[f:121[ن ت]َحْتِهَا [h:122[ٱ]لْأَنْهَ[n[ـٰ]رُ خَ[n[ـٰ]لِدِينَ فِيهَا‌ۚ رَضِىَ [h:3910[ٱ]للَّهُ عَنْهُمْ وَرَضُو[s[اْ] عَنْهُ‌ۚ أُ[s[وْ]لَ[o[ـٰٓ]ئِكَ حِزْبُ [h:13438[ٱ]للَّهِ‌ۚ أَل[o[َآ] إِ[g[نّ]َ حِزْبَ [h:3642[ٱ]للَّهِ هُمُ [h:23[ٱ]لْمُفْلِح[p[ُو]نَ","translation_en":"You shall not find a people who believe in Allah and the latter day befriending those who act in opposition to Allah and His Messenger, even though they were their (own) fathers, or their sons, or their brothers, or their kinsfolk; these are they into whose hearts He has impressed faith, and whom He has strengthened with an inspiration from Him: and He will cause them to enter gardens beneath which rivers flow, abiding therein; Allah is well-pleased with them and they are well-pleased with Him these are Allah's party: now surely the party of Allah are the successful ones.","translation_id":"Engkau (Muhammad) tidak akan mendapatkan suatu kaum yang beriman kepada Allah dan hari akhirat saling berkasih sayang dengan orang-orang yang menentang Allah dan Rasul-Nya, sekalipun orang-orang itu bapaknya, anaknya, saudaranya atau keluarganya. Mereka itulah orang-orang yang dalam hatinya telah ditanamkan Allah keimanan dan Allah telah menguatkan mereka dengan pertolongan yang datang dari Dia. Lalu dimasukkan-Nya mereka ke dalam surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya. Allah ridha terhadap mereka dan mereka pun merasa puas terhadap (limpahan rahmat)-Nya. Merekalah golongan Allah. Ingatlah, sesungguhnya golongan Allah itulah yang beruntung.","hasanah_per_verse":2210}]}
