{"verses":[{"id":3564,"verse_key":"33:31","text_indopak":"وَمَنۡ يَّقۡنُتۡ مِنۡكُنَّ لِلّٰهِ وَرَسُوۡلِهٖ وَتَعۡمَلۡ صَالِحًـا نُّؤۡتِهَـآ اَجۡرَهَا مَرَّتَيۡنِۙ وَاَعۡتَدۡنَا لَهَا رِزۡقًا كَرِيۡمًا‏"},{"id":3565,"verse_key":"33:32","text_indopak":"يٰنِسَآءَ النَّبِىِّ لَسۡتُنَّ كَاَحَدٍ مِّنَ النِّسَآءِ اِنِ اتَّقَيۡتُنَّ فَلَا تَخۡضَعۡنَ بِالۡقَوۡلِ فَيَـطۡمَعَ الَّذِىۡ فِىۡ قَلۡبِهٖ مَرَضٌ وَّقُلۡنَ قَوۡلًا مَّعۡرُوۡفًا ۚ‏"},{"id":3566,"verse_key":"33:33","text_indopak":"وَقَرۡنَ فِىۡ بُيُوۡتِكُنَّ وَلَا تَبَـرَّجۡنَ تَبَرُّجَ الۡجَاهِلِيَّةِ الۡاُوۡلٰى وَاَقِمۡنَ الصَّلٰوةَ وَاٰتِيۡنَ الزَّكٰوةَ وَاَطِعۡنَ اللّٰهَ وَرَسُوۡلَهٗ ؕ اِنَّمَا يُرِيۡدُ اللّٰهُ لِيُذۡهِبَ عَنۡكُمُ الرِّجۡسَ اَهۡلَ الۡبَيۡتِ وَيُطَهِّرَكُمۡ تَطۡهِيۡرًا ۚ‏"},{"id":3567,"verse_key":"33:34","text_indopak":"وَاذۡكُرۡنَ مَا يُتۡلٰى فِىۡ بُيُوۡتِكُنَّ مِنۡ اٰيٰتِ اللّٰهِ وَالۡحِكۡمَةِؕ اِنَّ اللّٰهَ كَانَ لَطِيۡفًا خَبِيۡرًا‏"},{"id":3568,"verse_key":"33:35","text_indopak":"اِنَّ الۡمُسۡلِمِيۡنَ وَالۡمُسۡلِمٰتِ وَالۡمُؤۡمِنِيۡنَ وَالۡمُؤۡمِنٰتِ وَالۡقٰنِتِيۡنَ وَالۡقٰنِتٰتِ وَالصّٰدِقِيۡنَ وَالصّٰدِقٰتِ وَالصّٰبِرِيۡنَ وَالصّٰبِرٰتِ وَالۡخٰشِعِيۡنَ وَالۡخٰشِعٰتِ وَالۡمُتَصَدِّقِيۡنَ وَ الۡمُتَصَدِّقٰتِ وَالصَّآٮِٕمِيۡنَ وَالصّٰٓٮِٕمٰتِ وَالۡحٰفِظِيۡنَ فُرُوۡجَهُمۡ وَالۡحٰـفِظٰتِ وَالذّٰكِرِيۡنَ اللّٰهَ كَثِيۡرًا وَّ الذّٰكِرٰتِ ۙ اَعَدَّ اللّٰهُ لَهُمۡ مَّغۡفِرَةً وَّاَجۡرًا عَظِيۡمًا‏"},{"id":3569,"verse_key":"33:36","text_indopak":"وَمَا كَانَ لِمُؤۡمِنٍ وَّلَا مُؤۡمِنَةٍ اِذَا قَضَى اللّٰهُ وَرَسُوۡلُهٗۤ اَمۡرًا اَنۡ يَّكُوۡنَ لَهُمُ الۡخِيَرَةُ مِنۡ اَمۡرِهِمۡ ؕ وَمَنۡ يَّعۡصِ اللّٰهَ وَرَسُوۡلَهٗ فَقَدۡ ضَلَّ ضَلٰلًا مُّبِيۡنًا‏"},{"id":3570,"verse_key":"33:37","text_indopak":"وَاِذۡ تَقُوۡلُ لِلَّذِىۡۤ اَنۡعَمَ اللّٰهُ عَلَيۡهِ وَاَنۡعَمۡتَ عَلَيۡهِ اَمۡسِكۡ عَلَيۡكَ زَوۡجَكَ وَاتَّقِ اللّٰهَ وَتُخۡفِىۡ فِىۡ نَفۡسِكَ مَا اللّٰهُ مُبۡدِيۡهِ وَتَخۡشَى النَّاسَ ​ۚ وَاللّٰهُ اَحَقُّ اَنۡ تَخۡشٰٮهُ ؕ فَلَمَّا قَضٰى زَيۡدٌ مِّنۡهَا وَطَرًا زَوَّجۡنٰكَهَا لِكَىۡ لَا يَكُوۡنَ عَلَى الۡمُؤۡمِنِيۡنَ حَرَجٌ فِىۡۤ اَزۡوَاجِ اَدۡعِيَآٮِٕهِمۡ اِذَا قَضَوۡا مِنۡهُنَّ وَطَرًا ؕ وَكَانَ اَمۡرُ اللّٰهِ مَفۡعُوۡلًا‏"},{"id":3571,"verse_key":"33:38","text_indopak":"مَا كَانَ عَلَى النَّبِىِّ مِنۡ حَرَجٍ فِيۡمَا فَرَضَ اللّٰهُ لهٗ ؕ سُنَّةَ اللّٰهِ فِى الَّذِيۡنَ خَلَوۡا مِنۡ قَبۡلُ ؕ وَكَانَ اَمۡرُ اللّٰهِ قَدَرًا مَّقۡدُوۡرَا  ۙ‏"},{"id":3572,"verse_key":"33:39","text_indopak":"اۨلَّذِيۡنَ يُبَـلِّـغُوۡنَ رِسٰلٰتِ اللّٰهِ وَيَخۡشَوۡنَهٗ وَلَا يَخۡشَوۡنَ اَحَدًا اِلَّا اللّٰهَ ؕ وَكَفٰى بِاللّٰهِ حَسِيۡبًا‏"},{"id":3573,"verse_key":"33:40","text_indopak":"مَا كَانَ مُحَمَّدٌ اَبَآ اَحَدٍ مِّنۡ رِّجَالِكُمۡ وَلٰـكِنۡ رَّسُوۡلَ اللّٰهِ وَخَاتَمَ النَّبِيّٖنَ ؕ وَكَانَ اللّٰهُ بِكُلِّ شَىۡءٍ عَلِيۡمًا‏"},{"id":3574,"verse_key":"33:41","text_indopak":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوا اذۡكُرُوۡا اللّٰهَ ذِكۡرًا كَثِيۡرًا ۙ‏"},{"id":3575,"verse_key":"33:42","text_indopak":"وَّ سَبِّحُوۡهُ بُكۡرَةً وَّاَصِيۡلًا‏"},{"id":3576,"verse_key":"33:43","text_indopak":"هُوَ الَّذِىۡ يُصَلِّىۡ عَلَيۡكُمۡ وَمَلٰٓٮِٕكَتُهٗ لِيُخۡرِجَكُمۡ مِّنَ الظُّلُمٰتِ اِلَى النُّوۡرِ ؕ وَكَانَ بِالۡمُؤۡمِنِيۡنَ رَحِيۡمًا‏"},{"id":3577,"verse_key":"33:44","text_indopak":"تَحِيَّتُهُمۡ يَوۡمَ يَلۡقَوۡنَهٗ سَلٰمٌ ۖۚ وَاَعَدَّ لَهُمۡ اَجۡرًا كَرِيۡمًا‏ ﻿﻿"},{"id":3578,"verse_key":"33:45","text_indopak":"يٰۤـاَيُّهَا النَّبِىُّ اِنَّاۤ اَرۡسَلۡنٰكَ شَاهِدًا وَّمُبَشِّرًا وَّنَذِيۡرًا ۙ‏"},{"id":3579,"verse_key":"33:46","text_indopak":"وَّدَاعِيًا اِلَى اللّٰهِ بِاِذۡنِهٖ وَسِرَاجًا مُّنِيۡرًا‏"},{"id":3580,"verse_key":"33:47","text_indopak":"وَبَشِّرِ الۡمُؤۡمِنِيۡنَ بِاَنَّ لَهُمۡ مِّنَ اللّٰهِ فَضۡلًا كَبِيۡرًا‏ ﻿﻿"},{"id":3581,"verse_key":"33:48","text_indopak":"وَلَا تُطِعِ الۡكٰفِرِيۡنَ وَالۡمُنٰفِقِيۡنَ وَدَعۡ اَذٰٮهُمۡ وَتَوَكَّلۡ عَلَى اللّٰهِ ؕ وَكَفٰى بِاللّٰهِ وَكِيۡلًا‏"},{"id":3582,"verse_key":"33:49","text_indopak":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِذَا نَكَحۡتُمُ الۡمُؤۡمِنٰتِ ثُمَّ طَلَّقۡتُمُوۡهُنَّ مِنۡ قَبۡلِ اَنۡ تَمَسُّوۡهُنَّ فَمَا لَـكُمۡ عَلَيۡهِنَّ مِنۡ عِدَّةٍ تَعۡتَدُّوۡنَهَا ۚ فَمَتِّعُوۡهُنَّ وَسَرِّحُوۡهُنَّ سَرَاحًا جَمِيۡلًا‏"},{"id":3583,"verse_key":"33:50","text_indopak":"يٰۤاَيُّهَا النَّبِىُّ اِنَّاۤ اَحۡلَلۡنَا لَـكَ اَزۡوَاجَكَ الّٰتِىۡۤ اٰتَيۡتَ اُجُوۡرَهُنَّ وَمَا مَلَـكَتۡ يَمِيۡنُكَ مِمَّاۤ اَفَآءَ اللّٰهُ عَلَيۡكَ وَبَنٰتِ عَمِّكَ وَبَنٰتِ عَمّٰتِكَ وَبَنٰتِ خَالِكَ وَبَنٰتِ خٰلٰتِكَ الّٰتِىۡ هَاجَرۡنَ مَعَكَ وَامۡرَاَةً مُّؤۡمِنَةً اِنۡ وَّهَبَتۡ نَفۡسَهَا لِلنَّبِىِّ اِنۡ اَرَادَ النَّبِىُّ اَنۡ يَّسۡتَـنۡكِحَهَا خَالِصَةً لَّـكَ مِنۡ دُوۡنِ الۡمُؤۡمِنِيۡنَ ؕ قَدۡ عَلِمۡنَا مَا فَرَضۡنَا عَلَيۡهِمۡ فِىۡۤ اَزۡوَاجِهِمۡ وَمَا مَلَـكَتۡ اَيۡمَانُهُمۡ لِكَيۡلَا يَكُوۡنَ عَلَيۡكَ حَرَجٌ ؕ وَكَانَ اللّٰهُ غَفُوۡرًا رَّحِيۡمًا‏"},{"id":3584,"verse_key":"33:51","text_indopak":"تُرۡجِىۡ مَنۡ تَشَآءُ مِنۡهُنَّ وَتُـــْٔوِىۡۤ اِلَيۡكَ مَنۡ تَشَآءُ ؕ وَمَنِ ابۡتَغَيۡتَ مِمَّنۡ عَزَلۡتَ فَلَا جُنَاحَ عَلَيۡكَ ؕ ذٰ لِكَ اَدۡنٰٓى اَنۡ تَقَرَّ اَعۡيُنُهُنَّ وَلَا يَحۡزَنَّ وَيَرۡضَيۡنَ بِمَاۤ اٰتَيۡتَهُنَّ كُلُّهُنَّ ؕ وَاللّٰهُ يَعۡلَمُ مَا فِىۡ قُلُوۡبِكُمۡ ؕ وَكَانَ اللّٰهُ عَلِيۡمًا حَلِيۡمًا‏"},{"id":3585,"verse_key":"33:52","text_indopak":"لَا يَحِلُّ لَـكَ النِّسَآءُ مِنۡۢ بَعۡدُ وَلَاۤ اَنۡ تَبَدَّلَ بِهِنَّ مِنۡ اَزۡوَاجٍ وَّلَوۡ اَعۡجَبَكَ حُسۡنُهُنَّ اِلَّا مَا مَلَـكَتۡ يَمِيۡنُكَ​ؕ وَكَانَ اللّٰهُ عَلٰى كُلِّ شَىۡءٍ رَّقِيۡبًا‏"},{"id":3586,"verse_key":"33:53","text_indopak":"يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَدۡخُلُوۡا بُيُوۡتَ النَّبِىِّ اِلَّاۤ اَنۡ يُّؤۡذَنَ لَـكُمۡ اِلٰى طَعَامٍ غَيۡرَ نٰظِرِيۡنَ اِنٰٮهُ وَلٰـكِنۡ اِذَا دُعِيۡتُمۡ فَادۡخُلُوۡا فَاِذَا طَعِمۡتُمۡ فَانْتَشِرُوۡا وَلَا مُسۡتَاۡنِسِيۡنَ لِحَـدِيۡثٍ ؕ اِنَّ ذٰلِكُمۡ كَانَ يُؤۡذِى النَّبِىَّ فَيَسۡتَحۡىٖ مِنۡكُمۡ وَاللّٰهُ لَا يَسۡتَحۡىٖ مِنَ الۡحَـقِّ ؕ وَاِذَا سَاَ لۡتُمُوۡهُنَّ مَتَاعًا فَسۡـَٔـــلُوۡهُنَّ مِنۡ وَّرَآءِ حِجَابٍ ؕ ذٰ لِكُمۡ اَطۡهَرُ لِقُلُوۡبِكُمۡ وَقُلُوۡبِهِنَّ ؕ وَمَا كَانَ لَـكُمۡ اَنۡ تُؤۡذُوۡا رَسُوۡلَ اللّٰهِ وَلَاۤ اَنۡ تَـنۡكِحُوۡۤا اَزۡوَاجَهٗ مِنۡۢ بَعۡدِهٖۤ اَبَدًا ؕ اِنَّ ذٰ لِكُمۡ كَانَ عِنۡدَ اللّٰهِ عَظِيۡمًا‏"},{"id":3587,"verse_key":"33:54","text_indopak":"اِنۡ تُبۡدُوۡا شَيۡـــًٔا اَوۡ تُخۡفُوۡهُ فَاِنَّ اللّٰهَ كَانَ بِكُلِّ شَىۡءٍ عَلِيۡمًا‏"},{"id":3588,"verse_key":"33:55","text_indopak":"لَا جُنَاحَ عَلَيۡهِنَّ فِىۡۤ اٰبَآٮِٕهِنَّ وَلَاۤ اَبۡنَآٮِٕهِنَّ وَلَاۤ اِخۡوَانِهِنَّ وَلَاۤ اَبۡنَآءِ اِخۡوَانِهِنَّ وَلَاۤ اَبۡنَآءِ اَخَوٰتِهِنَّ وَلَا نِسَآٮِٕهِنَّ وَلَا مَا مَلَـكَتۡ اَيۡمَانُهُنَّ ۚ وَاتَّقِيۡنَ اللّٰهَ ؕ اِنَّ اللّٰهَ كَانَ عَلٰى كُلِّ شَىۡءٍ شَهِيۡدًا‏"},{"id":3589,"verse_key":"33:56","text_indopak":"اِنَّ اللّٰهَ وَمَلٰٓٮِٕكَتَهٗ يُصَلُّوۡنَ عَلَى النَّبِىِّ ؕ يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا صَلُّوۡا عَلَيۡهِ وَسَلِّمُوۡا تَسۡلِيۡمًا‏"},{"id":3590,"verse_key":"33:57","text_indopak":"اِنَّ الَّذِيۡنَ يُؤۡذُوۡنَ اللّٰهَ وَرَسُوۡلَهٗ لَعَنَهُمُ اللّٰهُ فِى الدُّنۡيَا وَالۡاٰخِرَةِ وَاَعَدَّ لَهُمۡ عَذَابًا مُّهِيۡنًا‏"},{"id":3591,"verse_key":"33:58","text_indopak":"وَالَّذِيۡنَ يُؤۡذُوۡنَ الۡمُؤۡمِنِيۡنَ وَالۡمُؤۡمِنٰتِ بِغَيۡرِ مَا اكۡتَسَبُوۡا فَقَدِ احۡتَمَلُوۡا بُهۡتَانًا وَّاِثۡمًا مُّبِيۡنًا‏"},{"id":3592,"verse_key":"33:59","text_indopak":"يٰۤـاَيُّهَا النَّبِىُّ قُلْ لِّاَزۡوَاجِكَ وَبَنٰتِكَ وَنِسَآءِ الۡمُؤۡمِنِيۡنَ يُدۡنِيۡنَ عَلَيۡهِنَّ مِنۡ جَلَابِيۡبِهِنَّ ؕ ذٰ لِكَ اَدۡنٰٓى اَنۡ يُّعۡرَفۡنَ فَلَا يُؤۡذَيۡنَ ؕ وَكَانَ اللّٰهُ غَفُوۡرًا رَّحِيۡمًا‏"},{"id":3593,"verse_key":"33:60","text_indopak":"لَٮِٕنۡ لَّمۡ يَنۡتَهِ الۡمُنٰفِقُوۡنَ وَ الَّذِيۡنَ فِى قُلُوۡبِهِمۡ مَّرَضٌ وَّالۡمُرۡجِفُوۡنَ فِى الۡمَدِيۡنَةِ لَـنُغۡرِيَـنَّكَ بِهِمۡ ثُمَّ لَا يُجَاوِرُوۡنَكَ فِيۡهَاۤ اِلَّا قَلِيۡلًا ۛۚ  ۖ‏"},{"id":3594,"verse_key":"33:61","text_indopak":"مَّلۡـعُوۡنِيۡنَ ​ۛۚ اَيۡنَمَا ثُقِفُوۡۤا اُخِذُوۡا وَقُتِّلُوۡا تَقۡتِيۡلًا‏ ﻿﻿"},{"id":3595,"verse_key":"33:62","text_indopak":"سُنَّةَ اللّٰهِ فِى الَّذِيۡنَ خَلَوۡا مِنۡ قَبۡلُۚ وَلَنۡ تَجِدَ لِسُنَّةِ اللّٰهِ تَبۡدِيۡلًا‏"},{"id":3596,"verse_key":"33:63","text_indopak":"يَسۡـــَٔلُكَ النَّاسُ عَنِ السَّاعَةِؕ قُلۡ اِنَّمَا عِلۡمُهَا عِنۡدَ اللّٰهِؕ وَمَا يُدۡرِيۡكَ لَعَلَّ السَّاعَةَ تَكُوۡنُ قَرِيۡبًا‏"},{"id":3597,"verse_key":"33:64","text_indopak":"اِنَّ اللّٰهَ لَعَنَ الۡكٰفِرِيۡنَ وَاَعَدَّ لَهُمۡ سَعِيۡرًا ۙ‏"},{"id":3598,"verse_key":"33:65","text_indopak":"خٰلِدِيۡنَ فِيۡهَاۤ اَبَدًا ۚ لَا يَجِدُوۡنَ وَلِيًّا وَّلَا نَصِيۡرًا ۚ‏ ﻿﻿"},{"id":3599,"verse_key":"33:66","text_indopak":"يَوۡمَ تُقَلَّبُ وُجُوۡهُهُمۡ فِى النَّارِ يَقُوۡلُوۡنَ يٰلَيۡتَـنَاۤ اَطَعۡنَا اللّٰهَ وَاَطَعۡنَا الرَّسُوۡلَا‏"},{"id":3600,"verse_key":"33:67","text_indopak":"وَقَالُوۡا رَبَّنَاۤ اِنَّاۤ اَطَعۡنَا سَادَتَنَا وَكُبَرَآءَنَا فَاَضَلُّوۡنَا السَّبِيۡلَا‏"},{"id":3601,"verse_key":"33:68","text_indopak":"رَبَّنَاۤ اٰتِهِمۡ ضِعۡفَيۡنِ مِنَ الۡعَذَابِ وَالۡعَنۡهُمۡ لَعۡنًا كَبِيۡرًا‏ ﻿﻿"},{"id":3602,"verse_key":"33:69","text_indopak":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَكُوۡنُوۡا كَالَّذِيۡنَ اٰذَوۡا مُوۡسٰى فَبَـرَّاَهُ اللّٰهُ مِمَّا قَالُوۡا ؕ وَكَانَ عِنۡدَ اللّٰهِ وَجِيۡهًا ؕ‏"},{"id":3603,"verse_key":"33:70","text_indopak":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَقُوۡلُوۡا قَوۡلًا سَدِيۡدًا ۙ‏"},{"id":3604,"verse_key":"33:71","text_indopak":"يُّصۡلِحۡ لَـكُمۡ اَعۡمَالَـكُمۡ وَيَغۡفِرۡ لَـكُمۡ ذُنُوۡبَكُمۡؕ وَمَنۡ يُّطِعِ اللّٰهَ وَرَسُوۡلَهٗ فَقَدۡ فَازَ فَوۡزًا عَظِيۡمًا‏"},{"id":3605,"verse_key":"33:72","text_indopak":"اِنَّا عَرَضۡنَا الۡاَمَانَةَ عَلَى السَّمٰوٰتِ وَالۡاَرۡضِ وَالۡجِبَالِ فَاَبَيۡنَ اَنۡ يَّحۡمِلۡنَهَا وَاَشۡفَقۡنَ مِنۡهَا وَ حَمَلَهَا الۡاِنۡسَانُؕ اِنَّهٗ كَانَ ظَلُوۡمًا جَهُوۡلًا ۙ‏"},{"id":3606,"verse_key":"33:73","text_indopak":"لِّيُعَذِّبَ اللّٰهُ الۡمُنٰفِقِيۡنَ وَالۡمُنٰفِقٰتِ وَالۡمُشۡرِكِيۡنَ وَالۡمُشۡرِكٰتِ وَيَتُوۡبَ اللّٰهُ عَلَى الۡمُؤۡمِنِيۡنَ وَالۡمُؤۡمِنٰتِؕ وَكَانَ اللّٰهُ غَفُوۡرًا رَّحِيۡمًا‏"},{"id":3607,"verse_key":"34:1","text_indopak":"اَلۡحَمۡدُ لِلّٰهِ الَّذِىۡ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ وَلَـهُ الۡحَمۡدُ فِى الۡاٰخِرَةِ ؕ وَهُوَ الۡحَكِيۡمُ الۡخَبِيۡرُ‏"},{"id":3608,"verse_key":"34:2","text_indopak":"يَعۡلَمُ مَا يَلِجُ فِى الۡاَرۡضِ وَمَا يَخۡرُجُ مِنۡهَا وَمَا يَنۡزِلُ مِنَ السَّمَآءِ وَمَا يَعۡرُجُ فِيۡهَا ؕ وَهُوَ الرَّحِيۡمُ الۡغَفُوۡرُ‏"},{"id":3609,"verse_key":"34:3","text_indopak":"وَقَالَ الَّذِيۡنَ كَفَرُوۡا لَا تَاۡتِيۡنَا السَّاعَةُ ؕ قُلۡ بَلٰى وَرَبِّىۡ لَـتَاۡتِيَنَّكُمۡۙ عٰلِمِ الۡغَيۡبِ ۚ لَا يَعۡزُبُ عَنۡهُ مِثۡقَالُ ذَرَّةٍ فِى السَّمٰوٰتِ وَلَا فِى الۡاَرۡضِ وَلَاۤ اَصۡغَرُ مِنۡ ذٰ لِكَ وَلَاۤ اَكۡبَرُ اِلَّا فِىۡ كِتٰبٍ مُّبِيۡنٍۙ‏"},{"id":3610,"verse_key":"34:4","text_indopak":"لِّيَجۡزِىَ الَّذِيۡنَ اٰمَنُوا وَعَمِلُوۡا الصّٰلِحٰتِؕ اُولٰٓٮِٕكَ لَهُمۡ مَّغۡفِرَةٌ وَّرِزۡقٌ كَرِيۡمٌ‏"},{"id":3611,"verse_key":"34:5","text_indopak":"وَالَّذِيۡنَ سَعَوۡ فِىۡۤ اٰيٰتِنَا مُعٰجِزِيۡنَ اُولٰٓٮِٕكَ لَهُمۡ عَذَابٌ مِّنۡ رِّجۡزٍ اَلِيۡمٌ‏"},{"id":3612,"verse_key":"34:6","text_indopak":"وَيَرَى الَّذِيۡنَ اُوۡتُوا الۡعِلۡمَ الَّذِىۡۤ اُنۡزِلَ اِلَيۡكَ مِنۡ رَّبِّكَ هُوَ الۡحَـقَّ ۙ وَيَهۡدِىۡۤ اِلٰى صِرَاطِ الۡعَزِيۡزِ الۡحَمِيۡدِ‏"},{"id":3613,"verse_key":"34:7","text_indopak":"وَقَالَ الَّذِيۡنَ كَفَرُوۡا هَلۡ نَدُلُّكُمۡ عَلٰى رَجُلٍ يُّنَبِّئُكُمۡ اِذَا مُزِّقۡتُمۡ كُلَّ مُمَزَّقٍۙ اِنَّكُمۡ لَفِىۡ خَلۡقٍ جَدِيۡدٍۚ‏"},{"id":3614,"verse_key":"34:8","text_indopak":"اَ فۡتَـرٰى عَلَى اللّٰهِ كَذِبًا اَمۡ بِهٖ جِنَّةٌ  ؕ بَلِ الَّذِيۡنَ لَا يُؤۡمِنُوۡنَ بِالۡاٰخِرَةِ فِى الۡعَذَابِ وَالضَّلٰلِ الۡبَعِيۡدِ‏"},{"id":3615,"verse_key":"34:9","text_indopak":"اَفَلَمۡ يَرَوۡا اِلٰى مَا بَيۡنَ اَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡ مِّنَ السَّمَآءِ وَالۡاَرۡضِ ؕ اِنۡ نَّشَاۡ نَخۡسِفۡ بِهِمُ الۡاَرۡضَ اَوۡ نُسۡقِطۡ عَلَيۡهِمۡ كِسَفًا مِّنَ السَّمَآءِ ؕ اِنَّ فِىۡ ذٰ لِكَ لَاٰيَةً لِّكُلِّ عَبۡدٍ مُّنِيۡبٍ‏"},{"id":3616,"verse_key":"34:10","text_indopak":"وَلَقَدۡ اٰتَيۡنَا دَاوٗدَ مِنَّا فَضۡلًا ؕ يٰجِبَالُ اَوِّبِىۡ مَعَهٗ وَالطَّيۡرَ ۚ وَاَلَــنَّا لَـهُ الۡحَدِيۡدَ ۙ‏"},{"id":3617,"verse_key":"34:11","text_indopak":"اَنِ اعۡمَلۡ سٰبِغٰتٍ وَّقَدِّرۡ فِى السَّرۡدِ وَاعۡمَلُوۡا صَالِحًـا ؕ اِنِّىۡ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ‏"},{"id":3618,"verse_key":"34:12","text_indopak":"وَلِسُلَيۡمٰنَ الرِّيۡحَ غُدُوُّهَا شَهۡرٌ وَّرَوَاحُهَا شَهۡرٌۚ وَ اَسَلۡنَا لَهٗ عَيۡنَ الۡقِطۡرِؕ وَمِنَ الۡجِنِّ مَنۡ يَّعۡمَلُ بَيۡنَ يَدَيۡهِ بِاِذۡنِ رَبِّهِؕ وَمَنۡ يَّزِغۡ مِنۡهُمۡ عَنۡ اَمۡرِنَا نُذِقۡهُ مِنۡ عَذَابِ السَّعِيۡرِ‏"},{"id":3619,"verse_key":"34:13","text_indopak":"يَعۡمَلُوۡنَ لَهٗ مَا يَشَآءُ مِنۡ مَّحَارِيۡبَ وَتَمَاثِيۡلَ وَجِفَانٍ كَالۡجَـوَابِ وَقُدُوۡرٍ رّٰسِيٰتٍ ؕ اِعۡمَلُوۡۤا اٰلَ دَاوٗدَ شُكۡرًا ؕ وَقَلِيۡلٌ مِّنۡ عِبَادِىَ الشَّكُوۡرُ‏"},{"id":3620,"verse_key":"34:14","text_indopak":"فَلَمَّا قَضَيۡنَا عَلَيۡهِ الۡمَوۡتَ مَا دَلَّهُمۡ عَلٰى مَوۡتِهٖۤ اِلَّا دَآ بَّةُ الۡاَرۡضِ تَاۡ كُلُ مِنۡسَاَتَهُ ۚ فَلَمَّا خَرَّ تَبَيَّنَتِ الۡجِنُّ اَنۡ لَّوۡ كَانُوۡا يَعۡلَمُوۡنَ الۡغَيۡبَ مَا لَبِثُوۡا فِى الۡعَذَابِ الۡمُهِيۡنِ ؕ‏"},{"id":3621,"verse_key":"34:15","text_indopak":"لَقَدۡ كَانَ لِسَبَاٍ فِىۡ مَسۡكَنِهِمۡ اٰيَةٌ  ۚ جَنَّتٰنِ عَنۡ يَّمِيۡنٍ وَّشِمَالٍ ؕ  کُلُوۡا مِنۡ رِّزۡقِ رَبِّكُمۡ وَاشۡكُرُوۡا لَهٗ ؕ بَلۡدَةٌ طَيِّبَةٌ وَّرَبٌّ غَفُوۡرٌ‏‏"},{"id":3622,"verse_key":"34:16","text_indopak":"فَاَعۡرَضُوۡا فَاَرۡسَلۡنَا عَلَيۡهِمۡ سَيۡلَ الۡعَرِمِ وَبَدَّلۡنٰهُمۡ بِجَنَّتَيۡهِمۡ جَنَّتَيۡنِ ذَوَاتَىۡ اُكُلٍ خَمۡطٍ وَّاَثۡلٍ وَّشَىۡءٍ مِّنۡ سِدۡرٍ قَلِيۡلٍ‏"},{"id":3623,"verse_key":"34:17","text_indopak":"ذٰ لِكَ جَزَيۡنٰهُمۡ بِمَا كَفَرُوۡا ؕ وَهَلۡ نُـجٰزِىۡۤ اِلَّا الۡـكَفُوۡرَ‏ ﻿﻿"},{"id":3624,"verse_key":"34:18","text_indopak":"وَجَعَلۡنَا بَيۡنَهُمۡ وَبَيۡنَ الۡقُرَى الَّتِىۡ بٰرَكۡنَا فِيۡهَا قُرًى ظَاهِرَةً وَّقَدَّرۡنَا فِيۡهَا السَّيۡرَ ؕ سِيۡرُوۡا فِيۡهَا لَيَالِىَ وَاَيَّامًا اٰمِنِيۡنَ‏"},{"id":3625,"verse_key":"34:19","text_indopak":"فَقَالُوۡا رَبَّنَا بٰعِدۡ بَيۡنَ اَسۡفَارِنَا وَظَلَمُوۡۤا اَنۡفُسَهُمۡ فَجَعَلۡنٰهُمۡ اَحَادِيۡثَ وَمَزَّقۡنٰهُمۡ كُلَّ مُمَزَّقٍ ؕ اِنَّ فِىۡ ذٰ لِكَ لَاٰيٰتٍ لّـِكُلِّ صَبَّارٍ شَكُوۡرٍ‏"},{"id":3626,"verse_key":"34:20","text_indopak":"وَلَقَدۡ صَدَّقَ عَلَيۡهِمۡ اِبۡلِيۡسُ ظَنَّهٗ فَاتَّبَعُوۡهُ اِلَّا فَرِيۡقًا مِّنَ الۡمُؤۡمِنِيۡنَ‏"},{"id":3627,"verse_key":"34:21","text_indopak":"وَمَا كَانَ لَهٗ عَلَيۡهِمۡ مِّنۡ سُلۡطٰنٍ اِلَّا لِنَعۡلَمَ مَنۡ يُّـؤۡمِنُ بِالۡاٰخِرَةِ مِمَّنۡ هُوَ مِنۡهَا فِىۡ شَكٍّ ؕ وَ رَبُّكَ عَلٰى كُلِّ شَىۡءٍ حَفِيۡظٌ‏ ﻿﻿"},{"id":3628,"verse_key":"34:22","text_indopak":"قُلِ ادۡعُوا الَّذِيۡنَ زَعَمۡتُمۡ مِّنۡ دُوۡنِ اللّٰهِۚ لَا يَمۡلِكُوۡنَ مِثۡقَالَ ذَرَّةٍ فِى السَّمٰوٰتِ وَلَا فِى الۡاَرۡضِ وَمَا لَهُمۡ فِيۡهِمَا مِنۡ شِرۡكٍ وَّمَا لَهٗ مِنۡهُمۡ مِّنۡ ظَهِيۡرٍ‏"},{"id":3629,"verse_key":"34:23","text_indopak":"وَلَا تَنۡفَعُ الشَّفَاعَةُ عِنۡدَهٗۤ اِلَّا لِمَنۡ اَذِنَ لَهٗ ؕ حَتّٰٓى اِذَا فُزِّعَ عَنۡ قُلُوۡبِهِمۡ قَالُوۡا مَاذَا ۙ قَالَ رَبُّكُمۡ ؕ قَالُوا الۡحَـقَّ ۚ وَهُوَ الۡعَلِىُّ الۡكَبِيۡرُ‏"},{"id":3630,"verse_key":"34:24","text_indopak":"قُلۡ مَنۡ يَّرۡزُقُكُمۡ مِّنَ السَّمٰوٰتِ وَالۡاَرۡضِؕ قُلِ اللّٰهُ ۙ وَ اِنَّاۤ اَوۡ اِيَّاكُمۡ لَعَلٰى هُدًى اَوۡ فِىۡ ضَلٰلٍ مُّبِيۡنٍ‏"},{"id":3631,"verse_key":"34:25","text_indopak":"قُلْ لَّا تُسۡـــَٔلُوۡنَ عَمَّاۤ اَجۡرَمۡنَا وَلَا نُسۡــَٔـلُ عَمَّا تَعۡمَلُوۡنَ‏ ﻿﻿"},{"id":3632,"verse_key":"34:26","text_indopak":"قُلۡ يَجۡمَعُ بَيۡنَـنَا رَبُّنَا ثُمَّ يَفۡتَحُ بَيۡنَـنَا بِالۡحَـقِّ ؕ وَهُوَ الۡـفَتَّاحُ الۡعَلِيۡمُ‏"},{"id":3633,"verse_key":"34:27","text_indopak":"قُلۡ اَرُوۡنِىَ الَّذِيۡنَ اَ لۡحَـقۡتُمۡ بِهٖ شُرَكَآءَ كَلَّا ؕ بَلۡ هُوَ اللّٰهُ الۡعَزِيۡزُ الۡحَكِيۡمُ‏"},{"id":3634,"verse_key":"34:28","text_indopak":"وَمَاۤ اَرۡسَلۡنٰكَ اِلَّا كَآفَّةً لِّلنَّاسِ بَشِيۡرًا وَّنَذِيۡرًا وَّلٰـكِنَّ اَكۡثَرَ النَّاسِ لَا يَعۡلَمُوۡنَ‏"},{"id":3635,"verse_key":"34:29","text_indopak":"وَيَقُوۡلُوۡنَ مَتٰى هٰذَا الۡوَعۡدُ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ‏"},{"id":3636,"verse_key":"34:30","text_indopak":"قُلْ لَّـكُمۡ مِّيۡعَادُ يَوۡمٍ لَّا تَسۡتَاْخِرُوۡنَ عَنۡهُ سَاعَةً وَّلَا تَسۡتَقۡدِمُوۡنَ‏"},{"id":3637,"verse_key":"34:31","text_indopak":"وَقَالَ الَّذِيۡنَ كَفَرُوۡا لَنۡ نُّؤۡمِنَ بِهٰذَا الۡقُرۡاٰنِ وَلَا بِالَّذِىۡ بَيۡنَ يَدَيۡهِؕ وَلَوۡ تَرٰٓى اِذِ الظّٰلِمُوۡنَ مَوۡقُوۡفُوۡنَ عِنۡدَ رَبِّهِمۡ ۖۚ يَرۡجِعُ بَعۡضُهُمۡ اِلٰى بَعۡضِ اۨلۡقَوۡلَ​ۚ يَقُوۡلُ الَّذِيۡنَ اسۡتُضۡعِفُوۡا لِلَّذِيۡنَ اسۡتَكۡبَرُوۡا لَوۡلَاۤ اَنۡـتُمۡ لَـكُـنَّا مُؤۡمِنِيۡنَ‏"},{"id":3638,"verse_key":"34:32","text_indopak":"قَالَ الَّذِيۡنَ اسۡتَكۡبَرُوۡا لِلَّذِيۡنَ اسۡتُضۡعِفُوۡۤا اَنَحۡنُ صَدَدۡنٰكُمۡ عَنِ الۡهُدٰى بَعۡدَ اِذۡ جَآءَكُمۡ بَلۡ كُنۡتُمۡ مُّجۡرِمِيۡنَ‏"},{"id":3639,"verse_key":"34:33","text_indopak":"وَقَالَ الَّذِيۡنَ اسۡتُضۡعِفُوۡا لِلَّذِيۡنَ اسۡتَكۡبَرُوۡا بَلۡ مَكۡرُ الَّيۡلِ وَ النَّهَارِ اِذۡ تَاۡمُرُوۡنَـنَاۤ اَنۡ نَّـكۡفُرَ بِاللّٰهِ وَنَجۡعَلَ لَهٗۤ اَنۡدَادًا ؕ وَاَسَرُّوا النَّدَامَةَ لَمَّا رَاَوُا الۡعَذَابَ ؕ وَجَعَلۡنَا الۡاَغۡلٰلَ فِىۡۤ اَعۡنَاقِ الَّذِيۡنَ كَفَرُوۡا ؕ هَلۡ يُجۡزَوۡنَ اِلَّا مَا كَانُوۡا يَعۡمَلُوۡنَ‏ ﻿﻿"},{"id":3640,"verse_key":"34:34","text_indopak":"وَمَاۤ اَرۡسَلۡنَا فِىۡ قَرۡيَةٍ مِّنۡ نَّذِيۡرٍ اِلَّا قَالَ مُتۡـرَفُوۡهَاۤ ۙاِنَّا بِمَاۤ اُرۡسِلۡـتُمۡ بِهٖ كٰفِرُوۡنَ‏"},{"id":3641,"verse_key":"34:35","text_indopak":"وَ قَالُوۡا نَحۡنُ اَكۡثَرُ اَمۡوَالًا وَّاَوۡلَادًا ۙ وَّمَا نَحۡنُ بِمُعَذَّبِيۡنَ‏ ﻿﻿"},{"id":3642,"verse_key":"34:36","text_indopak":"قُلۡ اِنَّ رَبِّىۡ يَبۡسُطُ الرِّزۡقَ لِمَنۡ يَّشَآءُ وَيَقۡدِرُ وَلٰـكِنَّ اَكۡثَرَ النَّاسِ لَا يَعۡلَمُوۡنَ‏"},{"id":3643,"verse_key":"34:37","text_indopak":"وَمَاۤ اَمۡوَالُـكُمۡ وَلَاۤ اَوۡلَادُكُمۡ بِالَّتِىۡ تُقَرِّبُكُمۡ عِنۡدَنَا زُلۡفٰٓى اِلَّا مَنۡ اٰمَنَ وَعَمِلَ صَالِحًـا فَاُولٰٓٮِٕكَ لَهُمۡ جَزَآءُ الضِّعۡفِ بِمَا عَمِلُوۡا وَهُمۡ فِى الۡغُرُفٰتِ اٰمِنُوۡنَ‏"},{"id":3644,"verse_key":"34:38","text_indopak":"وَ الَّذِيۡنَ يَسۡعَوۡنَ فِىۡۤ اٰيٰتِنَا مُعٰجِزِيۡنَ اُولٰٓٮِٕكَ فِى الۡعَذَابِ مُحۡضَرُوۡنَ‏"},{"id":3645,"verse_key":"34:39","text_indopak":"قُلۡ اِنَّ رَبِّىۡ يَبۡسُطُ الرِّزۡقَ لِمَنۡ يَّشَآءُ مِنۡ عِبَادِهٖ وَيَقۡدِرُ لَهٗ ؕ وَمَاۤ اَنۡفَقۡتُمۡ مِّنۡ شَىۡءٍ فَهُوَ يُخۡلِفُهٗ ۚ وَهُوَ خَيۡرُ الرّٰزِقِيۡنَ‏ ﻿﻿"},{"id":3646,"verse_key":"34:40","text_indopak":"وَيَوۡمَ يَحۡشُرُهُمۡ جَمِيۡعًا ثُمَّ يَقُوۡلُ لِلۡمَلٰٓٮِٕكَةِ اَهٰٓؤُلَاۤءِ اِيَّاكُمۡ كَانُوۡا يَعۡبُدُوۡنَ‏"},{"id":3647,"verse_key":"34:41","text_indopak":"قَالُوۡا سُبۡحٰنَكَ اَنۡتَ وَلِيُّنَا مِنۡ دُوۡنِهِمۡۚ بَلۡ كَانُوۡا يَعۡبُدُوۡنَ الۡجِنَّ ۚ اَكۡثَرُهُمۡ بِهِمۡ مُّؤۡمِنُوۡنَ‏"},{"id":3648,"verse_key":"34:42","text_indopak":"فَالۡيَوۡمَ لَا يَمۡلِكُ بَعۡضُكُمۡ لِبَعۡضٍ نَّفۡعًا وَّلَا ضَرًّا ؕ وَنَـقُوۡلُ لِلَّذِيۡنَ ظَلَمُوۡا ذُوۡقُوۡا عَذَابَ النَّارِ الَّتِىۡ كُنۡتُمۡ بِهَا تُكَذِّبُوۡنَ‏ ﻿﻿"},{"id":3649,"verse_key":"34:43","text_indopak":"وَاِذَا تُتۡلٰى عَلَيۡهِمۡ اٰيٰتُنَا بَيِّنٰتٍ قَالُوۡا مَا هٰذَاۤ اِلَّا رَجُلٌ يُّرِيۡدُ اَنۡ يَّصُدَّكُمۡ عَمَّا كَانَ يَعۡبُدُ اٰبَآؤُكُمۡ​ ۚ وَقَالُوۡا مَا هٰذَاۤ اِلَّاۤ اِفۡكٌ مُّفۡتَـرً ىؕ وَقَالَ الَّذِيۡنَ كَفَرُوۡا لِلۡحَقِّ لَمَّا جَآءَهُمۡ ۙ اِنۡ هٰذَاۤ اِلَّا سِحۡرٌ مُّبِيۡنٌ‏"},{"id":3650,"verse_key":"34:44","text_indopak":"وَمَاۤ اٰتَيۡنٰهُمۡ مِّنۡ كُتُبٍ يَّدۡرُسُوۡنَهَا وَمَاۤ اَرۡسَلۡنَاۤ اِلَيۡهِمۡ قَبۡلَكَ مِنۡ نَّذِيۡرٍؕ‏"},{"id":3651,"verse_key":"34:45","text_indopak":"وَكَذَّبَ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡۙ وَمَا بَلَـغُوۡا مِعۡشَارَ مَاۤ اٰتَيۡنٰهُمۡ فَكَذَّبُوۡا رُسُلِىۡ فَكَيۡفَ كَانَ نَكِيۡرِ‏"},{"id":3652,"verse_key":"34:46","text_indopak":"قُلۡ اِنَّمَاۤ اَعِظُكُمۡ بِوَاحِدَةٍ ۚ اَنۡ تَقُوۡمُوۡا لِلّٰهِ مَثۡنٰى وَفُرَادٰى ثُمَّ تَتَفَكَّرُوۡا مَا بِصَاحِبِكُمۡ مِّنۡ جِنَّةٍ ؕ اِنۡ هُوَ اِلَّا نَذِيۡرٌ لَّـكُمۡ بَيۡنَ يَدَىۡ عَذَابٍ شَدِيۡدٍ‏"},{"id":3653,"verse_key":"34:47","text_indopak":"قُلۡ مَا سَاَ لۡـتُكُمۡ مِّنۡ اَجۡرٍ فَهُوَ لَـكُمۡ ؕ اِنۡ اَجۡرِىَ اِلَّا عَلَى اللّٰهِ ۚ وَهُوَ عَلٰى كُلِّ شَىۡءٍ شَهِيۡدٌ‏"},{"id":3654,"verse_key":"34:48","text_indopak":"قُلۡ اِنَّ رَبِّىۡ يَقۡذِفُ بِالۡحَـقِّ​ۚ عَلَّامُ الۡغُيُوۡبِ‏"},{"id":3655,"verse_key":"34:49","text_indopak":"قُلۡ جَآءَ الۡحَـقُّ وَمَا يُبۡدِئُ الۡبَاطِلُ وَمَا يُعِيۡدُ‏"},{"id":3656,"verse_key":"34:50","text_indopak":"قُلۡ اِنۡ ضَلَلۡتُ فَاِنَّمَاۤ اَضِلُّ عَلٰى نَـفۡسِىۡ ۚ وَاِنِ اهۡتَدَيۡتُ فَبِمَا يُوۡحِىۡۤ اِلَىَّ رَبِّىۡ ؕ اِنَّهٗ سَمِيۡعٌ قَرِيۡبٌ‏"},{"id":3657,"verse_key":"34:51","text_indopak":"وَلَوۡ تَرٰٓى اِذۡ فَزِعُوۡا فَلَا فَوۡتَ وَاُخِذُوۡا مِنۡ مَّكَانٍ قَرِيۡبٍۙ‏ ﻿﻿"},{"id":3658,"verse_key":"34:52","text_indopak":"وَّقَالُـوۡۤا اٰمَنَّا بِهٖ​ ۚ وَاَنّٰى لَهُمُ التَّنَاوُشُ مِنۡ مَّكَانٍۢ بَعِيۡدٍ ۖۚ‏"},{"id":3659,"verse_key":"34:53","text_indopak":"وَّقَدۡ كَفَرُوۡا بِهٖ مِنۡ قَبۡلُۚ وَيَقۡذِفُوۡنَ بِالۡغَيۡبِ مِنۡ مَّكَانٍۢ بَعِيۡدٍ​‏"},{"id":3660,"verse_key":"34:54","text_indopak":"وَحِيۡلَ بَيۡنَهُمۡ وَبَيۡنَ مَا يَشۡتَهُوۡنَ كَمَا فُعِلَ بِاَشۡيَاعِهِمۡ مِّنۡ قَبۡلُؕ اِنَّهُمۡ كَانُوۡا فِىۡ شَكٍّ مُّرِيۡبٍ‏"},{"id":3661,"verse_key":"35:1","text_indopak":"اَ لۡحَمۡدُ لِلّٰهِ فَاطِرِ السَّمٰوٰتِ وَالۡاَرۡضِ جَاعِلِ الۡمَلٰٓٮِٕكَةِ رُسُلًا اُولِىۡۤ اَجۡنِحَةٍ مَّثۡنٰى وَثُلٰثَ وَرُبٰعَ ؕ يَزِيۡدُ فِى الۡخَـلۡقِ مَا يَشَآءُ ؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏"},{"id":3662,"verse_key":"35:2","text_indopak":"مَا يَفۡتَحِ اللّٰهُ لِلنَّاسِ مِنۡ رَّحۡمَةٍ فَلَا مُمۡسِكَ لَهَا ۚ وَمَا يُمۡسِكۡ ۙ فَلَا مُرۡسِلَ لَهٗ مِنۡۢ بَعۡدِه ؕ وَهُوَ الۡعَزِيۡزُ الۡحَكِيۡمُ‏ ﻿﻿"},{"id":3663,"verse_key":"35:3","text_indopak":"يٰۤاَيُّهَا النَّاسُ اذۡكُرُوۡا نِعۡمَتَ اللّٰهِ عَلَيۡكُمۡؕ هَلۡ مِنۡ خَالِـقٍ غَيۡرُ اللّٰهِ يَرۡزُقُكُمۡ مِّنَ السَّمَآءِ وَالۡاَرۡضِؕ لَاۤ اِلٰهَ اِلَّا هُوَۖ فَاَنّٰى تُؤۡفَكُوۡنَ‏"},{"id":3664,"verse_key":"35:4","text_indopak":"وَاِنۡ يُّكَذِّبُوۡكَ فَقَدۡ كُذِّبَتۡ رُسُلٌ مِّنۡ قَبۡلِكَؕ وَاِلَى اللّٰهِ تُرۡجَعُ الۡاُمُوۡرُ‏"},{"id":3665,"verse_key":"35:5","text_indopak":"يٰۤـاَيُّهَا النَّاسُ اِنَّ وَعۡدَ اللّٰهِ حَقٌّ فَلَا تَغُرَّنَّكُمُ الۡحَيٰوةُ الدُّنۡيَاوَلَا يَغُرَّنَّكُمۡ بِاللّٰهِ الۡغَرُوۡرُ‏"},{"id":3666,"verse_key":"35:6","text_indopak":"اِنَّ الشَّيۡطٰنَ لَـكُمۡ عَدُوٌّ فَاتَّخِذُوۡهُ عَدُوًّا ؕ اِنَّمَا يَدۡعُوۡا حِزۡبَهٗ لِيَكُوۡنُوۡا مِنۡ اَصۡحٰبِ السَّعِيۡرِؕ‏"},{"id":3667,"verse_key":"35:7","text_indopak":"اَ لَّذِيۡنَ كَفَرُوۡا لَهُمۡ عَذَابٌ شَدِيۡدٌ ؕ وَّالَّذِيۡنَ اٰمَنُوا وَعَمِلُوۡا الصّٰلِحٰتِ لَهُمۡ مَّغۡفِرَةٌ وَّاَجۡرٌ كَبِيۡرٌ‏"},{"id":3668,"verse_key":"35:8","text_indopak":"اَفَمَنۡ زُيِّنَ لَهٗ سُوۡٓءُ عَمَلِهٖ فَرَاٰهُ حَسَنًا ؕ فَاِنَّ اللّٰهَ يُضِلُّ مَنۡ يَّشَآءُ وَيَهۡدِىۡ مَنۡ يَّشَآءُ ​ۖ  فَلَا تَذۡهَبۡ نَـفۡسُكَ عَلَيۡهِمۡ حَسَرٰتٍ ؕ اِنَّ اللّٰهَ عَلِيۡمٌۢ بِمَا يَصۡنَـعُوۡنَ‏"},{"id":3669,"verse_key":"35:9","text_indopak":"وَاللّٰهُ الَّذِىۡۤ اَرۡسَلَ الرِّيٰحَ فَتُثِيۡرُ سَحَابًا فَسُقۡنٰهُ اِلٰى بَلَدٍ مَّيِّتٍ فَاَحۡيَيۡنَا بِهِ الۡاَرۡضَ بَعۡدَ مَوۡتِهَا ؕ كَذٰلِكَ النُّشُوۡرُ‏ ﻿﻿"},{"id":3670,"verse_key":"35:10","text_indopak":"مَنۡ كَانَ يُرِيۡدُ الۡعِزَّةَ فَلِلّٰهِ الۡعِزَّةُ جَمِيۡعًا ؕ اِلَيۡهِ يَصۡعَدُ الۡـكَلِمُ الطَّيِّبُ وَالۡعَمَلُ الصَّالِحُ يَرۡفَعُهٗ ؕ وَ الَّذِيۡنَ يَمۡكُرُوۡنَ السَّيِّاٰتِ لَهُمۡ عَذَابٌ شَدِيۡدٌ  ؕ وَمَكۡرُ اُولٰٓٮِٕكَ هُوَ يَبُوۡرُ‏"},{"id":3671,"verse_key":"35:11","text_indopak":"وَاللّٰهُ خَلَقَكُمۡ مِّنۡ تُرَابٍ ثُمَّ مِنۡ نُّطۡفَةٍ ثُمَّ جَعَلَـكُمۡ اَزۡوَاجًا ؕ وَمَا تَحۡمِلُ مِنۡ اُنۡثٰى وَلَا تَضَعُ اِلَّا بِعِلۡمِهؕ وَمَا يُعَمَّرُ مِنۡ مُّعَمَّرٍ وَّلَا يُنۡقَصُ مِنۡ عُمُرِهٖۤ اِلَّا فِىۡ كِتٰبٍؕ اِنَّ ذٰلِكَ عَلَى اللّٰهِ يَسِيۡرٌ‏"},{"id":3672,"verse_key":"35:12","text_indopak":"وَمَا يَسۡتَوِىۡ الۡبَحۡرٰنِ ​ۖ  هٰذَا عَذۡبٌ فُرَاتٌ سَآٮِٕغٌ شَرَابُهٗ وَ هٰذَا مِلۡحٌ اُجَاجٌ ؕ وَمِنۡ كُلٍّ تَاۡكُلُوۡنَ لَحۡمًا طَرِيًّا وَّتَسۡتَخۡرِجُوۡنَ حِلۡيَةً تَلۡبَسُوۡنَهَا ۚ وَتَرَى الۡـفُلۡكَ فِيۡهِ مَوَاخِرَ لِتَبۡـتَـغُوۡا مِنۡ فَضۡلِهٖ وَلَعَلَّـكُمۡ تَشۡكُرُوۡنَ‏"},{"id":3673,"verse_key":"35:13","text_indopak":"يُوۡلِجُ الَّيۡلَ فِى النَّهَارِ وَيُوۡلِجُ النَّهَارَ فِى الَّيۡلِ ۙ وَسَخَّرَ الشَّمۡسَ وَالۡقَمَرَ ​ۖ  كُلٌّ يَّجۡرِىۡ لِاَجَلٍ مُّسَمًّى ؕ ذٰ لِكُمُ اللّٰهُ رَبُّكُمۡ لَـهُ الۡمُلۡكُ ؕ وَالَّذِيۡنَ تَدۡعُوۡنَ مِنۡ دُوۡنِهٖ مَا يَمۡلِكُوۡنَ مِنۡ قِطۡمِيۡرٍؕ‏"},{"id":3674,"verse_key":"35:14","text_indopak":"اِنۡ تَدۡعُوۡهُمۡ لَا يَسۡمَعُوۡا دُعَآءَكُمۡ​ ۚ وَلَوۡ سَمِعُوۡا مَا اسۡتَجَابُوۡا لَـكُمۡ ؕ وَيَوۡمَ الۡقِيٰمَةِ يَكۡفُرُوۡنَ بِشِرۡكِكُمۡ ؕ وَلَا يُـنَـبِّـئُكَ مِثۡلُ خَبِيۡرٍ‏"},{"id":3675,"verse_key":"35:15","text_indopak":"يٰۤاَيُّهَا النَّاسُ اَنۡتُمُ الۡفُقَرَآءُ اِلَى اللّٰهِۚ وَاللّٰهُ هُوَ الۡغَنِىُّ الۡحَمِيۡدُ‏"},{"id":3676,"verse_key":"35:16","text_indopak":"اِنۡ يَّشَاۡ يُذۡهِبۡكُمۡ وَيَاۡتِ بِخَلۡقٍ جَدِيۡدٍۚ‏"},{"id":3677,"verse_key":"35:17","text_indopak":"وَمَا ذٰ لِكَ عَلَى اللّٰهِ بِعَزِيۡزٍ‏"},{"id":3678,"verse_key":"35:18","text_indopak":"وَ لَا تَزِرُ وَازِرَةٌ وِّزۡرَ اُخۡرَىٰ ؕ وَاِنۡ تَدۡعُ مُثۡقَلَةٌ اِلٰى حِمۡلِهَا لَا يُحۡمَلۡ مِنۡهُ شَىۡءٌ وَّلَوۡ كَانَ ذَا قُرۡبٰى ؕ اِنَّمَا تُنۡذِرُ الَّذِيۡنَ يَخۡشَوۡنَ رَبَّهُمۡ بِالۡغَيۡبِ وَاَقَامُوا الصَّلٰوةَ ؕ وَمَنۡ تَزَكّٰى فَاِنَّمَا يَتَزَكّٰى لِنَفۡسِهٖ ؕ وَاِلَى اللّٰهِ الۡمَصِيۡرُ‏"},{"id":3679,"verse_key":"35:19","text_indopak":"وَمَا يَسۡتَوِى الۡاَعۡمٰى وَالۡبَصِيۡرُ ۙ‏"},{"id":3680,"verse_key":"35:20","text_indopak":"وَلَا الظُّلُمٰتُ وَلَا النُّوۡرُۙ‏"},{"id":3681,"verse_key":"35:21","text_indopak":"وَلَا الظِّلُّ وَلَا الۡحَـرُوۡرُۚ‏"},{"id":3682,"verse_key":"35:22","text_indopak":"وَمَا يَسۡتَوِى الۡاَحۡيَآءُ وَلَا الۡاَمۡوَاتُ ؕ اِنَّ اللّٰهَ يُسۡمِعُ مَنۡ يَّشَآءُ ۚ وَمَاۤ اَنۡتَ بِمُسۡمِعٍ مَّنۡ فِى الۡقُبُوۡرِ‏"},{"id":3683,"verse_key":"35:23","text_indopak":"اِنۡ اَنۡتَ اِلَّا نَذِيۡرٌ‏"},{"id":3684,"verse_key":"35:24","text_indopak":"اِنَّاۤ اَرۡسَلۡنٰكَ بِالۡحَـقِّ بَشِيۡرًا وَّنَذِيۡرًاؕ وَاِنۡ مِّنۡ اُمَّةٍ اِلَّا خَلَا فِيۡهَا نَذِيۡرٌ‏"},{"id":3685,"verse_key":"35:25","text_indopak":"وَاِنۡ يُّكَذِّبُوۡكَ فَقَدۡ كَذَّبَ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ​ۚ جَآءَتۡهُمۡ رُسُلُهُمۡ بِالۡبَيِّنٰتِ وَبِالزُّبُرِ وَبِالۡكِتٰبِ الۡمُنِيۡرِ‏"},{"id":3686,"verse_key":"35:26","text_indopak":"ثُمَّ اَخَذۡتُ الَّذِيۡنَ كَفَرُوۡا فَكَيۡفَ كَانَ نَـكِيۡرِ‏"},{"id":3687,"verse_key":"35:27","text_indopak":"اَلَمۡ تَرَ اَنَّ اللّٰهَ اَنۡزَلَ مِنَ السَّمَآءِ مَآءً ​ۚ فَاَخۡرَجۡنَا بِهٖ ثَمَرٰتٍ مُّخۡتَلِفًا اَلۡوَانُهَاؕ وَمِنَ الۡجِبَالِ جُدَدٌۢ بِيۡضٌ وَّحُمۡرٌ مُّخۡتَلِفٌ اَلۡوَانُهَا وَغَرَابِيۡبُ سُوۡدٌ‏"},{"id":3688,"verse_key":"35:28","text_indopak":"وَمِنَ النَّاسِ وَالدَّوَآبِّ وَالۡاَنۡعَامِ مُخۡتَلِفٌ اَ لۡوَانُهٗ كَذٰلِكَ ؕ اِنَّمَا يَخۡشَى اللّٰهَ مِنۡ عِبَادِهِ الۡعُلَمٰٓؤُا ؕ اِنَّ اللّٰهَ عَزِيۡزٌ غَفُوۡرٌ‏"},{"id":3689,"verse_key":"35:29","text_indopak":"اِنَّ الَّذِيۡنَ يَتۡلُوۡنَ كِتٰبَ اللّٰهِ وَاَقَامُوا الصَّلٰوةَ وَاَنۡفَقُوۡا مِمَّا رَزَقۡنٰهُمۡ سِرًّا وَّعَلَانِيَةً يَّرۡجُوۡنَ تِجَارَةً لَّنۡ تَبُوۡرَۙ‏ ﻿﻿"},{"id":3690,"verse_key":"35:30","text_indopak":"لِيُوَفِّيَهُمۡ اُجُوۡرَهُمۡ وَيَزِيۡدَهُمۡ مِّنۡ فَضۡلِهٖ ؕ اِنَّهٗ غَفُوۡرٌ شَكُوۡرٌ‏"},{"id":3691,"verse_key":"35:31","text_indopak":"وَالَّذِىۡۤ اَوۡحَيۡنَاۤ اِلَيۡكَ مِنَ الۡكِتٰبِ هُوَ الۡحَـقُّ مُصَدِّقًا لِّمَا بَيۡنَ يَدَيۡهِؕ اِنَّ اللّٰهَ بِعِبَادِهٖ لَخَبِيۡرٌۢ بَصِيۡرٌ‏"},{"id":3692,"verse_key":"35:32","text_indopak":"ثُمَّ اَوۡرَثۡنَا الۡكِتٰبَ الَّذِيۡنَ اصۡطَفَيۡنَا مِنۡ عِبَادِنَاۚ فَمِنۡهُمۡ ظَالِمٌ لِّنَفۡسِهٖ​ۚ وَمِنۡهُمۡ مُّقۡتَصِدٌ ​ۚ وَمِنۡهُمۡ سَابِقٌۢ بِالۡخَيۡرٰتِ بِاِذۡنِ اللّٰهِؕ ذٰلِكَ هُوَ الۡفَضۡلُ الۡكَبِيۡرُؕ‏"},{"id":3693,"verse_key":"35:33","text_indopak":"جَنّٰتُ عَدۡنٍ يَّدۡخُلُوۡنَهَا يُحَلَّوۡنَ فِيۡهَا مِنۡ اَسَاوِرَ مِنۡ ذَهَبٍ وَّلُـؤۡلُؤًا ۚ وَلِبَاسُهُمۡ فِيۡهَا حَرِيۡرٌ‏"},{"id":3694,"verse_key":"35:34","text_indopak":"وَقَالُوا الۡحَمۡدُ لِلّٰهِ الَّذِىۡۤ اَذۡهَبَ عَـنَّا الۡحَزَنَ ؕ اِنَّ رَبَّنَا لَـغَفُوۡرٌ شَكُوۡرُ ۙ‏"},{"id":3695,"verse_key":"35:35","text_indopak":"اۨلَّذِىۡۤ اَحَلَّنَا دَارَ الۡمُقَامَةِ مِنۡ فَضۡلِهٖ​ۚ لَا يَمَسُّنَا فِيۡهَا نَصَبٌ وَّلَا يَمَسُّنَا فِيۡهَا لُـغُوۡبٌ‏"},{"id":3696,"verse_key":"35:36","text_indopak":"وَالَّذِيۡنَ كَفَرُوۡا لَهُمۡ نَارُ جَهَنَّمَ​ۚ لَا يُقۡضٰى عَلَيۡهِمۡ فَيَمُوۡتُوۡا وَلَا يُخَفَّفُ عَنۡهُمۡ مِّنۡ عَذَابِهَا ؕ كَذٰلِكَ نَـجۡزِىۡ كُلَّ كَفُوۡرٍۚ‏ ﻿﻿"},{"id":3697,"verse_key":"35:37","text_indopak":"وَهُمۡ يَصۡطَرِخُوۡنَ فِيۡهَا ​ۚ رَبَّنَاۤ اَخۡرِجۡنَا نَـعۡمَلۡ صَالِحًـا غَيۡرَ الَّذِىۡ كُـنَّا نَـعۡمَلُؕ اَوَلَمۡ نُعَمِّرۡكُمۡ مَّا يَتَذَكَّرُ فِيۡهِ مَنۡ تَذَكَّرَ وَجَآءَكُمُ النَّذِيۡرُؕ فَذُوۡقُوۡا فَمَا لِلظّٰلِمِيۡنَ مِنۡ نَّصِيۡرٍ‏ ﻿﻿"},{"id":3698,"verse_key":"35:38","text_indopak":"اِنَّ اللّٰهَ عٰلِمُ غَيۡبِ السَّمٰوٰتِ وَالۡاَرۡضِؕ اِنَّهٗ عَلِيۡمٌۢ بِذَاتِ الصُّدُوۡرِ‏"},{"id":3699,"verse_key":"35:39","text_indopak":"هُوَ الَّذِىۡ جَعَلَـكُمۡ خَلٰٓٮِٕفَ فِى الۡاَرۡضِ ؕ فَمَنۡ كَفَرَ فَعَلَيۡهِ كُفۡرُهٗ ؕ وَلَا يَزِيۡدُ الۡـكٰفِرِيۡنَ كُفۡرُهُمۡ عِنۡدَ رَبِّهِمۡ اِلَّا مَقۡتًا ۚ وَلَا يَزِيۡدُ الۡـكٰفِرِيۡنَ كُفۡرُهُمۡ اِلَّا خَسَارًا‏"},{"id":3700,"verse_key":"35:40","text_indopak":"قُلۡ اَرَءَيۡتُمۡ شُرَكَآءَكُمُ الَّذِيۡنَ تَدۡعُوۡنَ مِنۡ دُوۡنِ اللّٰهِ ؕ اَرُوۡنِىۡ مَاذَا خَلَقُوۡا مِنَ الۡاَرۡضِ اَمۡ لَهُمۡ شِرۡكٌ فِى السَّمٰوٰتِ​ ۚ اَمۡ اٰتَيۡنٰهُمۡ كِتٰبًا فَهُمۡ عَلٰى بَيِّنَتٍ مِّنۡهُ ۚ بَلۡ اِنۡ يَّعِدُ الظّٰلِمُوۡنَ بَعۡضُهُمۡ بَعۡضًا اِلَّا غُرُوۡرًا‏"},{"id":3701,"verse_key":"35:41","text_indopak":"اِنَّ اللّٰهَ يُمۡسِكُ السَّمٰوٰتِ وَالۡاَرۡضَ اَنۡ تَزُوۡلَا ۚوَلَٮِٕنۡ زَالَــتَاۤ اِنۡ اَمۡسَكَهُمَا مِنۡ اَحَدٍ مِّنۡۢ بَعۡدِهٖ ؕ اِنَّهٗ كَانَ حَلِيۡمًا غَفُوۡرًا‏"},{"id":3702,"verse_key":"35:42","text_indopak":"وَاَ قۡسَمُوۡا بِاللّٰهِ جَهۡدَ اَيۡمَانِهِمۡ لَٮِٕنۡ جَآءَهُمۡ نَذِيۡرٌ لَّيَكُوۡنُنَّ اَهۡدٰى مِنۡ اِحۡدَى الۡاُمَمِۚ فَلَمَّا جَآءَهُمۡ نَذِيۡرٌ مَّا زَادَهُمۡ اِلَّا نُفُوۡرًا ۙ‏"},{"id":3703,"verse_key":"35:43","text_indopak":"اۨسۡتِكۡبَارًا فِى الۡاَرۡضِ وَمَكۡرَ السَّيّیٴِؕ وَلَا يَحِيۡقُ الۡمَكۡرُ السَّيِّـئُ اِلَّا بِاَهۡلِهٖ ؕ فَهَلۡ يَنۡظُرُوۡنَ اِلَّا سُنَّتَ الۡاَوَّلِيۡنَ ۚ فَلَنۡ تَجِدَ لِسُنَّتِ اللّٰهِ تَبۡدِيۡلًا ۚ وَلَنۡ تَجِدَ لِسُنَّتِ اللّٰهِ تَحۡوِيۡلًا‏"},{"id":3704,"verse_key":"35:44","text_indopak":"اَوَلَمۡ يَسِيۡرُوۡا فِى الۡاَرۡضِ فَيَنۡظُرُوۡا كَيۡفَ كَانَ عَاقِبَةُ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ وَكَانُوۡۤا اَشَدَّ مِنۡهُمۡ قُوَّةً ؕ وَمَا كَانَ اللّٰهُ لِيُعۡجِزَهٗ مِنۡ شَىۡءٍ فِى السَّمٰوٰتِ وَلَا فِى الۡاَرۡضِ ؕ اِنَّهٗ كَانَ عَلِيۡمًا قَدِيۡرًا‏ ﻿﻿"},{"id":3705,"verse_key":"35:45","text_indopak":"وَلَوۡ يُـؤَاخِذُ اللّٰهُ النَّاسَ بِمَا كَسَبُوۡا مَا تَرَكَ عَلٰى ظَهۡرِهَا مِنۡ دَآ بَّةٍ وَّلٰـكِنۡ يُّؤَخِّرُهُمۡ اِلٰٓى اَجَلٍ مُّسَمًّىۚ فَاِذَا جَآءَ اَجَلُهُمۡ فَاِنَّ اللّٰهَ كَانَ بِعِبَادِهٖ بَصِيۡرًا‏"},{"id":3706,"verse_key":"36:1","text_indopak":"يٰسٓ ۚ‏"},{"id":3707,"verse_key":"36:2","text_indopak":"وَالۡقُرۡاٰنِ الۡحَكِيۡمِ ۙ‏"},{"id":3708,"verse_key":"36:3","text_indopak":"اِنَّكَ لَمِنَ الۡمُرۡسَلِيۡنَۙ‏"},{"id":3709,"verse_key":"36:4","text_indopak":"عَلٰى صِرَاطٍ مُّسۡتَقِيۡمٍؕ‏"},{"id":3710,"verse_key":"36:5","text_indopak":"تَنۡزِيۡلَ الۡعَزِيۡزِ الرَّحِيۡمِ ۙ‏"},{"id":3711,"verse_key":"36:6","text_indopak":"لِتُنۡذِرَ قَوۡمًا مَّاۤ اُنۡذِرَ اٰبَآؤُهُمۡ فَهُمۡ غٰفِلُوۡنَ‏"},{"id":3712,"verse_key":"36:7","text_indopak":"لَقَدۡ حَقَّ الۡقَوۡلُ عَلٰٓى اَكۡثَرِهِمۡ فَهُمۡ لَا يُؤۡمِنُوۡنَ‏"},{"id":3713,"verse_key":"36:8","text_indopak":"اِنَّا جَعَلۡنَا فِىۡۤ اَعۡنَاقِهِمۡ اَغۡلٰلًا فَهِىَ اِلَى الۡاَ ذۡقَانِ فَهُمۡ مُّقۡمَحُوۡنَ‏"},{"id":3714,"verse_key":"36:9","text_indopak":"وَجَعَلۡنَا مِنۡۢ بَيۡنِ اَيۡدِيۡهِمۡ سَدًّا وَّمِنۡ خَلۡفِهِمۡ سَدًّا فَاَغۡشَيۡنٰهُمۡ فَهُمۡ لَا يُبۡصِرُوۡنَ‏"},{"id":3715,"verse_key":"36:10","text_indopak":"وَسَوَآءٌ عَلَيۡهِمۡ ءَاَنۡذَرۡتَهُمۡ اَمۡ لَمۡ تُنۡذِرۡهُمۡ لَا يُؤۡمِنُوۡنَ‏ ﻿﻿"},{"id":3716,"verse_key":"36:11","text_indopak":"اِنَّمَا تُنۡذِرُ مَنِ اتَّبَعَ الذِّكۡرَ وَخَشِىَ الرَّحۡمٰنَ بِالۡغَيۡبِۚ فَبَشِّرۡهُ بِمَغۡفِرَةٍ وَّاَجۡرٍ كَرِيۡمٍ‏"},{"id":3717,"verse_key":"36:12","text_indopak":"اِنَّا نَحۡنُ نُحۡىِ الۡمَوۡتٰى وَنَكۡتُبُ مَا قَدَّمُوۡا وَاٰثَارَهُمۡؕ وَكُلَّ شَىۡءٍ اَحۡصَيۡنٰهُ فِىۡۤ اِمَامٍ مُّبِيۡنٍ‏"},{"id":3718,"verse_key":"36:13","text_indopak":"وَاضۡرِبۡ لَهُمۡ مَّثَلًا اَصۡحٰبَ الۡقَرۡيَةِ ​ۘ اِذۡ جَآءَهَا الۡمُرۡسَلُوۡنَۚ‏ ﻿﻿"},{"id":3719,"verse_key":"36:14","text_indopak":"اِذۡ اَرۡسَلۡنَاۤ اِلَيۡهِمُ اثۡنَيۡنِ فَكَذَّبُوۡهُمَا فَعَزَّزۡنَا بِثَالِثٍ فَقَالُـوۡۤا اِنَّاۤ اِلَيۡكُمۡ مُّرۡسَلُوۡنَ‏"},{"id":3720,"verse_key":"36:15","text_indopak":"قَالُوۡا مَاۤ اَنۡـتُمۡ اِلَّا بَشَرٌ مِّثۡلُـنَا ۙ وَمَاۤ اَنۡزَلَ الرَّحۡمٰنُ مِنۡ شَىۡءٍۙ اِنۡ اَنۡـتُمۡ اِلَّا تَكۡذِبُوۡنَ‏"},{"id":3721,"verse_key":"36:16","text_indopak":"قَالُوۡا رَبُّنَا يَعۡلَمُ اِنَّاۤ اِلَيۡكُمۡ لَمُرۡسَلُوۡنَ‏"},{"id":3722,"verse_key":"36:17","text_indopak":"وَمَا عَلَيۡنَاۤ اِلَّا الۡبَلٰغُ الۡمُبِيۡنُ‏"},{"id":3723,"verse_key":"36:18","text_indopak":"قَالُـوۡۤا اِنَّا تَطَيَّرۡنَا بِكُمۡۚ لَٮِٕنۡ لَّمۡ تَنۡتَهُوۡا لَنَرۡجُمَنَّكُمۡ وَلَيَمَسَّنَّكُمۡ مِّنَّا عَذَابٌ اَلِيۡمٌ‏"},{"id":3724,"verse_key":"36:19","text_indopak":"قَالُوۡا طٰۤٮِٕـرُكُمۡ مَّعَكُمۡؕ اَٮِٕنۡ ذُكِّرۡتُمۡ ؕ بَلۡ اَنۡـتُمۡ قَوۡمٌ مُّسۡرِفُوۡنَ‏"},{"id":3725,"verse_key":"36:20","text_indopak":"وَجَآءَ مِنۡ اَقۡصَا الۡمَدِيۡنَةِ رَجُلٌ يَّسۡعٰى قَالَ يٰقَوۡمِ اتَّبِعُوا الۡمُرۡسَلِيۡنَۙ‏"},{"id":3726,"verse_key":"36:21","text_indopak":"اتَّبِعُوۡا مَنۡ لَّا يَسۡـــَٔلُكُمۡ اَجۡرًا وَّهُمۡ مُّهۡتَدُوۡنَ‏"},{"id":3727,"verse_key":"36:22","text_indopak":"وَمَا لِىَ لَاۤ اَعۡبُدُ الَّذِىۡ فَطَرَنِىۡ وَاِلَيۡهِ تُرۡجَعُوۡنَ‏"},{"id":3728,"verse_key":"36:23","text_indopak":"ءَاَ تَّخِذُ مِنۡ دُوۡنِهٖۤ اٰلِهَةً اِنۡ يُّرِدۡنِ الرَّحۡمٰنُ بِضُرٍّ لَّا تُغۡنِ عَنِّىۡ شَفَاعَتُهُمۡ شَيۡـــًٔا وَّلَا يُنۡقِذُوۡنِ​ۚ‏"},{"id":3729,"verse_key":"36:24","text_indopak":"اِنِّىۡۤ اِذًا لَّفِىۡ ضَلٰلٍ مُّبِيۡنٍ‏"},{"id":3730,"verse_key":"36:25","text_indopak":"اِنِّىۡۤ اٰمَنۡتُ بِرَبِّكُمۡ فَاسۡمَعُوۡنِؕ‏"},{"id":3731,"verse_key":"36:26","text_indopak":"قِيۡلَ ادۡخُلِ الۡجَـنَّةَ ؕ قَالَ يٰلَيۡتَ قَوۡمِىۡ يَعۡلَمُوۡنَۙ‏"},{"id":3732,"verse_key":"36:27","text_indopak":"بِمَا غَفَرَلِىۡ رَبِّىۡ وَجَعَلَنِىۡ مِنَ الۡمُكۡرَمِيۡنَ‏"}],"meta":{"filters":{"juz_number":"22"}}}
