{"chapter_number":83,"name_simple":"Al-Mutaffifin","verses_count":36,"verses":[{"text_madani":"وَيْلٌ لِّلْمُطَفِّفِينَ","translation_en":"Woe to the defrauders,","translation_id":"Celakalah bagi orang-orang yang curang (dalam menakar dan menimbang)!"},{"text_madani":"الَّذِينَ إِذَا اكْتَالُوا عَلَى النَّاسِ يَسْتَوْفُونَ","translation_en":"Who, when they take the measure (of their dues) from men take it fully,","translation_id":"(Yaitu) orang-orang yang apabila menerima takaran dari orang lain mereka minta dicukupkan,"},{"text_madani":"وَإِذَا كَالُوهُمْ أَو وَّزَنُوهُمْ يُخْسِرُونَ","translation_en":"But when they measure out to others or weigh out for them, they are deficient.","translation_id":"dan apabila mereka menakar atau menimbang (untuk orang lain), mereka mengurangi."},{"text_madani":"أَلَا يَظُنُّ أُولَٰئِكَ أَنَّهُم مَّبْعُوثُونَ","translation_en":"Do not these think that they shall be raised again","translation_id":"Tidakkah mereka itu mengira, bahwa sesungguhnya mereka akan dibangkitkan,"},{"text_madani":"لِيَوْمٍ عَظِيمٍ","translation_en":"For a mighty day,","translation_id":"pada suatu hari yang besar,"},{"text_madani":"يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ","translation_en":"The day on which men shall stand before the Lord of the worlds?","translation_id":"(yaitu) pada hari (ketika) semua orang bangkit menghadap Tuhan seluruh alam."},{"text_madani":"كَلَّا إِنَّ كِتَابَ الْفُجَّارِ لَفِي سِجِّينٍ","translation_en":"Nay! most surely the record of the wicked is in the Sijjin.","translation_id":"Sekali-kali jangan begitu! Sesungguhnya catatan orang yang durhaka benar-benar tersimpan dalam Sijjn."},{"text_madani":"وَمَا أَدْرَاكَ مَا سِجِّينٌ","translation_en":"And what will make you know what the Sijjin is?","translation_id":"Dan tahukah engkau apakah Sijjn itu?"},{"text_madani":"كِتَابٌ مَّرْقُومٌ","translation_en":"It is a written book.","translation_id":"(Yaitu) Kitab yang berisi catatan (amal)."},{"text_madani":"وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ","translation_en":"Woe on that day to the rejecters,","translation_id":"Celakalah pada hari itu, bagi orang-orang yang mendustakan!"},{"text_madani":"الَّذِينَ يُكَذِّبُونَ بِيَوْمِ الدِّينِ","translation_en":"Who give the lie to the day of judgment.","translation_id":"(yaitu) orang-orang yang mendustakannya (hari pembalasan)."},{"text_madani":"وَمَا يُكَذِّبُ بِهِ إِلَّا كُلُّ مُعْتَدٍ أَثِيمٍ","translation_en":"And none gives the lie to it but every exceeder of limits, sinful one","translation_id":"Dan tidak ada yang mendustakannya (hari pembalasan) kecuali setiap orang yang melampaui batas dan berdosa,"},{"text_madani":"إِذَا تُتْلَىٰ عَلَيْهِ آيَاتُنَا قَالَ أَسَاطِيرُ الْأَوَّلِينَ","translation_en":"When Our communications are recited to him, he says: Stories of those of yore.","translation_id":"yang apabila dibacakan kepadanya ayat-ayat Kami, dia berkata, “Itu adalah dongeng orang-orang dahulu.”"},{"text_madani":"كَلَّا ۖ بَلْ ۜ رَانَ عَلَىٰ قُلُوبِهِم مَّا كَانُوا يَكْسِبُونَ","translation_en":"Nay! rather, what they used to do has become like rust upon their hearts.","translation_id":"Sekali-kali tidak! Bahkan apa yang mereka kerjakan itu telah menutupi hati mereka."},{"text_madani":"كَلَّا إِنَّهُمْ عَن رَّبِّهِمْ يَوْمَئِذٍ لَّمَحْجُوبُونَ","translation_en":"Nay! most surely they shall on that day be debarred from their Lord.","translation_id":"Sekali-kali tidak! Sesungguhnya mereka pada hari itu benar-benar terhalang dari (melihat) Tuhannya."},{"text_madani":"ثُمَّ إِنَّهُمْ لَصَالُو الْجَحِيمِ","translation_en":"Then most surely they shall enter the burning fire.","translation_id":"Kemudian, sesungguhnya mereka benar-benar masuk neraka."},{"text_madani":"ثُمَّ يُقَالُ هَٰذَا الَّذِي كُنتُم بِهِ تُكَذِّبُونَ","translation_en":"Then shall it be said: This is what you gave the lie to.","translation_id":"Kemudian, dikatakan (kepada mereka), “Inilah (azab) yang dahulu kamu dustakan.”"},{"text_madani":"كَلَّا إِنَّ كِتَابَ الْأَبْرَارِ لَفِي عِلِّيِّينَ","translation_en":"Nay! Most surely the record of the righteous shall be in the Iliyin.","translation_id":"Sekali-kali tidak! Sesungguhnya catatan orang-orang yang berbakti benar-benar tersimpan dalam ’Illiyyn."},{"text_madani":"وَمَا أَدْرَاكَ مَا عِلِّيُّونَ","translation_en":"And what will make you know what the highest Iliyin is?","translation_id":"Dan tahukah engkau apakah ’Illiyyn itu?"},{"text_madani":"كِتَابٌ مَّرْقُومٌ","translation_en":"It is a written book,","translation_id":"(Yaitu) Kitab yang berisi catatan (amal),"},{"text_madani":"يَشْهَدُهُ الْمُقَرَّبُونَ","translation_en":"Those who are drawn near (to Allah) shall witness it.","translation_id":"yang disaksikan oleh (malaikat-malaikat) yang didekatkan (kepada Allah)."},{"text_madani":"إِنَّ الْأَبْرَارَ لَفِي نَعِيمٍ","translation_en":"Most surely the righteous shall be in bliss,","translation_id":"Sesungguhnya orang-orang yang berbakti benar-benar berada dalam (surga yang penuh) kenikmatan,"},{"text_madani":"عَلَى الْأَرَائِكِ يَنظُرُونَ","translation_en":"On thrones, they shall gaze;","translation_id":"mereka (duduk) di atas dipan-dipan melepas pandangan"},{"text_madani":"تَعْرِفُ فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ","translation_en":"You will recognize in their faces the brightness of bliss.","translation_id":"Kamu dapat mengetahui dari wajah mereka kesenangan hidup yang penuh kenikmatan."},{"text_madani":"يُسْقَوْنَ مِن رَّحِيقٍ مَّخْتُومٍ","translation_en":"They are made to quaff of a pure drink that is sealed (to others).","translation_id":"Mereka diberi minum dari khamar murni (tidak memabukkan) yang (tempatnya) masih dilak (disegel),"},{"text_madani":"خِتَامُهُ مِسْكٌ ۚ وَفِي ذَٰلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ","translation_en":"The sealing of it is (with) musk; and for that let the aspirers aspire.","translation_id":"laknya dari kasturi. Dan untuk yang demikian itu hendaknya orang berlomba-lomba."},{"text_madani":"وَمِزَاجُهُ مِن تَسْنِيمٍ","translation_en":"And the admixture of it is a water of Tasnim,","translation_id":"Dan campurannya dari tasnm,"},{"text_madani":"عَيْنًا يَشْرَبُ بِهَا الْمُقَرَّبُونَ","translation_en":"A fountain from which drink they who are drawn near (to Allah).","translation_id":"(yaitu) mata air yang diminum oleh mereka yang dekat (kepada Allah)."},{"text_madani":"إِنَّ الَّذِينَ أَجْرَمُوا كَانُوا مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ","translation_en":"Surely they who are guilty used to laugh at those who believe.","translation_id":"Sesungguhnya orang-orang yang berdosa adalah mereka yang dahulu menertawakan orang-orang yang beriman."},{"text_madani":"وَإِذَا مَرُّوا بِهِمْ يَتَغَامَزُونَ","translation_en":"And when they passed by them, they winked at one another.","translation_id":"Dan apabila mereka (orang-orang yang beriman) melintas di hadapan mereka, mereka saling mengedip-ngedipkan matanya,"},{"text_madani":"وَإِذَا انقَلَبُوا إِلَىٰ أَهْلِهِمُ انقَلَبُوا فَكِهِينَ","translation_en":"And when they returned to their own followers they returned exulting.","translation_id":"dan apabila kembali kepada kaumnya, mereka kembali dengan gembira ria."},{"text_madani":"وَإِذَا رَأَوْهُمْ قَالُوا إِنَّ هَٰؤُلَاءِ لَضَالُّونَ","translation_en":"And when they saw them, they said: Most surely these are in error;","translation_id":"Dan apabila mereka melihat (orang-orang mukmin), mereka mengatakan, “Sesungguhnya mereka benar-benar orang-orang sesat,”"},{"text_madani":"وَمَا أُرْسِلُوا عَلَيْهِمْ حَافِظِينَ","translation_en":"And they were not sent to be keepers over them.","translation_id":"padahal (orang-orang yang berdosa itu), mereka tidak diutus sebagai penjaga (orang-orang mukmin)."},{"text_madani":"فَالْيَوْمَ الَّذِينَ آمَنُوا مِنَ الْكُفَّارِ يَضْحَكُونَ","translation_en":"So today those who believe shall laugh at the unbelievers;","translation_id":"Maka pada hari ini, orang-orang yang beriman yang menertawakan orang-orang kafir,"},{"text_madani":"عَلَى الْأَرَائِكِ يَنظُرُونَ","translation_en":"On thrones, they will look.","translation_id":"mereka (duduk) di atas dipan-dipan melepas pandangan."},{"text_madani":"هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوا يَفْعَلُونَ","translation_en":"Surely the disbelievers are rewarded as they did.","translation_id":"Apakah orang-orang kafir itu diberi balasan (hukuman) terhadap apa yang telah mereka perbuat?"}]}
