{"chapter_number":51,"name_simple":"Adh-Dhariyat","verses_count":60,"verses":[{"text_madani":"وَالذَّارِيَاتِ ذَرْوًا","translation_en":"I swear by the wind that scatters far and wide,","translation_id":"Demi (angin) yang menerbangkan debu,"},{"text_madani":"فَالْحَامِلَاتِ وِقْرًا","translation_en":"Then those clouds bearing the load (of minute things in space).","translation_id":"dan awan yang mengandung (hujan),"},{"text_madani":"فَالْجَارِيَاتِ يُسْرًا","translation_en":"Then those (ships) that glide easily,","translation_id":"dan (kapal-kapal) yang berlayar dengan mudah,"},{"text_madani":"فَالْمُقَسِّمَاتِ أَمْرًا","translation_en":"Then those (angels who) distribute blessings by Our command;","translation_id":"dan (malaikat-malaikat) yang membagi-bagi urusan,"},{"text_madani":"إِنَّمَا تُوعَدُونَ لَصَادِقٌ","translation_en":"What you are threatened with is most surely true,","translation_id":"sungguh, apa yang dijanjikan kepadamu pasti benar,"},{"text_madani":"وَإِنَّ الدِّينَ لَوَاقِعٌ","translation_en":"And the judgment must most surely come about.","translation_id":"dan sungguh, (hari) pembalasan pasti terjadi."},{"text_madani":"وَالسَّمَاءِ ذَاتِ الْحُبُكِ","translation_en":"I swear by the heaven full of ways.","translation_id":"Demi langit yang mempunyai jalan-jalan,"},{"text_madani":"إِنَّكُمْ لَفِي قَوْلٍ مُّخْتَلِفٍ","translation_en":"Most surely you are at variance with each other in what you say,","translation_id":"sungguh, kamu benar-benar dalam keadaan berbeda-beda pendapat,"},{"text_madani":"يُؤْفَكُ عَنْهُ مَنْ أُفِكَ","translation_en":"He is turned away from it who would be turned away.","translation_id":"dipalingkan darinya (Al-Qur'an dan Rasul) orang yang dipalingkan."},{"text_madani":"قُتِلَ الْخَرَّاصُونَ","translation_en":"Cursed be the liars,","translation_id":"Terkutuklah orang-orang yang banyak berdusta,"},{"text_madani":"الَّذِينَ هُمْ فِي غَمْرَةٍ سَاهُونَ","translation_en":"Who are in a gulf (of ignorance) neglectful;","translation_id":"(yaitu) orang-orang yang terbenam dalam kebodohan dan kelalaian,"},{"text_madani":"يَسْأَلُونَ أَيَّانَ يَوْمُ الدِّينِ","translation_en":"They ask: When is the day of judgment?","translation_id":"mereka bertanya, “Kapankah hari pembalasan itu?”"},{"text_madani":"يَوْمَ هُمْ عَلَى النَّارِ يُفْتَنُونَ","translation_en":"(It is) the day on which they shall be tried at the fire.","translation_id":"(Hari pembalasan itu ialah) pada hari (ketika) mereka diazab di dalam api neraka."},{"text_madani":"ذُوقُوا فِتْنَتَكُمْ هَٰذَا الَّذِي كُنتُم بِهِ تَسْتَعْجِلُونَ","translation_en":"Taste your persecution! this is what you would hasten on.","translation_id":"(Dikatakan kepada mereka), “Rasakanlah azabmu ini. Inilah azab yang dahulu kamu minta agar disegerakan.”"},{"text_madani":"إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَعُيُونٍ","translation_en":"Surely those who guard (against evil) shall be in gardens and fountains.","translation_id":"Sesungguhnya orang-orang yang bertakwa berada di dalam taman-taman (surga) dan mata air,"},{"text_madani":"آخِذِينَ مَا آتَاهُمْ رَبُّهُمْ ۚ إِنَّهُمْ كَانُوا قَبْلَ ذَٰلِكَ مُحْسِنِينَ","translation_en":"Taking what their Lord gives them; surely they were before that, the doers of good.","translation_id":"mereka mengambil apa yang diberikan Tuhan kepada mereka. Sesungguhnya mereka sebelum itu (di dunia) adalah orang-orang yang berbuat baik;"},{"text_madani":"كَانُوا قَلِيلًا مِّنَ اللَّيْلِ مَا يَهْجَعُونَ","translation_en":"They used to sleep but little in the night.","translation_id":"mereka sedikit sekali tidur pada waktu malam;"},{"text_madani":"وَبِالْأَسْحَارِ هُمْ يَسْتَغْفِرُونَ","translation_en":"And in the morning they asked forgiveness.","translation_id":"dan pada akhir malam mereka memohon ampunan (kepada Allah)."},{"text_madani":"وَفِي أَمْوَالِهِمْ حَقٌّ لِّلسَّائِلِ وَالْمَحْرُومِ","translation_en":"And in their property was a portion due to him who begs and to him who is denied (good).","translation_id":"Dan pada harta benda mereka ada hak untuk orang miskin yang meminta dan orang miskin yang tidak meminta."},{"text_madani":"وَفِي الْأَرْضِ آيَاتٌ لِّلْمُوقِنِينَ","translation_en":"And in the earth there are signs for those who are sure,","translation_id":"Dan di bumi terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang yakin,"},{"text_madani":"وَفِي أَنفُسِكُمْ ۚ أَفَلَا تُبْصِرُونَ","translation_en":"And in your own souls (too); will you not then see?","translation_id":"dan (juga) pada dirimu sendiri. Maka apakah kamu tidak memperhatikan?"},{"text_madani":"وَفِي السَّمَاءِ رِزْقُكُمْ وَمَا تُوعَدُونَ","translation_en":"And in the heaven is your sustenance and what you are threatened with.","translation_id":"Dan di langit terdapat (sebab-sebab) rezekimu dan apa yang dijanjikan kepadamu."},{"text_madani":"فَوَرَبِّ السَّمَاءِ وَالْأَرْضِ إِنَّهُ لَحَقٌّ مِّثْلَ مَا أَنَّكُمْ تَنطِقُونَ","translation_en":"And by the Lord of the heavens and the earth! it is most surely the truth, just as you do speak.","translation_id":"Maka demi Tuhan langit dan bumi, sungguh, apa yang dijanjikan itu pasti terjadi seperti apa yang kamu ucapkan."},{"text_madani":"هَلْ أَتَاكَ حَدِيثُ ضَيْفِ إِبْرَاهِيمَ الْمُكْرَمِينَ","translation_en":"Has there come to you information about the honored guests of Ibrahim?","translation_id":"Sudahkah sampai kepadamu (Muhammad) cerita tamu Ibrahim (malaikat-malaikat) yang dimuliakan?"},{"text_madani":"إِذْ دَخَلُوا عَلَيْهِ فَقَالُوا سَلَامًا ۖ قَالَ سَلَامٌ قَوْمٌ مُّنكَرُونَ","translation_en":"When they entered upon him, they said: Peace. Peace, said he, a strange people.","translation_id":"(Ingatlah) ketika mereka masuk ke tempatnya lalu mengucapkan, “Salaman” (salam), Ibrahim menjawab, “Salamun” (salam). (Mereka itu) orang-orang yang belum dikenalnya."},{"text_madani":"فَرَاغَ إِلَىٰ أَهْلِهِ فَجَاءَ بِعِجْلٍ سَمِينٍ","translation_en":"Then he turned aside to his family secretly and brought a fat (roasted) calf,","translation_id":"Maka diam-diam dia (Ibrahim) pergi menemui keluarganya, kemudian dibawanya daging anak sapi gemuk (yang dibakar),"},{"text_madani":"فَقَرَّبَهُ إِلَيْهِمْ قَالَ أَلَا تَأْكُلُونَ","translation_en":"So he brought it near them. He said: What! will you not eat?","translation_id":"lalu dihidangkannya kepada mereka (tetapi mereka tidak mau makan). Ibrahim berkata, “Mengapa tidak kamu makan.”"},{"text_madani":"فَأَوْجَسَ مِنْهُمْ خِيفَةً ۖ قَالُوا لَا تَخَفْ ۖ وَبَشَّرُوهُ بِغُلَامٍ عَلِيمٍ","translation_en":"So he conceived in his mind a fear on account of them. They said: Fear not. And they gave him the good news of a boy possessing knowledge.","translation_id":"Maka dia (Ibrahim) merasa takut terhadap mereka. Mereka berkata, “Janganlah kamu takut,” dan mereka memberi kabar gembira kepadanya dengan (kelahiran) seorang anak yang alim (Ishak)."},{"text_madani":"فَأَقْبَلَتِ امْرَأَتُهُ فِي صَرَّةٍ فَصَكَّتْ وَجْهَهَا وَقَالَتْ عَجُوزٌ عَقِيمٌ","translation_en":"Then his wife came up in great grief, and she struck her face and said: An old barren woman!","translation_id":"Kemudian istrinya datang memekik (tercengang) lalu menepuk wajahnya sendiri seraya berkata, “(Aku ini) seorang perempuan tua yang mandul.”"},{"text_madani":"قَالُوا كَذَٰلِكِ قَالَ رَبُّكِ ۖ إِنَّهُ هُوَ الْحَكِيمُ الْعَلِيمُ","translation_en":"They said: Thus says your Lord: Surely He is the Wise, the Knowing.","translation_id":"Mereka berkata, “Demikianlah Tuhanmu berfirman. Sungguh, Dialah Yang Mahabijaksana, Maha Mengetahui.”"},{"text_madani":"قَالَ فَمَا خَطْبُكُمْ أَيُّهَا الْمُرْسَلُونَ","translation_en":"He said: What is your affair then, O messengers!","translation_id":"Dia (Ibrahim) berkata, “Apakah urusanmu yang penting wahai para utusan?”"},{"text_madani":"قَالُوا إِنَّا أُرْسِلْنَا إِلَىٰ قَوْمٍ مُّجْرِمِينَ","translation_en":"They said: Surely we are sent to a guilty people,","translation_id":"Mereka menjawab, “Sesungguhnya kami diutus kepada kaum yang berdosa (kaum Luth),"},{"text_madani":"لِنُرْسِلَ عَلَيْهِمْ حِجَارَةً مِّن طِينٍ","translation_en":"That we may send down upon them stone of clay,","translation_id":"agar Kami menimpa mereka dengan batu-batu dari tanah (yang keras),"},{"text_madani":"مُّسَوَّمَةً عِندَ رَبِّكَ لِلْمُسْرِفِينَ","translation_en":"Sent forth from your Lord for the extravagant.","translation_id":"yang ditandai dari Tuhanmu untuk (membinasakan) orang-orang yang melampaui batas.”"},{"text_madani":"فَأَخْرَجْنَا مَن كَانَ فِيهَا مِنَ الْمُؤْمِنِينَ","translation_en":"Then We brought forth such as were therein of the believers.","translation_id":"Lalu Kami keluarkan orang-orang yang beriman yang berada di dalamnya (negeri kaum Luth) itu."},{"text_madani":"فَمَا وَجَدْنَا فِيهَا غَيْرَ بَيْتٍ مِّنَ الْمُسْلِمِينَ","translation_en":"But We did not find therein save a (single) house of those who submitted (the Muslims).","translation_id":"Maka Kami tidak mendapati di dalamnya (negeri itu), kecuali sebuah rumah dari orang-orang Muslim (Luth)."},{"text_madani":"وَتَرَكْنَا فِيهَا آيَةً لِّلَّذِينَ يَخَافُونَ الْعَذَابَ الْأَلِيمَ","translation_en":"And We left therein a sign for those who fear the painful punishment.","translation_id":"Dan Kami tinggalkan padanya (negeri itu) suatu tanda bagi orang-orang yang takut kepada azab yang pedih."},{"text_madani":"وَفِي مُوسَىٰ إِذْ أَرْسَلْنَاهُ إِلَىٰ فِرْعَوْنَ بِسُلْطَانٍ مُّبِينٍ","translation_en":"And in Musa: When We sent him to Firon with clear authority.","translation_id":"Dan pada Musa (terdapat tanda-tanda kekuasaan Allah) ketika Kami mengutusnya kepada Fir‘aun dengan membawa mukjizat yang nyata."},{"text_madani":"فَتَوَلَّىٰ بِرُكْنِهِ وَقَالَ سَاحِرٌ أَوْ مَجْنُونٌ","translation_en":"But he turned away with his forces and said: A magician or a mad man.","translation_id":"Tetapi dia (Fir‘aun) bersama bala tentaranya berpaling dan berkata, “Dia adalah seorang pesihir atau orang gila.”"},{"text_madani":"فَأَخَذْنَاهُ وَجُنُودَهُ فَنَبَذْنَاهُمْ فِي الْيَمِّ وَهُوَ مُلِيمٌ","translation_en":"So We seized him and his hosts and hurled them into the sea and he was blamable.","translation_id":"Maka Kami siksa dia beserta bala tentaranya, lalu Kami lemparkan mereka ke dalam laut, dalam keadaan tercela."},{"text_madani":"وَفِي عَادٍ إِذْ أَرْسَلْنَا عَلَيْهِمُ الرِّيحَ الْعَقِيمَ","translation_en":"And in Ad: When We sent upon them the destructive wind.","translation_id":"Dan (juga) pada (kisah kaum) ‘Ad, ketika Kami kirimkan kepada mereka angin yang membinasakan,"},{"text_madani":"مَا تَذَرُ مِن شَيْءٍ أَتَتْ عَلَيْهِ إِلَّا جَعَلَتْهُ كَالرَّمِيمِ","translation_en":"It did not leave aught on which it blew, but it made it like ashes.","translation_id":"(angin itu) tidak membiarkan suatu apa pun yang dilandanya, bahkan dijadikannya seperti serbuk."},{"text_madani":"وَفِي ثَمُودَ إِذْ قِيلَ لَهُمْ تَمَتَّعُوا حَتَّىٰ حِينٍ","translation_en":"And in Samood: When it was said to them: Enjoy yourselves for a while.","translation_id":"Dan pada (kisah kaum) Tsamud, ketika dikatakan kepada mereka, “Bersenang-senanglah kamu sampai waktu yang ditentukan.”"},{"text_madani":"فَعَتَوْا عَنْ أَمْرِ رَبِّهِمْ فَأَخَذَتْهُمُ الصَّاعِقَةُ وَهُمْ يَنظُرُونَ","translation_en":"But they revolted against the commandment of their Lord, so the rumbling overtook them while they saw.","translation_id":"Lalu mereka berlaku angkuh terhadap perintah Tuhannya, maka mereka di-sambar petir sedang mereka melihatnya."},{"text_madani":"فَمَا اسْتَطَاعُوا مِن قِيَامٍ وَمَا كَانُوا مُنتَصِرِينَ","translation_en":"So they were not able to rise up, nor could they defend themselves-","translation_id":"Maka mereka tidak mampu bangun dan juga tidak mendapat pertolongan,"},{"text_madani":"وَقَوْمَ نُوحٍ مِّن قَبْلُ ۖ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ","translation_en":"And the people of Nuh before, surely they were a transgressing people.","translation_id":"dan sebelum itu (telah Kami binasakan) kaum Nuh. Sungguh, mereka adalah kaum yang fasik."},{"text_madani":"وَالسَّمَاءَ بَنَيْنَاهَا بِأَيْدٍ وَإِنَّا لَمُوسِعُونَ","translation_en":"And the heaven, We raised it high with power, and most surely We are the makers of things ample.","translation_id":"Dan langit Kami bangun dengan kekuasaan (Kami), dan Kami benar-benar meluaskannya."},{"text_madani":"وَالْأَرْضَ فَرَشْنَاهَا فَنِعْمَ الْمَاهِدُونَ","translation_en":"And the earth, We have made it a wide extent; how well have We then spread (it) out.","translation_id":"Dan bumi Kami hamparkan; maka (Kami) sebaik-baik yang telah menghamparkan."},{"text_madani":"وَمِن كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ لَعَلَّكُمْ تَذَكَّرُونَ","translation_en":"And of everything We have created pairs that you may be mindful.","translation_id":"Dan segala sesuatu Kami ciptakan berpasang-pasangan agar kamu mengingat (kebesaran Allah)."},{"text_madani":"فَفِرُّوا إِلَى اللَّهِ ۖ إِنِّي لَكُم مِّنْهُ نَذِيرٌ مُّبِينٌ","translation_en":"Therefore fly to Allah, surely I am a plain warner to you from Him.","translation_id":"Maka segeralah kembali kepada (menaati) Allah. Sungguh, aku seorang pemberi peringatan yang jelas dari Allah untukmu."},{"text_madani":"وَلَا تَجْعَلُوا مَعَ اللَّهِ إِلَٰهًا آخَرَ ۖ إِنِّي لَكُم مِّنْهُ نَذِيرٌ مُّبِينٌ","translation_en":"And do not set up with Allah another god: surely I am a plain warner to you from Him.","translation_id":"Dan janganlah kamu mengadakan tuhan yang lain selain Allah. Sungguh, aku seorang pemberi peringatan yang jelas dari Allah untukmu."},{"text_madani":"كَذَٰلِكَ مَا أَتَى الَّذِينَ مِن قَبْلِهِم مِّن رَّسُولٍ إِلَّا قَالُوا سَاحِرٌ أَوْ مَجْنُونٌ","translation_en":"Thus there did not come to those before them a messenger but they said: A magician or a mad man.","translation_id":"Demikianlah setiap kali seorang Rasul yang datang kepada orang-orang yang sebelum mereka, mereka (kaumnya) pasti mengatakan, “Dia itu pesihir atau orang gila.”"},{"text_madani":"أَتَوَاصَوْا بِهِ ۚ بَلْ هُمْ قَوْمٌ طَاغُونَ","translation_en":"Have they charged each other with this? Nay! they are an inordinate people.","translation_id":"Apakah mereka saling berpesan tentang apa yang dikatakan itu. Sebenarnya mereka adalah kaum yang melampaui batas."},{"text_madani":"فَتَوَلَّ عَنْهُمْ فَمَا أَنتَ بِمَلُومٍ","translation_en":"Then turn your back upon them for you are not to blame;","translation_id":"Maka berpalinglah engkau dari mereka, dan engkau sama sekali tidak tercela."},{"text_madani":"وَذَكِّرْ فَإِنَّ الذِّكْرَىٰ تَنفَعُ الْمُؤْمِنِينَ","translation_en":"And continue to remind, for surely the reminder profits the believers.","translation_id":"Dan tetaplah memberi peringatan, karena sesungguhnya peringatan itu bermanfaat bagi orang-orang mukmin."},{"text_madani":"وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ","translation_en":"And I have not created the jinn and the men except that they should serve Me.","translation_id":"Aku tidak menciptakan jin dan manusia melainkan agar mereka beribadah kepada-Ku."},{"text_madani":"مَا أُرِيدُ مِنْهُم مِّن رِّزْقٍ وَمَا أُرِيدُ أَن يُطْعِمُونِ","translation_en":"I do not desire from them any sustenance and I do not desire that they should feed Me.","translation_id":"Aku tidak menghendaki rezeki sedikit pun dari mereka dan Aku tidak menghendaki agar mereka memberi makan kepada-Ku."},{"text_madani":"إِنَّ اللَّهَ هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ","translation_en":"Surely Allah is the Bestower of sustenance, the Lord of Power, the Strong.","translation_id":"Sungguh Allah, Dialah Pemberi rezeki Yang Mempunyai Kekuatan lagi Sangat Kokoh."},{"text_madani":"فَإِنَّ لِلَّذِينَ ظَلَمُوا ذَنُوبًا مِّثْلَ ذَنُوبِ أَصْحَابِهِمْ فَلَا يَسْتَعْجِلُونِ","translation_en":"So surely those who are unjust shall have a portion like the portion of their companions, therefore let them not ask Me to hasten on.","translation_id":"Maka sungguh, untuk orang-orang yang zhalim ada bagian (azab) seperti bagian teman-teman mereka (dahulu); maka janganlah mereka meminta kepada-Ku untuk menyegerakannya."},{"text_madani":"فَوَيْلٌ لِّلَّذِينَ كَفَرُوا مِن يَوْمِهِمُ الَّذِي يُوعَدُونَ","translation_en":"Therefore woe to those who disbelieve because of their day which they are threatened with.","translation_id":"Maka celakalah orang-orang yang kafir pada hari yang telah dijanjikan kepada mereka (hari Kiamat)."}]}
