{"chapter_number":26,"name_simple":"Ash-Shu'ara","verses_count":227,"verses":[{"text_madani":"طسم","translation_en":"Ta Sin Mim.","translation_id":"Tha Sin Mim"},{"text_madani":"تِلْكَ آيَاتُ الْكِتَابِ الْمُبِينِ","translation_en":"These are the verses of the Book that makes (things) clear.","translation_id":"Inilah ayat-ayat Kitab (Al-Qur'an) yang jelas."},{"text_madani":"لَعَلَّكَ بَاخِعٌ نَّفْسَكَ أَلَّا يَكُونُوا مُؤْمِنِينَ","translation_en":"Perhaps you will kill yourself with grief because they do not believe.","translation_id":"Boleh jadi engkau (Muhammad) akan membinasakan dirimu (dengan kesedihan), karena mereka (penduduk Mekah) tidak beriman."},{"text_madani":"إِن نَّشَأْ نُنَزِّلْ عَلَيْهِم مِّنَ السَّمَاءِ آيَةً فَظَلَّتْ أَعْنَاقُهُمْ لَهَا خَاضِعِينَ","translation_en":"If We please, We should send down upon them a sign from the heaven so that their necks should stoop to it.","translation_id":"Jika Kami menghendaki, niscaya Kami turunkan kepada mereka mukjizat dari langit, yang akan membuat tengkuk mereka tunduk dengan rendah hati kepadanya."},{"text_madani":"وَمَا يَأْتِيهِم مِّن ذِكْرٍ مِّنَ الرَّحْمَٰنِ مُحْدَثٍ إِلَّا كَانُوا عَنْهُ مُعْرِضِينَ","translation_en":"And there does not come to them a new reminder from the Beneficent Allah but they turn aside from it.","translation_id":"Dan setiap kali disampaikan kepada mereka suatu peringatan baru (ayat Al-Qur'an yang diturunkan) dari Tuhan Yang Maha Pengasih, mereka selalu berpaling darinya."},{"text_madani":"فَقَدْ كَذَّبُوا فَسَيَأْتِيهِمْ أَنبَاءُ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ","translation_en":"So they have indeed rejected (the truth), therefore the news of that which they mock shall soon come to them.","translation_id":"Sungguh, mereka telah mendustakan (Al-Qur'an), maka kelak akan datang kepada mereka (kebenaran) berita-berita mengenai apa (azab) yang dulu mereka perolok-olokkan."},{"text_madani":"أَوَلَمْ يَرَوْا إِلَى الْأَرْضِ كَمْ أَنبَتْنَا فِيهَا مِن كُلِّ زَوْجٍ كَرِيمٍ","translation_en":"Do they not see the earth, how many of every noble kind We have caused to grow in it?","translation_id":"Dan apakah mereka tidak memperhatikan bumi, betapa banyak Kami tumbuhkan di bumi itu berbagai macam (tumbuh-tumbuhan) yang baik?"},{"text_madani":"إِنَّ فِي ذَٰلِكَ لَآيَةً ۖ وَمَا كَانَ أَكْثَرُهُم مُّؤْمِنِينَ","translation_en":"Most surely there is a sign in that, but most of them will not believe.","translation_id":"Sungguh, pada yang demikian itu terdapat tanda (kebesaran Allah), tetapi kebanyakan mereka tidak beriman."},{"text_madani":"وَإِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ","translation_en":"And most surely your Lord is the Mighty, the Merciful.","translation_id":"Dan sungguh, Tuhanmu Dialah Yang Mahaperkasa, Maha Penyayang."},{"text_madani":"وَإِذْ نَادَىٰ رَبُّكَ مُوسَىٰ أَنِ ائْتِ الْقَوْمَ الظَّالِمِينَ","translation_en":"And when your Lord called out to Musa, saying: Go to the unjust people,","translation_id":"Dan (ingatlah) ketika Tuhanmu menyeru Musa (dengan firman-Nya), “Datangilah kaum yang zhalim itu,"},{"text_madani":"قَوْمَ فِرْعَوْنَ ۚ أَلَا يَتَّقُونَ","translation_en":"The people of Firon: Will they not guard (against evil)?","translation_id":"(yaitu) kaum Fir‘aun. Mengapa mereka tidak bertakwa?”"},{"text_madani":"قَالَ رَبِّ إِنِّي أَخَافُ أَن يُكَذِّبُونِ","translation_en":"He said: O my Lord! surely I fear that they will reject me;","translation_id":"Dia (Musa) berkata, “Ya Tuhanku, sungguh, aku takut mereka akan mendustakan aku,"},{"text_madani":"وَيَضِيقُ صَدْرِي وَلَا يَنطَلِقُ لِسَانِي فَأَرْسِلْ إِلَىٰ هَارُونَ","translation_en":"And by breast straitens, and my tongue is not eloquent, therefore send Thou to Haroun (to help me);","translation_id":"sehingga dadaku terasa sempit dan lidahku tidak lancar, maka utuslah Harun (bersamaku)."},{"text_madani":"وَلَهُمْ عَلَيَّ ذَنبٌ فَأَخَافُ أَن يَقْتُلُونِ","translation_en":"And they have a crime against me, therefore I fear that they may slay me.","translation_id":"Sebab aku berdosa terhadap mereka, maka aku takut mereka akan membunuhku.”"},{"text_madani":"قَالَ كَلَّا ۖ فَاذْهَبَا بِآيَاتِنَا ۖ إِنَّا مَعَكُم مُّسْتَمِعُونَ","translation_en":"He said: By no means, so go you both with Our signs; surely We are with you, hearing;","translation_id":"(Allah) berfirman, “Jangan takut (mereka tidak akan dapat membunuhmu)! Maka pergilah kamu berdua dengan membawa ayat-ayat Kami (mukjizat-mukjizat); sungguh, Kami bersamamu mendengarkan (apa yang mereka katakan),"},{"text_madani":"فَأْتِيَا فِرْعَوْنَ فَقُولَا إِنَّا رَسُولُ رَبِّ الْعَالَمِينَ","translation_en":"Then come to Firon and say: Surely we are the messengers of the Lord of the worlds:","translation_id":"maka datanglah kamu berdua kepada Fir‘aun dan katakan, “Sesungguhnya kami adalah rasul-rasul Tuhan seluruh alam,"},{"text_madani":"أَنْ أَرْسِلْ مَعَنَا بَنِي إِسْرَائِيلَ","translation_en":"Then send with us the children of Israel.","translation_id":"lepaskanlah Bani Israil (pergi) bersama kami.”"},{"text_madani":"قَالَ أَلَمْ نُرَبِّكَ فِينَا وَلِيدًا وَلَبِثْتَ فِينَا مِنْ عُمُرِكَ سِنِينَ","translation_en":"(Firon) said: Did we not bring you up as a child among us, and you tarried among us for (many) years of your life?","translation_id":"Dia (Fir‘aun) menjawab, “Bukankah kami telah mengasuhmu dalam lingkungan (keluarga) kami, waktu engkau masih kanak-kanak dan engkau tinggal bersama kami beberapa tahun dari umurmu."},{"text_madani":"وَفَعَلْتَ فَعْلَتَكَ الَّتِي فَعَلْتَ وَأَنتَ مِنَ الْكَافِرِينَ","translation_en":"And you did (that) deed of yours which you did, and you are one of the ungrateful.","translation_id":"Dan engkau (Musa) telah melakukan (kesalahan dari) perbuatan yang telah engkau lakukan dan engkau termasuk orang yang tidak tahu berterima kasih.”"},{"text_madani":"قَالَ فَعَلْتُهَا إِذًا وَأَنَا مِنَ الضَّالِّينَ","translation_en":"He said: I did it then while I was of those unable to see the right course;","translation_id":"Dia (Musa) berkata, “Aku telah melakukannya, dan ketika itu aku termasuk orang yang khilaf."},{"text_madani":"فَفَرَرْتُ مِنكُمْ لَمَّا خِفْتُكُمْ فَوَهَبَ لِي رَبِّي حُكْمًا وَجَعَلَنِي مِنَ الْمُرْسَلِينَ","translation_en":"So I fled from you when I feared you, then my Lord granted me wisdom and made me of the messengers;","translation_id":"Lalu aku lari darimu karena aku takut kepadamu, kemudian Tuhanku menganugerahkan ilmu kepadaku serta Dia menjadikan aku salah seorang di antara rasul-rasul."},{"text_madani":"وَتِلْكَ نِعْمَةٌ تَمُنُّهَا عَلَيَّ أَنْ عَبَّدتَّ بَنِي إِسْرَائِيلَ","translation_en":"And is it a favor of which you remind me that you have enslaved the children of Israel?","translation_id":"Dan itulah kebaikan yang telah engkau berikan kepadaku, (sementara) itu engkau telah memperbudak Bani Israil.”"},{"text_madani":"قَالَ فِرْعَوْنُ وَمَا رَبُّ الْعَالَمِينَ","translation_en":"Firon said: And what is the Lord of the worlds?","translation_id":"Fir‘aun bertanya, “Siapa Tuhan seluruh alam itu?”"},{"text_madani":"قَالَ رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا ۖ إِن كُنتُم مُّوقِنِينَ","translation_en":"He said: The Lord of the heavens and the earth and what is between them, if you would be sure.","translation_id":"Dia (Musa) menjawab, “Tuhan pencipta langit dan bumi dan apa yang ada di antara keduanya (itulah Tuhanmu), jika kamu mempercayai-Nya.”"},{"text_madani":"قَالَ لِمَنْ حَوْلَهُ أَلَا تَسْتَمِعُونَ","translation_en":"(Firon) said to those around him: Do you not hear?","translation_id":"Dia (Fir‘aun) berkata kepada orang-orang di sekelilingnya, “Apakah kamu tidak mendengar (apa yang dikatakannya)?”"},{"text_madani":"قَالَ رَبُّكُمْ وَرَبُّ آبَائِكُمُ الْأَوَّلِينَ","translation_en":"He said: Your Lord and the Lord of your fathers of old.","translation_id":"Dia (Musa) berkata, “(Dia) Tuhanmu dan juga Tuhan nenek moyangmu terdahulu.”"},{"text_madani":"قَالَ إِنَّ رَسُولَكُمُ الَّذِي أُرْسِلَ إِلَيْكُمْ لَمَجْنُونٌ","translation_en":"Said he: Most surely your Messenger who is sent to you is mad.","translation_id":"Dia (Fir‘aun) berkata, “Sungguh, Rasulmu yang diutus kepada kamu benar-benar orang gila.”"},{"text_madani":"قَالَ رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ وَمَا بَيْنَهُمَا ۖ إِن كُنتُمْ تَعْقِلُونَ","translation_en":"He said: The Lord of the east and the west and what is between them, if you understand.","translation_id":"Dia (Musa) berkata, “(Dialah) Tuhan (yang menguasai) timur dan barat dan apa yang ada di antara keduanya; jika kamu mengerti.”"},{"text_madani":"قَالَ لَئِنِ اتَّخَذْتَ إِلَٰهًا غَيْرِي لَأَجْعَلَنَّكَ مِنَ الْمَسْجُونِينَ","translation_en":"Said he: If you will take a god besides me, I will most certainly make you one of the imprisoned.","translation_id":"Dia (Fir‘aun) berkata, “Sungguh, jika engkau menyembah Tuhan selain aku, pasti aku masukkan engkau ke dalam penjara.”"},{"text_madani":"قَالَ أَوَلَوْ جِئْتُكَ بِشَيْءٍ مُّبِينٍ","translation_en":"He said: What! even if I bring to you something manifest?","translation_id":"Dia (Musa) berkata, “Apakah (engkau akan melakukan itu) sekalipun aku tunjukkan kepadamu sesuatu (bukti) yang nyata?”"},{"text_madani":"قَالَ فَأْتِ بِهِ إِن كُنتَ مِنَ الصَّادِقِينَ","translation_en":"Said he: Bring it then, if you are of the truthful ones.","translation_id":"Dia (Fir‘aun) berkata, “Tunjukkan sesuatu (bukti yang nyata) itu, jika engkau termasuk orang yang benar!”"},{"text_madani":"فَأَلْقَىٰ عَصَاهُ فَإِذَا هِيَ ثُعْبَانٌ مُّبِينٌ","translation_en":"So he cast down his rod, and lo! it was an obvious serpent,","translation_id":"Maka dia (Musa) melemparkan tongkatnya, tiba-tiba tongkat itu menjadi ular besar yang sebenarnya."},{"text_madani":"وَنَزَعَ يَدَهُ فَإِذَا هِيَ بَيْضَاءُ لِلنَّاظِرِينَ","translation_en":"And he drew forth his hand, and lo! it appeared white to the onlookers.","translation_id":"Dan dia mengeluarkan tangannya (dari dalam bajunya), tiba-tiba tangan itu menjadi putih (bercahaya) bagi orang-orang yang melihatnya."},{"text_madani":"قَالَ لِلْمَلَإِ حَوْلَهُ إِنَّ هَٰذَا لَسَاحِرٌ عَلِيمٌ","translation_en":"(Firon) said to the chiefs around him: Most surely this is a skillful magician,","translation_id":"Dia (Fir‘aun) berkata kepada para pemuka di sekelilingnya, “Sesungguhnya dia (Musa) ini pasti seorang pesihir yang pandai,"},{"text_madani":"يُرِيدُ أَن يُخْرِجَكُم مِّنْ أَرْضِكُم بِسِحْرِهِ فَمَاذَا تَأْمُرُونَ","translation_en":"Who desires to turn you out of your land with his magic; what is it then that you advise?","translation_id":"dia hendak mengusir kamu dari negerimu dengan sihirnya; karena itu apakah yang kamu sarankan?”"},{"text_madani":"قَالُوا أَرْجِهْ وَأَخَاهُ وَابْعَثْ فِي الْمَدَائِنِ حَاشِرِينَ","translation_en":"They said: Give him and his brother respite and send heralds into the cities","translation_id":"Mereka menjawab, “Tahanlah (untuk sementara) dia dan saudaranya, dan utuslah ke seluruh negeri orang-orang yang akan mengumpulkan (pesihir),"},{"text_madani":"يَأْتُوكَ بِكُلِّ سَحَّارٍ عَلِيمٍ","translation_en":"That they should bring to you every skillful magician.","translation_id":"niscaya mereka akan mendatangkan semua pesihir yang pandai kepadamu.”"},{"text_madani":"فَجُمِعَ السَّحَرَةُ لِمِيقَاتِ يَوْمٍ مَّعْلُومٍ","translation_en":"So the magicians were gathered together at the appointed time on the fixed day,","translation_id":"Lalu dikumpulkanlah para pesihir pada waktu (yang ditetapkan) pada hari yang telah ditentukan,"},{"text_madani":"وَقِيلَ لِلنَّاسِ هَلْ أَنتُم مُّجْتَمِعُونَ","translation_en":"And it was said to the people: Will you gather together?","translation_id":"dan diumumkan kepada orang banyak, “Berkumpullah kamu semua,"},{"text_madani":"لَعَلَّنَا نَتَّبِعُ السَّحَرَةَ إِن كَانُوا هُمُ الْغَالِبِينَ","translation_en":"Haply we may follow the magicians, if they are the vanquishers.","translation_id":"agar kita mengikuti para pesihir itu, jika mereka yang menang.”"},{"text_madani":"فَلَمَّا جَاءَ السَّحَرَةُ قَالُوا لِفِرْعَوْنَ أَئِنَّ لَنَا لَأَجْرًا إِن كُنَّا نَحْنُ الْغَالِبِينَ","translation_en":"And when the magicians came, they said to Firon: Shall we get a reward if we are the vanquishers?","translation_id":"Maka ketika para pesihir datang, mereka berkata kepada Fir‘aun, “Apakah kami benar-benar akan mendapat imbalan yang besar jika kami yang menang?”"},{"text_madani":"قَالَ نَعَمْ وَإِنَّكُمْ إِذًا لَّمِنَ الْمُقَرَّبِينَ","translation_en":"He said: Yes, and surely you will then be of those who are made near.","translation_id":"Dia (Fir‘aun) menjawab, “Ya, dan bahkan kamu pasti akan mendapat kedudukan yang dekat (kepadaku).”"},{"text_madani":"قَالَ لَهُم مُّوسَىٰ أَلْقُوا مَا أَنتُم مُّلْقُونَ","translation_en":"Musa said to them: Cast what you are going to cast.","translation_id":"Dia (Musa) berkata kepada mereka, “Lemparkanlah apa yang hendak kamu lemparkan.”"},{"text_madani":"فَأَلْقَوْا حِبَالَهُمْ وَعِصِيَّهُمْ وَقَالُوا بِعِزَّةِ فِرْعَوْنَ إِنَّا لَنَحْنُ الْغَالِبُونَ","translation_en":"So they cast down their cords and their rods and said: By Firon's power, we shall most surely be victorious.","translation_id":"Lalu mereka melemparkan tali temali dan tongkat-tongkat mereka seraya berkata, “Demi kekuasaan Fir‘aun, pasti kamilah yang akan menang.”"},{"text_madani":"فَأَلْقَىٰ مُوسَىٰ عَصَاهُ فَإِذَا هِيَ تَلْقَفُ مَا يَأْفِكُونَ","translation_en":"Then Musa cast down his staff and lo! it swallowed up the lies they told.","translation_id":"Kemudian Musa melemparkan tongkatnya, maka tiba-tiba ia menelan benda-benda palsu yang mereka ada-adakan itu."},{"text_madani":"فَأُلْقِيَ السَّحَرَةُ سَاجِدِينَ","translation_en":"And the magicians were thrown down prostrate;","translation_id":"Maka menyungkurlah para pesihir itu, bersujud."},{"text_madani":"قَالُوا آمَنَّا بِرَبِّ الْعَالَمِينَ","translation_en":"They said: We believe in the Lord of the worlds:","translation_id":"Mereka berkata, “Kami beriman kepada Tuhan seluruh alam,"},{"text_madani":"رَبِّ مُوسَىٰ وَهَارُونَ","translation_en":"The Lord of Musa and Haroun.","translation_id":"(yaitu) Tuhannya Musa dan Harun.”"},{"text_madani":"قَالَ آمَنتُمْ لَهُ قَبْلَ أَنْ آذَنَ لَكُمْ ۖ إِنَّهُ لَكَبِيرُكُمُ الَّذِي عَلَّمَكُمُ السِّحْرَ فَلَسَوْفَ تَعْلَمُونَ ۚ لَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُم مِّنْ خِلَافٍ وَلَأُصَلِّبَنَّكُمْ أَجْمَعِينَ","translation_en":"Said he: You believe in him before I give you permission; most surely he is the chief of you who taught you the magic, so you shall know: certainly I will cut off your hands and your feet on opposite sides, and certainly I will crucify you all.","translation_id":"Dia (Fir‘aun) berkata, “Mengapa kamu beriman kepada Musa sebelum aku memberi izin kepadamu? Sesungguhnya dia pemimpinmu yang mengajarkan sihir kepadamu. Nanti kamu pasti akan tahu (akibat perbuatanmu). Pasti akan kupotong tangan dan kakimu bersilang dan sungguh, akan kusalib kamu semuanya.”"},{"text_madani":"قَالُوا لَا ضَيْرَ ۖ إِنَّا إِلَىٰ رَبِّنَا مُنقَلِبُونَ","translation_en":"They said: No harm; surely to our Lord we go back;","translation_id":"Mereka berkata, “Tidak ada yang kami takutkan, karena kami akan kembali kepada Tuhan kami."},{"text_madani":"إِنَّا نَطْمَعُ أَن يَغْفِرَ لَنَا رَبُّنَا خَطَايَانَا أَن كُنَّا أَوَّلَ الْمُؤْمِنِينَ","translation_en":"Surely we hope that our Lord will forgive us our wrongs because we are the first of the believers.","translation_id":"Sesungguhnya kami sangat menginginkan sekiranya Tuhan kami akan mengampuni kesalahan kami, karena kami menjadi orang yang pertama-tama beriman.”"},{"text_madani":"وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنْ أَسْرِ بِعِبَادِي إِنَّكُم مُّتَّبَعُونَ","translation_en":"And We revealed to Musa, saying: Go away with My servants travelling by night, surely you will be pursued.","translation_id":"Dan Kami wahyukan (perintahkan) kepada Musa, “Pergilah pada malam hari dengan membawa hamba-hamba-Ku (Bani Israil), sebab pasti kamu akan dikejar.”"},{"text_madani":"فَأَرْسَلَ فِرْعَوْنُ فِي الْمَدَائِنِ حَاشِرِينَ","translation_en":"So Firon sent heralds into the cities;","translation_id":"Kemudian Fir‘aun mengirimkan orang ke kota-kota (untuk mengumpulkan bala tentaranya)."},{"text_madani":"إِنَّ هَٰؤُلَاءِ لَشِرْذِمَةٌ قَلِيلُونَ","translation_en":"Most surely these are a small company;","translation_id":"(Fir‘aun berkata), “Sesungguhnya mereka (Bani Israil) hanya sekelompok kecil,"},{"text_madani":"وَإِنَّهُمْ لَنَا لَغَائِظُونَ","translation_en":"And most surely they have enraged us;","translation_id":"dan sesungguhnya mereka telah berbuat hal-hal yang menimbulkan amarah kita,"},{"text_madani":"وَإِنَّا لَجَمِيعٌ حَاذِرُونَ","translation_en":"And most surely we are a vigilant multitude.","translation_id":"dan sesungguhnya kita semua tanpa kecuali harus selalu waspada.”"},{"text_madani":"فَأَخْرَجْنَاهُم مِّن جَنَّاتٍ وَعُيُونٍ","translation_en":"So We turned them out of gardens and springs,","translation_id":"Kemudian, Kami keluarkan mereka (Fir‘aun dan kaumnya) dari taman-taman dan mata air,"},{"text_madani":"وَكُنُوزٍ وَمَقَامٍ كَرِيمٍ","translation_en":"And treasures and goodly dwellings,","translation_id":"dan (dari) harta kekayaan dan kedudukan yang mulia,"},{"text_madani":"كَذَٰلِكَ وَأَوْرَثْنَاهَا بَنِي إِسْرَائِيلَ","translation_en":"Even so. And We gave them as a heritage to the children of Israel.","translation_id":"demikianlah, dan Kami anugerahkan semuanya (itu) kepada Bani Israil."},{"text_madani":"فَأَتْبَعُوهُم مُّشْرِقِينَ","translation_en":"Then they pursued them at sunrise.","translation_id":"Lalu (Fir‘aun dan bala tentaranya) dapat menyusul mereka pada waktu matahari terbit."},{"text_madani":"فَلَمَّا تَرَاءَى الْجَمْعَانِ قَالَ أَصْحَابُ مُوسَىٰ إِنَّا لَمُدْرَكُونَ","translation_en":"So when the two hosts saw each other, the companions of Musa cried out: Most surely we are being overtaken.","translation_id":"Maka ketika kedua golongan itu saling melihat, berkatalah pengikut-pengikut Musa, “Kita benar-benar akan tersusul.”"},{"text_madani":"قَالَ كَلَّا ۖ إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ","translation_en":"He said: By no means; surely my Lord is with me: He will show me a way out.","translation_id":"Dia (Musa) menjawab, “Sekali-kali tidak akan (tersusul); sesungguhnya Tuhanku bersamaku, Dia akan memberi petunjuk kepadaku.”"},{"text_madani":"فَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنِ اضْرِب بِّعَصَاكَ الْبَحْرَ ۖ فَانفَلَقَ فَكَانَ كُلُّ فِرْقٍ كَالطَّوْدِ الْعَظِيمِ","translation_en":"Then We revealed to Musa: Strike the sea with your staff. So it had cloven asunder, and each part was like a huge mound.","translation_id":"Lalu Kami wahyukan kepada Musa, “Pukullah laut itu dengan tongkatmu.” Maka terbelahlah lautan itu, dan setiap belahan seperti gunung yang besar."},{"text_madani":"وَأَزْلَفْنَا ثَمَّ الْآخَرِينَ","translation_en":"And We brought near, there, the others.","translation_id":"Dan di sanalah Kami dekatkan golongan yang lain."},{"text_madani":"وَأَنجَيْنَا مُوسَىٰ وَمَن مَّعَهُ أَجْمَعِينَ","translation_en":"And We saved Musa and those with him, all of them.","translation_id":"Dan Kami selamatkan Musa dan orang-orang yang bersamanya."},{"text_madani":"ثُمَّ أَغْرَقْنَا الْآخَرِينَ","translation_en":"Then We drowned the others.","translation_id":"Kemudian Kami tenggelamkan golongan yang lain."},{"text_madani":"إِنَّ فِي ذَٰلِكَ لَآيَةً ۖ وَمَا كَانَ أَكْثَرُهُم مُّؤْمِنِينَ","translation_en":"Most surely there is a sign in this, but most of them do not believe.","translation_id":"Sungguh, pada yang demikian itu terdapat suatu tanda (kekuasaan Allah), tetapi kebanyakan mereka tidak beriman."},{"text_madani":"وَإِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ","translation_en":"And most surely your Lord is the Mighty, the Merciful.","translation_id":"Dan sesungguhnya Tuhanmu Dialah Yang Mahaperkasa, Maha Penyayang."},{"text_madani":"وَاتْلُ عَلَيْهِمْ نَبَأَ إِبْرَاهِيمَ","translation_en":"And recite to them the story of Ibrahim.","translation_id":"Dan bacakanlah kepada mereka kisah Ibrahim."},{"text_madani":"إِذْ قَالَ لِأَبِيهِ وَقَوْمِهِ مَا تَعْبُدُونَ","translation_en":"When he said to his father and his people: What do you worship?","translation_id":"Ketika dia (Ibrahim) berkata kepada ayahnya dan kaumnya, “Apakah yang kamu sembah?”"},{"text_madani":"قَالُوا نَعْبُدُ أَصْنَامًا فَنَظَلُّ لَهَا عَاكِفِينَ","translation_en":"They said: We worship idols, so we shall be their votaries.","translation_id":"Mereka menjawab, “Kami menyembah berhala-berhala dan kami senantiasa tekun menyembahnya.”"},{"text_madani":"قَالَ هَلْ يَسْمَعُونَكُمْ إِذْ تَدْعُونَ","translation_en":"He said: Do they hear you when you call?","translation_id":"Dia (Ibrahim) berkata, “Apakah mereka mendengarmu ketika kamu berdoa (kepadanya)?"},{"text_madani":"أَوْ يَنفَعُونَكُمْ أَوْ يَضُرُّونَ","translation_en":"Or do they profit you or cause you harm?","translation_id":"Atau (dapatkah) mereka memberi manfaat atau mencelakakan kamu?”"},{"text_madani":"قَالُوا بَلْ وَجَدْنَا آبَاءَنَا كَذَٰلِكَ يَفْعَلُونَ","translation_en":"They said: Nay, we found our fathers doing so.","translation_id":"Mereka menjawab, “Tidak, tetapi kami dapati nenek moyang kami berbuat begitu.”"},{"text_madani":"قَالَ أَفَرَأَيْتُم مَّا كُنتُمْ تَعْبُدُونَ","translation_en":"He said: Have you then considered what you have been worshipping:","translation_id":"Dia (Ibrahim) berkata, “Apakah kamu memperhatikan apa yang kamu sembah,"},{"text_madani":"أَنتُمْ وَآبَاؤُكُمُ الْأَقْدَمُونَ","translation_en":"You and your ancient sires.","translation_id":"kamu dan nenek moyang kamu yang terdahulu?"},{"text_madani":"فَإِنَّهُمْ عَدُوٌّ لِّي إِلَّا رَبَّ الْعَالَمِينَ","translation_en":"Surely they are enemies to me, but not (so) the Lord of the worlds;","translation_id":"Sesungguhnya mereka (apa yang kamu sembah) itu musuhku, lain halnya Tuhan seluruh alam,"},{"text_madani":"الَّذِي خَلَقَنِي فَهُوَ يَهْدِينِ","translation_en":"Who created me, then He has shown me the way:","translation_id":"(yaitu) Yang telah menciptakan aku, maka Dia yang memberi petunjuk kepadaku,"},{"text_madani":"وَالَّذِي هُوَ يُطْعِمُنِي وَيَسْقِينِ","translation_en":"And He Who gives me to eat and gives me to drink:","translation_id":"dan Yang memberi makan dan minum kepadaku;"},{"text_madani":"وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ","translation_en":"And when I am sick, then He restores me to health","translation_id":"dan apabila aku sakit, Dialah yang menyembuhkan aku,"},{"text_madani":"وَالَّذِي يُمِيتُنِي ثُمَّ يُحْيِينِ","translation_en":"And He Who will cause me to die, then give me life;","translation_id":"dan Yang akan mematikan aku, kemudian akan menghidupkan aku (kembali),"},{"text_madani":"وَالَّذِي أَطْمَعُ أَن يَغْفِرَ لِي خَطِيئَتِي يَوْمَ الدِّينِ","translation_en":"And Who, I hope, will forgive me my mistakes on the day of judgment.","translation_id":"dan Yang sangat kuinginkan akan mengampuni kesalahanku pada hari Kiamat.”"},{"text_madani":"رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ","translation_en":"My Lord: Grant me wisdom, and join me with the good","translation_id":"(Ibrahim berdoa), “Ya Tuhanku, berikanlah kepadaku ilmu dan masukkanlah aku ke dalam golongan orang-orang yang shalih,"},{"text_madani":"وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ","translation_en":"And ordain for me a goodly mention among posterity","translation_id":"dan jadikanlah aku buah tutur yang baik bagi orang-orang (yang datang) kemudian,"},{"text_madani":"وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ","translation_en":"And make me of the heirs of the garden of bliss","translation_id":"dan jadikanlah aku termasuk orang yang mewarisi surga yang penuh kenikmatan,"},{"text_madani":"وَاغْفِرْ لِأَبِي إِنَّهُ كَانَ مِنَ الضَّالِّينَ","translation_en":"And forgive my father, for surely he is of those who have gone astray;","translation_id":"dan ampunilah ayahku, sesungguhnya dia termasuk orang yang sesat,"},{"text_madani":"وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ","translation_en":"And disgrace me not on the day when they are raised","translation_id":"dan janganlah Engkau hinakan aku pada hari mereka dibangkitkan,"},{"text_madani":"يَوْمَ لَا يَنفَعُ مَالٌ وَلَا بَنُونَ","translation_en":"The day on which property will not avail, nor sons","translation_id":"(yaitu) pada hari (ketika) harta dan anak-anak tidak berguna,"},{"text_madani":"إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ","translation_en":"Except him who comes to Allah with a heart free (from evil).","translation_id":"kecuali orang-orang yang menghadap Allah dengan hati yang bersih,"},{"text_madani":"وَأُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِينَ","translation_en":"And the garden shall be brought near for those who guard (against evil),","translation_id":"dan surga didekatkan kepada orang-orang yang bertakwa,"},{"text_madani":"وَبُرِّزَتِ الْجَحِيمُ لِلْغَاوِينَ","translation_en":"And the hell shall be made manifest to the erring ones,","translation_id":"dan neraka Jahim diperlihatkan dengan jelas kepada orang-orang yang sesat,”"},{"text_madani":"وَقِيلَ لَهُمْ أَيْنَ مَا كُنتُمْ تَعْبُدُونَ","translation_en":"And it shall be said to them: Where are those that you used to worship;","translation_id":"dan dikatakan kepada mereka, “Di mana berhala-berhala yang dahulu kamu sembah,"},{"text_madani":"مِن دُونِ اللَّهِ هَلْ يَنصُرُونَكُمْ أَوْ يَنتَصِرُونَ","translation_en":"Besides Allah? Can they help you or yet help themselves?","translation_id":"selain Allah? Dapatkah mereka menolong kamu atau menolong diri mereka sendiri?”"},{"text_madani":"فَكُبْكِبُوا فِيهَا هُمْ وَالْغَاوُونَ","translation_en":"So they shall be thrown down into it, they and the erring ones,","translation_id":"Maka mereka (sesembahan itu) dijungkirkan ke dalam neraka bersama orang-orang yang sesat,"},{"text_madani":"وَجُنُودُ إِبْلِيسَ أَجْمَعُونَ","translation_en":"And the hosts of the Shaitan, all.","translation_id":"dan bala tentara Iblis semuanya."},{"text_madani":"قَالُوا وَهُمْ فِيهَا يَخْتَصِمُونَ","translation_en":"They shall say while they contend therein:","translation_id":"Mereka berkata sambil bertengkar di dalamnya (neraka),"},{"text_madani":"تَاللَّهِ إِن كُنَّا لَفِي ضَلَالٍ مُّبِينٍ","translation_en":"By Allah! we were certainly in manifest error,","translation_id":"”Demi Allah, sesungguhnya kita dahulu (di dunia) dalam kesesatan yang nyata,"},{"text_madani":"إِذْ نُسَوِّيكُم بِرَبِّ الْعَالَمِينَ","translation_en":"When we made you equal to the Lord of the worlds;","translation_id":"karena kita mempersamakan kamu (berhala-berhala) dengan Tuhan seluruh alam."},{"text_madani":"وَمَا أَضَلَّنَا إِلَّا الْمُجْرِمُونَ","translation_en":"And none but the guilty led us astray;","translation_id":"Dan tidak ada yang menyesatkan kita kecuali orang-orang yang berdosa."},{"text_madani":"فَمَا لَنَا مِن شَافِعِينَ","translation_en":"So we have no intercessors,","translation_id":"Maka sehingga (sekarang) kita tidak mempunyai pemberi syafaat (penolong),"},{"text_madani":"وَلَا صَدِيقٍ حَمِيمٍ","translation_en":"Nor a true friend;","translation_id":"dan tidak pula mempunyai teman yang akrab,"},{"text_madani":"فَلَوْ أَنَّ لَنَا كَرَّةً فَنَكُونَ مِنَ الْمُؤْمِنِينَ","translation_en":"But if we could but once return, we would be of the believers.","translation_id":"Maka seandainya kita dapat kembali (ke dunia) niscaya kita menjadi orang-orang yang beriman.”"},{"text_madani":"إِنَّ فِي ذَٰلِكَ لَآيَةً ۖ وَمَا كَانَ أَكْثَرُهُم مُّؤْمِنِينَ","translation_en":"Most surely there is a sign in this, but most of them do not believe.","translation_id":"Sungguh, pada yang demikian itu terdapat tanda (kekuasaan Allah), tetapi kebanyakan mereka tidak beriman."},{"text_madani":"وَإِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ","translation_en":"And most surely your Lord is the Mighty, the Merciful.","translation_id":"Dan sungguh, Tuhanmu benar-benar Dialah Mahaperkasa, Maha Penyayang."},{"text_madani":"كَذَّبَتْ قَوْمُ نُوحٍ الْمُرْسَلِينَ","translation_en":"The people of Nuh rejected the messengers.","translation_id":"Kaum Nuh telah mendustakan para rasul."},{"text_madani":"إِذْ قَالَ لَهُمْ أَخُوهُمْ نُوحٌ أَلَا تَتَّقُونَ","translation_en":"When their brother Nuh said to them: Will you not guard (against evil)?","translation_id":"Ketika saudara mereka (Nuh) berkata kepada mereka, “Mengapa kamu tidak bertakwa?"},{"text_madani":"إِنِّي لَكُمْ رَسُولٌ أَمِينٌ","translation_en":"Surely I am a faithful messenger to you;","translation_id":"Sesungguhnya aku ini seorang rasul kepercayaan (yang diutus) kepadamu,"},{"text_madani":"فَاتَّقُوا اللَّهَ وَأَطِيعُونِ","translation_en":"Therefore guard against (the punishment of) Allah and obey me","translation_id":"Maka bertakwalah kamu kepada Allah dan taatlah kepadaku."},{"text_madani":"وَمَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ ۖ إِنْ أَجْرِيَ إِلَّا عَلَىٰ رَبِّ الْعَالَمِينَ","translation_en":"And I do not ask you any reward for it; my reward is only with the Lord of the worlds:","translation_id":"Dan aku tidak meminta imbalan kepadamu atas ajakan itu; imbalanku hanyalah dari Tuhan seluruh alam."},{"text_madani":"فَاتَّقُوا اللَّهَ وَأَطِيعُونِ","translation_en":"So guard against (the punishment of) Allah and obey me.","translation_id":"Maka bertakwalah kamu kepada Allah dan taatlah kepadaku.”"},{"text_madani":"قَالُوا أَنُؤْمِنُ لَكَ وَاتَّبَعَكَ الْأَرْذَلُونَ","translation_en":"They said: Shall we believe in you while the meanest follow you?","translation_id":"Mereka berkata, “Apakah kami harus beriman kepadamu, padahal pengikut-pengikutmu orang-orang yang hina?”"},{"text_madani":"قَالَ وَمَا عِلْمِي بِمَا كَانُوا يَعْمَلُونَ","translation_en":"He said: And what knowledge have I of what they do?","translation_id":"Dia (Nuh) menjawab, “Tidak ada pengetahuanku tentang apa yang mereka kerjakan."},{"text_madani":"إِنْ حِسَابُهُمْ إِلَّا عَلَىٰ رَبِّي ۖ لَوْ تَشْعُرُونَ","translation_en":"Their account is only with my Lord, if you could perceive","translation_id":"Perhitungan (amal perbuatan) mereka tidak lain hanyalah kepada Tuhanku, jika kamu menyadari."},{"text_madani":"وَمَا أَنَا بِطَارِدِ الْمُؤْمِنِينَ","translation_en":"And I am not going to drive away the believers;","translation_id":"Dan aku tidak akan mengusir orang-orang yang beriman."},{"text_madani":"إِنْ أَنَا إِلَّا نَذِيرٌ مُّبِينٌ","translation_en":"I am naught but a plain warner.","translation_id":"Aku (ini) hanyalah pemberi peringatan yang jelas.”"},{"text_madani":"قَالُوا لَئِن لَّمْ تَنتَهِ يَا نُوحُ لَتَكُونَنَّ مِنَ الْمَرْجُومِينَ","translation_en":"They said: If you desist not, O Nuh, you shall most certainly be of those stoned to death.","translation_id":"Mereka berkata, “Wahai Nuh! Sungguh, jika engkau tidak (mau) berhenti, niscaya engkau termasuk orang yang dirajam (dilempari batu sampai mati).”"},{"text_madani":"قَالَ رَبِّ إِنَّ قَوْمِي كَذَّبُونِ","translation_en":"He said: My Lord! Surely my people give me the lie!","translation_id":"Dia (Nuh) berkata, “Ya Tuhanku, sungguh kaumku telah mendustakan aku;"},{"text_madani":"فَافْتَحْ بَيْنِي وَبَيْنَهُمْ فَتْحًا وَنَجِّنِي وَمَن مَّعِيَ مِنَ الْمُؤْمِنِينَ","translation_en":"Therefore judge Thou between me and them with a (just) judgment, and deliver me and those who are with me of the believers.","translation_id":"maka berilah keputusan antara aku dengan mereka, dan selamatkanlah aku dan mereka yang beriman bersamaku.”"},{"text_madani":"فَأَنجَيْنَاهُ وَمَن مَّعَهُ فِي الْفُلْكِ الْمَشْحُونِ","translation_en":"So We delivered him and those with him in the laden ark.","translation_id":"Kemudian Kami menyelamatkannya Nuh dan orang-orang yang bersamanya di dalam kapal yang penuh muatan."},{"text_madani":"ثُمَّ أَغْرَقْنَا بَعْدُ الْبَاقِينَ","translation_en":"Then We drowned the rest afterwards","translation_id":"Kemudian setelah itu Kami tenggelamkan orang-orang yang tinggal."},{"text_madani":"إِنَّ فِي ذَٰلِكَ لَآيَةً ۖ وَمَا كَانَ أَكْثَرُهُم مُّؤْمِنِينَ","translation_en":"Most surely there is a sign in this, but most of them do not believe.","translation_id":"Sungguh, pada yang demikian itu benar-benar terdapat tanda (kekuasaan Allah), tetapi kebanyakan mereka tidak beriman."},{"text_madani":"وَإِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ","translation_en":"And most surely your Lord is the Mighty, the Merciful.","translation_id":"Dan sungguh, Tuhanmu, Dialah Yang Mahaperkasa, Maha Penyayang."},{"text_madani":"كَذَّبَتْ عَادٌ الْمُرْسَلِينَ","translation_en":"Ad gave the lie to the messengers.","translation_id":"(Kaum) ‘Ad telah mendustakan para rasul."},{"text_madani":"إِذْ قَالَ لَهُمْ أَخُوهُمْ هُودٌ أَلَا تَتَّقُونَ","translation_en":"When their brother Hud said to them: Will you not guard (against evil)?","translation_id":"Ketika saudara mereka Hud berkata kepada mereka, “Mengapa kamu tidak bertakwa?"},{"text_madani":"إِنِّي لَكُمْ رَسُولٌ أَمِينٌ","translation_en":"Surely I am a faithful messenger to you;","translation_id":"Sungguh, aku ini seorang rasul kepercayaan (yang diutus) kepadamu,"},{"text_madani":"فَاتَّقُوا اللَّهَ وَأَطِيعُونِ","translation_en":"Therefore guard against (the punishment of) Allah and obey me:","translation_id":"karena itu bertakwalah kepada Allah dan taatlah kepadaku."},{"text_madani":"وَمَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ ۖ إِنْ أَجْرِيَ إِلَّا عَلَىٰ رَبِّ الْعَالَمِينَ","translation_en":"And I do not ask you any reward for it; surely my reward is only with the Lord of the worlds","translation_id":"Dan aku tidak meminta imbalan kepadamu atas ajakan itu; imbalanku hanyalah dari Tuhan seluruh alam."},{"text_madani":"أَتَبْنُونَ بِكُلِّ رِيعٍ آيَةً تَعْبَثُونَ","translation_en":"Do you build on every height a monument? Vain is it that you do:","translation_id":"Apakah kamu mendirikan istana-istana pada setiap tanah yang tinggi untuk kemegahan tanpa ditempati,"},{"text_madani":"وَتَتَّخِذُونَ مَصَانِعَ لَعَلَّكُمْ تَخْلُدُونَ","translation_en":"And you make strong fortresses that perhaps you may","translation_id":"dan kamu membuat benteng-benteng dengan harapan kamu hidup kekal?"},{"text_madani":"وَإِذَا بَطَشْتُم بَطَشْتُمْ جَبَّارِينَ","translation_en":"And when you lay hands (on men) you lay hands (like) tyrants;","translation_id":"Dan apabila kamu menyiksa, maka kamu lakukan secara kejam dan bengis."},{"text_madani":"فَاتَّقُوا اللَّهَ وَأَطِيعُونِ","translation_en":"So guard against (the punishment of) Allah and obey me","translation_id":"Maka bertakwalah kepada Allah dan taatlah kepadaku,"},{"text_madani":"وَاتَّقُوا الَّذِي أَمَدَّكُم بِمَا تَعْلَمُونَ","translation_en":"And be careful of (your duty to) Him Who has given you abundance of what you know.","translation_id":"dan tetaplah kamu bertakwa kepada-Nya yang telah menganugerahkan kepadamu apa yang kamu ketahui."},{"text_madani":"أَمَدَّكُم بِأَنْعَامٍ وَبَنِينَ","translation_en":"He has given you abundance of cattle and children","translation_id":"Dia (Allah) telah menganugerahkan kepadamu hewan ternak dan anak-anak,"},{"text_madani":"وَجَنَّاتٍ وَعُيُونٍ","translation_en":"And gardens and fountains;","translation_id":"dan kebun-kebun, dan mata air,"},{"text_madani":"إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ","translation_en":"Surely I fear for you the chastisement of a grievous day","translation_id":"sesungguhnya aku takut kamu akan ditimpa azab pada hari yang besar.”"},{"text_madani":"قَالُوا سَوَاءٌ عَلَيْنَا أَوَعَظْتَ أَمْ لَمْ تَكُن مِّنَ الْوَاعِظِينَ","translation_en":"They said: It is the same to us whether you admonish or are not one of the admonishers","translation_id":"Mereka menjawab, “Sama saja bagi kami, apakah engkau memberi nasihat atau tidak memberi nasihat,"},{"text_madani":"إِنْ هَٰذَا إِلَّا خُلُقُ الْأَوَّلِينَ","translation_en":"This is naught but a custom of the ancients;","translation_id":"(agama kami) ini tidak lain hanyalah adat kebiasaan orang-orang terdahulu,"},{"text_madani":"وَمَا نَحْنُ بِمُعَذَّبِينَ","translation_en":"And we are not going to be punished.","translation_id":"dan kami (sama sekali) tidak akan diazab.”"},{"text_madani":"فَكَذَّبُوهُ فَأَهْلَكْنَاهُمْ ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً ۖ وَمَا كَانَ أَكْثَرُهُم مُّؤْمِنِينَ","translation_en":"So they gave him the lie, then We destroyed them. Most surely there is a sign in this, but most of them do not believe.","translation_id":"Maka mereka mendustakannya (Hud), lalu Kami binasakan mereka. Sungguh, pada yang demikian itu terdapat tanda (kekuasaan Allah), tetapi kebanyakan mereka tidak beriman."},{"text_madani":"وَإِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ","translation_en":"And most surely your Lord is the Mighty, the Merciful.","translation_id":"Dan sungguh, Tuhanmu, Dialah Yang Mahaperkasa, Maha Penyayang."},{"text_madani":"كَذَّبَتْ ثَمُودُ الْمُرْسَلِينَ","translation_en":"Samood gave the lie to the messengers","translation_id":"Kaum Tsamud telah mendustakan para rasul."},{"text_madani":"إِذْ قَالَ لَهُمْ أَخُوهُمْ صَالِحٌ أَلَا تَتَّقُونَ","translation_en":"When their brother Salih said to them: Will you not guard (against evil)?","translation_id":"Ketika saudara mereka Shalih berkata kepada mereka, “Mengapa kamu tidak bertakwa?"},{"text_madani":"إِنِّي لَكُمْ رَسُولٌ أَمِينٌ","translation_en":"Surely I am a faithful messenger to you","translation_id":"Sungguh, aku ini seorang rasul kepercayaan (yang diutus) kepadamu,"},{"text_madani":"فَاتَّقُوا اللَّهَ وَأَطِيعُونِ","translation_en":"Therefore guard against (the punishment of) Allah and obey me:","translation_id":"karena itu bertakwalah kepada Allah dan taatlah kepadaku."},{"text_madani":"وَمَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ ۖ إِنْ أَجْرِيَ إِلَّا عَلَىٰ رَبِّ الْعَالَمِينَ","translation_en":"And I do not ask you any reward for it; my reward is only with the Lord of the worlds:","translation_id":"Dan aku tidak meminta sesuatu imbalan kepadamu atas ajakan itu, imbalanku hanyalah dari Tuhan seluruh alam."},{"text_madani":"أَتُتْرَكُونَ فِي مَا هَاهُنَا آمِنِينَ","translation_en":"Will you be left secure in what is here;","translation_id":"Apakah kamu (mengira) akan dibiarkan tinggal di sini (di negeri kamu ini) dengan aman,"},{"text_madani":"فِي جَنَّاتٍ وَعُيُونٍ","translation_en":"In gardens and fountains,","translation_id":"di dalam kebun-kebun dan mata air,"},{"text_madani":"وَزُرُوعٍ وَنَخْلٍ طَلْعُهَا هَضِيمٌ","translation_en":"And cornfields and palm-trees having fine spadices?","translation_id":"dan tanaman-tanaman dan pohon-pohon kurma yang mayangnya lembut."},{"text_madani":"وَتَنْحِتُونَ مِنَ الْجِبَالِ بُيُوتًا فَارِهِينَ","translation_en":"And you hew houses out of the mountains exultingly;","translation_id":"Dan kamu pahat dengan terampil sebagian gunung-gunung untuk dijadikan rumah-rumah;"},{"text_madani":"فَاتَّقُوا اللَّهَ وَأَطِيعُونِ","translation_en":"Therefore guard against (the punishment of) Allah and obey me;","translation_id":"maka bertakwalah kepada Allah dan taatlah kepadaku;"},{"text_madani":"وَلَا تُطِيعُوا أَمْرَ الْمُسْرِفِينَ","translation_en":"And do not obey the bidding of the extravagant,","translation_id":"dan janganlah kamu menaati perintah orang-orang yang melampaui batas,"},{"text_madani":"الَّذِينَ يُفْسِدُونَ فِي الْأَرْضِ وَلَا يُصْلِحُونَ","translation_en":"Who make mischief in the land and do not act aright.","translation_id":"yang berbuat kerusakan di bumi dan tidak mengadakan perbaikan.”"},{"text_madani":"قَالُوا إِنَّمَا أَنتَ مِنَ الْمُسَحَّرِينَ","translation_en":"They said: You are only of the deluded ones;","translation_id":"Mereka berkata, “Sungguh, engkau hanyalah termasuk orang yang kena sihir;"},{"text_madani":"مَا أَنتَ إِلَّا بَشَرٌ مِّثْلُنَا فَأْتِ بِآيَةٍ إِن كُنتَ مِنَ الصَّادِقِينَ","translation_en":"You are naught but a mortal like ourselves; so bring a sign if you are one of the truthful.","translation_id":"engkau hanyalah manusia seperti kami; maka datangkanlah sesuatu mukjizat jika engkau termasuk orang yang benar.”"},{"text_madani":"قَالَ هَٰذِهِ نَاقَةٌ لَّهَا شِرْبٌ وَلَكُمْ شِرْبُ يَوْمٍ مَّعْلُومٍ","translation_en":"He said: This is a she-camel; she shall have her portion of water, and you have your portion of water on an appointed time;","translation_id":"Dia (Shalih) menjawab, “Ini seekor unta betina, yang berhak mendapatkan (giliran) minum, dan kamu juga berhak mendapatkan minum pada hari yang ditentukan."},{"text_madani":"وَلَا تَمَسُّوهَا بِسُوءٍ فَيَأْخُذَكُمْ عَذَابُ يَوْمٍ عَظِيمٍ","translation_en":"And do not touch her with evil, lest the punishment of a grievous day should overtake you.","translation_id":"Dan jangan kamu menyentuhnya (unta itu) dengan sesuatu kejahatan, nanti kamu akan ditimpa azab pada hari yang dahsyat.”"},{"text_madani":"فَعَقَرُوهَا فَأَصْبَحُوا نَادِمِينَ","translation_en":"But they hamstrung her, then regretted;","translation_id":"Kemudian mereka membunuhnya, lalu mereka merasa menyesal,"},{"text_madani":"فَأَخَذَهُمُ الْعَذَابُ ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً ۖ وَمَا كَانَ أَكْثَرُهُم مُّؤْمِنِينَ","translation_en":"So the punishment overtook them. Most surely there is a sign in this, but most of them do not believe.","translation_id":"maka mereka ditimpa azab. Sungguh, pada yang demikian itu terdapat tanda (kekuasaan Allah), tetapi kebanyakan mereka tidak beriman."},{"text_madani":"وَإِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ","translation_en":"And most surely your Lord is the Mighty, the Merciful.","translation_id":"Dan sungguh, Tuhanmu, Dialah Yang Mahaperkasa, Maha Penyayang."},{"text_madani":"كَذَّبَتْ قَوْمُ لُوطٍ الْمُرْسَلِينَ","translation_en":"The people of Lut gave the lie to the messengers.","translation_id":"Kaum Luth telah mendustakan para rasul,"},{"text_madani":"إِذْ قَالَ لَهُمْ أَخُوهُمْ لُوطٌ أَلَا تَتَّقُونَ","translation_en":"When their brother Lut said to them: Will you not guard (against evil)?","translation_id":"ketika saudara mereka Luth berkata kepada mereka, “Mengapa kamu tidak bertakwa?”"},{"text_madani":"إِنِّي لَكُمْ رَسُولٌ أَمِينٌ","translation_en":"Surely I am a faithful messenger to you;","translation_id":"Sungguh, aku ini seorang rasul kepercayaan (yang diutus) kepadamu,"},{"text_madani":"فَاتَّقُوا اللَّهَ وَأَطِيعُونِ","translation_en":"Therefore guard against (the punishment of) Allah and obey me:","translation_id":"maka bertakwalah kepada Allah dan taatlah kepadaku."},{"text_madani":"وَمَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ ۖ إِنْ أَجْرِيَ إِلَّا عَلَىٰ رَبِّ الْعَالَمِينَ","translation_en":"And I do not ask you any reward for it; my reward is only with the Lord of the worlds;","translation_id":"Dan aku tidak meminta imbalan kepadamu atas ajakan itu; imbalanku hanyalah dari Tuhan seluruh alam."},{"text_madani":"أَتَأْتُونَ الذُّكْرَانَ مِنَ الْعَالَمِينَ","translation_en":"What! do you come to the males from among the creatures","translation_id":"Mengapa kamu mendatangi jenis laki-laki di antara manusia (berbuat homoseks),"},{"text_madani":"وَتَذَرُونَ مَا خَلَقَ لَكُمْ رَبُّكُم مِّنْ أَزْوَاجِكُم ۚ بَلْ أَنتُمْ قَوْمٌ عَادُونَ","translation_en":"And leave what your Lord has created for you of your wives? Nay, you are a people exceeding limits.","translation_id":"dan kamu tinggalkan (perempuan) yang diciptakan Tuhan untuk menjadi istri-istri kamu? Kamu (memang) orang-orang yang melampaui batas.”"},{"text_madani":"قَالُوا لَئِن لَّمْ تَنتَهِ يَا لُوطُ لَتَكُونَنَّ مِنَ الْمُخْرَجِينَ","translation_en":"They said: If you desist not, O Lut! you shall surely be of those who are expelled.","translation_id":"Mereka menjawab, “Wahai Luth! Jika engkau tidak berhenti, engkau termasuk orang-orang yang terusir.”"},{"text_madani":"قَالَ إِنِّي لِعَمَلِكُم مِّنَ الْقَالِينَ","translation_en":"He said: Surely I am of those who utterly abhor your","translation_id":"Dia (Luth) berkata, “Aku sungguh benci kepada perbuatanmu.”"},{"text_madani":"رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ","translation_en":"My Lord! deliver me and my followers from what they do.","translation_id":"(Luth berdoa), “Ya Tuhanku, selamatkanlah aku dan keluargaku dari (akibat) perbuatan yang mereka kerjakan.”"},{"text_madani":"فَنَجَّيْنَاهُ وَأَهْلَهُ أَجْمَعِينَ","translation_en":"So We delivered him and his followers all,","translation_id":"Lalu Kami selamatkan dia bersama keluarganya semua,"},{"text_madani":"إِلَّا عَجُوزًا فِي الْغَابِرِينَ","translation_en":"Except an old woman, among those who remained behind.","translation_id":"kecuali seorang perempuan tua (istrinya), yang termasuk dalam golongan yang tinggal."},{"text_madani":"ثُمَّ دَمَّرْنَا الْآخَرِينَ","translation_en":"Then We utterly destroyed the others.","translation_id":"Kemudian Kami binasakan yang lain."},{"text_madani":"وَأَمْطَرْنَا عَلَيْهِم مَّطَرًا ۖ فَسَاءَ مَطَرُ الْمُنذَرِينَ","translation_en":"And We rained down upon them a rain, and evil was the rain on those warned.","translation_id":"Dan Kami hujani mereka (dengan hujan batu), maka betapa buruk hujan yang menimpa orang-orang yang telah diberi peringatan itu."},{"text_madani":"إِنَّ فِي ذَٰلِكَ لَآيَةً ۖ وَمَا كَانَ أَكْثَرُهُم مُّؤْمِنِينَ","translation_en":"Most surely there is a sign in this, but most of them do not believe.","translation_id":"Sungguh, pada yang demikian itu terdapat tanda (kekuasaan Allah), tetapi kebanyakan mereka tidak beriman."},{"text_madani":"وَإِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ","translation_en":"And most surely your Lord is the Mighty, the Merciful.","translation_id":"Dan sungguh, Tuhanmu, Dialah Yang Mahaperkasa, Maha Penyayang."},{"text_madani":"كَذَّبَ أَصْحَابُ الْأَيْكَةِ الْمُرْسَلِينَ","translation_en":"The dwellers of the thicket gave the lie to the messengers.","translation_id":"Penduduk Aikah telah mendustakan para rasul;"},{"text_madani":"إِذْ قَالَ لَهُمْ شُعَيْبٌ أَلَا تَتَّقُونَ","translation_en":"When Shu'aib said to them: Will you not guard (against evil)?","translation_id":"ketika Syuaib berkata kepada mereka, “Mengapa kamu tidak bertakwa?"},{"text_madani":"إِنِّي لَكُمْ رَسُولٌ أَمِينٌ","translation_en":"Surely I am a faithful messenger to you;","translation_id":"Sungguh, aku adalah rasul kepercayaan (yang diutus) kepadamu,"},{"text_madani":"فَاتَّقُوا اللَّهَ وَأَطِيعُونِ","translation_en":"Therefore guard against (the punishment of) Allah and obey me:","translation_id":"maka bertakwalah kepada Allah dan taatlah kepadaku;"},{"text_madani":"وَمَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ ۖ إِنْ أَجْرِيَ إِلَّا عَلَىٰ رَبِّ الْعَالَمِينَ","translation_en":"And I do not ask you any reward for it, my reward is only with the Lord of the worlds;","translation_id":"Dan aku tidak meminta imbalan kepadamu atas ajakan itu; imbalanku hanyalah dari Tuhan seluruh alam."},{"text_madani":"أَوْفُوا الْكَيْلَ وَلَا تَكُونُوا مِنَ الْمُخْسِرِينَ","translation_en":"Give a full measure and be not of those who diminish;","translation_id":"Sempurnakanlah takaran dan janganlah kamu merugikan orang lain."},{"text_madani":"وَزِنُوا بِالْقِسْطَاسِ الْمُسْتَقِيمِ","translation_en":"And weigh (things) with a right balance,","translation_id":"Dan timbanglah dengan timbangan yang benar."},{"text_madani":"وَلَا تَبْخَسُوا النَّاسَ أَشْيَاءَهُمْ وَلَا تَعْثَوْا فِي الْأَرْضِ مُفْسِدِينَ","translation_en":"And do not wrong men of their things, and do not act corruptly in the earth, making mischief.","translation_id":"Dan janganlah kamu merugikan manusia dengan mengurangi hak-haknya dan janganlah membuat kerusakan di bumi;"},{"text_madani":"وَاتَّقُوا الَّذِي خَلَقَكُمْ وَالْجِبِلَّةَ الْأَوَّلِينَ","translation_en":"And guard against (the punishment of) Him who created you and the former nations.","translation_id":"dan bertakwalah kepada Allah yang telah menciptakan kamu dan umat-umat yang terdahulu.”"},{"text_madani":"قَالُوا إِنَّمَا أَنتَ مِنَ الْمُسَحَّرِينَ","translation_en":"They said: You are only of those deluded;","translation_id":"Mereka berkata, “Engkau tidak lain hanyalah orang-orang yang kena sihir."},{"text_madani":"وَمَا أَنتَ إِلَّا بَشَرٌ مِّثْلُنَا وَإِن نَّظُنُّكَ لَمِنَ الْكَاذِبِينَ","translation_en":"And you are naught but a mortal like ourselves, and we know you to be certainly of the liars.","translation_id":"Dan engkau hanyalah manusia seperti kami, dan sesungguhnya kami yakin engkau termasuk orang-orang yang berdusta."},{"text_madani":"فَأَسْقِطْ عَلَيْنَا كِسَفًا مِّنَ السَّمَاءِ إِن كُنتَ مِنَ الصَّادِقِينَ","translation_en":"Therefore cause a portion of the heaven to come down upon us, if you are one of the truthful.","translation_id":"Maka jatuhkanlah kepada kami gumpalan dari langit, jika engkau termasuk orang-orang yang benar.”"},{"text_madani":"قَالَ رَبِّي أَعْلَمُ بِمَا تَعْمَلُونَ","translation_en":"He said: My Lord knows best what you do.","translation_id":"Dia (Syuaib) berkata, “Tuhanku lebih mengetahui apa yang kamu kerjakan.”"},{"text_madani":"فَكَذَّبُوهُ فَأَخَذَهُمْ عَذَابُ يَوْمِ الظُّلَّةِ ۚ إِنَّهُ كَانَ عَذَابَ يَوْمٍ عَظِيمٍ","translation_en":"But they called him a liar, so the punishment of the day of covering overtook them; surely it was the punishment of a grievous day.","translation_id":"Kemudian mereka mendustakannya (Syuaib), lalu mereka ditimpa azab pada hari yang gelap. Sungguh, itulah azab pada hari yang dahsyat."},{"text_madani":"إِنَّ فِي ذَٰلِكَ لَآيَةً ۖ وَمَا كَانَ أَكْثَرُهُم مُّؤْمِنِينَ","translation_en":"Most surely there is a sign in this, but most of them do not believe.","translation_id":"Sungguh, pada yang demikian itu benar-benar terdapat tanda (kekuasaan Allah), tetapi kebanyakan mereka tidak beriman."},{"text_madani":"وَإِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ","translation_en":"And most surely your Lord is Mighty, the Merciful.","translation_id":"Dan sungguh, Tuhanmu, Dialah yang Mahaperkasa, Maha Penyayang."},{"text_madani":"وَإِنَّهُ لَتَنزِيلُ رَبِّ الْعَالَمِينَ","translation_en":"And most surely this is a revelation from the Lord of the worlds.","translation_id":"Dan sungguh, (Al-Qur'an) ini benar-benar diturunkan oleh Tuhan seluruh alam,"},{"text_madani":"نَزَلَ بِهِ الرُّوحُ الْأَمِينُ","translation_en":"The Faithful Spirit has descended with it,","translation_id":"Yang dibawa turun oleh ar-Ruh al-Amin (Jibril),"},{"text_madani":"عَلَىٰ قَلْبِكَ لِتَكُونَ مِنَ الْمُنذِرِينَ","translation_en":"Upon your heart that you may be of the warners","translation_id":"ke dalam hatimu (Muhammad) agar engkau termasuk orang yang memberi peringatan,"},{"text_madani":"بِلِسَانٍ عَرَبِيٍّ مُّبِينٍ","translation_en":"In plain Arabic language.","translation_id":"dengan bahasa Arab yang jelas."},{"text_madani":"وَإِنَّهُ لَفِي زُبُرِ الْأَوَّلِينَ","translation_en":"And most surely the same is in the scriptures of the ancients.","translation_id":"Dan sungguh, (Al-Qur'an) itu (disebut) dalam kitab-kitab orang yang terdahulu."},{"text_madani":"أَوَلَمْ يَكُن لَّهُمْ آيَةً أَن يَعْلَمَهُ عُلَمَاءُ بَنِي إِسْرَائِيلَ","translation_en":"Is it not a sign to them that the learned men of the Israelites know it?","translation_id":"Apakah tidak (cukup) menjadi bukti bagi mereka, bahwa para ulama Bani Israil mengetahuinya?"},{"text_madani":"وَلَوْ نَزَّلْنَاهُ عَلَىٰ بَعْضِ الْأَعْجَمِينَ","translation_en":"And if we had revealed it to any of the foreigners","translation_id":"Dan seandainya (Al-Qur'an) itu Kami turunkan kepada sebagian dari golongan bukan Arab,"},{"text_madani":"فَقَرَأَهُ عَلَيْهِم مَّا كَانُوا بِهِ مُؤْمِنِينَ","translation_en":"So that he should have recited it to them, they would not have believed therein.","translation_id":"lalu dia membacakannya kepada mereka (orang-orang kafir); niscaya mereka tidak juga akan beriman kepadanya."},{"text_madani":"كَذَٰلِكَ سَلَكْنَاهُ فِي قُلُوبِ الْمُجْرِمِينَ","translation_en":"Thus have We caused it to enter into the hearts of the guilty.","translation_id":"Demikianlah, Kami masukkan (sifat dusta dan ingkar) ke dalam hati orang-orang yang berdosa,"},{"text_madani":"لَا يُؤْمِنُونَ بِهِ حَتَّىٰ يَرَوُا الْعَذَابَ الْأَلِيمَ","translation_en":"They will not believe in it until they see the painful punishment.","translation_id":"mereka tidak akan beriman kepadanya, hingga mereka melihat azab yang pedih,"},{"text_madani":"فَيَأْتِيَهُم بَغْتَةً وَهُمْ لَا يَشْعُرُونَ","translation_en":"And it shall come to them all of a sudden, while they shall not perceive;","translation_id":"maka datang azab kepada mereka secara mendadak, ketika mereka tidak menyadarinya,"},{"text_madani":"فَيَقُولُوا هَلْ نَحْنُ مُنظَرُونَ","translation_en":"Then they will say: Shall we be respited?","translation_id":"lalu mereka berkata, “Apakah kami diberi penangguhan waktu?”"},{"text_madani":"أَفَبِعَذَابِنَا يَسْتَعْجِلُونَ","translation_en":"What! do they still seek to hasten on Our punishment?","translation_id":"Bukankah mereka yang meminta agar azab Kami dipercepat?"},{"text_madani":"أَفَرَأَيْتَ إِن مَّتَّعْنَاهُمْ سِنِينَ","translation_en":"Have you then considered if We let them enjoy themselves for years,","translation_id":"Maka bagaimana pendapatmu jika kepada mereka Kami berikan kenikmatan hidup beberapa tahun,"},{"text_madani":"ثُمَّ جَاءَهُم مَّا كَانُوا يُوعَدُونَ","translation_en":"Then there comes to them that with which they are threatened,","translation_id":"kemudian datang kepada mereka azab yang diancamkan kepada mereka,"},{"text_madani":"مَا أَغْنَىٰ عَنْهُم مَّا كَانُوا يُمَتَّعُونَ","translation_en":"That which they were made to enjoy shall not avail them?","translation_id":"niscaya tidak berguna bagi mereka kenikmatan yang mereka rasakan."},{"text_madani":"وَمَا أَهْلَكْنَا مِن قَرْيَةٍ إِلَّا لَهَا مُنذِرُونَ","translation_en":"And We did not destroy any town but it had (its) warners,","translation_id":"Dan Kami tidak membinasakan sesuatu negeri, kecuali setelah ada orang-orang yang memberi peringatan kepadanya;"},{"text_madani":"ذِكْرَىٰ وَمَا كُنَّا ظَالِمِينَ","translation_en":"To remind, and We are never unjust.","translation_id":"untuk (menjadi) peringatan. Dan Kami tidak berlaku zhalim."},{"text_madani":"وَمَا تَنَزَّلَتْ بِهِ الشَّيَاطِينُ","translation_en":"And the Shaitans have not come down with it.","translation_id":"Dan (Al-Qur'an) itu tidaklah dibawa turun oleh setan-setan."},{"text_madani":"وَمَا يَنبَغِي لَهُمْ وَمَا يَسْتَطِيعُونَ","translation_en":"And it behoves them not, and they have not the power to do (it).","translation_id":"Dan tidaklah pantas bagi mereka (Al-Qur'an itu), dan mereka pun tidak akan sanggup."},{"text_madani":"إِنَّهُمْ عَنِ السَّمْعِ لَمَعْزُولُونَ","translation_en":"Most surely they are far removed from the hearing of it.","translation_id":"Sesungguhnya untuk mendengarkannya pun mereka dijauhkan."},{"text_madani":"فَلَا تَدْعُ مَعَ اللَّهِ إِلَٰهًا آخَرَ فَتَكُونَ مِنَ الْمُعَذَّبِينَ","translation_en":"So call not upon another god with Allah, lest you be of those who are punished.","translation_id":"Maka janganlah kamu menyeru (menyembah) tuhan selain Allah, nanti kamu termasuk orang-orang yang diazab."},{"text_madani":"وَأَنذِرْ عَشِيرَتَكَ الْأَقْرَبِينَ","translation_en":"And warn your nearest relations,","translation_id":"Dan berilah peringatan kepada kerabat-kerabatmu (Muhammad) yang terdekat,"},{"text_madani":"وَاخْفِضْ جَنَاحَكَ لِمَنِ اتَّبَعَكَ مِنَ الْمُؤْمِنِينَ","translation_en":"And be kind to him who follows you of the believers.","translation_id":"dan rendahkanlah dirimu terhadap orang-orang yang beriman yang mengikutimu."},{"text_madani":"فَإِنْ عَصَوْكَ فَقُلْ إِنِّي بَرِيءٌ مِّمَّا تَعْمَلُونَ","translation_en":"But if they disobey you, then say: Surely I am clear of what you do.","translation_id":"Kemudian jika mereka mendurhakaimu maka katakanlah (Muhammad), “Sesungguhnya aku tidak bertanggung jawab terhadap apa yang kamu kerjakan.”"},{"text_madani":"وَتَوَكَّلْ عَلَى الْعَزِيزِ الرَّحِيمِ","translation_en":"And rely on the Mighty, the Merciful,","translation_id":"Dan bertawakallah kepada (Allah) Yang Mahaperkasa, Maha Penyayang."},{"text_madani":"الَّذِي يَرَاكَ حِينَ تَقُومُ","translation_en":"Who sees you when you stand up.","translation_id":"Yang melihat engkau ketika engkau berdiri (untuk shalat),"},{"text_madani":"وَتَقَلُّبَكَ فِي السَّاجِدِينَ","translation_en":"And your turning over and over among those who prostrate themselves before Allah.","translation_id":"dan (melihat) perubahan gerakan badanmu di antara orang-orang yang sujud."},{"text_madani":"إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ","translation_en":"Surely He is the Hearing, the Knowing.","translation_id":"Sungguh, Dia Maha Mendengar, Maha Mengetahui."},{"text_madani":"هَلْ أُنَبِّئُكُمْ عَلَىٰ مَن تَنَزَّلُ الشَّيَاطِينُ","translation_en":"Shall I inform you (of him) upon whom the Shaitans descend?","translation_id":"Maukah Aku beritakan kepadamu, kepada siapa setan-setan itu turun?"},{"text_madani":"تَنَزَّلُ عَلَىٰ كُلِّ أَفَّاكٍ أَثِيمٍ","translation_en":"They descend upon every lying, sinful one,","translation_id":"Mereka (setan) turun kepada setiap pendusta yang banyak berdosa,"},{"text_madani":"يُلْقُونَ السَّمْعَ وَأَكْثَرُهُمْ كَاذِبُونَ","translation_en":"They incline their ears, and most of them are liars.","translation_id":"mereka menyampaikan hasil pendengaran mereka, sedangkan kebanyakan mereka orang-orang pendusta."},{"text_madani":"وَالشُّعَرَاءُ يَتَّبِعُهُمُ الْغَاوُونَ","translation_en":"And as to the poets, those who go astray follow them.","translation_id":"Dan penyair-penyair itu diikuti oleh orang-orang yang sesat."},{"text_madani":"أَلَمْ تَرَ أَنَّهُمْ فِي كُلِّ وَادٍ يَهِيمُونَ","translation_en":"Do you not see that they wander about bewildered in every valley?","translation_id":"Tidakkah engkau melihat bahwa mereka mengembara di setiap lembah,"},{"text_madani":"وَأَنَّهُمْ يَقُولُونَ مَا لَا يَفْعَلُونَ","translation_en":"And that they say that which they do not do,","translation_id":"dan bahwa mereka mengatakan apa yang mereka sendiri tidak mengerjakan(nya)?"},{"text_madani":"إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَذَكَرُوا اللَّهَ كَثِيرًا وَانتَصَرُوا مِن بَعْدِ مَا ظُلِمُوا ۗ وَسَيَعْلَمُ الَّذِينَ ظَلَمُوا أَيَّ مُنقَلَبٍ يَنقَلِبُونَ","translation_en":"Except those who believe and do good and remember Allah much, and defend themselves after they are oppressed; and they who act unjustly shall know to what final place of turning they shall turn back.","translation_id":"Kecuali orang-orang (penyair-penyair) yang beriman dan berbuat kebajikan dan banyak mengingat Allah dan mendapat kemenangan setelah terzhalimi (karena menjawab puisi-puisi orang-orang kafir). Dan orang-orang yang zhalim kelak akan tahu ke tempat mana mereka akan kembali."}]}
