{"chapter_number":37,"name_simple":"As-Saffat","verses_count":182,"verses":[{"text_madani":"وَالصَّافَّاتِ صَفًّا","translation_en":"I swear by those who draw themselves out in ranks","translation_id":"Demi (rombongan malaikat) yang berbaris bersaf-saf,"},{"text_madani":"فَالزَّاجِرَاتِ زَجْرًا","translation_en":"Then those who drive away with reproof,","translation_id":"demi (rombongan) yang mencegah dengan sungguh-sungguh,"},{"text_madani":"فَالتَّالِيَاتِ ذِكْرًا","translation_en":"Then those who recite, being mindful,","translation_id":"demi (rombongan) yang membacakan peringatan,"},{"text_madani":"إِنَّ إِلَٰهَكُمْ لَوَاحِدٌ","translation_en":"Most surely your Allah is One:","translation_id":"sungguh, Tuhanmu benar-benar Esa."},{"text_madani":"رَّبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَرَبُّ الْمَشَارِقِ","translation_en":"The Lord of the heavens and the earth and what is between them, and Lord of the easts.","translation_id":"Tuhan langit dan bumi dan apa yang berada di antara keduanya dan Tuhan tempat-tempat terbitnya matahari."},{"text_madani":"إِنَّا زَيَّنَّا السَّمَاءَ الدُّنْيَا بِزِينَةٍ الْكَوَاكِبِ","translation_en":"Surely We have adorned the nearest heaven with an adornment, the stars,","translation_id":"Sesungguhnya Kami telah menghias langit dunia (yang terdekat), dengan hiasan bintang-bintang."},{"text_madani":"وَحِفْظًا مِّن كُلِّ شَيْطَانٍ مَّارِدٍ","translation_en":"And (there is) a safeguard against every rebellious Shaitan.","translation_id":"Dan (Kami) telah menjaganya dari setiap setan yang durhaka,"},{"text_madani":"لَّا يَسَّمَّعُونَ إِلَى الْمَلَإِ الْأَعْلَىٰ وَيُقْذَفُونَ مِن كُلِّ جَانِبٍ","translation_en":"They cannot listen to the exalted assembly and they are thrown at from every side,","translation_id":"mereka (setan-setan itu) tidak dapat mendengar (pembicaraan) para malaikat dan mereka dilempari dari segala penjuru,"},{"text_madani":"دُحُورًا ۖ وَلَهُمْ عَذَابٌ وَاصِبٌ","translation_en":"Being driven off, and for them is a perpetual chastisement,","translation_id":"untuk mengusir mereka dan mereka akan mendapat azab yang kekal,"},{"text_madani":"إِلَّا مَنْ خَطِفَ الْخَطْفَةَ فَأَتْبَعَهُ شِهَابٌ ثَاقِبٌ","translation_en":"Except him who snatches off but once, then there follows him a brightly shining flame.","translation_id":"kecuali (setan) yang mencuri (pembicaraan); maka ia dikejar oleh bintang yang menyala."},{"text_madani":"فَاسْتَفْتِهِمْ أَهُمْ أَشَدُّ خَلْقًا أَم مَّنْ خَلَقْنَا ۚ إِنَّا خَلَقْنَاهُم مِّن طِينٍ لَّازِبٍ","translation_en":"Then ask them whether they are stronger in creation or those (others) whom We have created. Surely We created them of firm clay.","translation_id":"Maka tanyakanlah kepada mereka (musyrik Mekah), “Apakah penciptaan mereka yang lebih sulit ataukah apa yang telah Kami ciptakan itu?” Sesungguhnya Kami telah menciptakan mereka dari tanah liat."},{"text_madani":"بَلْ عَجِبْتَ وَيَسْخَرُونَ","translation_en":"Nay! you wonder while they mock,","translation_id":"Bahkan engkau (Muhammad) menjadi heran (terhadap keingkaran mereka) dan mereka menghinakan (engkau)."},{"text_madani":"وَإِذَا ذُكِّرُوا لَا يَذْكُرُونَ","translation_en":"And when they are reminded, they mind not,","translation_id":"Dan apabila mereka diberi peringatan, mereka tidak mengindahkannya."},{"text_madani":"وَإِذَا رَأَوْا آيَةً يَسْتَسْخِرُونَ","translation_en":"And when they see a sign they incite one another to scoff,","translation_id":"Dan apabila mereka melihat suatu tanda (kebesaran) Allah, mereka memperolok-olokkan."},{"text_madani":"وَقَالُوا إِنْ هَٰذَا إِلَّا سِحْرٌ مُّبِينٌ","translation_en":"And they say: This is nothing but clear magic:","translation_id":"Dan mereka berkata, “Ini tidak lain hanyalah sihir yang nyata."},{"text_madani":"أَإِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظَامًا أَإِنَّا لَمَبْعُوثُونَ","translation_en":"What! when we are dead and have become dust and bones, shall we then certainly be raised,","translation_id":"Apabila kami telah mati dan telah menjadi tanah dan tulang-belulang, apakah benar kami akan dibangkitkan (kembali)?"},{"text_madani":"أَوَآبَاؤُنَا الْأَوَّلُونَ","translation_en":"Or our fathers of yore?","translation_id":"dan apakah nenek moyang kami yang telah terdahulu (akan dibangkitkan pula)?”"},{"text_madani":"قُلْ نَعَمْ وَأَنتُمْ دَاخِرُونَ","translation_en":"Say: Aye! and you shall be abject.","translation_id":"Katakanlah (Muhammad), “Ya, dan kamu akan terhina.”"},{"text_madani":"فَإِنَّمَا هِيَ زَجْرَةٌ وَاحِدَةٌ فَإِذَا هُمْ يَنظُرُونَ","translation_en":"So it shall only be a single cry, when lo! they shall see.","translation_id":"Maka sesungguhnya kebangkitan itu hanya dengan satu teriakan saja; maka seketika itu mereka melihatnya."},{"text_madani":"وَقَالُوا يَا وَيْلَنَا هَٰذَا يَوْمُ الدِّينِ","translation_en":"And they shall say: O woe to us! this is the day of requital.","translation_id":"Dan mereka berkata, “Alangkah celaka kami! (Kiranya) inilah hari pembalasan itu.”"},{"text_madani":"هَٰذَا يَوْمُ الْفَصْلِ الَّذِي كُنتُم بِهِ تُكَذِّبُونَ","translation_en":"This is the day of the judgment which you called a lie.","translation_id":"Inilah hari keputusan yang dahulu kamu dustakan."},{"text_madani":"احْشُرُوا الَّذِينَ ظَلَمُوا وَأَزْوَاجَهُمْ وَمَا كَانُوا يَعْبُدُونَ","translation_en":"Gather together those who were unjust and their associates, and what they used to worship","translation_id":"(Diperintahkan kepada malaikat), “Kumpulkanlah orang-orang yang zhalim beserta teman sejawat mereka dan apa yang dahulu mereka sembah,"},{"text_madani":"مِن دُونِ اللَّهِ فَاهْدُوهُمْ إِلَىٰ صِرَاطِ الْجَحِيمِ","translation_en":"Besides Allah, then lead them to the way to hell.","translation_id":"selain Allah, lalu tunjukkanlah kepada mereka jalan ke neraka."},{"text_madani":"وَقِفُوهُمْ ۖ إِنَّهُم مَّسْئُولُونَ","translation_en":"And stop them, for they shall be questioned:","translation_id":"Tahanlah mereka (di tempat perhentian), sesungguhnya mereka akan ditanya,"},{"text_madani":"مَا لَكُمْ لَا تَنَاصَرُونَ","translation_en":"What is the matter with you that you do not help each other?","translation_id":"”Mengapa kamu tidak tolong-menolong?”"},{"text_madani":"بَلْ هُمُ الْيَوْمَ مُسْتَسْلِمُونَ","translation_en":"Nay! on that day they shall be submissive.","translation_id":"Bahkan mereka pada hari itu menyerah (kepada keputusan Allah)."},{"text_madani":"وَأَقْبَلَ بَعْضُهُمْ عَلَىٰ بَعْضٍ يَتَسَاءَلُونَ","translation_en":"And some of them shall advance towards others, questioning each other.","translation_id":"Dan sebagian mereka menghadap kepada sebagian yang lain saling berbantah-bantahan."},{"text_madani":"قَالُوا إِنَّكُمْ كُنتُمْ تَأْتُونَنَا عَنِ الْيَمِينِ","translation_en":"They shall say: Surely you used to come to us from the right side.","translation_id":"Sesungguhnya (pengikut-pengikut) mereka berkata (kepada pemimpin-pemimpin mereka), “Kamulah yang dahulu datang kepada kami dari kanan.”"},{"text_madani":"قَالُوا بَل لَّمْ تَكُونُوا مُؤْمِنِينَ","translation_en":"They shall say: Nay, you (yourselves) were not believers;","translation_id":"(Pemimpin-pemimpin) mereka menjawab, “(Tidak), bahkan kamulah yang tidak (mau) menjadi orang mukmin,"},{"text_madani":"وَمَا كَانَ لَنَا عَلَيْكُم مِّن سُلْطَانٍ ۖ بَلْ كُنتُمْ قَوْمًا طَاغِينَ","translation_en":"And we had no authority over you, but you were an inordinate people;","translation_id":"sedangkan kami tidak berkuasa terhadapmu, bahkan kamu menjadi kaum yang melampaui batas."},{"text_madani":"فَحَقَّ عَلَيْنَا قَوْلُ رَبِّنَا ۖ إِنَّا لَذَائِقُونَ","translation_en":"So the sentence of our Lord has come to pass against us: (now) we shall surely taste;","translation_id":"Maka pantas putusan (azab) Tuhan menimpa kita; pasti kita akan merasakan (azab itu)."},{"text_madani":"فَأَغْوَيْنَاكُمْ إِنَّا كُنَّا غَاوِينَ","translation_en":"So we led you astray, for we ourselves were erring.","translation_id":"Maka kami telah menyesatkan kamu, sesungguhnya kami sendiri, orang-orang yang sesat.”"},{"text_madani":"فَإِنَّهُمْ يَوْمَئِذٍ فِي الْعَذَابِ مُشْتَرِكُونَ","translation_en":"So they shall on that day be sharers in the chastisement one with another.","translation_id":"Maka sesungguhnya mereka pada hari itu bersama-sama merasakan azab."},{"text_madani":"إِنَّا كَذَٰلِكَ نَفْعَلُ بِالْمُجْرِمِينَ","translation_en":"Surely thus do We deal with the guilty.","translation_id":"Sungguh, demikianlah Kami memperlakukan terhadap orang-orang yang berbuat dosa."},{"text_madani":"إِنَّهُمْ كَانُوا إِذَا قِيلَ لَهُمْ لَا إِلَٰهَ إِلَّا اللَّهُ يَسْتَكْبِرُونَ","translation_en":"Surely they used to behave proudly when it was said to them: There is no god but Allah;","translation_id":"Sungguh, dahulu apabila dikatakan kepada mereka, “La ilaha illallah” (Tidak ada tuhan selain Allah), mereka menyombongkan diri,"},{"text_madani":"وَيَقُولُونَ أَئِنَّا لَتَارِكُو آلِهَتِنَا لِشَاعِرٍ مَّجْنُونٍ","translation_en":"And to say: What! shall we indeed give up our gods for the sake of a mad poet?","translation_id":"dan mereka berkata, “Apakah kami harus meninggalkan sesembahan kami karena seorang penyair gila?”"},{"text_madani":"بَلْ جَاءَ بِالْحَقِّ وَصَدَّقَ الْمُرْسَلِينَ","translation_en":"Nay: he has come with the truth and verified the messengers.","translation_id":"Padahal dia (Muhammad) datang dengan membawa kebenaran dan membenarkan rasul-rasul (sebelumnya)."},{"text_madani":"إِنَّكُمْ لَذَائِقُو الْعَذَابِ الْأَلِيمِ","translation_en":"Most surely you will taste the painful punishment.","translation_id":"Sungguh, kamu pasti akan merasakan azab yang pedih."},{"text_madani":"وَمَا تُجْزَوْنَ إِلَّا مَا كُنتُمْ تَعْمَلُونَ","translation_en":"And you shall not be rewarded except (for) what you did.","translation_id":"Dan kamu tidak diberi balasan melainkan terhadap apa yang telah kamu kerjakan,"},{"text_madani":"إِلَّا عِبَادَ اللَّهِ الْمُخْلَصِينَ","translation_en":"Save the servants of Allah, the purified ones.","translation_id":"tetapi hamba-hamba Allah yang dibersihkan (dari dosa),"},{"text_madani":"أُولَٰئِكَ لَهُمْ رِزْقٌ مَّعْلُومٌ","translation_en":"For them is a known sustenance,","translation_id":"mereka itu memperoleh rezeki yang sudah ditentukan,"},{"text_madani":"فَوَاكِهُ ۖ وَهُم مُّكْرَمُونَ","translation_en":"Fruits, and they shall be highly honored,","translation_id":"(yaitu) buah-buahan. Dan mereka orang yang dimuliakan,"},{"text_madani":"فِي جَنَّاتِ النَّعِيمِ","translation_en":"In gardens of pleasure,","translation_id":"di dalam surga-surga yang penuh kenikmatan,"},{"text_madani":"عَلَىٰ سُرُرٍ مُّتَقَابِلِينَ","translation_en":"On thrones, facing each other.","translation_id":"(mereka duduk) berhadap-hadapan di atas dipan-dipan."},{"text_madani":"يُطَافُ عَلَيْهِم بِكَأْسٍ مِّن مَّعِينٍ","translation_en":"A bowl shall be made to go round them from water running out of springs,","translation_id":"Kepada mereka diedarkan gelas (yang berisi air) dari mata air (surga),"},{"text_madani":"بَيْضَاءَ لَذَّةٍ لِّلشَّارِبِينَ","translation_en":"White, delicious to those who drink.","translation_id":"(warnanya) putih bersih, sedap rasanya bagi orang-orang yang minum."},{"text_madani":"لَا فِيهَا غَوْلٌ وَلَا هُمْ عَنْهَا يُنزَفُونَ","translation_en":"There shall be no trouble in it, nor shall they be exhausted therewith.","translation_id":"Tidak ada di dalamnya (unsur) yang memabukkan dan mereka tidak mabuk karenanya."},{"text_madani":"وَعِندَهُمْ قَاصِرَاتُ الطَّرْفِ عِينٌ","translation_en":"And with them shall be those who restrain the eyes, having beautiful eyes;","translation_id":"Dan di sisi mereka ada (bidadari-bidadari) yang bermata indah, dan membatasi pandangannya,"},{"text_madani":"كَأَنَّهُنَّ بَيْضٌ مَّكْنُونٌ","translation_en":"As if they were eggs carefully protected.","translation_id":"seakan-akan mereka adalah telur yang tersimpan dengan baik."},{"text_madani":"فَأَقْبَلَ بَعْضُهُمْ عَلَىٰ بَعْضٍ يَتَسَاءَلُونَ","translation_en":"Then shall some of them advance to others, questioning each other.","translation_id":"Lalu mereka berhadap-hadapan satu sama lain sambil bercakap-cakap."},{"text_madani":"قَالَ قَائِلٌ مِّنْهُمْ إِنِّي كَانَ لِي قَرِينٌ","translation_en":"A speaker from among them shall say: Surely I had a comrade of mine,","translation_id":"Berkatalah salah seorang di antara mereka, “Sesungguhnya aku dahulu (di dunia) pernah mempunyai seorang teman,"},{"text_madani":"يَقُولُ أَإِنَّكَ لَمِنَ الْمُصَدِّقِينَ","translation_en":"Who said: What! are you indeed of those who accept (the truth)?","translation_id":"yang berkata, “Apakah sesungguhnya kamu termasuk orang-orang yang membenarkan (hari berbangkit)?"},{"text_madani":"أَإِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظَامًا أَإِنَّا لَمَدِينُونَ","translation_en":"What! when we are dead and have become dust and bones, shall we then be certainly brought to judgment?","translation_id":"Apabila kita telah mati dan telah menjadi tanah dan tulang-belulang, apakah kita benar-benar (akan dibangkitkan) untuk diberi pembalasan?”"},{"text_madani":"قَالَ هَلْ أَنتُم مُّطَّلِعُونَ","translation_en":"He shall say: Will you look on?","translation_id":"Dia berkata, “Maukah kamu meninjau (temanku itu)?”"},{"text_madani":"فَاطَّلَعَ فَرَآهُ فِي سَوَاءِ الْجَحِيمِ","translation_en":"Then he looked down and saw him in the midst of hell.","translation_id":"Maka dia meninjaunya, lalu dia melihat (teman)nya itu di tengah-tengah neraka yang menyala-nyala."},{"text_madani":"قَالَ تَاللَّهِ إِن كِدتَّ لَتُرْدِينِ","translation_en":"He shall say: By Allah! you had almost caused me to perish;","translation_id":"Dia berkata, “Demi Allah, engkau hampir saja mencelakakanku,"},{"text_madani":"وَلَوْلَا نِعْمَةُ رَبِّي لَكُنتُ مِنَ الْمُحْضَرِينَ","translation_en":"And had it not been for the favor of my Lord, I would certainly have been among those brought up.","translation_id":"dan sekiranya bukan karena nikmat Tuhanku pastilah aku termasuk orang-orang yang diseret (ke neraka).”"},{"text_madani":"أَفَمَا نَحْنُ بِمَيِّتِينَ","translation_en":"Is it then that we are not going to die,","translation_id":"Maka apakah kita tidak akan mati?"},{"text_madani":"إِلَّا مَوْتَتَنَا الْأُولَىٰ وَمَا نَحْنُ بِمُعَذَّبِينَ","translation_en":"Except our previous death? And we shall not be chastised?","translation_id":"Kecuali kematian kita yang pertama saja (di dunia), dan kita tidak akan diazab (di akhirat ini)?”"},{"text_madani":"إِنَّ هَٰذَا لَهُوَ الْفَوْزُ الْعَظِيمُ","translation_en":"Most surely this is the mighty achievement.","translation_id":"Sungguh, ini benar-benar kemenangan yang agung."},{"text_madani":"لِمِثْلِ هَٰذَا فَلْيَعْمَلِ الْعَامِلُونَ","translation_en":"For the like of this then let the workers work.","translation_id":"Untuk (kemenangan) serupa ini, hendaklah beramal orang-orang yang mampu beramal."},{"text_madani":"أَذَٰلِكَ خَيْرٌ نُّزُلًا أَمْ شَجَرَةُ الزَّقُّومِ","translation_en":"Is this better as an entertainment or the tree of Zaqqum?","translation_id":"Apakah (makanan surga) itu hidangan yang lebih baik ataukah pohon zaqqum."},{"text_madani":"إِنَّا جَعَلْنَاهَا فِتْنَةً لِّلظَّالِمِينَ","translation_en":"Surely We have made it to be a trial to the unjust.","translation_id":"Sungguh, Kami menjadikannya (pohon zaqqum itu) sebagai azab bagi orang-orang zhalim."},{"text_madani":"إِنَّهَا شَجَرَةٌ تَخْرُجُ فِي أَصْلِ الْجَحِيمِ","translation_en":"Surely it is a tree that-grows in the bottom of the hell;","translation_id":"Sungguh, itu adalah pohon yang keluar dari dasar neraka Jahim,"},{"text_madani":"طَلْعُهَا كَأَنَّهُ رُءُوسُ الشَّيَاطِينِ","translation_en":"Its produce is as it were the heads of the serpents.","translation_id":"Mayangnya seperti kepala-kepala setan."},{"text_madani":"فَإِنَّهُمْ لَآكِلُونَ مِنْهَا فَمَالِئُونَ مِنْهَا الْبُطُونَ","translation_en":"Then most surely they shall eat of it and fill (their) bellies with it.","translation_id":"Maka sungguh, mereka benar-benar memakan sebagian darinya (buah pohon itu), dan mereka memenuhi perutnya dengan buahnya (zaqqum)."},{"text_madani":"ثُمَّ إِنَّ لَهُمْ عَلَيْهَا لَشَوْبًا مِّنْ حَمِيمٍ","translation_en":"Then most surely they shall have after it to drink of a mixture prepared in boiling water.","translation_id":"Kemudian sungguh, setelah makan (buah zaqqum) mereka mendapat minuman yang dicampur dengan air yang sangat panas."},{"text_madani":"ثُمَّ إِنَّ مَرْجِعَهُمْ لَإِلَى الْجَحِيمِ","translation_en":"Then most surely their return shall be to hell.","translation_id":"Kemudian pasti tempat kembali mereka ke neraka Jahim."},{"text_madani":"إِنَّهُمْ أَلْفَوْا آبَاءَهُمْ ضَالِّينَ","translation_en":"Surely they found their fathers going astray,","translation_id":"Sesungguhnya mereka mendapati nenek moyang mereka dalam keadaan sesat,"},{"text_madani":"فَهُمْ عَلَىٰ آثَارِهِمْ يُهْرَعُونَ","translation_en":"So in their footsteps they are being hastened on.","translation_id":"lalu mereka tergesa-gesa mengikuti jejak (nenek moyang) mereka."},{"text_madani":"وَلَقَدْ ضَلَّ قَبْلَهُمْ أَكْثَرُ الْأَوَّلِينَ","translation_en":"And certainly most of the ancients went astray before them,","translation_id":"Dan sungguh, sebelum mereka (Suku Quraisy), telah sesat sebagian besar dari orang-orang yang dahulu,"},{"text_madani":"وَلَقَدْ أَرْسَلْنَا فِيهِم مُّنذِرِينَ","translation_en":"And certainly We sent among them warners.","translation_id":"dan sungguh, Kami telah mengutus (rasul) pemberi peringatan di kalangan mereka."},{"text_madani":"فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُنذَرِينَ","translation_en":"Then see how was the end of those warned,","translation_id":"Maka perhatikanlah bagaimana kesudahan orang-orang yang diberi peringatan itu,"},{"text_madani":"إِلَّا عِبَادَ اللَّهِ الْمُخْلَصِينَ","translation_en":"Except the servants of Allah, the purified ones.","translation_id":"kecuali hamba-hamba Allah yang disucikan (dari dosa)."},{"text_madani":"وَلَقَدْ نَادَانَا نُوحٌ فَلَنِعْمَ الْمُجِيبُونَ","translation_en":"And Nuh did certainly call upon Us, and most excellent answerer of prayer are We.","translation_id":"Dan sungguh, Nuh telah berdoa kepada Kami, maka sungguh, Kamilah sebaik-baik yang memperkenankan doa."},{"text_madani":"وَنَجَّيْنَاهُ وَأَهْلَهُ مِنَ الْكَرْبِ الْعَظِيمِ","translation_en":"And We delivered him and his followers from the mighty distress.","translation_id":"Kami telah menyelamatkan dia dan pengikutnya dari bencana yang besar."},{"text_madani":"وَجَعَلْنَا ذُرِّيَّتَهُ هُمُ الْبَاقِينَ","translation_en":"And We made his offspring the survivors.","translation_id":"Dan Kami jadikan anak cucunya orang-orang yang melanjutkan keturunan."},{"text_madani":"وَتَرَكْنَا عَلَيْهِ فِي الْآخِرِينَ","translation_en":"And We perpetuated to him (praise) among the later generations.","translation_id":"Dan Kami abadikan untuk Nuh (pujian) di kalangan orang-orang yang datang kemudian;"},{"text_madani":"سَلَامٌ عَلَىٰ نُوحٍ فِي الْعَالَمِينَ","translation_en":"Peace and salutation to Nuh among the nations.","translation_id":"”Kesejahteraan (Kami limpahkan) atas Nuh di seluruh alam.”"},{"text_madani":"إِنَّا كَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ","translation_en":"Thus do We surely reward the doers of good.","translation_id":"Sungguh, demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik."},{"text_madani":"إِنَّهُ مِنْ عِبَادِنَا الْمُؤْمِنِينَ","translation_en":"Surely he was of Our believing servants.","translation_id":"Sungguh, dia termasuk di antara hamba-hamba Kami yang beriman."},{"text_madani":"ثُمَّ أَغْرَقْنَا الْآخَرِينَ","translation_en":"Then We drowned the others","translation_id":"Kemudian Kami tenggelamkan yang lain."},{"text_madani":"وَإِنَّ مِن شِيعَتِهِ لَإِبْرَاهِيمَ","translation_en":"And most surely Ibrahim followed his way.","translation_id":"Dan sungguh, Ibrahim termasuk golongannya (Nuh)."},{"text_madani":"إِذْ جَاءَ رَبَّهُ بِقَلْبٍ سَلِيمٍ","translation_en":"When he came to his Lord with a free heart,","translation_id":"(Ingatlah) ketika dia datang kepada Tuhannya dengan hati yang suci,"},{"text_madani":"إِذْ قَالَ لِأَبِيهِ وَقَوْمِهِ مَاذَا تَعْبُدُونَ","translation_en":"When he said to his father and his people: What is it that you worship?","translation_id":"(ingatlah) ketika dia berkata kepada ayahnya dan kaumnya, “Apakah yang kamu sembah itu?"},{"text_madani":"أَئِفْكًا آلِهَةً دُونَ اللَّهِ تُرِيدُونَ","translation_en":"A lie-- gods besides Allah-- do you desire?","translation_id":"Apakah kamu menghendaki kebohongan dengan sesembahan selain Allah itu?"},{"text_madani":"فَمَا ظَنُّكُم بِرَبِّ الْعَالَمِينَ","translation_en":"What is then your idea about the Lord of the worlds?","translation_id":"Maka bagaimana anggapanmu terhadap Tuhan seluruh alam?”"},{"text_madani":"فَنَظَرَ نَظْرَةً فِي النُّجُومِ","translation_en":"Then he looked at the stars, looking up once,","translation_id":"Lalu dia memandang sekilas ke bintang-bintang,"},{"text_madani":"فَقَالَ إِنِّي سَقِيمٌ","translation_en":"Then he said: Surely I am sick (of your worshipping these).","translation_id":"kemudian dia (Ibrahim) berkata, “Sesungguhnya aku sakit.”"},{"text_madani":"فَتَوَلَّوْا عَنْهُ مُدْبِرِينَ","translation_en":"So they went away from him, turning back.","translation_id":"Lalu mereka berpaling dari dia dan pergi meninggalkannya."},{"text_madani":"فَرَاغَ إِلَىٰ آلِهَتِهِمْ فَقَالَ أَلَا تَأْكُلُونَ","translation_en":"Then he turned aside to their gods secretly and said: What! do you not eat?","translation_id":"Kemudian dia (Ibrahim) pergi dengan diam-diam kepada berhala-berhala mereka; lalu dia berkata, “Mengapa kamu tidak makan?"},{"text_madani":"مَا لَكُمْ لَا تَنطِقُونَ","translation_en":"What is the matter with you that you do not speak?","translation_id":"Mengapa kamu tidak menjawab?”"},{"text_madani":"فَرَاغَ عَلَيْهِمْ ضَرْبًا بِالْيَمِينِ","translation_en":"Then he turned against them secretly, smiting them with the right hand.","translation_id":"Lalu dihadapinya (berhala-berhala) itu sambil memukulnya dengan tangan kanannya."},{"text_madani":"فَأَقْبَلُوا إِلَيْهِ يَزِفُّونَ","translation_en":"So they (people) advanced towards him, hastening.","translation_id":"Kemudian mereka (kaumnya) datang bergegas kepadanya."},{"text_madani":"قَالَ أَتَعْبُدُونَ مَا تَنْحِتُونَ","translation_en":"Said he: What! do you worship what you hew out?","translation_id":"Dia (Ibrahim) berkata, “Apakah kamu menyembah patung-patung yang kamu pahat itu?"},{"text_madani":"وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ","translation_en":"And Allah has created you and what you make.","translation_id":"Padahal Allah-lah yang menciptakan kamu dan apa yang kamu perbuat itu.”"},{"text_madani":"قَالُوا ابْنُوا لَهُ بُنْيَانًا فَأَلْقُوهُ فِي الْجَحِيمِ","translation_en":"They said: Build for him a furnace, then cast him into the burning fire.","translation_id":"Mereka berkata, “Buatlah bangunan (perapian) untuknya (membakar Ibrahim); lalu lemparkan dia ke dalam api yang menyala-nyala itu.”"},{"text_madani":"فَأَرَادُوا بِهِ كَيْدًا فَجَعَلْنَاهُمُ الْأَسْفَلِينَ","translation_en":"And they desired a war against him, but We brought them low.","translation_id":"Maka mereka bermaksud memperdayainya dengan (membakar)nya, (namun Allah menyelamatkannya), lalu Kami jadikan mereka orang-orang yang hina."},{"text_madani":"وَقَالَ إِنِّي ذَاهِبٌ إِلَىٰ رَبِّي سَيَهْدِينِ","translation_en":"And he said: Surely I fly to my lord; He will guide me.","translation_id":"Dan dia (Ibrahim) berkata, “Sesungguhnya aku harus pergi (menghadap) kepada Tuhanku, Dia akan memberi petunjuk kepadaku."},{"text_madani":"رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ","translation_en":"My Lord! grant me of the doers of good deeds.","translation_id":"Ya Tuhanku, anugerahkanlah kepadaku (seorang anak) yang termasuk orang yang shalih.”"},{"text_madani":"فَبَشَّرْنَاهُ بِغُلَامٍ حَلِيمٍ","translation_en":"So We gave him the good news of a boy, possessing forbearance.","translation_id":"Maka Kami beri kabar gembira kepadanya dengan (kelahiran) seorang anak yang sangat sabar (Ismail)."},{"text_madani":"فَلَمَّا بَلَغَ مَعَهُ السَّعْيَ قَالَ يَا بُنَيَّ إِنِّي أَرَىٰ فِي الْمَنَامِ أَنِّي أَذْبَحُكَ فَانظُرْ مَاذَا تَرَىٰ ۚ قَالَ يَا أَبَتِ افْعَلْ مَا تُؤْمَرُ ۖ سَتَجِدُنِي إِن شَاءَ اللَّهُ مِنَ الصَّابِرِينَ","translation_en":"And when he attained to working with him, he said: O my son! surely I have seen in a dream that I should sacrifice you; consider then what you see. He said: O my father! do what you are commanded; if Allah please, you will find me of the patient ones.","translation_id":"Maka ketika anak itu sampai (pada umur) sanggup berusaha bersamanya, (Ibrahim) berkata, “Wahai anakku! Sesungguhnya aku bermimpi bahwa aku menyembelihmu. Maka pikirkanlah bagaimana pendapatmu!” Dia (Ismail) menjawab, “Wahai ayahku! Lakukanlah apa yang diperintahkan (Allah) kepadamu; insya Allah engkau akan mendapatiku termasuk orang yang sabar.”"},{"text_madani":"فَلَمَّا أَسْلَمَا وَتَلَّهُ لِلْجَبِينِ","translation_en":"So when they both submitted and he threw him down upon his forehead,","translation_id":"Maka ketika keduanya telah berserah diri dan dia (Ibrahim) membaringkan anaknya atas pelipis(nya), (untuk melaksanakan perintah Allah)."},{"text_madani":"وَنَادَيْنَاهُ أَن يَا إِبْرَاهِيمُ","translation_en":"And We called out to him saying: O Ibrahim!","translation_id":"Lalu Kami panggil dia, “Wahai Ibrahim!"},{"text_madani":"قَدْ صَدَّقْتَ الرُّؤْيَا ۚ إِنَّا كَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ","translation_en":"You have indeed shown the truth of the vision; surely thus do We reward the doers of good:","translation_id":"sungguh, engkau telah membenarkan mimpi itu.” Sungguh, demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik."},{"text_madani":"إِنَّ هَٰذَا لَهُوَ الْبَلَاءُ الْمُبِينُ","translation_en":"Most surely this is a manifest trial.","translation_id":"Sesungguhnya ini benar-benar suatu ujian yang nyata."},{"text_madani":"وَفَدَيْنَاهُ بِذِبْحٍ عَظِيمٍ","translation_en":"And We ransomed him with a Feat sacrifice.","translation_id":"Dan Kami tebus anak itu dengan seekor sembelihan yang besar."},{"text_madani":"وَتَرَكْنَا عَلَيْهِ فِي الْآخِرِينَ","translation_en":"And We perpetuated (praise) to him among the later generations.","translation_id":"Dan Kami abadikan untuk Ibrahim (pujian) di kalangan orang-orang yang datang kemudian,"},{"text_madani":"سَلَامٌ عَلَىٰ إِبْرَاهِيمَ","translation_en":"Peace be on Ibrahim.","translation_id":"”Selamat sejahtera bagi Ibrahim.”"},{"text_madani":"كَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ","translation_en":"Thus do We reward the doers of good.","translation_id":"Demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik."},{"text_madani":"إِنَّهُ مِنْ عِبَادِنَا الْمُؤْمِنِينَ","translation_en":"Surely he was one of Our believing servants.","translation_id":"Sungguh, dia termasuk hamba-hamba Kami yang beriman."},{"text_madani":"وَبَشَّرْنَاهُ بِإِسْحَاقَ نَبِيًّا مِّنَ الصَّالِحِينَ","translation_en":"And We gave him the good news of Ishaq, a prophet among the good ones.","translation_id":"Dan Kami beri dia kabar gembira dengan (kelahiran) Ishak seorang nabi yang termasuk orang-orang yang shalih."},{"text_madani":"وَبَارَكْنَا عَلَيْهِ وَعَلَىٰ إِسْحَاقَ ۚ وَمِن ذُرِّيَّتِهِمَا مُحْسِنٌ وَظَالِمٌ لِّنَفْسِهِ مُبِينٌ","translation_en":"And We showered Our blessings on him and on Ishaq; and of their offspring are the doers of good, and (also) those who are clearly unjust to their own souls.","translation_id":"Dan Kami limpahkan keberkahan kepadanya dan kepada Ishak. Dan di antara keturunan keduanya ada yang berbuat baik dan ada (pula) yang terang-terangan berbuat zhalim terhadap dirinya sendiri."},{"text_madani":"وَلَقَدْ مَنَنَّا عَلَىٰ مُوسَىٰ وَهَارُونَ","translation_en":"And certainly We conferred a favor on Musa and Haroun.","translation_id":"Dan sungguh, Kami telah melimpahkan nikmat kepada Musa dan Harun."},{"text_madani":"وَنَجَّيْنَاهُمَا وَقَوْمَهُمَا مِنَ الْكَرْبِ الْعَظِيمِ","translation_en":"And We delivered them both and their people from the mighty distress.","translation_id":"Dan Kami selamatkan keduanya dan kaumnya dari bencana yang besar,"},{"text_madani":"وَنَصَرْنَاهُمْ فَكَانُوا هُمُ الْغَالِبِينَ","translation_en":"And We helped them, so they were the vanquishers.","translation_id":"dan Kami tolong mereka, sehingga jadilah mereka orang-orang yang menang."},{"text_madani":"وَآتَيْنَاهُمَا الْكِتَابَ الْمُسْتَبِينَ","translation_en":"And We gave them both the Book that made (things) clear.","translation_id":"Dan Kami berikan kepada keduanya Kitab yang sangat jelas,"},{"text_madani":"وَهَدَيْنَاهُمَا الصِّرَاطَ الْمُسْتَقِيمَ","translation_en":"And We guided them both on the right way.","translation_id":"dan Kami tunjukkan keduanya jalan yang lurus."},{"text_madani":"وَتَرَكْنَا عَلَيْهِمَا فِي الْآخِرِينَ","translation_en":"And We perpetuated (praise) to them among the later generations.","translation_id":"Dan Kami abadikan untuk keduanya (pujian) di kalangan orang-orang yang datang kemudian,"},{"text_madani":"سَلَامٌ عَلَىٰ مُوسَىٰ وَهَارُونَ","translation_en":"Peace be on Musa and Haroun.","translation_id":"”Selamat sejahtera bagi Musa dan Harun.”"},{"text_madani":"إِنَّا كَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ","translation_en":"Even thus do We reward the doers of good.","translation_id":"Demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik."},{"text_madani":"إِنَّهُمَا مِنْ عِبَادِنَا الْمُؤْمِنِينَ","translation_en":"Surely they were both of Our believing servants.","translation_id":"Sungguh, keduanya termasuk hamba-hamba Kami yang beriman."},{"text_madani":"وَإِنَّ إِلْيَاسَ لَمِنَ الْمُرْسَلِينَ","translation_en":"And Ilyas was most surely of the messengers.","translation_id":"Dan sungguh, Ilyas benar-benar termasuk salah seorang rasul."},{"text_madani":"إِذْ قَالَ لِقَوْمِهِ أَلَا تَتَّقُونَ","translation_en":"When he said to his people: Do you not guard (against evil)?","translation_id":"(Ingatlah) ketika dia berkata kepada kaumnya, “Mengapa kamu tidak bertakwa?"},{"text_madani":"أَتَدْعُونَ بَعْلًا وَتَذَرُونَ أَحْسَنَ الْخَالِقِينَ","translation_en":"What! do you call upon Ba'l and forsake the best of the creators,","translation_id":"Patutkah kamu menyembah Ba’l dan kamu tinggalkan (Allah) sebaik-baik pencipta."},{"text_madani":"اللَّهَ رَبَّكُمْ وَرَبَّ آبَائِكُمُ الْأَوَّلِينَ","translation_en":"Allah, your Lord and the Lord of your fathers of yore?","translation_id":"(Yaitu) Allah Tuhanmu dan Tuhan nenek moyangmu yang terdahulu?”"},{"text_madani":"فَكَذَّبُوهُ فَإِنَّهُمْ لَمُحْضَرُونَ","translation_en":"But they called him a liar, therefore they shall most surely be brought up.","translation_id":"Tetapi mereka mendustakannya (Ilyas), maka sungguh, mereka akan diseret (ke neraka),"},{"text_madani":"إِلَّا عِبَادَ اللَّهِ الْمُخْلَصِينَ","translation_en":"But not the servants of Allah, the purified ones.","translation_id":"kecuali hamba-hamba Allah yang disucikan (dari dosa),"},{"text_madani":"وَتَرَكْنَا عَلَيْهِ فِي الْآخِرِينَ","translation_en":"And We perpetuated to him (praise) among the later generations.","translation_id":"Dan Kami abadikan untuk Ilyas (pujian) di kalangan orang-orang yang datang kemudian."},{"text_madani":"سَلَامٌ عَلَىٰ إِلْ يَاسِينَ","translation_en":"Peace be on Ilyas.","translation_id":"”Selamat sejahtera bagi Ilyas.”"},{"text_madani":"إِنَّا كَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ","translation_en":"Even thus do We reward the doers of good.","translation_id":"Demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik."},{"text_madani":"إِنَّهُ مِنْ عِبَادِنَا الْمُؤْمِنِينَ","translation_en":"Surely he was one of Our believing servants.","translation_id":"Sungguh, dia termasuk hamba-hamba Kami yang beriman."},{"text_madani":"وَإِنَّ لُوطًا لَّمِنَ الْمُرْسَلِينَ","translation_en":"And Lut was most surely of the messengers.","translation_id":"Dan sungguh, Luth benar-benar termasuk salah seorang rasul."},{"text_madani":"إِذْ نَجَّيْنَاهُ وَأَهْلَهُ أَجْمَعِينَ","translation_en":"When We delivered him and his followers, all--","translation_id":"(Ingatlah) ketika Kami telah menyelamatkan dia dan pengikutnya semua,"},{"text_madani":"إِلَّا عَجُوزًا فِي الْغَابِرِينَ","translation_en":"Except an old woman (who was) amongst those who tarried.","translation_id":"kecuali seorang perempuan tua (istrinya) bersama-sama orang yang tinggal (di kota)."},{"text_madani":"ثُمَّ دَمَّرْنَا الْآخَرِينَ","translation_en":"Then We destroyed the others.","translation_id":"Kemudian Kami binasakan orang-orang yang lain."},{"text_madani":"وَإِنَّكُمْ لَتَمُرُّونَ عَلَيْهِم مُّصْبِحِينَ","translation_en":"And most surely you pass by them in the morning,","translation_id":"Dan sesungguhnya kamu (penduduk Mekah) benar-benar akan melalui (bekas-bekas) mereka pada waktu pagi,"},{"text_madani":"وَبِاللَّيْلِ ۗ أَفَلَا تَعْقِلُونَ","translation_en":"And at night; do you not then understand?","translation_id":"dan pada waktu malam. Maka mengapa kamu tidak mengerti?"},{"text_madani":"وَإِنَّ يُونُسَ لَمِنَ الْمُرْسَلِينَ","translation_en":"And Yunus was most surely of the messengers.","translation_id":"Dan sungguh, Yunus benar-benar termasuk salah seorang rasul,"},{"text_madani":"إِذْ أَبَقَ إِلَى الْفُلْكِ الْمَشْحُونِ","translation_en":"When he ran away to a ship completely laden,","translation_id":"(ingatlah) ketika dia lari, ke kapal yang penuh muatan,"},{"text_madani":"فَسَاهَمَ فَكَانَ مِنَ الْمُدْحَضِينَ","translation_en":"So he shared (with them), but was of those who are cast off.","translation_id":"kemudian dia ikut diundi ternyata dia termasuk orang-orang yang kalah (dalam undian)."},{"text_madani":"فَالْتَقَمَهُ الْحُوتُ وَهُوَ مُلِيمٌ","translation_en":"So the fish swallowed him while he did that for which he blamed himself","translation_id":"Maka dia ditelan oleh ikan besar dalam keadaan tercela."},{"text_madani":"فَلَوْلَا أَنَّهُ كَانَ مِنَ الْمُسَبِّحِينَ","translation_en":"But had it not been that he was of those who glorify (Us),","translation_id":"Maka sekiranya dia tidak termasuk orang yang banyak berdzikir (bertasbih) kepada Allah,"},{"text_madani":"لَلَبِثَ فِي بَطْنِهِ إِلَىٰ يَوْمِ يُبْعَثُونَ","translation_en":"He would certainly have tarried in its belly to the day when they are raised.","translation_id":"niscaya dia akan tetap tinggal di perut (ikan itu) sampai hari kebangkitan."},{"text_madani":"فَنَبَذْنَاهُ بِالْعَرَاءِ وَهُوَ سَقِيمٌ","translation_en":"Then We cast him on to the vacant surface of the earth while he was sick.","translation_id":"Kemudian Kami lemparkan dia ke daratan yang tandus, sedang dia dalam keadaan sakit."},{"text_madani":"وَأَنبَتْنَا عَلَيْهِ شَجَرَةً مِّن يَقْطِينٍ","translation_en":"And We caused to grow up for him a gourdplant.","translation_id":"Kemudian untuk dia Kami tumbuhkan sebatang pohon dari jenis labu."},{"text_madani":"وَأَرْسَلْنَاهُ إِلَىٰ مِائَةِ أَلْفٍ أَوْ يَزِيدُونَ","translation_en":"And We sent him to a hundred thousand, rather they exceeded.","translation_id":"Dan Kami utus dia kepada seratus ribu (orang) atau lebih,"},{"text_madani":"فَآمَنُوا فَمَتَّعْنَاهُمْ إِلَىٰ حِينٍ","translation_en":"And they believed, so We gave them provision till a time.","translation_id":"sehingga mereka beriman, karena itu Kami anugerahkan kenikmatan hidup kepada mereka hingga waktu tertentu."},{"text_madani":"فَاسْتَفْتِهِمْ أَلِرَبِّكَ الْبَنَاتُ وَلَهُمُ الْبَنُونَ","translation_en":"Then ask them whether your Lord has daughters and they have sons.","translation_id":"Maka tanyakanlah (Muhammad) kepada mereka (orang-orang kafir Mekah), “Apakah anak-anak perempuan itu untuk Tuhanmu sedangkan untuk mereka anak-anak laki-laki?”"},{"text_madani":"أَمْ خَلَقْنَا الْمَلَائِكَةَ إِنَاثًا وَهُمْ شَاهِدُونَ","translation_en":"Or did We create the angels females while they were witnesses?","translation_id":"atau apakah Kami menciptakan malaikat-malaikat berupa perempuan sedangkan mereka menyaksikan(nya)?"},{"text_madani":"أَلَا إِنَّهُم مِّنْ إِفْكِهِمْ لَيَقُولُونَ","translation_en":"Now surely it is of their own lie that they say:","translation_id":"Ingatlah, sesungguhnya di antara kebohongannya mereka benar-benar mengatakan,"},{"text_madani":"وَلَدَ اللَّهُ وَإِنَّهُمْ لَكَاذِبُونَ","translation_en":"Allah has begotten; and most surely they are liars.","translation_id":"”Allah mempunyai anak.” Dan sungguh, mereka benar-benar pendusta,"},{"text_madani":"أَصْطَفَى الْبَنَاتِ عَلَى الْبَنِينَ","translation_en":"Has He chosen daughters in preference to sons?","translation_id":"apakah Dia (Allah) memilih anak-anak perempuan daripada anak-anak laki-laki?"},{"text_madani":"مَا لَكُمْ كَيْفَ تَحْكُمُونَ","translation_en":"What is the matter with you, how is it that you judge?","translation_id":"Mengapa kamu ini? Bagaimana (caranya) kamu menetapkan?"},{"text_madani":"أَفَلَا تَذَكَّرُونَ","translation_en":"Will you not then mind?","translation_id":"Maka mengapa kamu tidak memikirkan?"},{"text_madani":"أَمْ لَكُمْ سُلْطَانٌ مُّبِينٌ","translation_en":"Or have you a clear authority?","translation_id":"Ataukah kamu mempunyai bukti yang jelas?"},{"text_madani":"فَأْتُوا بِكِتَابِكُمْ إِن كُنتُمْ صَادِقِينَ","translation_en":"Then bring your book, if you are truthful.","translation_id":"(Kalau begitu) maka bawalah kitabmu jika kamu orang yang benar."},{"text_madani":"وَجَعَلُوا بَيْنَهُ وَبَيْنَ الْجِنَّةِ نَسَبًا ۚ وَلَقَدْ عَلِمَتِ الْجِنَّةُ إِنَّهُمْ لَمُحْضَرُونَ","translation_en":"And they assert a relationship between Him and the jinn; and certainly the jinn do know that they shall surely be brought up;","translation_id":"Dan mereka mengadakan (hubungan) nasab (keluarga) antara Dia (Allah) dan jin. Dan sungguh, jin telah mengetahui bahwa mereka pasti akan diseret (ke neraka),"},{"text_madani":"سُبْحَانَ اللَّهِ عَمَّا يَصِفُونَ","translation_en":"Glory be to Allah (for freedom) from what they describe;","translation_id":"Mahasuci Allah dari apa yang mereka sifatkan,"},{"text_madani":"إِلَّا عِبَادَ اللَّهِ الْمُخْلَصِينَ","translation_en":"But not so the servants of Allah, the purified ones.","translation_id":"kecuali hamba-hamba Allah yang disucikan (dari dosa)."},{"text_madani":"فَإِنَّكُمْ وَمَا تَعْبُدُونَ","translation_en":"So surely you and what you worship,","translation_id":"Maka sesungguhnya kamu dan apa yang kamu sembah itu,"},{"text_madani":"مَا أَنتُمْ عَلَيْهِ بِفَاتِنِينَ","translation_en":"Not against Him can you cause (any) to fall into trial,","translation_id":"tidak akan dapat menyesatkan (seseorang) terhadap Allah,"},{"text_madani":"إِلَّا مَنْ هُوَ صَالِ الْجَحِيمِ","translation_en":"Save him who will go to hell.","translation_id":"kecuali orang-orang yang akan masuk ke neraka Jahim."},{"text_madani":"وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَّعْلُومٌ","translation_en":"And there is none of us but has an assigned place,","translation_id":"Dan tidak satu pun di antara kami (malaikat) melainkan masing-masing mempunyai kedudukan tertentu,"},{"text_madani":"وَإِنَّا لَنَحْنُ الصَّافُّونَ","translation_en":"And most surely we are they who draw themselves out in ranks,","translation_id":"dan sesungguhnya kami selalu teratur dalam barisan (dalam melaksanakan perintah Allah)."},{"text_madani":"وَإِنَّا لَنَحْنُ الْمُسَبِّحُونَ","translation_en":"And we are most surely they who declare the glory (of Allah).","translation_id":"Dan sungguh, kami benar-benar terus bertasbih (kepada Allah)."},{"text_madani":"وَإِن كَانُوا لَيَقُولُونَ","translation_en":"And surely they used to say:","translation_id":"Dan sesungguhnya mereka (orang kafir Mekah) benar-benar pernah berkata,"},{"text_madani":"لَوْ أَنَّ عِندَنَا ذِكْرًا مِّنَ الْأَوَّلِينَ","translation_en":"Had we a reminder from those of yore,","translation_id":"”Sekiranya di sisi kami ada sebuah kitab dari (kitab-kitab yang diturunkan) kepada orang-orang dahulu,"},{"text_madani":"لَكُنَّا عِبَادَ اللَّهِ الْمُخْلَصِينَ","translation_en":"We would certainly have been the servants of Allah-- the purified ones.","translation_id":"tentu kami akan menjadi hamba Allah yang disucikan (dari dosa).”"},{"text_madani":"فَكَفَرُوا بِهِ ۖ فَسَوْفَ يَعْلَمُونَ","translation_en":"But (now) they disbelieve in it, so they will come to know.","translation_id":"Tetapi ternyata mereka mengingkarinya (Al-Qur'an); maka kelak mereka akan mengetahui (akibat keingkarannya itu)."},{"text_madani":"وَلَقَدْ سَبَقَتْ كَلِمَتُنَا لِعِبَادِنَا الْمُرْسَلِينَ","translation_en":"And certainly Our word has already gone forth in respect of Our servants, the messengers:","translation_id":"Dan sungguh, janji Kami telah tetap bagi hamba-hamba Kami yang menjadi rasul,"},{"text_madani":"إِنَّهُمْ لَهُمُ الْمَنصُورُونَ","translation_en":"Most surely they shall be the assisted ones","translation_id":"(yaitu) mereka itu pasti akan mendapat pertolongan."},{"text_madani":"وَإِنَّ جُندَنَا لَهُمُ الْغَالِبُونَ","translation_en":"And most surely Our host alone shall be the victorious ones.","translation_id":"Dan sesungguhnya bala tentara Kami itulah yang pasti menang."},{"text_madani":"فَتَوَلَّ عَنْهُمْ حَتَّىٰ حِينٍ","translation_en":"Therefore turn away from them till a time,","translation_id":"Maka berpalinglah engkau (Muhammad) dari mereka sampai waktu tertentu,"},{"text_madani":"وَأَبْصِرْهُمْ فَسَوْفَ يُبْصِرُونَ","translation_en":"And (then) see them, so they too shall see.","translation_id":"dan perlihatkanlah kepada mereka, maka kelak mereka akan melihat (azab itu)."},{"text_madani":"أَفَبِعَذَابِنَا يَسْتَعْجِلُونَ","translation_en":"What! would they then hasten on Our chastisement?","translation_id":"Maka apakah mereka meminta agar azab Kami disegerakan?"},{"text_madani":"فَإِذَا نَزَلَ بِسَاحَتِهِمْ فَسَاءَ صَبَاحُ الْمُنذَرِينَ","translation_en":"But when it shall descend in their court, evil shall then be the morning of the warned ones.","translation_id":"Maka apabila (siksaan) itu turun di halaman mereka, maka sangat buruklah pagi hari bagi orang-orang yang diperingatkan itu."},{"text_madani":"وَتَوَلَّ عَنْهُمْ حَتَّىٰ حِينٍ","translation_en":"And turn away from them till a time","translation_id":"Dan berpalinglah engkau dari mereka sampai waktu tertentu."},{"text_madani":"وَأَبْصِرْ فَسَوْفَ يُبْصِرُونَ","translation_en":"And (then) see, for they too shall see.","translation_id":"Dan perlihatkanlah, maka kelak mereka akan melihat (azab itu)."},{"text_madani":"سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ","translation_en":"Glory be to your Lord, the Lord of Honor, above what they describe.","translation_id":"Mahasuci Tuhanmu, Tuhan Yang Mahaperkasa dari sifat yang mereka katakan."},{"text_madani":"وَسَلَامٌ عَلَى الْمُرْسَلِينَ","translation_en":"And peace be on the messengers.","translation_id":"Dan selamat sejahtera bagi para rasul."},{"text_madani":"وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ","translation_en":"And all praise is due to Allah, the Lord of the worlds.","translation_id":"Dan segala puji bagi Allah Tuhan seluruh alam."}]}
