{"chapter_number":52,"name_simple":"At-Tur","verses_count":49,"verses":[{"text_madani":"وَالطُّورِ","translation_en":"I swear by the Mountain,","translation_id":"Demi gunung (Sinai),"},{"text_madani":"وَكِتَابٍ مَّسْطُورٍ","translation_en":"And the Book written","translation_id":"dan demi Kitab yang ditulis,"},{"text_madani":"فِي رَقٍّ مَّنشُورٍ","translation_en":"In an outstretched fine parchment,","translation_id":"pada lembaran yang terbuka,"},{"text_madani":"وَالْبَيْتِ الْمَعْمُورِ","translation_en":"And the House (Kaaba) that is visited,","translation_id":"demi Baitulma‘mur (Ka‘bah),"},{"text_madani":"وَالسَّقْفِ الْمَرْفُوعِ","translation_en":"And the elevated canopy","translation_id":"demi atap yang ditinggikan (langit),"},{"text_madani":"وَالْبَحْرِ الْمَسْجُورِ","translation_en":"And the swollen sea","translation_id":"demi lautan yang penuh gelombang,"},{"text_madani":"إِنَّ عَذَابَ رَبِّكَ لَوَاقِعٌ","translation_en":"Most surely the punishment of your Lord will come to pass;","translation_id":"sungguh, azab Tuhanmu pasti terjadi,"},{"text_madani":"مَّا لَهُ مِن دَافِعٍ","translation_en":"There shall be none to avert it;","translation_id":"tidak sesuatu pun yang dapat menolaknya,"},{"text_madani":"يَوْمَ تَمُورُ السَّمَاءُ مَوْرًا","translation_en":"On the day when the heaven shall move from side to side","translation_id":"pada hari (ketika) langit berguncang sekeras-kerasnya,"},{"text_madani":"وَتَسِيرُ الْجِبَالُ سَيْرًا","translation_en":"And the mountains shall pass away passing away (altogether).","translation_id":"dan gunung berjalan (berpindah-pindah)."},{"text_madani":"فَوَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ","translation_en":"So woe on that day to those who reject (the truth),","translation_id":"Maka celakalah pada hari itu bagi orang-orang yang mendustakan."},{"text_madani":"الَّذِينَ هُمْ فِي خَوْضٍ يَلْعَبُونَ","translation_en":"Those who sport entering into vain discourses.","translation_id":"Orang-orang yang bermain-main dalam kebatilan (perbuatan dosa),"},{"text_madani":"يَوْمَ يُدَعُّونَ إِلَىٰ نَارِ جَهَنَّمَ دَعًّا","translation_en":"The day on which they shall be driven away to the fire of hell with violence.","translation_id":"pada hari (ketika) itu mereka didorong ke neraka Jahanam dengan sekuat-kuatnya."},{"text_madani":"هَٰذِهِ النَّارُ الَّتِي كُنتُم بِهَا تُكَذِّبُونَ","translation_en":"This is the fire which you used to give the lie to.","translation_id":"(Dikatakan kepada mereka), “Inilah neraka yang dahulu kamu mendustakannya.”"},{"text_madani":"أَفَسِحْرٌ هَٰذَا أَمْ أَنتُمْ لَا تُبْصِرُونَ","translation_en":"Is it magic then or do you not see?","translation_id":"Maka apakah ini sihir? Ataukah kamu tidak melihat?"},{"text_madani":"اصْلَوْهَا فَاصْبِرُوا أَوْ لَا تَصْبِرُوا سَوَاءٌ عَلَيْكُمْ ۖ إِنَّمَا تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ","translation_en":"Enter into it, then bear (it) patiently, or do not bear (it) patiently, it is the same to you; you shall be requited only (for) what you did.","translation_id":"Masuklah ke dalamnya (rasakanlah panas apinya); baik kamu bersabar atau tidak, sama saja bagimu; sesungguhnya kamu hanya diberi balasan atas apa yang telah kamu kerjakan."},{"text_madani":"إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَنَعِيمٍ","translation_en":"Surely those who guard (against evil) shall be in gardens and bliss","translation_id":"Sesungguhnya orang-orang yang bertakwa berada dalam surga dan kenikmatan,"},{"text_madani":"فَاكِهِينَ بِمَا آتَاهُمْ رَبُّهُمْ وَوَقَاهُمْ رَبُّهُمْ عَذَابَ الْجَحِيمِ","translation_en":"Rejoicing because of what their Lord gave them, and their Lord saved them from the punishment of the burning fire.","translation_id":"mereka bersuka ria dengan apa yang diberikan Tuhan kepada mereka; dan Tuhan memelihara mereka dari azab neraka."},{"text_madani":"كُلُوا وَاشْرَبُوا هَنِيئًا بِمَا كُنتُمْ تَعْمَلُونَ","translation_en":"Eat and drink pleasantly for what you did,","translation_id":"(Dikatakan kepada mereka), “Makan dan minumlah dengan rasa nikmat sebagai balasan dari apa yang telah kamu kerjakan.”"},{"text_madani":"مُتَّكِئِينَ عَلَىٰ سُرُرٍ مَّصْفُوفَةٍ ۖ وَزَوَّجْنَاهُم بِحُورٍ عِينٍ","translation_en":"Reclining on thrones set in lines, and We will unite them to large-eyed beautiful ones.","translation_id":"Mereka bersandar di atas dipan-dipan yang tersusun dan Kami berikan kepada mereka pasangan bidadari yang bermata indah."},{"text_madani":"وَالَّذِينَ آمَنُوا وَاتَّبَعَتْهُمْ ذُرِّيَّتُهُم بِإِيمَانٍ أَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ وَمَا أَلَتْنَاهُم مِّنْ عَمَلِهِم مِّن شَيْءٍ ۚ كُلُّ امْرِئٍ بِمَا كَسَبَ رَهِينٌ","translation_en":"And (as for) those who believe and their offspring follow them in faith, We will unite with them their offspring and We will not diminish to them aught of their work; every man is responsible for what he shall have wrought.","translation_id":"Dan orang-orang yang beriman, beserta anak cucu mereka yang mengikuti mereka dalam keimanan, Kami pertemukan mereka dengan anak cucu mereka (di dalam surga), dan Kami tidak mengurangi sedikit pun pahala amal (kebajikan) mereka. Setiap orang terikat dengan apa yang dikerjakannya."},{"text_madani":"وَأَمْدَدْنَاهُم بِفَاكِهَةٍ وَلَحْمٍ مِّمَّا يَشْتَهُونَ","translation_en":"And We will aid them with fruit and flesh such as they desire.","translation_id":"Dan Kami berikan kepada mereka tambahan berupa buah-buahan dan daging dari segala jenis yang mereka ingini."},{"text_madani":"يَتَنَازَعُونَ فِيهَا كَأْسًا لَّا لَغْوٌ فِيهَا وَلَا تَأْثِيمٌ","translation_en":"They shall pass therein from one to another a cup wherein there shall be nothing vain nor any sin.","translation_id":"(Di dalam surga itu) mereka saling mengulurkan gelas yang isinya tidak (menimbulkan) ucapan yang tidak berfaedah ataupun perbuatan dosa."},{"text_madani":"وَيَطُوفُ عَلَيْهِمْ غِلْمَانٌ لَّهُمْ كَأَنَّهُمْ لُؤْلُؤٌ مَّكْنُونٌ","translation_en":"And round them shall go boys of theirs as if they were hidden pearls.","translation_id":"Dan di sekitar mereka ada anak-anak muda yang berkeliling untuk (melayani) mereka, seakan-akan mereka itu mutiara yang tersimpan."},{"text_madani":"وَأَقْبَلَ بَعْضُهُمْ عَلَىٰ بَعْضٍ يَتَسَاءَلُونَ","translation_en":"And some of them shall advance towards others questioning each other.","translation_id":"Dan sebagian mereka berhadap-hadapan satu sama lain saling bertegur sapa."},{"text_madani":"قَالُوا إِنَّا كُنَّا قَبْلُ فِي أَهْلِنَا مُشْفِقِينَ","translation_en":"Saying: Surely we feared before on account of our families:","translation_id":"Mereka berkata, “Sesungguhnya kami dahulu, sewaktu berada di tengah-tengah keluarga kami merasa takut (akan diazab)."},{"text_madani":"فَمَنَّ اللَّهُ عَلَيْنَا وَوَقَانَا عَذَابَ السَّمُومِ","translation_en":"But Allah has been gracious to us and He has saved us from the punishment of the hot wind:","translation_id":"Maka Allah memberikan karunia kepada kami dan memelihara kami dari azab neraka."},{"text_madani":"إِنَّا كُنَّا مِن قَبْلُ نَدْعُوهُ ۖ إِنَّهُ هُوَ الْبَرُّ الرَّحِيمُ","translation_en":"Surely we called upon Him before: Surely He is the Benign, the Merciful.","translation_id":"Sesungguhnya kami menyembah-Nya sejak dahulu. Dialah Yang Maha Melimpahkan Kebaikan, Maha Penyayang.”"},{"text_madani":"فَذَكِّرْ فَمَا أَنتَ بِنِعْمَتِ رَبِّكَ بِكَاهِنٍ وَلَا مَجْنُونٍ","translation_en":"Therefore continue to remind, for by the grace of your Lord, you are not a soothsayer, or a madman.","translation_id":"Maka peringatkanlah, karena dengan nikmat Tuhanmu engkau (Muhammad) bukanlah seorang tukang tenung dan bukan pula orang gila."},{"text_madani":"أَمْ يَقُولُونَ شَاعِرٌ نَّتَرَبَّصُ بِهِ رَيْبَ الْمَنُونِ","translation_en":"Or do they say: A poet, we wait for him the evil accidents of time.","translation_id":"Bahkan mereka berkata, “Dia adalah seorang penyair yang kami tunggu-tunggu kecelakaan menimpanya.”"},{"text_madani":"قُلْ تَرَبَّصُوا فَإِنِّي مَعَكُم مِّنَ الْمُتَرَبِّصِينَ","translation_en":"Say: Wait, for surely I too with you am of those who wait.","translation_id":"Katakanlah (Muhammad), “Tunggulah! Sesungguhnya aku pun termasuk orang yang sedang menunggu bersama kamu.”"},{"text_madani":"أَمْ تَأْمُرُهُمْ أَحْلَامُهُم بِهَٰذَا ۚ أَمْ هُمْ قَوْمٌ طَاغُونَ","translation_en":"Nay! do their understandings bid them this? Or are they an inordinate people?","translation_id":"Apakah mereka diperintah oleh pikiran-pikiran mereka untuk mengucapkan (tuduhan-tuduhan) ini ataukah mereka kaum yang melampaui batas?"},{"text_madani":"أَمْ يَقُولُونَ تَقَوَّلَهُ ۚ بَل لَّا يُؤْمِنُونَ","translation_en":"Or do they say: He has forged it. Nay! they do not believe.","translation_id":"Ataukah mereka berkata, “Dia (Muhammad) mereka-rekanya.” Tidak! Merekalah yang tidak beriman."},{"text_madani":"فَلْيَأْتُوا بِحَدِيثٍ مِّثْلِهِ إِن كَانُوا صَادِقِينَ","translation_en":"Then let them bring an announcement like it if they are truthful.","translation_id":"Maka cobalah mereka membuat yang semisal dengannya (Al-Qur'an) jika mereka orang-orang yang benar."},{"text_madani":"أَمْ خُلِقُوا مِنْ غَيْرِ شَيْءٍ أَمْ هُمُ الْخَالِقُونَ","translation_en":"Or were they created without there being anything, or are they the creators?","translation_id":"Atau apakah mereka tercipta tanpa asal-usul ataukah mereka yang menciptakan (diri mereka sendiri)?"},{"text_madani":"أَمْ خَلَقُوا السَّمَاوَاتِ وَالْأَرْضَ ۚ بَل لَّا يُوقِنُونَ","translation_en":"Or did they create the heavens and the earth? Nay! they have no certainty.","translation_id":"Ataukah mereka telah menciptakan langit dan bumi? Sebenarnya mereka tidak meyakini (apa yang mereka katakan)."},{"text_madani":"أَمْ عِندَهُمْ خَزَائِنُ رَبِّكَ أَمْ هُمُ الْمُصَيْطِرُونَ","translation_en":"Or have they the treasures of your Lord with them? Or have they been set in absolute authority?","translation_id":"Ataukah di sisi mereka ada perbendaharaan Tuhanmu ataukah mereka yang berkuasa?"},{"text_madani":"أَمْ لَهُمْ سُلَّمٌ يَسْتَمِعُونَ فِيهِ ۖ فَلْيَأْتِ مُسْتَمِعُهُم بِسُلْطَانٍ مُّبِينٍ","translation_en":"Or have they the means by which they listen? Then let their listener bring a clear authority.","translation_id":"Atau apakah mereka mempunyai tangga (ke langit) untuk mendengarkan (hal-hal yang gaib)? Maka hendaklah orang yang mendengarkan di antara mereka itu datang membawa keterangan yang nyata."},{"text_madani":"أَمْ لَهُ الْبَنَاتُ وَلَكُمُ الْبَنُونَ","translation_en":"Or has He daughters while you have sons?","translation_id":"Ataukah (pantas) untuk Dia anak-anak perempuan sedangkan untuk kamu anak-anak laki-laki?"},{"text_madani":"أَمْ تَسْأَلُهُمْ أَجْرًا فَهُم مِّن مَّغْرَمٍ مُّثْقَلُونَ","translation_en":"Or do you ask them for a reward, so that they are overburdened by a debt?","translation_id":"Ataukah engkau (Muhamamd) meminta imbalan kepada mereka sehingga mereka dibebani dengan hutang?"},{"text_madani":"أَمْ عِندَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُونَ","translation_en":"Or have they the unseen so that they write (it) down?","translation_id":"Ataukah di sisi mereka mempunyai (pengetahuan) tentang yang gaib lalu mereka menuliskannya?"},{"text_madani":"أَمْ يُرِيدُونَ كَيْدًا ۖ فَالَّذِينَ كَفَرُوا هُمُ الْمَكِيدُونَ","translation_en":"Or do they desire a war? But those who disbelieve shall be the vanquished ones in war.","translation_id":"Ataukah mereka hendak melakukan tipu daya? Tetapi orang-orang yang kafir itu, justru merekalah yang terkena tipu daya."},{"text_madani":"أَمْ لَهُمْ إِلَٰهٌ غَيْرُ اللَّهِ ۚ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ","translation_en":"Or have they a god other than Allah? Glory be to Allah from what they set up (with Him).","translation_id":"Ataukah mereka mempunyai tuhan selain Allah? Mahasuci Allah dari apa yang mereka persekutukan."},{"text_madani":"وَإِن يَرَوْا كِسْفًا مِّنَ السَّمَاءِ سَاقِطًا يَقُولُوا سَحَابٌ مَّرْكُومٌ","translation_en":"And if they should see a portion of the heaven coming down, they would say: Piled up clouds.","translation_id":"Dan jika mereka melihat gumpalan-gumpalan awan berjatuhan dari langit, mereka berkata, “Itu adalah awan yang bertumpuk-tumpuk.”"},{"text_madani":"فَذَرْهُمْ حَتَّىٰ يُلَاقُوا يَوْمَهُمُ الَّذِي فِيهِ يُصْعَقُونَ","translation_en":"Leave them then till they meet that day of theirs wherein they shall be made to swoon (with terror):","translation_id":"Maka biarkanlah mereka hingga mereka menemui hari (yang dijanjikan kepada) mereka, pada hari itu mereka dibinasakan,"},{"text_madani":"يَوْمَ لَا يُغْنِي عَنْهُمْ كَيْدُهُمْ شَيْئًا وَلَا هُمْ يُنصَرُونَ","translation_en":"The day on which their struggle shall not avail them aught, nor shall they be helped.","translation_id":"(yaitu) pada hari (ketika) tipu daya mereka tidak berguna sedikit pun bagi mereka dan mereka tidak akan diberi pertolongan."},{"text_madani":"وَإِنَّ لِلَّذِينَ ظَلَمُوا عَذَابًا دُونَ ذَٰلِكَ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ","translation_en":"And surely those who are unjust shall have a punishment besides that (in the world), but most of them do not know.","translation_id":"Dan sesungguhnya bagi orang-orang yang zhalim masih ada azab selain itu. Tetapi kebanyakan mereka tidak mengetahui."},{"text_madani":"وَاصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنَا ۖ وَسَبِّحْ بِحَمْدِ رَبِّكَ حِينَ تَقُومُ","translation_en":"And wait patiently for the judgment of your Lord, for surely you are before Our eyes, and sing the praise of your Lord when you rise;","translation_id":"Dan bersabarlah (Muhammad) menunggu ketetapan Tuhanmu, karena sesungguhnya engkau berada dalam pengawasan Kami, dan bertasbihlah dengan memuji Tuhanmu ketika engkau bangun,"},{"text_madani":"وَمِنَ اللَّيْلِ فَسَبِّحْهُ وَإِدْبَارَ النُّجُومِ","translation_en":"And in the night, give Him glory too, and at the setting of the stars.","translation_id":"dan pada sebagian malam bertasbihlah kepada-Nya dan (juga) pada waktu terbenamnya bintang-bintang (pada waktu fajar)."}]}
