{"chapter_number":68,"name_simple":"Al-Qalam","verses_count":52,"verses":[{"text_madani":"ن ۚ وَالْقَلَمِ وَمَا يَسْطُرُونَ","translation_en":"Noon. I swear by the pen and what the angels write,","translation_id":"Nun. Demi pena dan apa yang mereka tuliskan,"},{"text_madani":"مَا أَنتَ بِنِعْمَةِ رَبِّكَ بِمَجْنُونٍ","translation_en":"By the grace of your Lord you are not mad.","translation_id":"dengan karunia Tuhanmu engkau (Muhammad) bukanlah orang gila."},{"text_madani":"وَإِنَّ لَكَ لَأَجْرًا غَيْرَ مَمْنُونٍ","translation_en":"And most surely you shall have a reward never to be cut off.","translation_id":"Dan sesungguhnya engkau pasti mendapat pahala yang besar yang tidak putus-putusnya."},{"text_madani":"وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِيمٍ","translation_en":"And most surely you conform (yourself) to sublime morality.","translation_id":"Dan sesungguhnya engkau benar-benar berbudi pekerti yang luhur."},{"text_madani":"فَسَتُبْصِرُ وَيُبْصِرُونَ","translation_en":"So you shall see, and they (too) shall see,","translation_id":"Maka kelak engkau akan melihat dan mereka (orang-orang kafir) pun akan melihat,"},{"text_madani":"بِأَييِّكُمُ الْمَفْتُونُ","translation_en":"Which of you is afflicted with madness.","translation_id":"siapa di antara kamu yang gila?"},{"text_madani":"إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَن ضَلَّ عَن سَبِيلِهِ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ","translation_en":"Surely your Lord best knows him who errs from His way, and He best knows the followers of the right course.","translation_id":"Sungguh, Tuhanmu, Dialah yang paling mengetahui siapa yang sesat dari jalan-Nya; dan Dialah yang paling mengetahui siapa orang yang mendapat petunjuk."},{"text_madani":"فَلَا تُطِعِ الْمُكَذِّبِينَ","translation_en":"So do not yield to the rejecters.","translation_id":"Maka janganlah engkau patuhi orang-orang yang mendustakan (ayat-ayat Allah)."},{"text_madani":"وَدُّوا لَوْ تُدْهِنُ فَيُدْهِنُونَ","translation_en":"They wish that you should be pliant so they (too) would be pliant.","translation_id":"Mereka menginginkan agar engkau bersikap lunak maka mereka bersikap lunak (pula)."},{"text_madani":"وَلَا تُطِعْ كُلَّ حَلَّافٍ مَّهِينٍ","translation_en":"And yield not to any mean swearer","translation_id":"Dan janganlah engkau patuhi setiap orang yang suka bersumpah dan suka menghina,"},{"text_madani":"هَمَّازٍ مَّشَّاءٍ بِنَمِيمٍ","translation_en":"Defamer, going about with slander","translation_id":"suka mencela, yang kian ke mari menyebarkan fitnah,"},{"text_madani":"مَّنَّاعٍ لِّلْخَيْرِ مُعْتَدٍ أَثِيمٍ","translation_en":"Forbidder of good, outstepping the limits, sinful,","translation_id":"yang merintangi segala yang baik, yang melampaui batas dan banyak dosa,"},{"text_madani":"عُتُلٍّ بَعْدَ ذَٰلِكَ زَنِيمٍ","translation_en":"Ignoble, besides all that, base-born;","translation_id":"yang bertabiat kasar, selain itu juga terkenal kejahatannya,"},{"text_madani":"أَن كَانَ ذَا مَالٍ وَبَنِينَ","translation_en":"Because he possesses wealth and sons.","translation_id":"karena dia kaya dan banyak anak."},{"text_madani":"إِذَا تُتْلَىٰ عَلَيْهِ آيَاتُنَا قَالَ أَسَاطِيرُ الْأَوَّلِينَ","translation_en":"When Our communications are recited to him, he says: Stories of those of yore.","translation_id":"Apabila ayat-ayat Kami dibacakan kepadanya, dia berkata, “(Ini adalah) dongeng-dongeng orang dahulu.”"},{"text_madani":"سَنَسِمُهُ عَلَى الْخُرْطُومِ","translation_en":"We will brand him on the nose.","translation_id":"Kelak dia akan Kami beri tanda pada belalai(nya)."},{"text_madani":"إِنَّا بَلَوْنَاهُمْ كَمَا بَلَوْنَا أَصْحَابَ الْجَنَّةِ إِذْ أَقْسَمُوا لَيَصْرِمُنَّهَا مُصْبِحِينَ","translation_en":"Surely We will try them as We tried the owners of the garden, when they swore that they would certainly cut off the produce in the morning,","translation_id":"Sungguh, Kami telah menguji mereka (orang musyrik Mekah) sebagaimana Kami telah menguji pemilik-pemilik kebun, ketika mereka bersumpah pasti akan memetik (hasil)nya pada pagi hari,"},{"text_madani":"وَلَا يَسْتَثْنُونَ","translation_en":"And were not willing to set aside a portion (for the poor).","translation_id":"tetapi mereka tidak menyisihkan (dengan mengucapkan, “Insya Allah”)."},{"text_madani":"فَطَافَ عَلَيْهَا طَائِفٌ مِّن رَّبِّكَ وَهُمْ نَائِمُونَ","translation_en":"Then there encompassed it a visitation from your Lord while they were sleeping.","translation_id":"Lalu kebun itu ditimpa bencana (yang datang) dari Tuhanmu ketika mereka sedang tidur."},{"text_madani":"فَأَصْبَحَتْ كَالصَّرِيمِ","translation_en":"So it became as black, barren land.","translation_id":"Maka jadilah kebun itu hitam seperti malam yang gelap gulita,"},{"text_madani":"فَتَنَادَوْا مُصْبِحِينَ","translation_en":"And they called out to each other in the morning,","translation_id":"lalu pada pagi hari mereka saling memanggil."},{"text_madani":"أَنِ اغْدُوا عَلَىٰ حَرْثِكُمْ إِن كُنتُمْ صَارِمِينَ","translation_en":"Saying: Go early to your tilth if you would cut (the produce).","translation_id":"”Pergilah pagi-pagi ke kebunmu jika kamu hendak memetik hasil.”"},{"text_madani":"فَانطَلَقُوا وَهُمْ يَتَخَافَتُونَ","translation_en":"So they went, while they consulted together secretly,","translation_id":"Maka mereka pun berangkat sambil berbisik-bisik."},{"text_madani":"أَن لَّا يَدْخُلَنَّهَا الْيَوْمَ عَلَيْكُم مِّسْكِينٌ","translation_en":"Saying: No poor man shall enter it today upon you.","translation_id":"”Pada hari ini jangan sampai ada orang miskin masuk ke dalam kebunmu.”"},{"text_madani":"وَغَدَوْا عَلَىٰ حَرْدٍ قَادِرِينَ","translation_en":"And in the morning they went, having the power to prevent.","translation_id":"Dan berangkatlah mereka pada pagi hari dengan niat menghalangi (orang-orang miskin) padahal mereka mampu (menolongnya)."},{"text_madani":"فَلَمَّا رَأَوْهَا قَالُوا إِنَّا لَضَالُّونَ","translation_en":"But when they saw it, they said: Most surely we have gone astray","translation_id":"Maka ketika mereka melihat kebun itu, mereka berkata, “Sungguh, kita ini benar-benar orang-orang yang sesat,"},{"text_madani":"بَلْ نَحْنُ مَحْرُومُونَ","translation_en":"Nay! we are made to suffer privation.","translation_id":"bahkan kita tidak memperoleh apa pun,”"},{"text_madani":"قَالَ أَوْسَطُهُمْ أَلَمْ أَقُل لَّكُمْ لَوْلَا تُسَبِّحُونَ","translation_en":"The best of them said: Did I not say to you, Why do you not glorify (Allah)?","translation_id":"berkatalah seorang yang paling bijak di antara mereka, “Bukankah aku telah mengatakan kepadamu, mengapa kamu tidak bertasbih (kepada Tuhanmu).”"},{"text_madani":"قَالُوا سُبْحَانَ رَبِّنَا إِنَّا كُنَّا ظَالِمِينَ","translation_en":"They said: Glory be to our Lord, surely we were unjust.","translation_id":"Mereka mengucapkan, “Mahasuci Tuhan kami, sungguh, kami adalah orang-orang yang zhalim.”"},{"text_madani":"فَأَقْبَلَ بَعْضُهُمْ عَلَىٰ بَعْضٍ يَتَلَاوَمُونَ","translation_en":"Then some of them advanced against others, blaming each other.","translation_id":"Lalu mereka saling berhadapan dan saling menyalahkan."},{"text_madani":"قَالُوا يَا وَيْلَنَا إِنَّا كُنَّا طَاغِينَ","translation_en":"Said they: O woe to us! surely we were inordinate:","translation_id":"Mereka berkata, “Celaka kita! Sesungguhnya kita orang-orang yang melampaui batas."},{"text_madani":"عَسَىٰ رَبُّنَا أَن يُبْدِلَنَا خَيْرًا مِّنْهَا إِنَّا إِلَىٰ رَبِّنَا رَاغِبُونَ","translation_en":"Maybe, our Lord will give us instead one better than it; surely to our Lord do we make our humble petition.","translation_id":"Mudah-mudahan Tuhan memberikan ganti kepada kita dengan (kebun) yang lebih baik daripada yang ini, sungguh, kita mengharapkan ampunan dari Tuhan kita.”"},{"text_madani":"كَذَٰلِكَ الْعَذَابُ ۖ وَلَعَذَابُ الْآخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا يَعْلَمُونَ","translation_en":"Such is the chastisement, and certainly the chastisement of the hereafter is greater, did they but know!","translation_id":"Seperti itulah azab (di dunia). Dan sungguh, azab akhirat lebih besar se-kiranya mereka mengetahui."},{"text_madani":"إِنَّ لِلْمُتَّقِينَ عِندَ رَبِّهِمْ جَنَّاتِ النَّعِيمِ","translation_en":"Surely those who guard (against evil) shall have with their Lord gardens of bliss.","translation_id":"Sungguh, bagi orang-orang yang bertakwa (disediakan) surga yang penuh kenikmatan di sisi Tuhannya."},{"text_madani":"أَفَنَجْعَلُ الْمُسْلِمِينَ كَالْمُجْرِمِينَ","translation_en":"What! shall We then make (that is, treat) those who submit as the guilty?","translation_id":"Apakah patut Kami memperlakukan orang-orang Islam itu seperti orang-orang yang berdosa (orang kafir)?"},{"text_madani":"مَا لَكُمْ كَيْفَ تَحْكُمُونَ","translation_en":"What has happened to you? How do you judge?","translation_id":"Mengapa kamu (berbuat demikian)? Bagaimana kamu mengambil keputusan?"},{"text_madani":"أَمْ لَكُمْ كِتَابٌ فِيهِ تَدْرُسُونَ","translation_en":"Or have you a book wherein you read,","translation_id":"Atau apakah kamu mempunyai kitab (yang diturunkan Allah) yang kamu pelajari?"},{"text_madani":"إِنَّ لَكُمْ فِيهِ لَمَا تَخَيَّرُونَ","translation_en":"That you have surely therein what you choose?","translation_id":"sesungguhnya kamu dapat memilih apa saja yang ada di dalamnya."},{"text_madani":"أَمْ لَكُمْ أَيْمَانٌ عَلَيْنَا بَالِغَةٌ إِلَىٰ يَوْمِ الْقِيَامَةِ ۙ إِنَّ لَكُمْ لَمَا تَحْكُمُونَ","translation_en":"Or have you received from Us an agreement confirmed by an oath extending to the day of resurrection that you shall surely have what you demand?","translation_id":"Atau apakah kamu memperoleh (janji-janji yang diperkuat dengan) sumpah dari Kami, yang tetap berlaku sampai hari Kiamat; bahwa kamu dapat mengambil keputusan (sekehendakmu)?"},{"text_madani":"سَلْهُمْ أَيُّهُم بِذَٰلِكَ زَعِيمٌ","translation_en":"Ask them which of them will vouch for that,","translation_id":"Tanyakanlah kepada mereka, “Siapakah di antara mereka yang bertanggung jawab terhadap (keputusan yang diambil itu)?”"},{"text_madani":"أَمْ لَهُمْ شُرَكَاءُ فَلْيَأْتُوا بِشُرَكَائِهِمْ إِن كَانُوا صَادِقِينَ","translation_en":"Or have they associates if they are truthful.","translation_id":"Atau apakah mereka mempunyai sekutu-sekutu? Kalau begitu hendaklah mereka mendatangkan sekutu-sekutunya jika mereka orang-orang yang benar."},{"text_madani":"يَوْمَ يُكْشَفُ عَن سَاقٍ وَيُدْعَوْنَ إِلَى السُّجُودِ فَلَا يَسْتَطِيعُونَ","translation_en":"On the day when there shall be a severe affliction, and they shall be called upon to make obeisance, but they shall not be able,","translation_id":"(Ingatlah) pada hari ketika betis disingkapkan dan mereka diseru untuk bersujud; maka mereka tidak mampu,"},{"text_madani":"خَاشِعَةً أَبْصَارُهُمْ تَرْهَقُهُمْ ذِلَّةٌ ۖ وَقَدْ كَانُوا يُدْعَوْنَ إِلَى السُّجُودِ وَهُمْ سَالِمُونَ","translation_en":"Their looks cast down, abasement shall overtake them; and they were called upon to make obeisance indeed while yet they were safe.","translation_id":"pandangan mereka tertunduk ke bawah, diliputi kehinaan. Dan sungguh, dahulu (di dunia) mereka telah diseru untuk bersujud pada waktu mereka sehat (tetapi mereka tidak melakukan)."},{"text_madani":"فَذَرْنِي وَمَن يُكَذِّبُ بِهَٰذَا الْحَدِيثِ ۖ سَنَسْتَدْرِجُهُم مِّنْ حَيْثُ لَا يَعْلَمُونَ","translation_en":"So leave Me and him who rejects this announcement; We will overtake them by degrees, from whence they perceive not:","translation_id":"Maka serahkanlah kepada-Ku (urusannya) dan orang-orang yang mendustakan perkataan ini (Al-Qur'an). Kelak akan Kami hukum mereka berangsur-angsur dari arah yang tidak mereka ketahui,"},{"text_madani":"وَأُمْلِي لَهُمْ ۚ إِنَّ كَيْدِي مَتِينٌ","translation_en":"And I do bear with them, surely My plan is firm.","translation_id":"dan Aku memberi tenggang waktu kepada mereka. Sungguh, rencana-Ku sangat teguh."},{"text_madani":"أَمْ تَسْأَلُهُمْ أَجْرًا فَهُم مِّن مَّغْرَمٍ مُّثْقَلُونَ","translation_en":"Or do you ask from them a reward, so that they are burdened with debt?","translation_id":"Ataukah engkau (Muhammad) meminta imbalan kepada mereka, sehingga mereka dibebani dengan hutang?"},{"text_madani":"أَمْ عِندَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُونَ","translation_en":"Or have they (the knowledge of) the unseen, so that they write (it) down?","translation_id":"Ataukah mereka mengetahui yang gaib, lalu mereka menuliskannya?"},{"text_madani":"فَاصْبِرْ لِحُكْمِ رَبِّكَ وَلَا تَكُن كَصَاحِبِ الْحُوتِ إِذْ نَادَىٰ وَهُوَ مَكْظُومٌ","translation_en":"So wait patiently for the judgment of your Lord, and be not like the companion of the fish, when he cried while he was in distress.","translation_id":"Maka bersabarlah engkau (Muhammad) terhadap ketetapan Tuhanmu, dan janganlah engkau seperti (Yunus) orang yang berada dalam (perut) ikan ketika dia berdoa dengan hati sedih."},{"text_madani":"لَّوْلَا أَن تَدَارَكَهُ نِعْمَةٌ مِّن رَّبِّهِ لَنُبِذَ بِالْعَرَاءِ وَهُوَ مَذْمُومٌ","translation_en":"Were it not that favor from his Lord had overtaken him, he would certainly have been cast down upon the naked Found while he was blamed.","translation_id":"Sekiranya dia tidak segera mendapat nikmat dari Tuhannya, pastilah dia dicampakkan ke tanah tandus dalam keadaan tercela."},{"text_madani":"فَاجْتَبَاهُ رَبُّهُ فَجَعَلَهُ مِنَ الصَّالِحِينَ","translation_en":"Then his Lord chose him, and He made him of the good.","translation_id":"Lalu Tuhannya memilihnya dan menjadikannya termasuk orang yang shalih."},{"text_madani":"وَإِن يَكَادُ الَّذِينَ كَفَرُوا لَيُزْلِقُونَكَ بِأَبْصَارِهِمْ لَمَّا سَمِعُوا الذِّكْرَ وَيَقُولُونَ إِنَّهُ لَمَجْنُونٌ","translation_en":"And those who disbelieve would almost smite you with their eyes when they hear the reminder, and they say: Most surely he is mad.","translation_id":"Dan sungguh, orang-orang kafir itu hampir-hampir menggelincirkanmu dengan pandangan mata mereka, ketika mereka mendengar Al-Qur'an dan mereka berkata, “Dia (Muhammad) itu benar-benar orang gila.”"},{"text_madani":"وَمَا هُوَ إِلَّا ذِكْرٌ لِّلْعَالَمِينَ","translation_en":"And it is naught but a reminder to the nations.","translation_id":"Padahal (Al-Qur'an) itu tidak lain adalah peringatan bagi seluruh alam."}]}
