{"chapter_number":50,"name_simple":"Qaf","verses_count":45,"verses":[{"text_madani":"ق ۚ وَالْقُرْآنِ الْمَجِيدِ","translation_en":"Qaf. I swear by the glorious Quran (that Muhammad is the Messenger of Allah)","translation_id":"Qaf. Demi Al-Qur'an yang mulia."},{"text_madani":"بَلْ عَجِبُوا أَن جَاءَهُم مُّنذِرٌ مِّنْهُمْ فَقَالَ الْكَافِرُونَ هَٰذَا شَيْءٌ عَجِيبٌ","translation_en":"Nay! they wonder that there has come to them a warner from among themselves, so the unbelievers say: This is a wonderful thing:","translation_id":"(Mereka tidak menerimanya) bahkan mereka tercengang karena telah datang kepada mereka seorang pemberi peringatan dari (kalangan) mereka sendiri, maka berkatalah orang-orang kafir, “Ini adalah suatu yang sangat ajaib.”"},{"text_madani":"أَإِذَا مِتْنَا وَكُنَّا تُرَابًا ۖ ذَٰلِكَ رَجْعٌ بَعِيدٌ","translation_en":"What! when we are dead and have become dust? That is afar (from probable) return.","translation_id":"Apakah apabila kami telah mati dan sudah menjadi tanah (akan kembali lagi)? Itu adalah suatu pengembalian yang tidak mungkin."},{"text_madani":"قَدْ عَلِمْنَا مَا تَنقُصُ الْأَرْضُ مِنْهُمْ ۖ وَعِندَنَا كِتَابٌ حَفِيظٌ","translation_en":"We know indeed what the earth diminishes of them, and with Us is a writing that preserves.","translation_id":"Sungguh, Kami telah mengetahui apa yang ditelan bumi dari (tubuh) mereka, sebab pada Kami ada kitab (catatan) yang terpelihara baik."},{"text_madani":"بَلْ كَذَّبُوا بِالْحَقِّ لَمَّا جَاءَهُمْ فَهُمْ فِي أَمْرٍ مَّرِيجٍ","translation_en":"Nay, they rejected the truth when it came to them, so they are (now) in a state of confusion.","translation_id":"Bahkan mereka telah mendustakan kebenaran ketika (kebenaran itu) datang kepada mereka, maka mereka berada dalam keadaan kacau balau."},{"text_madani":"أَفَلَمْ يَنظُرُوا إِلَى السَّمَاءِ فَوْقَهُمْ كَيْفَ بَنَيْنَاهَا وَزَيَّنَّاهَا وَمَا لَهَا مِن فُرُوجٍ","translation_en":"Do they not then look up to heaven above them how We have made it and adorned it and it has no gaps?","translation_id":"Maka tidakkah mereka memperhatikan langit yang ada di atas mereka, bagaimana cara Kami membangunnya dan menghiasinya dan tidak terdapat retak-retak sedikit pun?"},{"text_madani":"وَالْأَرْضَ مَدَدْنَاهَا وَأَلْقَيْنَا فِيهَا رَوَاسِيَ وَأَنبَتْنَا فِيهَا مِن كُلِّ زَوْجٍ بَهِيجٍ","translation_en":"And the earth, We have made it plain and cast in it mountains and We have made to grow therein of all beautiful kinds,","translation_id":"Dan bumi yang Kami hamparkan dan Kami pancangkan di atasnya gunung-gunung yang kokoh dan Kami tumbuhkan di atasnya tanam-tanaman yang indah,"},{"text_madani":"تَبْصِرَةً وَذِكْرَىٰ لِكُلِّ عَبْدٍ مُّنِيبٍ","translation_en":"To give sight and as a reminder to every servant who turns frequently (to Allah).","translation_id":"untuk menjadi pelajaran dan peringatan bagi setiap hamba yang kembali (tunduk kepada Allah)."},{"text_madani":"وَنَزَّلْنَا مِنَ السَّمَاءِ مَاءً مُّبَارَكًا فَأَنبَتْنَا بِهِ جَنَّاتٍ وَحَبَّ الْحَصِيدِ","translation_en":"And We send down from the cloud water abounding in good, then We cause to grow thereby gardens and the grain that is reaped,","translation_id":"Dan dari langit Kami turunkan air yang memberi berkah lalu Kami tumbuhkan dengan (air) itu pepohonan yang rindang dan biji-bijian yang dapat dipanen."},{"text_madani":"وَالنَّخْلَ بَاسِقَاتٍ لَّهَا طَلْعٌ نَّضِيدٌ","translation_en":"And the tall palm-trees having spadices closely set one above another,","translation_id":"Dan pohon kurma yang tinggi-tinggi yang mempunyai mayang yang bersusun-susun,"},{"text_madani":"رِّزْقًا لِّلْعِبَادِ ۖ وَأَحْيَيْنَا بِهِ بَلْدَةً مَّيْتًا ۚ كَذَٰلِكَ الْخُرُوجُ","translation_en":"A sustenance for the servants, and We give life thereby to a dead land; thus is the rising.","translation_id":"(sebagai) rezeki bagi hamba-hamba (Kami), dan Kami hidupkan dengan (air) itu negeri yang mati (tandus). Seperti itulah terjadinya kebangkitan (dari kubur)."},{"text_madani":"كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَأَصْحَابُ الرَّسِّ وَثَمُودُ","translation_en":"(Others) before them rejected (prophets): the people of Nuh and the dwellers of Ar-Rass and Samood,","translation_id":"Sebelum mereka, kaum Nuh, penduduk Rass dan Tsamud telah mendustakan (rasul-rasul),"},{"text_madani":"وَعَادٌ وَفِرْعَوْنُ وَإِخْوَانُ لُوطٍ","translation_en":"And Ad and Firon and Lut's brethren,","translation_id":"dan (demikian juga) kaum ‘Ad, kaum Fir‘aun dan kaum Luth,"},{"text_madani":"وَأَصْحَابُ الْأَيْكَةِ وَقَوْمُ تُبَّعٍ ۚ كُلٌّ كَذَّبَ الرُّسُلَ فَحَقَّ وَعِيدِ","translation_en":"And the dwellers of the grove and the people of Tuba; all rejected the messengers, so My threat came to pass.","translation_id":"dan (juga) penduduk Aikah serta kaum Tubba‘. Semuanya telah mendustakan rasul-rasul maka berlakulah ancaman-Ku (atas mereka)."},{"text_madani":"أَفَعَيِينَا بِالْخَلْقِ الْأَوَّلِ ۚ بَلْ هُمْ فِي لَبْسٍ مِّنْ خَلْقٍ جَدِيدٍ","translation_en":"Were We then fatigued with the first creation? Yet are they in doubt with regard to a new creation.","translation_id":"Maka apakah Kami letih dengan penciptaan yang pertama? (Sama sekali tidak) bahkan mereka dalam keadaan ragu-ragu tentang penciptaan yang baru."},{"text_madani":"وَلَقَدْ خَلَقْنَا الْإِنسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ ۖ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ","translation_en":"And certainly We created man, and We know what his mind suggests to him, and We are nearer to him than his life-vein.","translation_id":"Dan sungguh, Kami telah menciptakan manusia dan mengetahui apa yang dibisikkan oleh hatinya, dan Kami lebih dekat kepadanya daripada urat lehernya."},{"text_madani":"إِذْ يَتَلَقَّى الْمُتَلَقِّيَانِ عَنِ الْيَمِينِ وَعَنِ الشِّمَالِ قَعِيدٌ","translation_en":"When the two receivers receive, sitting on the right and on the left.","translation_id":"(Ingatlah) ketika dua malaikat mencatat (perbuatannya), yang satu duduk di sebelah kanan dan yang lain di sebelah kiri."},{"text_madani":"مَّا يَلْفِظُ مِن قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ","translation_en":"He utters not a word but there is by him a watcher at hand.","translation_id":"Tidak ada suatu kata yang diucapkannya melainkan ada di sisinya malaikat pengawas yang selalu siap (mencatat)."},{"text_madani":"وَجَاءَتْ سَكْرَةُ الْمَوْتِ بِالْحَقِّ ۖ ذَٰلِكَ مَا كُنتَ مِنْهُ تَحِيدُ","translation_en":"And the stupor of death will come in truth; that is what you were trying to escape.","translation_id":"Dan datanglah sakaratul maut dengan sebenar-benarnya. Itulah yang dahulu hendak kamu hindari."},{"text_madani":"وَنُفِخَ فِي الصُّورِ ۚ ذَٰلِكَ يَوْمُ الْوَعِيدِ","translation_en":"And the trumpet shall be blown; that is the day of the threatening.","translation_id":"Dan ditiuplah sangkakala. Itulah hari yang diancamkan."},{"text_madani":"وَجَاءَتْ كُلُّ نَفْسٍ مَّعَهَا سَائِقٌ وَشَهِيدٌ","translation_en":"And every soul shall come, with it a driver and a witness.","translation_id":"Setiap orang akan datang bersama (malaikat) penggiring dan (malaikat) saksi."},{"text_madani":"لَّقَدْ كُنتَ فِي غَفْلَةٍ مِّنْ هَٰذَا فَكَشَفْنَا عَنكَ غِطَاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ","translation_en":"Certainly you were heedless of it, but now We have removed from you your veil, so your sight today is sharp.","translation_id":"Sungguh, kamu dahulu lalai tentang (peristiwa) ini, maka Kami singkapkan tutup (yang menutupi) matamu, sehingga penglihatanmu pada hari ini sangat tajam."},{"text_madani":"وَقَالَ قَرِينُهُ هَٰذَا مَا لَدَيَّ عَتِيدٌ","translation_en":"And his companions shall say: This is what is ready with me.","translation_id":"Dan (malaikat) yang menyertainya berkata, “Inilah (catatan perbuatan) yang ada padaku.”"},{"text_madani":"أَلْقِيَا فِي جَهَنَّمَ كُلَّ كَفَّارٍ عَنِيدٍ","translation_en":"Do cast into hell every ungrateful, rebellious one,","translation_id":"(Allah berfirman), “Lemparkanlah olehmu berdua ke dalam neraka Jahanam semua orang yang sangat ingkar dan keras kepala,"},{"text_madani":"مَّنَّاعٍ لِّلْخَيْرِ مُعْتَدٍ مُّرِيبٍ","translation_en":"Forbidder of good, exceeder of limits, doubter,","translation_id":"yang sangat enggan melakukan kebajikan, melampaui batas dan bersikap ragu-ragu,"},{"text_madani":"الَّذِي جَعَلَ مَعَ اللَّهِ إِلَٰهًا آخَرَ فَأَلْقِيَاهُ فِي الْعَذَابِ الشَّدِيدِ","translation_en":"Who sets up another god with Allah, so do cast him into severe chastisement.","translation_id":"yang mempersekutukan Allah dengan tuhan lain, maka lemparkanlah dia ke dalam azab yang keras.”"},{"text_madani":"قَالَ قَرِينُهُ رَبَّنَا مَا أَطْغَيْتُهُ وَلَٰكِن كَانَ فِي ضَلَالٍ بَعِيدٍ","translation_en":"His companion will say: Our Lord! I did not lead him into inordinacy but he himself was in a great error.","translation_id":"(Setan) yang menyertainya berkata (pula), “Ya Tuhan kami, aku tidak menyesatkannya tetapi dia sendiri yang berada dalam kesesatan yang jauh.”"},{"text_madani":"قَالَ لَا تَخْتَصِمُوا لَدَيَّ وَقَدْ قَدَّمْتُ إِلَيْكُم بِالْوَعِيدِ","translation_en":"He will say: Do not quarrel in My presence, and indeed I gave you the threatening beforehand:","translation_id":"(Allah) berfirman, “Janganlah kamu bertengkar di hadapan-Ku, dan sungguh, dahulu Aku telah memberikan ancaman kepadamu."},{"text_madani":"مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ وَمَا أَنَا بِظَلَّامٍ لِّلْعَبِيدِ","translation_en":"My word shall not be changed, nor am I in the least unjust to the servants.","translation_id":"Keputusan-Ku tidak dapat diubah dan Aku tidak menzhalimi hamba-hamba-Ku.”"},{"text_madani":"يَوْمَ نَقُولُ لِجَهَنَّمَ هَلِ امْتَلَأْتِ وَتَقُولُ هَلْ مِن مَّزِيدٍ","translation_en":"On the day that We will say to hell: Are you filled up? And it will say: Are there any more?","translation_id":"(Ingatlah) pada hari (ketika) Kami bertanya kepada Jahanam, “Apakah kamu sudah penuh?” Ia menjawab, “Masih adakah tambahan?”"},{"text_madani":"وَأُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِينَ غَيْرَ بَعِيدٍ","translation_en":"And the garden shall be brought near to those who guard (against evil), not far off:","translation_id":"Sedangkan surga didekatkan kepada orang-orang yang bertakwa pada tempat yang tidak jauh (dari mereka)."},{"text_madani":"هَٰذَا مَا تُوعَدُونَ لِكُلِّ أَوَّابٍ حَفِيظٍ","translation_en":"This is what you were promised, (it is) for every one who turns frequently (to Allah), keeps (His limits);","translation_id":"(Kepada mereka dikatakan), “Inilah nikmat yang dijanjikan kepadamu, (yaitu) kepada setiap hamba yang senantiasa bertobat (kepada Allah) dan memelihara (semua peraturan-peraturan-Nya)."},{"text_madani":"مَّنْ خَشِيَ الرَّحْمَٰنَ بِالْغَيْبِ وَجَاءَ بِقَلْبٍ مُّنِيبٍ","translation_en":"Who fears the Beneficent Allah in secret and comes with a penitent heart:","translation_id":"(Yaitu) orang yang takut kepada Allah Yang Maha Pengasih sekalipun tidak kelihatan (olehnya) dan dia datang dengan hati yang bertobat,"},{"text_madani":"ادْخُلُوهَا بِسَلَامٍ ۖ ذَٰلِكَ يَوْمُ الْخُلُودِ","translation_en":"Enter it in peace, that is the day of abiding.","translation_id":"masuklah ke (dalam surga) dengan aman dan damai. Itulah hari yang abadi.”"},{"text_madani":"لَهُم مَّا يَشَاءُونَ فِيهَا وَلَدَيْنَا مَزِيدٌ","translation_en":"They have therein what they wish and with Us is more yet.","translation_id":"Mereka di dalamnya memperoleh apa yang mereka kehendaki, dan pada Kami ada tambahannya."},{"text_madani":"وَكَمْ أَهْلَكْنَا قَبْلَهُم مِّن قَرْنٍ هُمْ أَشَدُّ مِنْهُم بَطْشًا فَنَقَّبُوا فِي الْبِلَادِ هَلْ مِن مَّحِيصٍ","translation_en":"And how many a generation did We destroy before them who were mightier in prowess than they, so they went about and about in the lands. Is there a place of refuge?","translation_id":"Dan betapa banyak umat yang telah Kami binasakan sebelum mereka, (padahal) mereka lebih hebat kekuatannya daripada mereka (umat yang belakangan) ini. Mereka pernah menjelajah di beberapa negeri. Adakah tempat pelarian (dari kebinasaan bagi mereka)?"},{"text_madani":"إِنَّ فِي ذَٰلِكَ لَذِكْرَىٰ لِمَن كَانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وَهُوَ شَهِيدٌ","translation_en":"Most surely there is a reminder in this for him who has a heart or he gives ear and is a witness.","translation_id":"Sungguh, pada yang demikian itu pasti terdapat peringatan bagi orang-orang yang mempunyai hati atau yang menggunakan pendengarannya, sedang dia menyaksikannya."},{"text_madani":"وَلَقَدْ خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ وَمَا مَسَّنَا مِن لُّغُوبٍ","translation_en":"And certainly We created the heavens and the earth and what is between them in six periods and there touched Us not any fatigue.","translation_id":"Dan sungguh, Kami telah menciptakan langit dan bumi dan apa yang ada antara keduanya dalam enam masa, dan Kami tidak merasa letih sedikit pun."},{"text_madani":"فَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ الْغُرُوبِ","translation_en":"Therefore be patient of what they say, and sing the praise of your Lord before the rising of the sun and before the setting.","translation_id":"Maka bersabarlah engkau (Muhammad) terhadap apa yang mereka katakan dan bertasbihlah dengan memuji Tuhanmu sebelum matahari terbit dan sebelum terbenam."},{"text_madani":"وَمِنَ اللَّيْلِ فَسَبِّحْهُ وَأَدْبَارَ السُّجُودِ","translation_en":"And glorify Him in the night and after the prayers.","translation_id":"Dan bertasbihlah kepada-Nya pada malam hari dan setiap selesai shalat."},{"text_madani":"وَاسْتَمِعْ يَوْمَ يُنَادِ الْمُنَادِ مِن مَّكَانٍ قَرِيبٍ","translation_en":"And listen on the day when the crier shall cry from a near place","translation_id":"Dan dengarkanlah (seruan) pada hari (ketika) penyeru (malaikat) menyeru dari tempat yang dekat."},{"text_madani":"يَوْمَ يَسْمَعُونَ الصَّيْحَةَ بِالْحَقِّ ۚ ذَٰلِكَ يَوْمُ الْخُرُوجِ","translation_en":"The day when they shall hear the cry in truth; that is the day of coming forth.","translation_id":"(Yaitu) pada hari (ketika) mereka men-dengar suara dahsyat dengan sebenarnya. Itulah hari keluar (dari kubur)."},{"text_madani":"إِنَّا نَحْنُ نُحْيِي وَنُمِيتُ وَإِلَيْنَا الْمَصِيرُ","translation_en":"Surely We give life and cause to die, and to Us is the eventual coming;","translation_id":"Sungguh, Kami yang menghidupkan dan mematikan dan kepada Kami tempat kembali (semua makhluk)."},{"text_madani":"يَوْمَ تَشَقَّقُ الْأَرْضُ عَنْهُمْ سِرَاعًا ۚ ذَٰلِكَ حَشْرٌ عَلَيْنَا يَسِيرٌ","translation_en":"The day on which the earth shall cleave asunder under them, they will make haste; that is a gathering together easy to Us.","translation_id":"(Yaitu) pada hari (ketika) bumi terbelah, mereka keluar dengan cepat. Yang demikian itu adalah pengumpulan yang mudah bagi Kami."},{"text_madani":"نَّحْنُ أَعْلَمُ بِمَا يَقُولُونَ ۖ وَمَا أَنتَ عَلَيْهِم بِجَبَّارٍ ۖ فَذَكِّرْ بِالْقُرْآنِ مَن يَخَافُ وَعِيدِ","translation_en":"We know best what they say, and you are not one to compel them; therefore remind him by means of the Quran who fears My threat.","translation_id":"Kami lebih mengetahui tentang apa yang mereka katakan, dan engkau (Muhammad) bukanlah seorang pemaksa terhadap mereka. Maka berilah peringatan dengan Al-Qur'an kepada siapa pun yang takut kepada ancaman-Ku."}]}
