{"chapter_number":44,"name_simple":"Ad-Dukhan","verses_count":59,"verses":[{"text_madani":"حم","translation_en":"Ha Mim!","translation_id":"Haa Mim"},{"text_madani":"وَالْكِتَابِ الْمُبِينِ","translation_en":"I swear by the Book that makes manifest (the truth).","translation_id":"Demi Kitab (Al-Qur'an) yang jelas,"},{"text_madani":"إِنَّا أَنزَلْنَاهُ فِي لَيْلَةٍ مُّبَارَكَةٍ ۚ إِنَّا كُنَّا مُنذِرِينَ","translation_en":"Surely We revealed it on a blessed night surely We are ever warning--","translation_id":"sesungguhnya Kami menurunkannya pada malam yang diberkahi. Sungguh, Kamilah yang memberi peringatan."},{"text_madani":"فِيهَا يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ","translation_en":"Therein every wise affair is made distinct,","translation_id":"Pada (malam itu) dijelaskan segala urusan yang penuh hikmah,"},{"text_madani":"أَمْرًا مِّنْ عِندِنَا ۚ إِنَّا كُنَّا مُرْسِلِينَ","translation_en":"A command from Us; surely We are the senders (of messengers),","translation_id":"(yaitu) urusan dari sisi Kami. Sungguh, Kamilah yang mengutus rasul-rasul,"},{"text_madani":"رَحْمَةً مِّن رَّبِّكَ ۚ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ","translation_en":"A mercy from your Lord, surely He is the Hearing, the Knowing,","translation_id":"sebagai rahmat dari Tuhanmu. Sungguh, Dia Maha Mendengar, Maha Mengetahui,"},{"text_madani":"رَبِّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا ۖ إِن كُنتُم مُّوقِنِينَ","translation_en":"The Lord of the heavens and the earth and what is between them, if you would be sure.","translation_id":"Tuhan (yang memelihara) langit dan bumi dan apa yang ada di antara keduanya; jika kamu orang-orang yang meyakini."},{"text_madani":"لَا إِلَٰهَ إِلَّا هُوَ يُحْيِي وَيُمِيتُ ۖ رَبُّكُمْ وَرَبُّ آبَائِكُمُ الْأَوَّلِينَ","translation_en":"There is no god but He; He gives life and causes death, your Lord and the Lord of your fathers of yore.","translation_id":"Tidak ada tuhan selain Dia, Dia yang menghidupkan dan mematikan. (Dialah) Tuhanmu dan Tuhan nenek moyangmu dahulu."},{"text_madani":"بَلْ هُمْ فِي شَكٍّ يَلْعَبُونَ","translation_en":"Nay, they are in doubt, they sport.","translation_id":"Tetapi mereka dalam keraguan, mereka bermain-main."},{"text_madani":"فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُّبِينٍ","translation_en":"Therefore keep waiting for the day when the heaven shall bring an evident smoke,","translation_id":"Maka tunggulah pada hari ketika langit membawa kabut yang tampak jelas,"},{"text_madani":"يَغْشَى النَّاسَ ۖ هَٰذَا عَذَابٌ أَلِيمٌ","translation_en":"That shall overtake men; this is a painful punishment.","translation_id":"yang meliputi manusia. Inilah azab yang pedih."},{"text_madani":"رَّبَّنَا اكْشِفْ عَنَّا الْعَذَابَ إِنَّا مُؤْمِنُونَ","translation_en":"Our Lord! remove from us the punishment; surely we are believers.","translation_id":"(Mereka berdoa), “Ya Tuhan kami, lenyapkanlah azab itu dari kami. Sungguh, kami akan beriman.”"},{"text_madani":"أَنَّىٰ لَهُمُ الذِّكْرَىٰ وَقَدْ جَاءَهُمْ رَسُولٌ مُّبِينٌ","translation_en":"How shall they be reminded, and there came to them an Messenger making clear (the truth),","translation_id":"Bagaimana mereka dapat menerima peringatan, padahal (sebelumnya pun) seorang Rasul telah datang memberi penjelasan kepada mereka,"},{"text_madani":"ثُمَّ تَوَلَّوْا عَنْهُ وَقَالُوا مُعَلَّمٌ مَّجْنُونٌ","translation_en":"Yet they turned their backs on him and said: One taught (by others), a madman.","translation_id":"kemudian mereka berpaling darinya dan berkata, “Dia itu orang yang menerima ajaran (dari orang lain) dan orang gila.”"},{"text_madani":"إِنَّا كَاشِفُو الْعَذَابِ قَلِيلًا ۚ إِنَّكُمْ عَائِدُونَ","translation_en":"Surely We will remove the punishment a little, (but) you will surely return (to evil).","translation_id":"Sungguh (kalau) Kami melenyapkan azab itu sedikit saja, tentu kamu akan kembali (ingkar)."},{"text_madani":"يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَىٰ إِنَّا مُنتَقِمُونَ","translation_en":"On the day when We will seize (them) with the most violent seizing; surely We will inflict retribution.","translation_id":"(Ingatlah) pada hari (ketika) Kami menghantam mereka dengan keras. Kami pasti memberi balasan."},{"text_madani":"وَلَقَدْ فَتَنَّا قَبْلَهُمْ قَوْمَ فِرْعَوْنَ وَجَاءَهُمْ رَسُولٌ كَرِيمٌ","translation_en":"And certainly We tried before them the people of Firon, and there came to them a noble messenger,","translation_id":"Dan sungguh, sebelum mereka Kami benar-benar telah menguji kaum Fir’aun dan telah datang kepada mereka seorang Rasul yang mulia,"},{"text_madani":"أَنْ أَدُّوا إِلَيَّ عِبَادَ اللَّهِ ۖ إِنِّي لَكُمْ رَسُولٌ أَمِينٌ","translation_en":"Saying: Deliver to me the servants of Allah, surely I am a faithful messenger to you,","translation_id":"(dengan berkata), “Serahkanlah kepadaku hamba-hamba Allah (Bani Israil). Sesungguhnya aku adalah utusan (Allah) yang dapat kamu percaya,"},{"text_madani":"وَأَن لَّا تَعْلُوا عَلَى اللَّهِ ۖ إِنِّي آتِيكُم بِسُلْطَانٍ مُّبِينٍ","translation_en":"And that do not exalt yourselves against Allah, surely I will bring to you a clear authority:","translation_id":"dan janganlah kamu menyombongkan diri terhadap Allah. Sungguh, aku datang kepadamu dengan membawa bukti yang nyata."},{"text_madani":"وَإِنِّي عُذْتُ بِرَبِّي وَرَبِّكُمْ أَن تَرْجُمُونِ","translation_en":"And surely I take refuge with my Lord and your Lord that you should stone me to death:","translation_id":"Dan sesungguhnya aku berlindung kepada Tuhanku dan Tuhanmu, dari ancamanmu untuk merajamku,"},{"text_madani":"وَإِن لَّمْ تُؤْمِنُوا لِي فَاعْتَزِلُونِ","translation_en":"And if you do not believe in me, then leave me alone.","translation_id":"dan jika kamu tidak beriman kepadaku maka biarkanlah aku (memimpin Bani Israil).”"},{"text_madani":"فَدَعَا رَبَّهُ أَنَّ هَٰؤُلَاءِ قَوْمٌ مُّجْرِمُونَ","translation_en":"Then he called upon his Lord: These are a guilty people.","translation_id":"Kemudian dia (Musa) berdoa kepada Tuhannya, “Sungguh, mereka ini adalah kaum yang berdosa (segerakanlah azab kepada mereka).”"},{"text_madani":"فَأَسْرِ بِعِبَادِي لَيْلًا إِنَّكُم مُّتَّبَعُونَ","translation_en":"So go forth with My servants by night; surely you will be pursued:","translation_id":"(Allah berfirman), “Karena itu berjalanlah dengan hamba-hamba-Ku pada malam hari, sesungguhnya kamu akan dikejar,"},{"text_madani":"وَاتْرُكِ الْبَحْرَ رَهْوًا ۖ إِنَّهُمْ جُندٌ مُّغْرَقُونَ","translation_en":"And leave the sea intervening; surely they are a host that shall be drowned.","translation_id":"dan biarkanlah laut itu terbelah. Sesungguhnya mereka, bala tentara yang akan ditenggelamkan.”"},{"text_madani":"كَمْ تَرَكُوا مِن جَنَّاتٍ وَعُيُونٍ","translation_en":"How many of the gardens and fountains have they left!","translation_id":"Betapa banyak taman-taman dan mata air-mata air yang mereka tinggalkan,"},{"text_madani":"وَزُرُوعٍ وَمَقَامٍ كَرِيمٍ","translation_en":"And cornfields and noble places!","translation_id":"juga kebun-kebun serta tempat-tempat kediaman yang indah,"},{"text_madani":"وَنَعْمَةٍ كَانُوا فِيهَا فَاكِهِينَ","translation_en":"And goodly things wherein they rejoiced;","translation_id":"dan kesenangan-kesenangan yang dapat mereka nikmati di sana,"},{"text_madani":"كَذَٰلِكَ ۖ وَأَوْرَثْنَاهَا قَوْمًا آخَرِينَ","translation_en":"Thus (it was), and We gave them as a heritage to another people.","translation_id":"demikianlah, dan Kami wariskan (semua) itu kepada kaum yang lain."},{"text_madani":"فَمَا بَكَتْ عَلَيْهِمُ السَّمَاءُ وَالْأَرْضُ وَمَا كَانُوا مُنظَرِينَ","translation_en":"So the heaven and the earth did not weep for them, nor were they respited.","translation_id":"Maka langit dan bumi tidak menangisi mereka dan mereka pun tidak diberi penangguhan waktu."},{"text_madani":"وَلَقَدْ نَجَّيْنَا بَنِي إِسْرَائِيلَ مِنَ الْعَذَابِ الْمُهِينِ","translation_en":"And certainly We delivered the children of Israel from the abasing chastisement,","translation_id":"Dan sungguh, telah Kami selamatkan Bani Israil dari siksaan yang menghinakan,"},{"text_madani":"مِن فِرْعَوْنَ ۚ إِنَّهُ كَانَ عَالِيًا مِّنَ الْمُسْرِفِينَ","translation_en":"From Firon; surely he was haughty, (and) one of the extravagant.","translation_id":"dari (siksaan) Fir‘aun, sungguh, dia itu orang yang sombong, termasuk orang-orang yang melampaui batas."},{"text_madani":"وَلَقَدِ اخْتَرْنَاهُمْ عَلَىٰ عِلْمٍ عَلَى الْعَالَمِينَ","translation_en":"And certainly We chose them, having knowledge, above the nations.","translation_id":"Dan sungguh, Kami pilih mereka (Bani Israil) dengan ilmu (Kami) di atas semua bangsa (pada masa itu)."},{"text_madani":"وَآتَيْنَاهُم مِّنَ الْآيَاتِ مَا فِيهِ بَلَاءٌ مُّبِينٌ","translation_en":"And We gave them of the communications wherein was clear blessing.","translation_id":"Dan telah Kami berikan kepada mereka di antara tanda-tanda (kebesaran Kami) sesuatu yang di dalamnya terdapat nikmat yang nyata."},{"text_madani":"إِنَّ هَٰؤُلَاءِ لَيَقُولُونَ","translation_en":"Most surely these do say:","translation_id":"Sesungguhnya mereka (kaum musyrik) itu pasti akan berkata,"},{"text_madani":"إِنْ هِيَ إِلَّا مَوْتَتُنَا الْأُولَىٰ وَمَا نَحْنُ بِمُنشَرِينَ","translation_en":"There is naught but our first death and we shall not be raised again.","translation_id":"”Tidak ada kematian selain kematian di dunia ini. Dan kami tidak akan dibangkitkan,"},{"text_madani":"فَأْتُوا بِآبَائِنَا إِن كُنتُمْ صَادِقِينَ","translation_en":"So bring our fathers (back), if you are truthful.","translation_id":"maka hadirkanlah (kembali) nenek moyang kami jika kamu orang yang benar.”"},{"text_madani":"أَهُمْ خَيْرٌ أَمْ قَوْمُ تُبَّعٍ وَالَّذِينَ مِن قَبْلِهِمْ ۚ أَهْلَكْنَاهُمْ ۖ إِنَّهُمْ كَانُوا مُجْرِمِينَ","translation_en":"Are they better or the people of Tubba and those before them? We destroyed them, for surely they were guilty.","translation_id":"Apakah mereka (kaum musyrikin) yang lebih baik atau kaum Tubba‘, dan orang-orang yang sebelum mereka yang telah Kami binasakan karena mereka itu adalah orang-orang yang sungguh berdosa."},{"text_madani":"وَمَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا لَاعِبِينَ","translation_en":"And We did not create the heavens and the earth and what is between them in sport.","translation_id":"Dan tidaklah Kami bermain-main menciptakan langit dan bumi dan apa yang ada di antara keduanya."},{"text_madani":"مَا خَلَقْنَاهُمَا إِلَّا بِالْحَقِّ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ","translation_en":"We did not create them both but with the truth, but most of them do not know.","translation_id":"Tidaklah Kami ciptakan keduanya melainkan dengan haq (benar), tetapi kebanyakan mereka tidak mengetahui."},{"text_madani":"إِنَّ يَوْمَ الْفَصْلِ مِيقَاتُهُمْ أَجْمَعِينَ","translation_en":"Surely the day of separation is their appointed term, of all of them","translation_id":"Sungguh, pada hari keputusan (hari Kiamat) itu adalah waktu yang dijanjikan bagi mereka semuanya,"},{"text_madani":"يَوْمَ لَا يُغْنِي مَوْلًى عَن مَّوْلًى شَيْئًا وَلَا هُمْ يُنصَرُونَ","translation_en":"The day on which a friend shall not avail (his) friend aught, nor shall they be helped,","translation_id":"(yaitu) pada hari (ketika) seorang teman sama sekali tidak dapat memberi manfaat kepada teman lainnya dan mereka tidak akan mendapat pertolongan,"},{"text_madani":"إِلَّا مَن رَّحِمَ اللَّهُ ۚ إِنَّهُ هُوَ الْعَزِيزُ الرَّحِيمُ","translation_en":"Save those on whom Allah shall have mercy; surely He is the Mighty the Merciful.","translation_id":"Kecuali orang yang diberi rahmat oleh Allah. Sungguh, Dia Mahaperkasa, Maha Penyayang."},{"text_madani":"إِنَّ شَجَرَتَ الزَّقُّومِ","translation_en":"Surely the tree of the Zaqqum,","translation_id":"Sungguh pohon zaqqum itu,"},{"text_madani":"طَعَامُ الْأَثِيمِ","translation_en":"Is the food of the sinful","translation_id":"makanan bagi orang yang banyak dosa."},{"text_madani":"كَالْمُهْلِ يَغْلِي فِي الْبُطُونِ","translation_en":"Like dregs of oil; it shall boil in (their) bellies,","translation_id":"Seperti cairan tembaga yang mendidih di dalam perut,"},{"text_madani":"كَغَلْيِ الْحَمِيمِ","translation_en":"Like the boiling of hot water.","translation_id":"seperti mendidihnya air yang sangat panas."},{"text_madani":"خُذُوهُ فَاعْتِلُوهُ إِلَىٰ سَوَاءِ الْجَحِيمِ","translation_en":"Seize him, then drag him down into the middle of the hell;","translation_id":"”Peganglah dia kemudian seretlah dia sampai ke tengah-tengah neraka,"},{"text_madani":"ثُمَّ صُبُّوا فَوْقَ رَأْسِهِ مِنْ عَذَابِ الْحَمِيمِ","translation_en":"Then pour above his head of the torment of the boiling water:","translation_id":"kemudian tuangkanlah di atas kepalanya azab (dari) air yang sangat panas.”"},{"text_madani":"ذُقْ إِنَّكَ أَنتَ الْعَزِيزُ الْكَرِيمُ","translation_en":"Taste; you forsooth are the mighty, the honorable:","translation_id":"”Rasakanlah, sesungguhnya kamu benar-benar orang yang perkasa lagi mulia.”"},{"text_madani":"إِنَّ هَٰذَا مَا كُنتُم بِهِ تَمْتَرُونَ","translation_en":"Surely this is what you disputed about.","translation_id":"Sungguh, inilah azab yang dahulu kamu ragukan."},{"text_madani":"إِنَّ الْمُتَّقِينَ فِي مَقَامٍ أَمِينٍ","translation_en":"Surely those who guard (against evil) are in a secure place,","translation_id":"Sungguh, orang-orang yang bertakwa berada dalam tempat yang aman,"},{"text_madani":"فِي جَنَّاتٍ وَعُيُونٍ","translation_en":"In gardens and springs;","translation_id":"(yaitu) di dalam taman-taman dan mata air-mata air,"},{"text_madani":"يَلْبَسُونَ مِن سُندُسٍ وَإِسْتَبْرَقٍ مُّتَقَابِلِينَ","translation_en":"They shall wear of fine and thick silk, (sitting) face to face;","translation_id":"mereka memakai sutra yang halus dan sutra yang tebal, (duduk) berhadapan,"},{"text_madani":"كَذَٰلِكَ وَزَوَّجْنَاهُم بِحُورٍ عِينٍ","translation_en":"Thus (shall it be), and We will wed them with Houris pure, beautiful ones.","translation_id":"demikianlah, kemudian Kami berikan kepada mereka pasangan bidadari yang bermata indah."},{"text_madani":"يَدْعُونَ فِيهَا بِكُلِّ فَاكِهَةٍ آمِنِينَ","translation_en":"They shall call therein for every fruit in security;","translation_id":"Di dalamnya mereka dapat meminta segala macam buah-buahan dengan aman dan tenteram,"},{"text_madani":"لَا يَذُوقُونَ فِيهَا الْمَوْتَ إِلَّا الْمَوْتَةَ الْأُولَىٰ ۖ وَوَقَاهُمْ عَذَابَ الْجَحِيمِ","translation_en":"They shall not taste therein death except the first death, and He will save them from the punishment of the hell,","translation_id":"mereka tidak akan merasakan mati di dalamnya selain kematian pertama (di dunia). Allah melindungi mereka dari azab neraka,"},{"text_madani":"فَضْلًا مِّن رَّبِّكَ ۚ ذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ","translation_en":"A grace from your Lord; this is the great achievement.","translation_id":"itu merupakan karunia dari Tuhanmu. Demikian itulah kemenangan yang agung."},{"text_madani":"فَإِنَّمَا يَسَّرْنَاهُ بِلِسَانِكَ لَعَلَّهُمْ يَتَذَكَّرُونَ","translation_en":"So have We made it easy in your tongue that they may be mindful.","translation_id":"Sungguh, Kami mudahkan Al-Qur'an itu dengan bahasamu agar mereka mendapat pelajaran."},{"text_madani":"فَارْتَقِبْ إِنَّهُم مُّرْتَقِبُونَ","translation_en":"Therefore wait; surely they are waiting.","translation_id":"Maka tunggulah; sungguh, mereka itu (juga sedang) menunggu."}]}
