{"chapter_number":23,"name_simple":"Al-Mu'minun","verses_count":118,"verses":[{"text_madani":"قَدْ أَفْلَحَ الْمُؤْمِنُونَ","translation_en":"Successful indeed are the believers,","translation_id":"Sungguh beruntung orang-orang yang beriman,"},{"text_madani":"الَّذِينَ هُمْ فِي صَلَاتِهِمْ خَاشِعُونَ","translation_en":"Who are humble in their prayers,","translation_id":"(yaitu) orang yang khusyuk dalam shalatnya,"},{"text_madani":"وَالَّذِينَ هُمْ عَنِ اللَّغْوِ مُعْرِضُونَ","translation_en":"And who keep aloof from what is vain,","translation_id":"dan orang yang menjauhkan diri dari (perbuatan dan perkataan) yang tidak berguna,"},{"text_madani":"وَالَّذِينَ هُمْ لِلزَّكَاةِ فَاعِلُونَ","translation_en":"And who are givers of poor-rate,","translation_id":"dan orang yang menunaikan zakat,"},{"text_madani":"وَالَّذِينَ هُمْ لِفُرُوجِهِمْ حَافِظُونَ","translation_en":"And who guard their private parts,","translation_id":"dan orang yang memelihara kemaluannya,"},{"text_madani":"إِلَّا عَلَىٰ أَزْوَاجِهِمْ أَوْ مَا مَلَكَتْ أَيْمَانُهُمْ فَإِنَّهُمْ غَيْرُ مَلُومِينَ","translation_en":"Except before their mates or those whom their right hands possess, for they surely are not blameable,","translation_id":"kecuali terhadap istri-istri mereka atau hamba sahaya yang mereka miliki; maka sesungguhnya mereka tidak tercela."},{"text_madani":"فَمَنِ ابْتَغَىٰ وَرَاءَ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الْعَادُونَ","translation_en":"But whoever seeks to go beyond that, these are they that exceed the limits;","translation_id":"Tetapi barang siapa mencari di balik itu (zina, dan sebagainya), maka mereka itulah orang-orang yang melampaui batas."},{"text_madani":"وَالَّذِينَ هُمْ لِأَمَانَاتِهِمْ وَعَهْدِهِمْ رَاعُونَ","translation_en":"And those who are keepers of their trusts and their covenant,","translation_id":"Dan (sungguh beruntung) orang yang memelihara amanat-amanat dan janjinya,"},{"text_madani":"وَالَّذِينَ هُمْ عَلَىٰ صَلَوَاتِهِمْ يُحَافِظُونَ","translation_en":"And those who keep a guard on their prayers;","translation_id":"serta orang yang memelihara shalatnya."},{"text_madani":"أُولَٰئِكَ هُمُ الْوَارِثُونَ","translation_en":"These are they who are the heirs,","translation_id":"Mereka itulah orang yang akan mewarisi,"},{"text_madani":"الَّذِينَ يَرِثُونَ الْفِرْدَوْسَ هُمْ فِيهَا خَالِدُونَ","translation_en":"Who shall inherit the Paradise; they shall abide therein.","translation_id":"(yakni) yang akan mewarisi (surga) Firdaus. Mereka kekal di dalamnya."},{"text_madani":"وَلَقَدْ خَلَقْنَا الْإِنسَانَ مِن سُلَالَةٍ مِّن طِينٍ","translation_en":"And certainly We created man of an extract of clay,","translation_id":"Dan sungguh, Kami telah menciptakan manusia dari saripati (berasal) dari tanah."},{"text_madani":"ثُمَّ جَعَلْنَاهُ نُطْفَةً فِي قَرَارٍ مَّكِينٍ","translation_en":"Then We made him a small seed in a firm resting-place,","translation_id":"Kemudian Kami menjadikannya air mani (yang disimpan) dalam tempat yang kokoh (rahim)."},{"text_madani":"ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً فَخَلَقْنَا الْعَلَقَةَ مُضْغَةً فَخَلَقْنَا الْمُضْغَةَ عِظَامًا فَكَسَوْنَا الْعِظَامَ لَحْمًا ثُمَّ أَنشَأْنَاهُ خَلْقًا آخَرَ ۚ فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ","translation_en":"Then We made the seed a clot, then We made the clot a lump of flesh, then We made (in) the lump of flesh bones, then We clothed the bones with flesh, then We caused it to grow into another creation, so blessed be Allah, the best of the creators.","translation_id":"Kemudian, air mani itu Kami jadikan sesuatu yang melekat, lalu sesuatu yang melekat itu Kami jadikan segumpal daging, dan segumpal daging itu Kami jadikan tulang belulang, lalu tulang belulang itu Kami bungkus dengan daging. Kemudian, Kami menjadikannya makhluk yang (berbentuk) lain. Mahasuci Allah, Pencipta yang paling baik."},{"text_madani":"ثُمَّ إِنَّكُم بَعْدَ ذَٰلِكَ لَمَيِّتُونَ","translation_en":"Then after that you will most surely die.","translation_id":"Kemudian setelah itu, sesungguhnya kamu pasti mati."},{"text_madani":"ثُمَّ إِنَّكُمْ يَوْمَ الْقِيَامَةِ تُبْعَثُونَ","translation_en":"Then surely on the day of resurrection you shall be raised.","translation_id":"Kemudian, sesungguhnya kamu akan dibangkitkan (dari kuburmu) pada hari Kiamat."},{"text_madani":"وَلَقَدْ خَلَقْنَا فَوْقَكُمْ سَبْعَ طَرَائِقَ وَمَا كُنَّا عَنِ الْخَلْقِ غَافِلِينَ","translation_en":"And certainly We made above you seven heavens; and never are We heedless of creation.","translation_id":"Dan sungguh, Kami telah menciptakan tujuh (lapis) langit di atas kamu, dan Kami tidaklah lengah terhadap ciptaan (Kami)."},{"text_madani":"وَأَنزَلْنَا مِنَ السَّمَاءِ مَاءً بِقَدَرٍ فَأَسْكَنَّاهُ فِي الْأَرْضِ ۖ وَإِنَّا عَلَىٰ ذَهَابٍ بِهِ لَقَادِرُونَ","translation_en":"And We send down water from the cloud according to a measure, then We cause it to settle in the earth, and most surely We are able to carry it away.","translation_id":"Dan Kami turunkan air dari langit dengan suatu ukuran; lalu Kami jadikan air itu menetap di bumi, dan pasti Kami berkuasa melenyapkannya."},{"text_madani":"فَأَنشَأْنَا لَكُم بِهِ جَنَّاتٍ مِّن نَّخِيلٍ وَأَعْنَابٍ لَّكُمْ فِيهَا فَوَاكِهُ كَثِيرَةٌ وَمِنْهَا تَأْكُلُونَ","translation_en":"Then We cause to grow thereby gardens of palm trees and grapes for you; you have in them many fruits and from them do you eat;","translation_id":"Lalu dengan (air) itu, Kami tumbuhkan untukmu kebun-kebun kurma dan anggur; di sana kamu memperoleh buah-buahan yang banyak dan sebagian dari (buah-buahan) itu kamu makan,"},{"text_madani":"وَشَجَرَةً تَخْرُجُ مِن طُورِ سَيْنَاءَ تَنبُتُ بِالدُّهْنِ وَصِبْغٍ لِّلْآكِلِينَ","translation_en":"And a tree that grows out of Mount Sinai which produces oil and a condiment for those who eat.","translation_id":"dan (Kami tumbuhkan) pohon (zaitun) yang tumbuh dari gunung Sinai, yang menghasilkan minyak, dan bahan pembangkit selera bagi orang-orang yang makan."},{"text_madani":"وَإِنَّ لَكُمْ فِي الْأَنْعَامِ لَعِبْرَةً ۖ نُّسْقِيكُم مِّمَّا فِي بُطُونِهَا وَلَكُمْ فِيهَا مَنَافِعُ كَثِيرَةٌ وَمِنْهَا تَأْكُلُونَ","translation_en":"And most surely there is a lesson for you in the cattle: We make you to drink of what is in their bellies, and you have in them many advantages and of them you eat,","translation_id":"Dan sesungguhnya pada hewan-hewan ternak terdapat suatu pelajaran bagimu. Kami memberi minum kamu dari (air susu) yang ada dalam perutnya, dan padanya juga terdapat banyak manfaat untukmu, dan sebagian darinya kamu makan,"},{"text_madani":"وَعَلَيْهَا وَعَلَى الْفُلْكِ تُحْمَلُونَ","translation_en":"And on them and on the ships you are borne.","translation_id":"di atasnya (hewan-hewan ternak) dan di atas kapal-kapal kamu diangkut."},{"text_madani":"وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَقَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۖ أَفَلَا تَتَّقُونَ","translation_en":"And certainly We sent Nuh to his people, and he said: O my people! serve Allah, you have no god other than Him; will you not then guard (against evil)?","translation_id":"Dan sungguh, Kami telah mengutus Nuh kepada kaumnya, lalu dia berkata, “Wahai kaumku! Sembahlah Allah, (karena) tidak ada tuhan (yang berhak disembah) bagimu selain Dia. Maka mengapa kamu tidak bertakwa (kepada-Nya)?”"},{"text_madani":"فَقَالَ الْمَلَأُ الَّذِينَ كَفَرُوا مِن قَوْمِهِ مَا هَٰذَا إِلَّا بَشَرٌ مِّثْلُكُمْ يُرِيدُ أَن يَتَفَضَّلَ عَلَيْكُمْ وَلَوْ شَاءَ اللَّهُ لَأَنزَلَ مَلَائِكَةً مَّا سَمِعْنَا بِهَٰذَا فِي آبَائِنَا الْأَوَّلِينَ","translation_en":"And the chiefs of those who disbelieved from among his people said: He is nothing but a mortal like yourselves who desires that he may have superiority over you, and if Allah had pleased, He could certainly have sent down angels. We have not heard of this among our fathers of yore:","translation_id":"Maka berkatalah para pemuka orang kafir dari kaumnya, “Orang ini tidak lain hanyalah manusia seperti kamu, yang ingin menjadi orang yang lebih mulia daripada kamu. Dan seandainya Allah menghendaki, tentu Dia mengutus malaikat. Belum pernah kami mendengar (seruan yang seperti) ini pada (masa) nenek moyang kami dahulu."},{"text_madani":"إِنْ هُوَ إِلَّا رَجُلٌ بِهِ جِنَّةٌ فَتَرَبَّصُوا بِهِ حَتَّىٰ حِينٍ","translation_en":"He is only a madman, so bear with him for a time.","translation_id":"Dia hanyalah seorang laki-laki yang gila, maka tunggulah (sabarlah) terhadapnya sampai waktu yang ditentukan.”"},{"text_madani":"قَالَ رَبِّ انصُرْنِي بِمَا كَذَّبُونِ","translation_en":"He said: O my Lord! help me against their calling me a liar.","translation_id":"Dia (Nuh) berdoa, “Ya Tuhanku, tolonglah aku karena mereka mendustakan aku.”"},{"text_madani":"فَأَوْحَيْنَا إِلَيْهِ أَنِ اصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا فَإِذَا جَاءَ أَمْرُنَا وَفَارَ التَّنُّورُ ۙ فَاسْلُكْ فِيهَا مِن كُلٍّ زَوْجَيْنِ اثْنَيْنِ وَأَهْلَكَ إِلَّا مَن سَبَقَ عَلَيْهِ الْقَوْلُ مِنْهُمْ ۖ وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا ۖ إِنَّهُم مُّغْرَقُونَ","translation_en":"So We revealed to him, saying: Make the ark before Our eyes and (according to) Our revelation; and when Our command is given and the valley overflows, take into it of every kind a pair, two, and your followers, except those among them against whom the word has gone forth, and do not speak to Me in respect of those who are unjust; surely they shall be drowned.","translation_id":"Lalu Kami wahyukan kepadanya, “Buatlah kapal di bawah pengawasan dan petunjuk Kami, maka apabila perintah Kami datang dan tanur (dapur) telah memancarkan air, maka masukkanlah ke dalam (kapal) itu sepasang-sepasang dari setiap jenis, juga keluargamu, kecuali orang yang lebih dahulu ditetapkan (akan ditimpa siksaan) di antara mereka. Dan janganlah engkau bicarakan dengan-Ku tentang orang-orang yang zhalim, sesungguhnya mereka itu akan ditenggelamkan."},{"text_madani":"فَإِذَا اسْتَوَيْتَ أَنتَ وَمَن مَّعَكَ عَلَى الْفُلْكِ فَقُلِ الْحَمْدُ لِلَّهِ الَّذِي نَجَّانَا مِنَ الْقَوْمِ الظَّالِمِينَ","translation_en":"And when you are firmly seated, you and those with you, in the ark, say: All praise is due to Allah who delivered us from the unjust people:","translation_id":"Dan apabila engkau dan orang-orang yang bersamamu telah berada di atas kapal, maka ucapkanlah, “Segala puji bagi Allah yang telah menyelamatkan kami dari orang-orang yang zhalim.”"},{"text_madani":"وَقُل رَّبِّ أَنزِلْنِي مُنزَلًا مُّبَارَكًا وَأَنتَ خَيْرُ الْمُنزِلِينَ","translation_en":"And say: O my Lord! cause me to disembark a blessed alighting, and Thou art the best to cause to alight.","translation_id":"Dan berdoalah, “Ya Tuhanku, tempatkanlah aku pada tempat yang diberkahi, dan Engkau adalah sebaik-baik pemberi tempat.”"},{"text_madani":"إِنَّ فِي ذَٰلِكَ لَآيَاتٍ وَإِن كُنَّا لَمُبْتَلِينَ","translation_en":"Most surely there are signs in this, and most surely We are ever trying (men).","translation_id":"Sungguh, pada (kejadian) itu benar-benar terdapat tanda-tanda (kebesaran Allah); dan sesungguhnya Kami benar-benar menimpakan siksaan (kepada kaum Nuh itu)."},{"text_madani":"ثُمَّ أَنشَأْنَا مِن بَعْدِهِمْ قَرْنًا آخَرِينَ","translation_en":"Then We raised up after them another generation.","translation_id":"Kemudian setelah mereka, Kami ciptakan umat yang lain (kaum ‘Ad)."},{"text_madani":"فَأَرْسَلْنَا فِيهِمْ رَسُولًا مِّنْهُمْ أَنِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۖ أَفَلَا تَتَّقُونَ","translation_en":"So We sent among them a messenger from among them, saying: Serve Allah, you have no god other than Him; will you not then guard (against evil)?","translation_id":"Lalu Kami utus kepada mereka, seorang rasul dari kalangan mereka sendiri (yang berkata), “Sembahlah Allah! Tidak ada tuhan (yang berhak disembah) bagimu selain Dia. Maka mengapa kamu tidak bertakwa (kepada-Nya)?”"},{"text_madani":"وَقَالَ الْمَلَأُ مِن قَوْمِهِ الَّذِينَ كَفَرُوا وَكَذَّبُوا بِلِقَاءِ الْآخِرَةِ وَأَتْرَفْنَاهُمْ فِي الْحَيَاةِ الدُّنْيَا مَا هَٰذَا إِلَّا بَشَرٌ مِّثْلُكُمْ يَأْكُلُ مِمَّا تَأْكُلُونَ مِنْهُ وَيَشْرَبُ مِمَّا تَشْرَبُونَ","translation_en":"And the chiefs of his people who disbelieved and called the meeting of the hereafter a lie, and whom We had given plenty to enjoy in this world's life, said: This is nothing but a mortal like yourselves, eating of what you eat from and drinking of what you drink.","translation_id":"Dan berkatalah para pemuka orang kafir dari kaumnya dan yang mendustakan pertemuan hari akhirat serta mereka yang telah Kami beri kemewahan dan kesenangan dalam kehidupan di dunia, “(Orang) ini tidak lain hanyalah manusia seperti kamu, dia makan apa yang kamu makan, dan dia minum apa yang kamu minum.”"},{"text_madani":"وَلَئِنْ أَطَعْتُم بَشَرًا مِّثْلَكُمْ إِنَّكُمْ إِذًا لَّخَاسِرُونَ","translation_en":"And if you obey a mortal like yourselves, then most surely you will be losers:","translation_id":"Dan sungguh, jika kamu menaati manusia seperti kamu, niscaya kamu pasti rugi."},{"text_madani":"أَيَعِدُكُمْ أَنَّكُمْ إِذَا مِتُّمْ وَكُنتُمْ تُرَابًا وَعِظَامًا أَنَّكُم مُّخْرَجُونَ","translation_en":"What! does he threaten you that when you are dead and become dust and bones that you shall then be brought forth?","translation_id":"Adakah dia menjanjikan kepada kamu, bahwa apabila kamu telah mati dan menjadi tanah dan tulang belulang, sesungguhnya kamu akan dikeluarkan (dari kuburmu)?"},{"text_madani":"هَيْهَاتَ هَيْهَاتَ لِمَا تُوعَدُونَ","translation_en":"Far, far is that which you are threatened with.","translation_id":"Jauh! Jauh sekali (dari kebenaran) apa yang diancamkan kepada kamu,"},{"text_madani":"إِنْ هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا نَحْنُ بِمَبْعُوثِينَ","translation_en":"There is naught but our life in this world; we die and we live and we shall not be raised again.","translation_id":"(kehidupan itu) tidak lain hanyalah kehidupan kita di dunia ini, (di sanalah) kita mati dan hidup dan tidak akan dibangkitkan (lagi),"},{"text_madani":"إِنْ هُوَ إِلَّا رَجُلٌ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا وَمَا نَحْنُ لَهُ بِمُؤْمِنِينَ","translation_en":"He is naught but a man who has forged a lie against Allah, and we are not going to believe in him.","translation_id":"Dia tidak lain hanyalah seorang laki-laki yang mengada-adakan kebohongan terhadap Allah, dan kita tidak akan mempercayainya."},{"text_madani":"قَالَ رَبِّ انصُرْنِي بِمَا كَذَّبُونِ","translation_en":"He said: O my Lord! help me against their calling me a liar.","translation_id":"Dia (Hud) berdoa, “Ya Tuhanku, tolonglah aku karena mereka mendustakan aku.”"},{"text_madani":"قَالَ عَمَّا قَلِيلٍ لَّيُصْبِحُنَّ نَادِمِينَ","translation_en":"He said: In a little while they will most certainly be repenting.","translation_id":"Dia (Allah) berfirman, “Tidak lama lagi mereka pasti akan menyesal.”"},{"text_madani":"فَأَخَذَتْهُمُ الصَّيْحَةُ بِالْحَقِّ فَجَعَلْنَاهُمْ غُثَاءً ۚ فَبُعْدًا لِّلْقَوْمِ الظَّالِمِينَ","translation_en":"So the punishment overtook them in justice, and We made them as rubbish; so away with the unjust people.","translation_id":"Lalu mereka benar-benar dimusnahkan oleh suara yang mengguntur, dan Kami jadikan mereka (seperti) sampah yang dibawa banjir. Maka binasalah bagi orang-orang yang zhalim."},{"text_madani":"ثُمَّ أَنشَأْنَا مِن بَعْدِهِمْ قُرُونًا آخَرِينَ","translation_en":"Then We raised after them other generations.","translation_id":"Kemudian setelah mereka Kami ciptakan umat-umat yang lain."},{"text_madani":"مَا تَسْبِقُ مِنْ أُمَّةٍ أَجَلَهَا وَمَا يَسْتَأْخِرُونَ","translation_en":"No people can hasten on their doom nor can they postpone (it).","translation_id":"Tidak ada satu umat pun yang dapat menyegerakan ajalnya, dan tidak (pula) menangguhkannya."},{"text_madani":"ثُمَّ أَرْسَلْنَا رُسُلَنَا تَتْرَىٰ ۖ كُلَّ مَا جَاءَ أُمَّةً رَّسُولُهَا كَذَّبُوهُ ۚ فَأَتْبَعْنَا بَعْضَهُم بَعْضًا وَجَعَلْنَاهُمْ أَحَادِيثَ ۚ فَبُعْدًا لِّقَوْمٍ لَّا يُؤْمِنُونَ","translation_en":"Then We sent Our messengers one after another; whenever there came to a people their messenger, they called him a liar, so We made some of them follow others and We made them stories; so away with a people who do not believe!","translation_id":"Kemudian, Kami utus rasul-rasul Kami berturut-turut. Setiap kali seorang rasul datang kepada suatu umat, mereka mendustakannya, maka Kami silihgantikan sebagian mereka dengan sebagian yang lain (dalam kebinasaan). Dan Kami jadikan mereka bahan cerita (bagi manusia). Maka kebinasaanlah bagi kaum yang tidak beriman."},{"text_madani":"ثُمَّ أَرْسَلْنَا مُوسَىٰ وَأَخَاهُ هَارُونَ بِآيَاتِنَا وَسُلْطَانٍ مُّبِينٍ","translation_en":"Then We sent Musa and his brother Haroun, with Our communications and a clear authority,","translation_id":"Kemudian Kami utus Musa dan saudaranya Harun dengan membawa tanda-tanda (kebesaran) Kami, dan bukti yang nyata,"},{"text_madani":"إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ فَاسْتَكْبَرُوا وَكَانُوا قَوْمًا عَالِينَ","translation_en":"To Firon and his chiefs, but they behaved haughtily and they were an insolent people.","translation_id":"kepada Fir‘aun dan para pemuka kaumnya, tetapi mereka angkuh dan mereka memang kaum yang sombong."},{"text_madani":"فَقَالُوا أَنُؤْمِنُ لِبَشَرَيْنِ مِثْلِنَا وَقَوْمُهُمَا لَنَا عَابِدُونَ","translation_en":"And they said: What! shall we believe in two mortals like ourselves while their people serve us?","translation_id":"Maka mereka berkata, “Apakah (pantas) kita percaya kepada dua orang manusia seperti kita, padahal kaum mereka (Bani Israil) adalah orang-orang yang menghambakan diri kepada kita?”"},{"text_madani":"فَكَذَّبُوهُمَا فَكَانُوا مِنَ الْمُهْلَكِينَ","translation_en":"So they rejected them and became of those who were destroyed.","translation_id":"Maka mereka mendustakan keduanya, sebab itu mereka termasuk orang yang dibinasakan."},{"text_madani":"وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ لَعَلَّهُمْ يَهْتَدُونَ","translation_en":"And certainly We gave Musa the Book that they may follow a right direction.","translation_id":"Dan sungguh, telah Kami anugerahi kepada Musa Kitab (Taurat), agar mereka (Bani Israil) mendapat petunjuk."},{"text_madani":"وَجَعَلْنَا ابْنَ مَرْيَمَ وَأُمَّهُ آيَةً وَآوَيْنَاهُمَا إِلَىٰ رَبْوَةٍ ذَاتِ قَرَارٍ وَمَعِينٍ","translation_en":"And We made the son of Marium and his mother a sign, and We gave them a shelter on a lofty ground having meadows and springs.","translation_id":"Dan telah Kami jadikan (Isa) putra Maryam bersama ibunya sebagai suatu bukti yang nyata bagi (kebesaran Kami), dan Kami melindungi mereka di sebuah dataran tinggi, (tempat yang tenang, rindang dan banyak buah-buahan) dengan mata air yang mengalir."},{"text_madani":"يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا ۖ إِنِّي بِمَا تَعْمَلُونَ عَلِيمٌ","translation_en":"O messengers! eat of the good things and do good; surely I know what you do.","translation_id":"Allah berfirman, “Wahai para rasul! Makanlah dari (makanan) yang baik-baik, dan kerjakanlah kebajikan. Sungguh, Aku Maha Mengetahui apa yang kamu kerjakan."},{"text_madani":"وَإِنَّ هَٰذِهِ أُمَّتُكُمْ أُمَّةً وَاحِدَةً وَأَنَا رَبُّكُمْ فَاتَّقُونِ","translation_en":"And surely this your religion is one religion and I am your Lord, therefore be careful (of your duty) to Me.","translation_id":"Dan sungguh, (agama tauhid) inilah agama kamu, agama yang satu dan Aku adalah Tuhanmu, maka bertakwalah kepada-Ku.”"},{"text_madani":"فَتَقَطَّعُوا أَمْرَهُم بَيْنَهُمْ زُبُرًا ۖ كُلُّ حِزْبٍ بِمَا لَدَيْهِمْ فَرِحُونَ","translation_en":"But they cut off their religion among themselves into sects, each part rejoicing in that which is with them.","translation_id":"Kemudian mereka terpecah belah dalam urusan (agama)nya menjadi beberapa golongan. Setiap golongan (merasa) bangga dengan apa yang ada pada mereka (masing-masing)."},{"text_madani":"فَذَرْهُمْ فِي غَمْرَتِهِمْ حَتَّىٰ حِينٍ","translation_en":"Therefore leave them in their overwhelming ignorance till","translation_id":"Maka biarkanlah mereka dalam kesesatannya sampai waktu yang ditentukan."},{"text_madani":"أَيَحْسَبُونَ أَنَّمَا نُمِدُّهُم بِهِ مِن مَّالٍ وَبَنِينَ","translation_en":"Do they think that by what We aid them with of wealth and children,","translation_id":"Apakah mereka mengira bahwa Kami memberikan harta dan anak-anak kepada mereka itu (berarti bahwa),"},{"text_madani":"نُسَارِعُ لَهُمْ فِي الْخَيْرَاتِ ۚ بَل لَّا يَشْعُرُونَ","translation_en":"We are hastening to them of good things? Nay, they do not perceive.","translation_id":"Kami segera memberikan kebaikan-kebaikan kepada mereka? (Tidak), tetapi mereka tidak menyadarinya."},{"text_madani":"إِنَّ الَّذِينَ هُم مِّنْ خَشْيَةِ رَبِّهِم مُّشْفِقُونَ","translation_en":"Surely they who from fear of their Lord are cautious,","translation_id":"Sungguh, orang-orang yang karena takut (azab) Tuhannya, mereka sangat berhati-hati,"},{"text_madani":"وَالَّذِينَ هُم بِآيَاتِ رَبِّهِمْ يُؤْمِنُونَ","translation_en":"And those who believe in the communications of their Lord,","translation_id":"dan mereka yang beriman dengan tanda-tanda (kekuasaan) Tuhannya,"},{"text_madani":"وَالَّذِينَ هُم بِرَبِّهِمْ لَا يُشْرِكُونَ","translation_en":"And those who do not associate (aught) with their Lord,","translation_id":"dan mereka yang tidak mempersekutukan Tuhannya,"},{"text_madani":"وَالَّذِينَ يُؤْتُونَ مَا آتَوا وَّقُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلَىٰ رَبِّهِمْ رَاجِعُونَ","translation_en":"And those who give what they give (in alms) while their hearts are full of fear that to their Lord they must return,","translation_id":"dan mereka yang memberikan apa yang mereka berikan (sedekah) dengan hati penuh rasa takut (karena mereka tahu) bahwa sesungguhnya mereka akan kembali kepada Tuhannya,"},{"text_madani":"أُولَٰئِكَ يُسَارِعُونَ فِي الْخَيْرَاتِ وَهُمْ لَهَا سَابِقُونَ","translation_en":"These hasten to good things and they are foremost in (attaining) them.","translation_id":"mereka itu bersegera dalam kebaikan-kebaikan, dan merekalah orang-orang yang lebih dahulu memperolehnya."},{"text_madani":"وَلَا نُكَلِّفُ نَفْسًا إِلَّا وُسْعَهَا ۖ وَلَدَيْنَا كِتَابٌ يَنطِقُ بِالْحَقِّ ۚ وَهُمْ لَا يُظْلَمُونَ","translation_en":"And We do not lay on any soul a burden except to the extent of its ability, and with Us is a book which speaks the truth, and they shall not be dealt with unjustly.","translation_id":"Dan Kami tidak membebani seseorang melainkan menurut kesanggupannya, dan pada Kami ada suatu catatan yang menuturkan dengan sebenarnya, dan mereka tidak dizhalimi (dirugikan)."},{"text_madani":"بَلْ قُلُوبُهُمْ فِي غَمْرَةٍ مِّنْ هَٰذَا وَلَهُمْ أَعْمَالٌ مِّن دُونِ ذَٰلِكَ هُمْ لَهَا عَامِلُونَ","translation_en":"Nay, their hearts are in overwhelming ignorance with respect to it and they have besides this other deeds which they do.","translation_id":"Tetapi, hati mereka (orang-orang kafir) itu dalam kesesatan dari (memahami Al-Qur'an) ini, dan mereka mempunyai (kebiasaan banyak mengerjakan) perbuatan-perbuatan lain (buruk) yang terus mereka kerjakan."},{"text_madani":"حَتَّىٰ إِذَا أَخَذْنَا مُتْرَفِيهِم بِالْعَذَابِ إِذَا هُمْ يَجْأَرُونَ","translation_en":"Until when We overtake those who lead easy lives among them with punishment, lo! they cry for succor.","translation_id":"Sehingga apabila Kami timpakan siksaan kepada orang-orang yang hidup bermewah-mewah di antara mereka, seketika itu mereka berteriak-teriak meminta tolong."},{"text_madani":"لَا تَجْأَرُوا الْيَوْمَ ۖ إِنَّكُم مِّنَّا لَا تُنصَرُونَ","translation_en":"Cry not for succor this day; surely you shall not be given help from Us.","translation_id":"Janganlah kamu berteriak-teriak meminta tolong pada hari ini! Sungguh, kamu tidak akan mendapat pertolongan dari Kami."},{"text_madani":"قَدْ كَانَتْ آيَاتِي تُتْلَىٰ عَلَيْكُمْ فَكُنتُمْ عَلَىٰ أَعْقَابِكُمْ تَنكِصُونَ","translation_en":"My communications were indeed recited to you, but you used to turn back on your heels,","translation_id":"Sesungguhnya ayat-ayat-Ku (Al-Qur'an) selalu dibacakan kepada kamu, tetapi kamu selalu berpaling ke belakang,"},{"text_madani":"مُسْتَكْبِرِينَ بِهِ سَامِرًا تَهْجُرُونَ","translation_en":"In arrogance; talking nonsense about the Quran, and left him like one telling fables by night.","translation_id":"dengan menyombongkan diri dan mengucapkan perkataan-perkataan keji terhadapnya (Al-Qur'an) pada waktu kamu bercakap-cakap pada malam hari."},{"text_madani":"أَفَلَمْ يَدَّبَّرُوا الْقَوْلَ أَمْ جَاءَهُم مَّا لَمْ يَأْتِ آبَاءَهُمُ الْأَوَّلِينَ","translation_en":"Is it then that they do not ponder over what is said, or is it that there has come to them that which did not come to their fathers of old?","translation_id":"Maka tidakkah mereka menghayati firman (Allah), atau adakah telah datang kepada mereka apa yang tidak pernah datang kepada nenek moyang mereka terdahulu?"},{"text_madani":"أَمْ لَمْ يَعْرِفُوا رَسُولَهُمْ فَهُمْ لَهُ مُنكِرُونَ","translation_en":"Or is it that they have not recognized their Messenger, so that they deny him?","translation_id":"Ataukah mereka tidak mengenal Rasul mereka (Muhammad), karena itu mereka mengingkarinya?"},{"text_madani":"أَمْ يَقُولُونَ بِهِ جِنَّةٌ ۚ بَلْ جَاءَهُم بِالْحَقِّ وَأَكْثَرُهُمْ لِلْحَقِّ كَارِهُونَ","translation_en":"Or do they say: There is madness in him? Nay! he has brought them the truth, and most of them are averse from the truth.","translation_id":"Atau mereka berkata, “Orang itu (Muhammad) gila.” Padahal, dia telah datang membawa kebenaran kepada mereka, tetapi kebanyakan mereka membenci kebenaran."},{"text_madani":"وَلَوِ اتَّبَعَ الْحَقُّ أَهْوَاءَهُمْ لَفَسَدَتِ السَّمَاوَاتُ وَالْأَرْضُ وَمَن فِيهِنَّ ۚ بَلْ أَتَيْنَاهُم بِذِكْرِهِمْ فَهُمْ عَن ذِكْرِهِم مُّعْرِضُونَ","translation_en":"And should the truth follow their low desires, surely the heavens and the earth and all those who are therein would have perished. Nay! We have brought to them their reminder, but from their reminder they turn aside.","translation_id":"Dan seandainya kebenaran itu menuruti keinginan mereka, pasti binasalah langit dan bumi, dan semua yang ada di dalamnya. Bahkan Kami telah memberikan peringatan kepada mereka, tetapi mereka berpaling dari peringatan itu."},{"text_madani":"أَمْ تَسْأَلُهُمْ خَرْجًا فَخَرَاجُ رَبِّكَ خَيْرٌ ۖ وَهُوَ خَيْرُ الرَّازِقِينَ","translation_en":"Or is it that you ask them a recompense? But the recompense of your Lord is best, and He is the best of those who provide sustenance.","translation_id":"Atau engkau (Muhammad) meminta imbalan kepada mereka? Sedangkan imbalan dari Tuhanmu lebih baik, karena Dia pemberi rezeki yang terbaik."},{"text_madani":"وَإِنَّكَ لَتَدْعُوهُمْ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ","translation_en":"And most surely you invite them to a right way.","translation_id":"Dan sesungguhnya engkau pasti telah menyeru mereka kepada jalan yang lurus."},{"text_madani":"وَإِنَّ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ عَنِ الصِّرَاطِ لَنَاكِبُونَ","translation_en":"And most surely those who do not believe in the hereafter are deviating from the way.","translation_id":"Dan sesungguhnya orang-orang yang tidak beriman kepada akhirat benar-benar telah menyimpang jauh dari jalan (yang lurus)."},{"text_madani":"وَلَوْ رَحِمْنَاهُمْ وَكَشَفْنَا مَا بِهِم مِّن ضُرٍّ لَّلَجُّوا فِي طُغْيَانِهِمْ يَعْمَهُونَ","translation_en":"And if We show mercy to them and remove the distress they have, they would persist in their inordinacy, blindly wandering on.","translation_id":"Dan seandainya mereka Kami kasihani, dan Kami lenyapkan malapetaka yang menimpa mereka, pasti mereka akan terus-menerus terombang-ambing dalam kesesatan mereka."},{"text_madani":"وَلَقَدْ أَخَذْنَاهُم بِالْعَذَابِ فَمَا اسْتَكَانُوا لِرَبِّهِمْ وَمَا يَتَضَرَّعُونَ","translation_en":"And already We overtook them with chastisement, but they were not submissive to their Lord, nor do they humble themselves.","translation_id":"Dan sungguh Kami telah menimpakan siksaan kepada mereka, tetapi mereka tidak mau tunduk kepada Tuhannya, dan (juga) tidak merendahkan diri."},{"text_madani":"حَتَّىٰ إِذَا فَتَحْنَا عَلَيْهِم بَابًا ذَا عَذَابٍ شَدِيدٍ إِذَا هُمْ فِيهِ مُبْلِسُونَ","translation_en":"Until when We open upon them a door of severe chastisement, lo! they are in despair at it.","translation_id":"Sehingga apabila Kami bukakan untuk mereka pintu azab yang sangat keras, seketika itu mereka menjadi putus asa."},{"text_madani":"وَهُوَ الَّذِي أَنشَأَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ ۚ قَلِيلًا مَّا تَشْكُرُونَ","translation_en":"And He it is Who made for you the ears and the eyes and the hearts; little is it that you give thanks.","translation_id":"Dan Dialah yang telah menciptakan bagimu pendengaran, penglihatan dan hati nurani, tetapi sedikit sekali kamu bersyukur."},{"text_madani":"وَهُوَ الَّذِي ذَرَأَكُمْ فِي الْأَرْضِ وَإِلَيْهِ تُحْشَرُونَ","translation_en":"And He it is Who multiplied you in the earth, and to Him you shall be gathered.","translation_id":"Dan Dialah yang menciptakan dan mengembangbiakkan kamu di bumi dan kepada-Nyalah kamu akan dikumpulkan."},{"text_madani":"وَهُوَ الَّذِي يُحْيِي وَيُمِيتُ وَلَهُ اخْتِلَافُ اللَّيْلِ وَالنَّهَارِ ۚ أَفَلَا تَعْقِلُونَ","translation_en":"And He it is Who gives life and causes death, and (in) His (control) is the alternation of the night and the day; do you not then understand?","translation_id":"Dan Dialah yang menghidupkan dan mematikan, dan Dialah yang (mengatur) pergantian malam dan siang. Tidakkah kamu mengerti?"},{"text_madani":"بَلْ قَالُوا مِثْلَ مَا قَالَ الْأَوَّلُونَ","translation_en":"Nay, they say the like of what the ancients said:","translation_id":"Bahkan mereka mengucapkan perkataan yang serupa dengan apa yang diucapkan oleh orang-orang terdahulu."},{"text_madani":"قَالُوا أَإِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظَامًا أَإِنَّا لَمَبْعُوثُونَ","translation_en":"They say: What! When we are dead and become dust and bones, shall we then be raised?","translation_id":"Mereka berkata, “Apakah betul, apabila kami telah mati dan telah menjadi tanah dan tulang belulang, kami benar-benar akan dibangkitkan kembali?"},{"text_madani":"لَقَدْ وُعِدْنَا نَحْنُ وَآبَاؤُنَا هَٰذَا مِن قَبْلُ إِنْ هَٰذَا إِلَّا أَسَاطِيرُ الْأَوَّلِينَ","translation_en":"Certainly we are promised this, and (so were) our fathers aforetime; this is naught but stories of those of old.","translation_id":"Sungguh, yang demikian ini sudah dijanjikan kepada kami dan kepada nenek moyang kami dahulu, ini hanyalah dongeng orang-orang terdahulu!”"},{"text_madani":"قُل لِّمَنِ الْأَرْضُ وَمَن فِيهَا إِن كُنتُمْ تَعْلَمُونَ","translation_en":"Say: Whose is the earth, and whoever is therein, if you know?","translation_id":"Katakanlah (Muhammad), “Milik siapakah bumi, dan semua yang ada di dalamnya, jika kamu mengetahui?”"},{"text_madani":"سَيَقُولُونَ لِلَّهِ ۚ قُلْ أَفَلَا تَذَكَّرُونَ","translation_en":"They will say: Allah's. Say: Will you not then mind?","translation_id":"Mereka akan menjawab, “Milik Allah.” Katakanlah, “Maka apakah kamu tidak ingat?”"},{"text_madani":"قُلْ مَن رَّبُّ السَّمَاوَاتِ السَّبْعِ وَرَبُّ الْعَرْشِ الْعَظِيمِ","translation_en":"Say: Who is the Lord of the seven heavens and the Lord of the mighty dominion?","translation_id":"Katakanlah, “Siapakah Tuhan yang memiliki langit yang tujuh dan yang memiliki ‘Arsy yang agung?”"},{"text_madani":"سَيَقُولُونَ لِلَّهِ ۚ قُلْ أَفَلَا تَتَّقُونَ","translation_en":"They will say: (This is) Allah's. Say: Will you not then guard (against evil)?","translation_id":"Mereka akan menjawab, “(Milik) Allah.” Katakanlah, “Maka mengapa kamu tidak bertakwa?”"},{"text_madani":"قُلْ مَن بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَهُوَ يُجِيرُ وَلَا يُجَارُ عَلَيْهِ إِن كُنتُمْ تَعْلَمُونَ","translation_en":"Say: Who is it in Whose hand is the kingdom of all things and Who gives succor, but against Him Succor is not given, if you do but know?","translation_id":"Katakanlah, “Siapakah yang di tangan-Nya berada kekuasaan segala sesuatu. Dia melindungi, dan tidak ada yang dapat dilindungi dari (azab-Nya), jika kamu mengetahui?”"},{"text_madani":"سَيَقُولُونَ لِلَّهِ ۚ قُلْ فَأَنَّىٰ تُسْحَرُونَ","translation_en":"They will say: (This is) Allah's. Say: From whence are you then deceived?","translation_id":"Mereka akan menjawab, “(Milik) Allah.” Katakanlah, “(Kalau demikian), maka bagaimana kamu sampai tertipu?”"},{"text_madani":"بَلْ أَتَيْنَاهُم بِالْحَقِّ وَإِنَّهُمْ لَكَاذِبُونَ","translation_en":"Nay! We have brought to them the truth, and most surely they are liars.","translation_id":"Padahal Kami telah membawa kebenaran kepada mereka, tetapi mere-ka benar-benar pendusta."},{"text_madani":"مَا اتَّخَذَ اللَّهُ مِن وَلَدٍ وَمَا كَانَ مَعَهُ مِنْ إِلَٰهٍ ۚ إِذًا لَّذَهَبَ كُلُّ إِلَٰهٍ بِمَا خَلَقَ وَلَعَلَا بَعْضُهُمْ عَلَىٰ بَعْضٍ ۚ سُبْحَانَ اللَّهِ عَمَّا يَصِفُونَ","translation_en":"Never did Allah take to Himself a son, and never was there with him any (other) god-- in that case would each god have certainly taken away what he created, and some of them would certainly have overpowered others; glory be to Allah above what they describe!","translation_id":"Allah tidak mempunyai anak, dan tidak ada tuhan (yang lain) bersama-Nya, (sekiranya tuhan banyak), maka masing-masing tuhan itu akan membawa apa (makhluk) yang diciptakannya, dan sebagian dari tuhan-tuhan itu akan mengalahkan sebagian yang lain. Mahasuci Allah dari apa yang mereka sifatkan itu,"},{"text_madani":"عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَتَعَالَىٰ عَمَّا يُشْرِكُونَ","translation_en":"The Knower of the unseen and the seen, so may He be exalted above what they associate (with Him).","translation_id":"(Dialah Tuhan) yang mengetahui semua yang gaib dan semua yang tampak. Mahatinggi (Allah) dari apa yang mereka persekutukan."},{"text_madani":"قُل رَّبِّ إِمَّا تُرِيَنِّي مَا يُوعَدُونَ","translation_en":"Say: O my Lord! if Thou shouldst make me see what they are threatened with:","translation_id":"Katakanlah (Muhammad), “Ya Tuhanku, seandainya Engkau hendak memperlihatkan kepadaku apa (azab) yang diancamkan kepada mereka,"},{"text_madani":"رَبِّ فَلَا تَجْعَلْنِي فِي الْقَوْمِ الظَّالِمِينَ","translation_en":"My Lord! then place me not with the unjust.","translation_id":"Ya Tuhanku, maka janganlah Engkau jadikan aku dalam golongan orang-orang zhalim.”"},{"text_madani":"وَإِنَّا عَلَىٰ أَن نُّرِيَكَ مَا نَعِدُهُمْ لَقَادِرُونَ","translation_en":"And most surely We are well able to make you see what We threaten them with.","translation_id":"Dan sungguh, Kami kuasa untuk memperlihatkan kepadamu (Muhammad) apa yang Kami ancamkan kepada mereka."},{"text_madani":"ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ السَّيِّئَةَ ۚ نَحْنُ أَعْلَمُ بِمَا يَصِفُونَ","translation_en":"Repel evil by what is best; We know best what they describe.","translation_id":"Tolaklah perbuatan buruk mereka dengan (cara) yang lebih baik, Kami lebih mengetahui apa yang mereka sifatkan (kepada Allah)."},{"text_madani":"وَقُل رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ","translation_en":"And say: O my Lord! I seek refuge in Thee from the evil suggestions of the Shaitans;","translation_id":"Dan katakanlah, “Ya Tuhanku, aku berlindung kepada Engkau dari bisikan-bisikan setan,"},{"text_madani":"وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ","translation_en":"And I seek refuge in Thee! O my Lord! from their presence.","translation_id":"dan aku berlindung (pula) kepada Engkau ya Tuhanku, agar mereka tidak mendekati aku.”"},{"text_madani":"حَتَّىٰ إِذَا جَاءَ أَحَدَهُمُ الْمَوْتُ قَالَ رَبِّ ارْجِعُونِ","translation_en":"Until when death overtakes one of them, he says: Send me back, my Lord, send me back;","translation_id":"(Demikianlah keadaan orang-orang kafir itu), hingga apabila datang kematian kepada seseorang dari mereka, dia berkata, “Ya Tuhanku, kembalikanlah aku (ke dunia),"},{"text_madani":"لَعَلِّي أَعْمَلُ صَالِحًا فِيمَا تَرَكْتُ ۚ كَلَّا ۚ إِنَّهَا كَلِمَةٌ هُوَ قَائِلُهَا ۖ وَمِن وَرَائِهِم بَرْزَخٌ إِلَىٰ يَوْمِ يُبْعَثُونَ","translation_en":"Haply I may do good in that which I have left. By no means! it is a (mere) word that he speaks; and before them is a barrier until the day they are raised.","translation_id":"agar aku dapat berbuat kebajikan yang telah aku tinggalkan.” Sekali-kali tidak! Sesungguhnya itu adalah dalih yang diucapkannya saja. Dan di hadapan mereka ada barzakh sampai pada hari mereka dibangkitkan."},{"text_madani":"فَإِذَا نُفِخَ فِي الصُّورِ فَلَا أَنسَابَ بَيْنَهُمْ يَوْمَئِذٍ وَلَا يَتَسَاءَلُونَ","translation_en":"So when the trumpet is blown, there shall be no ties of relationship between them on that day, nor shall they ask of each other.","translation_id":"Apabila sangkakala ditiup maka tidak ada lagi pertalian keluarga di antara mereka pada hari itu (hari Kiamat), dan tidak (pula) mereka saling bertanya."},{"text_madani":"فَمَن ثَقُلَتْ مَوَازِينُهُ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ","translation_en":"Then as for him whose good deeds are preponderant, these are the successful.","translation_id":"Barangsiapa berat timbangan (kebaikan)nya, maka mereka itulah orang-orang yang beruntung."},{"text_madani":"وَمَنْ خَفَّتْ مَوَازِينُهُ فَأُولَٰئِكَ الَّذِينَ خَسِرُوا أَنفُسَهُمْ فِي جَهَنَّمَ خَالِدُونَ","translation_en":"And as for him whose good deeds are light, these are they who shall have lost their souls, abiding in hell","translation_id":"Dan barang siapa ringan timbangan (kebaikan)nya, maka mereka itulah orang-orang yang merugikan dirinya sendiri, mereka kekal di dalam neraka Jahanam."},{"text_madani":"تَلْفَحُ وُجُوهَهُمُ النَّارُ وَهُمْ فِيهَا كَالِحُونَ","translation_en":"The fire shall scorch their faces, and they therein shall be in severe affliction.","translation_id":"Wajah mereka dibakar api neraka, dan mereka di neraka dalam keadaan muram dengan bibir yang cacat."},{"text_madani":"أَلَمْ تَكُنْ آيَاتِي تُتْلَىٰ عَلَيْكُمْ فَكُنتُم بِهَا تُكَذِّبُونَ","translation_en":"Were not My communications recited to you? But you used to reject them.","translation_id":"Bukankah ayat-ayat-Ku telah dibacakan kepadamu, tetapi kamu selalu mendustakannya?"},{"text_madani":"قَالُوا رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا وَكُنَّا قَوْمًا ضَالِّينَ","translation_en":"They shall say: O our Lord! our adversity overcame us and we were an erring people:","translation_id":"Mereka berkata, “Ya Tuhan kami, kami telah dikuasai oleh kejahatan kami, dan kami adalah orang-orang yang sesat."},{"text_madani":"رَبَّنَا أَخْرِجْنَا مِنْهَا فَإِنْ عُدْنَا فَإِنَّا ظَالِمُونَ","translation_en":"O our Lord! Take us out of it; then if we return (to evil) surely we shall be unjust.","translation_id":"Ya Tuhan kami, keluarkanlah kami darinya (kembalikanlah kami ke dunia), jika kami masih juga kembali (kepada kekafiran), sungguh, kami adalah orang-orang yang zhalim.”"},{"text_madani":"قَالَ اخْسَئُوا فِيهَا وَلَا تُكَلِّمُونِ","translation_en":"He shall say: Go away into it and speak nat to Me;","translation_id":"Dia (Allah) berfirman, “Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan Aku.”"},{"text_madani":"إِنَّهُ كَانَ فَرِيقٌ مِّنْ عِبَادِي يَقُولُونَ رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ","translation_en":"Surely there was a party of My servants who said: O our Lord! we believe, so do Thou forgive us and have mercy on us, and Thou art the best of the Merciful ones.","translation_id":"Sesungguhnya ada segolongan dari hamba-hamba-Ku berdoa, “Ya Tuhan kami, kami telah beriman, maka ampunilah kami dan berilah kami rahmat, Engkau adalah pemberi rahmat yang terbaik.”"},{"text_madani":"فَاتَّخَذْتُمُوهُمْ سِخْرِيًّا حَتَّىٰ أَنسَوْكُمْ ذِكْرِي وَكُنتُم مِّنْهُمْ تَضْحَكُونَ","translation_en":"But you took them for a mockery until they made you forget My remembrance and you used to laugh at them.","translation_id":"Lalu kamu jadikan mereka buah ejekan, sehingga kamu lupa mengingat Aku, dan kamu (selalu) menertawakan mereka,"},{"text_madani":"إِنِّي جَزَيْتُهُمُ الْيَوْمَ بِمَا صَبَرُوا أَنَّهُمْ هُمُ الْفَائِزُونَ","translation_en":"Surely I have rewarded them this day because they were patient, that they are the achievers.","translation_id":"sesungguhnya pada hari ini Aku memberi balasan kepada mereka, karena kesabaran mereka; sesungguhnya mereka itulah orang-orang yang memperoleh kemenangan."},{"text_madani":"قَالَ كَمْ لَبِثْتُمْ فِي الْأَرْضِ عَدَدَ سِنِينَ","translation_en":"He will say: How many years did you tarry in the earth?","translation_id":"Dia (Allah) berfirman, “Berapa tahunkah lamanya kamu tinggal di bumi?”"},{"text_madani":"قَالُوا لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ فَاسْأَلِ الْعَادِّينَ","translation_en":"They will say: We tarried a day or part of a day, but ask those who keep account.","translation_id":"Mereka menjawab, “Kami tinggal (di bumi) sehari atau setengah hari, maka tanyakanlah kepada mereka yang menghitung.”"},{"text_madani":"قَالَ إِن لَّبِثْتُمْ إِلَّا قَلِيلًا ۖ لَّوْ أَنَّكُمْ كُنتُمْ تَعْلَمُونَ","translation_en":"He will say: You did tarry but a little-- had you but known (it):","translation_id":"Dia (Allah) berfirman, “Kamu tinggal (di bumi) hanya sebentar saja, jika kamu benar-benar mengetahui.”"},{"text_madani":"أَفَحَسِبْتُمْ أَنَّمَا خَلَقْنَاكُمْ عَبَثًا وَأَنَّكُمْ إِلَيْنَا لَا تُرْجَعُونَ","translation_en":"What! did you then think that We had created you in vain and that you shall not be returned to Us?","translation_id":"Maka apakah kamu mengira, bahwa Kami menciptakan kamu main-main (tanpa ada maksud) dan bahwa kamu tidak akan dikembalikan kepada Kami?"},{"text_madani":"فَتَعَالَى اللَّهُ الْمَلِكُ الْحَقُّ ۖ لَا إِلَٰهَ إِلَّا هُوَ رَبُّ الْعَرْشِ الْكَرِيمِ","translation_en":"So exalted be Allah, the True King; no god is there but He, the Lord of the honorable dominion.","translation_id":"Maka Mahatinggi Allah, Raja yang sebenarnya; tidak ada tuhan (yang berhak disembah) selain Dia, Tuhan (yang memiliki) ‘Arsy yang mulia."},{"text_madani":"وَمَن يَدْعُ مَعَ اللَّهِ إِلَٰهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ فَإِنَّمَا حِسَابُهُ عِندَ رَبِّهِ ۚ إِنَّهُ لَا يُفْلِحُ الْكَافِرُونَ","translation_en":"And whoever invokes with Allah another god-- he has no proof of this-- his reckoning is only with his Lord; surely the unbelievers shall not be successful.","translation_id":"Dan barang siapa menyembah tuhan yang lain selain Allah, padahal tidak ada suatu bukti pun baginya tentang itu, maka perhitungannya hanya pada Tuhannya. Sesungguhnya orang-orang kafir itu tidak akan beruntung."},{"text_madani":"وَقُل رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ","translation_en":"And say: O my Lord! forgive and have mercy, and Thou art the best of the Merciful ones.","translation_id":"Dan katakanlah (Muhammad), “Ya Tuhanku, berilah ampunan dan (berilah) rahmat, Engkaulah pemberi rahmat yang terbaik.”"}]}
